{"title":"Elegi 2017 Bånsull","magnet":"magnet:?xt=urn:btih:00a674f44a813ce1fd07d7fe0da497d5ab231947&dn=Elegi+2017+B%26aring%3Bnsull&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wwino","categoryP":"audio","categoryS":"flac","size":"176795220","seeders":"0","leechers":"0","description":"Elegi ~ B&#xE5;nsull ~ 2017\r\nDronarivm DR-43.\r\n <a href=\"\nhttp://i5.imageban.ru/out/2017/05/27/38894bfc4033799766be257b4aaa10fd.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i5.imageban.ru/out/2017/05/27/38894bfc4033799766be257b4aaa10fd.jpg</a>\r\n\r\n1 \tGejnganger \t2:42\r\n2 \tHvor Her Er &#xD8;dselig \t5:06\r\n3 \tFull Av Tomhet \t3:24\r\n4 \tM&#xF8;rtemann \t5:17\r\n5 \tVemod \t7:00\r\n6 \tK-141 \t6:42\r\n7 \tMesse \t3:52\r\n8 \tElevte Time \t4:16\r\n9 \tFordum \t6:48\r\n\r\nElegi is no stranger to the dark ambient scene. Since the debut, Sistereis in 2007 on Miasmah Records, Elegi has been one of the front runners in the dark ambient scene. Yet, much like Dahlia&apos;s Tear, Elegi, for whatever reason, continues to fall beneath the radar of the greater dark ambient community. Lauded among fellow musicians, yet generally lost over the years to listeners. So, it is with great pleasure that I am able to review this latest work, B&#xE5;nsull. In the hope that, not only will fans discover the beauty of B&#xE5;nsull, but they will also find a need to seek out the previous two albums, Sistereis from 2007 and Varde from 2009.\r\nElegi has an amazingly unique take on dark ambient, which could be part of why their music has been overlooked. Hard to pin down, it could really be considered more of an experimental album than most others in the genre. Elegi works in the fashion of more recent artists like Flowers For Bodysnatchers or Enmarta. Elegi incorporates a multitude of instruments and sound sculpting to produce a work which is at once bold and engaging, yet simultaneously subtle and relaxing. This surely attests to the scope of creativity and technical talents of the man behind Elegi, Tommy Jansen hailing from Oslo, Norway. It seems that there is never an end to the magnificent talents of dark ambient musicians in Scandinavia. Elegi absolutely deserves a spot among the more well known projects: Svartsinn, Northaunt, Kammarheit, Taphephobia, etc. \r\nB&#xE5;nsull is true to the form of Elegi. There hasn&apos;t been a lot of change, stylistically. Yet, that is a welcome statement to me, as the previous two albums were nothing short of masterpieces. Years have gone by, 8 years, since the 2009 release of Varde. It seemed all hope was lost for another album, and yet here it is!.. - Michael Barnett, terrarelicta.com","last_updated":"2017-05-27T08:49:52.508Z","parsed":{"xt":"urn:btih:00a674f44a813ce1fd07d7fe0da497d5ab231947","dn":"Elegi 2017 B&aring;nsull","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"00a674f44a813ce1fd07d7fe0da497d5ab231947","infoHashBuffer":{"type":"Buffer","data":[0,166,116,244,74,129,60,225,253,7,215,254,13,164,151,213,171,35,25,71]},"name":"Elegi 2017 B&aring;nsull","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}