{"title":"The Glass Town Game by Catherynne M Valente ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:013d7e32a10d252659566bc634f8a02b68733b9b&dn=The+Glass+Town+Game+by+Catherynne+M+Valente+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"21690842","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Glass Town Game by Catherynne M Valente ePUB eBOOK-ZAK\r\n\r\nCharlotte and Emily must enter a fantasy world that they invented in order to rescue their siblings in this adventurous and fiercely intelligent novel from the New York Times best-selling author of The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making.\r\n\r\nInside a small Yorkshire parsonage, Charlotte, Branwell, Emily, and Anne Bront&#xEB; have invented a game called Glass Town, where their toy soldiers fight Napoleon and no one dies. This make-believe land helps the four escape from a harsh reality: Charlotte and Emily are being sent away to a dangerous boarding school, a school they might not return from. But on this Beastliest Day, the day Anne and Branwell walk their sisters to the train station, something incredible happens: The train whisks them all away to a real Glass Town, and the children trade the moors for a wonderland all their own.\r\n\r\nThis is their Glass Town, exactly like they envisioned it...almost. They certainly never gave Napoleon a fire-breathing porcelain rooster instead of a horse. And their soldiers can die; wars are fought over the potion that raises the dead, a potion Anne would very much like to bring back to England. But when Anne and Branwell are kidnapped, Charlotte and Emily must find a way to save their siblings. Can two English girls stand against Napoleon&apos;s armies, especially now that he has a new weapon from the real world? And if he escapes Glass Town, will England ever be safe again?\r\n\r\nTogether, the Bront&#xEB; siblings must battle with a world of their own creation if they are to make it back to England alive in this magical celebration of authorship, creativity, and classic literature from award-winning author Catherynne M. Valente.\r\n\r\nxx","last_updated":"2017-09-06T12:00:46.901Z","parsed":{"xt":"urn:btih:013d7e32a10d252659566bc634f8a02b68733b9b","dn":"The Glass Town Game by Catherynne M Valente ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"013d7e32a10d252659566bc634f8a02b68733b9b","infoHashBuffer":{"type":"Buffer","data":[1,61,126,50,161,13,37,38,89,86,107,198,52,248,160,43,104,115,59,155]},"name":"The Glass Town Game by Catherynne M Valente ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}