{"title":"\nNitro Pro Enterprise 11.0.6.326 (x64) Portable","magnet":"magnet:?xt=urn:btih:01d41511487ed3e86cd741a03245e8fa368d4cce&dn=Nitro+Pro+Enterprise+11.0.6.326+%28x64%29+Portable&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"osideri","categoryP":"applications","categoryS":"windows","size":"165094985","seeders":"0","leechers":"1","description":"Nitro Pro gives you everything you need to create, convert, edit, sign, and share standard PDF files. Its simple, straightforward, and intuitive to use - so you can work more productively, your way. With Nitro Pro you can share your files with others, no matter what platform or device they are on, and Nitro Pro makes conversion easy. Convert one or more files to PDF with just a click or two. Reuse and repurpose PDF-based content with greater accuracy. With Nitro Pros industry-leading conversion technology and array of extraction tools you can easily repurpose text and images from reports, presentations, and more for reuse in any other application. Share files with the peace of mind, knowing almost anyone on almost any machine can open, view, and review - every time.\t\r\n\r\nCopying &amp; Exporting PDF:\r\n&#xB7; Export PDF for reuse in Microsoft Word, WordPerfect, OpenOffice and more.\r\n&#xB7; Use different conversion modes to export files that look precisely like the original PDF and others that are easier to edit and repurpose.\r\n&#xB7; Extract all text and images from PDF documents.\r\n&#xB7; Batch convert PDF files to Word, RTF, and text formats.\r\n&#xB7; Copy text while retaining formatting, including font, color, and size.\r\n\r\nEditing PDF:\r\n&#xB7; Insert and edit text, including font, size, color and more.\r\n&#xB7; Edit images &#x2014; insert, resize, rotate, crop, flip, replace, arrange, delete, and extract.\r\n&#xB7; Edit image properties &#x2014; brightness, contrast, color space, and resolution.\r\n&#xB7; Edit pages &#x2014; insert, delete, rotate, crop, extract, and replace.\r\n&#xB7; Split pages of PDF documents based on page groups, page ranges, and bookmark structure.\r\n&#xB7; Add headers, footers, watermarks, and text to all pages in a document.\r\n&#xB7; Add Bates numbering across a collection of PDF documents.\r\n&#xB7; Add and edit bookmarks and links.\r\n&#xB7; Auto-create bookmarks based on document text formatting and headings.\r\n&#xB7; Auto-create links based on keywords and page numbers.\r\n&#xB7; Optimize, shrink and repair PDF documents.\r\n&#xB7; Edit document properties including metadata and initial view settings","last_updated":"2017-09-28T12:04:53.513Z","parsed":{"xt":"urn:btih:01d41511487ed3e86cd741a03245e8fa368d4cce","dn":"Nitro Pro Enterprise 11.0.6.326 (x64) Portable","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"01d41511487ed3e86cd741a03245e8fa368d4cce","infoHashBuffer":{"type":"Buffer","data":[1,212,21,17,72,126,211,232,108,215,65,160,50,69,232,250,54,141,76,206]},"name":"Nitro Pro Enterprise 11.0.6.326 (x64) Portable","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}