{"title":"Adnans Story by Rabia Chaudry 2016 RETAiL ePUB eBOOK-DiSTRiBUTiO","magnet":"magnet:?xt=urn:btih:02b5fa68feaaf3d97b81e4a4a066ea11ce0fb690&dn=Adnans+Story+by+Rabia+Chaudry+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"16816714","seeders":"0","leechers":"0","description":"xx\r\n\r\nAdnans Story by Rabia Chaudry 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\n&quot;The first letter I received after being arrested in 1999 was from Rabia. Since that time until now, she has believed in my innocence and been committed to my exoneration.... [T]here is no one better to help tell my story, and no one that I trust more to tell it, than Rabia.&quot; (Adnan Syed)\r\n\r\nOn February 28, 2000, Adnan Syed was convicted and sentenced to life plus 30 years for the murder of his ex-girlfriend, Hae Min Lee, a high school senior in Baltimore, Maryland. From the moment of his arrest, Syed has consistently maintained his innocence. Rabia Chaudry, a family friend, always believed him and has never given up the hope that he might someday be released. By 2013, however, after almost all appeals had been exhausted, things looked bleak. That&apos;s when Rabia contacted Sarah Koenig, a producer at This American Life, in the hopes of finding a journalist who would bring greater attention to Adnan&apos;s story and perhaps shed new light on the case. Koenig&apos;s investigation turned into Serial, an international phenomenon and Peabody Award-winning podcast.\r\n\r\nAdnan&apos;s Story will reexamine the investigation that led to Adnan Syed&apos;s arrest, share his life in prison, cover new evidence and possibilities that have since come to light, and review the recent court successes - including a ruling by a Maryland judge to reopen Syed&apos;s case. Woven with personal reflections from Adnan himself, including new never-before-seen letters he penned from prison, and the story of his family, his community, and public advocate Chaudry, the book offers new insight into the story that captivated the attention of millions as his legal team and investigatory team, along with countless others who have crowdsourced an investigation like never before, seek to exonerate him and find out the truth of what really happened on that day in 1999.\r\n\r\nWhat has captivated the public about Adnan&apos;s story are the layers of contradictions, fascinating characters, cultural dissonance, and fog of ambiguity around what really happened to Hae Min Lee. But this is not just a personal story; it is a testament to a thoroughly broken system that convicts tens of thousands of innocent people and how the power of the media and public can move rigid institutions to bring about justice.\r\n\r\nxx","last_updated":"2017-08-31T12:00:36.274Z","parsed":{"xt":"urn:btih:02b5fa68feaaf3d97b81e4a4a066ea11ce0fb690","dn":"Adnans Story by Rabia Chaudry 2016 RETAiL ePUB eBOOK-DiSTRiBUTiO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"02b5fa68feaaf3d97b81e4a4a066ea11ce0fb690","infoHashBuffer":{"type":"Buffer","data":[2,181,250,104,254,170,243,217,123,129,228,164,160,102,234,17,206,15,182,144]},"name":"Adnans Story by Rabia Chaudry 2016 RETAiL ePUB eBOOK-DiSTRiBUTiO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}