{"title":"Unretirement by Chris Farrell MOBI","magnet":"magnet:?xt=urn:btih:02e99323a222c4f71e8262ebc211c8b2019735bb&dn=Unretirement+by+Chris+Farrell+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"487126","seeders":"4","leechers":"3","description":"xx\r\n\r\nUnretirement by Chris Farrell MOBI\r\n\r\nThe budget battles of recent years have amplified the warnings of demographic doomsayers who predicted that a wave of baby boomers would bleed America dry, bankrupting Social Security and Medicare as they faded into an impoverished old age. On the contrary, argues award-winning journalist Chris Farrell, we are instead on the verge of a broad, positive transformation of our economy and society.\r\n\r\nThe old idea of &quot;retirement&quot; - a word that means withdrawal, describing a time when people gave up productive employment and shrank their activities - was a short-lived historical anomaly. Humans have always found meaning and motivation in work and community, Farrell notes, and the boomer generation, poised to live longer in better health than any before, is already discovering unretirement - extending their working lives, often with new careers, entrepreneurial ventures, and volunteer service. Their experience, wisdom - and importantly, their continued earnings - will enrich the American workplace, treasury, and our whole society in the decades to come.\r\n\r\nUnretirement not only explains this seismic change, now in its early stages, it provides key insights and practical advice for boomers about to navigate this exciting, but unsettled, new frontier. Drawing on Chris Farrell&apos;s decades of covering personal finance and economics for Bloomberg Businessweek and Marketplace Money, this will be an indispensable guide to the landscape of unretirement from one of America&apos;s most trusted experts.\r\n\r\nxx","last_updated":"2017-10-31T12:02:58.784Z","parsed":{"xt":"urn:btih:02e99323a222c4f71e8262ebc211c8b2019735bb","dn":"Unretirement by Chris Farrell MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"02e99323a222c4f71e8262ebc211c8b2019735bb","infoHashBuffer":{"type":"Buffer","data":[2,233,147,35,162,34,196,247,30,130,98,235,194,17,200,178,1,151,53,187]},"name":"Unretirement by Chris Farrell MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}