{"title":"Richard Shankman - The Art and Skill of Buddhist Meditation","magnet":"magnet:?xt=urn:btih:03038be4d127ebe4bb475c26922f5738f00a1816&dn=Richard+Shankman+-+The+Art+and+Skill+of+Buddhist+Meditation&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Rapidss","categoryP":"other","categoryS":"e_books","size":"519085","seeders":"30","leechers":"6","description":"The Art and Skill of Buddhist Meditation: Mindfulness, Concentration, and Insight\r\nby Richard Shankman\r\n\r\nPresented in a straightforward, accessible manner, The Art and Skill of Buddhist Meditation offers a practical guide to building a strong meditation practice, unifying mindfulness, concentration and insight into a single, integrated path of meditation.\r\n\r\nMindfulness and insight, clearly knowing what is happening in one&#x2019;s present moment experience, and concentration, the ability of the mind to remain steady and undistracted, are foundational elements of meditation. People are often confused about how these aspects of the practice fit together. Should they be doing insight meditation or concentration practices? How does concentration fit into insight meditation? This book offers specific guidance for cultivating both insight and concentration.\r\n\r\nThis book will be of interest to both beginning and experienced meditation practitioners, anyone wishing to familiarize themselves with, deepen their understanding of and increase their practical skills in mindfulness, concentration, and insight meditation. New meditators want a hands-on book they can easily put into practice, and they will find the step-by-step instructions accessible and easy to understand. Experienced practitioners will find a complete and useful guide for deepening insight and cultivating the deeper stages of concentration known as jhana. \r\n\r\nThis book discusses the most common experiences that can arise as the meditation process unfolds. This book will help you find the approaches and techniques that work best for you, offering a range of instructions for working with various possibilities of what can happen as meditation progresses.\r\n\r\nPublished October 14th 2015 by New Harbinger Publications","last_updated":"2017-06-06T12:01:22.278Z","parsed":{"xt":"urn:btih:03038be4d127ebe4bb475c26922f5738f00a1816","dn":"Richard Shankman - The Art and Skill of Buddhist Meditation","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"03038be4d127ebe4bb475c26922f5738f00a1816","infoHashBuffer":{"type":"Buffer","data":[3,3,139,228,209,39,235,228,187,71,92,38,146,47,87,56,240,10,24,22]},"name":"Richard Shankman - The Art and Skill of Buddhist Meditation","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}