{"title":"Nemesis by Philip Roth epub RtR","magnet":"magnet:?xt=urn:btih:0383d6a2a2c7682b6a4445d1205462f0dbe58a19&dn=Nemesis+by+Philip+Roth+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2660572","seeders":"0","leechers":"0","description":"xx\r\n\r\nNemesis by Philip Roth epub RtR\r\n\r\nThis is the startling theme of Philip Roth&apos;s wrenching new book: a wartime polio epidemic in the summer of 1944 and the effect it has on a closely knit, family-oriented Newark community and its children.\r\n\r\nAt the center of Nemesis is a vigorous, dutiful 23-year-old playground director, Bucky Cantor, a javelin thrower and weightlifter, who is devoted to his charges and disappointed with himself because his weak eyes have excluded him from serving in the war alongside his contemporaries.\r\n\r\nFocusing on Cantor&apos;s dilemmas as polio begins to ravage his playground and on the everyday realities he faces, Roth leads us through every inch of the emotions such a pestilence can breed: the fear, the panic, anger, bewilderment, suffering, and pain. Moving between the smoldering, malodorous streets of besieged Newark and Indian Hill, a pristine childrens summer camp high in the Poconos whose &quot;mountain air was purified of all contaminants&quot;, Roth depicts a decent, energetic man with the best intentions struggling in his own private war against the epidemic. Roth is tenderly exact at every point about Cantors passage into personal disaster, and no less exact about the condition of childhood.\r\n\r\nThrough this story runs the dark questions that haunt all four of Roths late short novels, Everyman, Indignation, The Humbling, and now Nemesis: What kind of accidental choices fatally shape a life? How does the individual withstand the onslaught of circumstance?\r\n\r\nxx","last_updated":"2017-07-08T12:00:20.452Z","parsed":{"xt":"urn:btih:0383d6a2a2c7682b6a4445d1205462f0dbe58a19","dn":"Nemesis by Philip Roth epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0383d6a2a2c7682b6a4445d1205462f0dbe58a19","infoHashBuffer":{"type":"Buffer","data":[3,131,214,162,162,199,104,43,106,68,69,209,32,84,98,240,219,229,138,25]},"name":"Nemesis by Philip Roth epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}