{"title":"Moranifesto by Caitlin Moran EPUB","magnet":"magnet:?xt=urn:btih:03868bc8c9a36898ef26f49374387d4af3d43eeb&dn=Moranifesto+by+Caitlin+Moran+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"988328","seeders":"1","leechers":"2","description":"xx\r\n\r\nMoranifesto by Caitlin Moran EPUB\r\n\r\nFrom the New York Times best-selling author of How to Be a Woman and Moranthology comes a collection of Caitlin Moran&apos;s award-winning London Times columns that takes a clever, hilarious look at celebrities, society, and the wacky world we live in today - including three major new pieces exclusive to this book.\r\n\r\nWhen Caitlin Moran sat down to choose her favorite pieces for her new book, she realized that they all shared a common theme - the same old problems and the same old asshats. Then she thought of the word Moranifesto, and she knew what she had to do....\r\n\r\nIntroducing every piece and weaving her writing together into a brilliant, seamless narrative - just as she did in Moranthology - Caitlin combines the best of her recent columns with lots of new writing unique to this book as she offers a characteristically fun and witty look at the news, celebrity culture, and society. Featuring strong and important pieces on poverty, the media, and class, Moranifesto also focuses on how socially engaged we&apos;ve become as a society.\r\n\r\nAnd, of course, Caitlin is never afraid to address the big issues, such as Benedict Cumberbatch and duffel coats. Who else but Caitlin Moran - a true modern Renaissance woman - could deal with topics as pressing and diverse as the beauty of musicals, affordable housing, Daft Punk, and why the Internet is like a drunken toddler?\r\n\r\nCovering everything from Hillary Clinton to UTIs, Caitlin&apos;s manifesto is an engaging and mischievous rallying call for our times.\r\n\r\nxx","last_updated":"2017-10-23T12:01:27.069Z","parsed":{"xt":"urn:btih:03868bc8c9a36898ef26f49374387d4af3d43eeb","dn":"Moranifesto by Caitlin Moran EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"03868bc8c9a36898ef26f49374387d4af3d43eeb","infoHashBuffer":{"type":"Buffer","data":[3,134,139,200,201,163,104,152,239,38,244,147,116,56,125,74,243,212,62,235]},"name":"Moranifesto by Caitlin Moran EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}