{"title":"The Conquering Tide by Ian W. Toll EPUB","magnet":"magnet:?xt=urn:btih:03b5f2105867c5c52a42c2be2fd89e91279d0412&dn=The+Conquering+Tide+by+Ian+W.+Toll+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10037248","seeders":"0","leechers":"1","description":"xx\r\n\r\nThe Conquering Tide by Ian W. Toll EPUB\r\n\r\nThe devastation of Pearl Harbor and the American victory at Midway were prelude to a greater challenge: rolling back the vast Japanese Pacific empire island by island.\r\n\r\nThis masterful history encompasses the heart of the Pacific War - the period between mid-1942 and mid-1944 - when parallel Allied counteroffensives north and south of the equator washed over Japan&apos;s far-flung island empire like a &quot;conquering tide&quot;, concluding with Japan&apos;s irreversible strategic defeat in the Marianas. It was the largest, bloodiest, most costly, most technically innovative and logistically complicated amphibious war in history, and it fostered bitter interservice rivalries, leaving wounds that even victory could not heal.\r\n\r\nOften overlooked, these are the years and fights that decided the Pacific War. Ian W. Toll&apos;s battle scenes - in the air, at sea, and in the jungles - are simply riveting. He also takes the reader into the wartime councils in Washington and Tokyo, where politics and strategy often collided, and into the struggle to mobilize wartime production, which was the secret of Allied victory. Brilliantly researched, the narrative is propelled and colored by firsthand accounts - letters, diaries, debriefings, and memoirs - that are the raw material of the telling details, shrewd judgment, and penetrating insight of this magisterial history.\r\n\r\nxx","last_updated":"2017-11-01T12:03:08.609Z","parsed":{"xt":"urn:btih:03b5f2105867c5c52a42c2be2fd89e91279d0412","dn":"The Conquering Tide by Ian W. Toll EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"03b5f2105867c5c52a42c2be2fd89e91279d0412","infoHashBuffer":{"type":"Buffer","data":[3,181,242,16,88,103,197,197,42,66,194,190,47,216,158,145,39,157,4,18]},"name":"The Conquering Tide by Ian W. Toll EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}