{"title":"Maurice White - My Life with Earth Wind and Fire 2016 RETAiL ePU","magnet":"magnet:?xt=urn:btih:03e2c3e40fe87cd05fe87facf6065eaf0e83367d&dn=Maurice+White+-+My+Life+with+Earth+Wind+and+Fire+2016+RETAiL+ePU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7515342","seeders":"28","leechers":"6","description":"Maurice White - My Life with Earth Wind and Fire 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe late Grammy-winning founder of the legendary pop/R&amp;B/soul/funk/disco group tells his story and charts the rise of his legendary band in this sincere memoir that captures the heart and soul of an artist whose groundbreaking sound continues to influence music today. With a foreword by David Foster.\r\n\r\nWith its dynamic horns, contrasting vocals, and vivid stage shows, Earth, Wind &amp; Fire was one of the most popular acts of the late 20th century - the band &quot;that changed the sound of black pop&quot; (Rolling Stone) - and its music continues to inspire modern artists including Usher, Jay Z, CeeLo Green, and Outkast. At last the band&apos;s founder, Maurice White, shares the story of his success.\r\n\r\nWhite reflects on the great blessings music has brought to his life and the struggles he&apos;s endured: his mother leaving him behind in Memphis when he was four; learning to play the drums with Booker T. Jones; moving to Chicago at 18 and later Los Angeles after leaving the Ramsey Lewis Trio; forming EWF, only to have the original group fall apart; working with Barbra Streisand and Neil Diamond; his diagnosis of Parkinson&apos;s; and his final public performance with the group at the 2006 Grammy Awards. Through it all White credits his faith for his amazing success and guidance in overcoming his many challenges.\r\n\r\nMy Life with Earth Wind, &amp; Fire is an intimate, moving, and beautiful memoir from a man whose creativity and determination carried him to great success and whose faith enabled him to savor every moment","last_updated":"2017-05-23T18:53:53.811Z","parsed":{"xt":"urn:btih:03e2c3e40fe87cd05fe87facf6065eaf0e83367d","dn":"Maurice White - My Life with Earth Wind and Fire 2016 RETAiL ePU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"03e2c3e40fe87cd05fe87facf6065eaf0e83367d","infoHashBuffer":{"type":"Buffer","data":[3,226,195,228,15,232,124,208,95,232,127,172,246,6,94,175,14,131,54,125]},"name":"Maurice White - My Life with Earth Wind and Fire 2016 RETAiL ePU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}