{"title":"PublicDisgrace--PD-41116 Stella Cox, Nikki Thorne, Steve Holmes ","magnet":"magnet:?xt=urn:btih:04290528f4f5853c89baf2a2527ee30895c95297&dn=PublicDisgrace--PD-41116+Stella+Cox%2C+Nikki+Thorne%2C+Steve+Holmes+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"merzedes","categoryP":"porno","categoryS":"hd___movies","size":"2893696240","seeders":"39","leechers":"71","description":"\r\n\r\nBusty Stella Cox Loves Getting Fucked In Public\r\n\r\nJun 12, 2017 - Steve Holmes , Stella Cox  , Nikki Thorne , Antonio Ross \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nWe welcome back one of the many muses of Public Disgrace, Stella Cox who returns once again to get what she often craves; corporal punishment, rough sex, and public humiliation. The lovely Nikki Thorne and the always serious Antonio Ross have Stella crawling outside on her hands and knees across the dirty pavement with her ass and big natural tits exposed and a spreader bar tied to each ankle. Nikki and Antonio take turns occasionally zapping Stella&apos;s ass, thighs, and tits with electricity just to watch her flinch in fear. Sitting on a park bench, Antonio then uses Stella&apos;s ass as a footstool while she licks clean and deep-throats Nikki Thorne&apos;s sweaty bare feet, covering them with saliva and tears from all the gagging. With Stella&apos;s legs spread apart on the concrete showing everyone her shaved pussy, Nikki commands Stella to clean her dirty ass and takes a seat on Stella&apos;s face while the public watch and listen to Stella&apos;s muffled screams. While starving for air, Stella furiously licks every crevice of Nikki&apos;s asshole. Later with Stella being led by leash and collar, they head to a crowded bar to meet Steve Holmes where Stella then gets on her knees and licks Nikki&apos;s hairy horny pussy while Antonio slaps Stella&apos;s ass until its pink and warm. Steve Holmes then canes Stella&apos;s ass and tits, leaving her covered in lasting red stripes to match her red dress. As a gesture of gratitude, Stella then drops to her knees and sucks Steve and Antonio&apos;s cocks until both are rock hard and ready to fuck. Antonio pounds Stella&apos;s pussy with gumption on a nearby table holding Stella&apos;s throat in one hand and the other busy slapping her face while Steve fucks Nikki&apos;s pussy and ass on the table next to them. Stella ultimately gets her slutty asshole and pussy wrecked and drenched in everyones fluids. \r\n\r\nScreens <a href=\"\nhttps://www.kink.com/shoot/41116\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.kink.com/shoot/41116</a>\r\n <a href=\"\nhttps://s24.pixxxels.org/vi0j03lnp/PD_-_Jun_12_2017_-_Stella_Cox_Nikki_Thorne_St.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s24.pixxxels.org/vi0j03lnp/PD_-_Jun_12_2017_-_Stella_Cox_Nikki_Thorne_St.jpg</a>\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n23 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n\r\n1337X FAQ: http://i.xomf.com/gdqkv.jpg\r\n\r\nThePirateBay FAQ: http://i.xomf.com/hgyrj.jpg\r\n\r\nCheers :-)","last_updated":"2017-06-13T12:04:24.383Z","parsed":{"xt":"urn:btih:04290528f4f5853c89baf2a2527ee30895c95297","dn":"PublicDisgrace--PD-41116 Stella Cox, Nikki Thorne, Steve Holmes ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"04290528f4f5853c89baf2a2527ee30895c95297","infoHashBuffer":{"type":"Buffer","data":[4,41,5,40,244,245,133,60,137,186,242,162,82,126,227,8,149,201,82,151]},"name":"PublicDisgrace--PD-41116 Stella Cox, Nikki Thorne, Steve Holmes ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}