{"title":"The Quest_ Energy, Security, and the Remaking of the Modern Worl","magnet":"magnet:?xt=urn:btih:04d253f7bba786c96e671bc952f23b16de0e560b&dn=The+Quest_+Energy%2C+Security%2C+and+the+Remaking+of+the+Modern+Worl&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5415700","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Quest_ Energy, Security, and the Remaking of the Modern World by Daniel Yergin ePUB eBOOK-ZAK\r\n\r\nIn this gripping account of the quest for the energy that our world needs, Daniel Yergin continues the riveting story begun in his Pulitzer Prize-winning book, The Prize.\r\n\r\nA master storyteller as well as a leading energy expert, Yergin shows us how energy is an engine of global political and economic change. It is a story that spans the energies on which our civilization has been built and the new energies that are competing to replace them. From the jammed streets of Beijing to the shores of the Caspian Sea, from the conflicts in the Mideast to Capitol Hill and Silicon Valley, Yergin takes us into the decisions that are shaping our future. The drama of oil - the struggle for access, the battle for control, the insecurity of supply, the consequences of use, its impact on the global economy, and the geopolitics that dominate it - continues to profoundly affect our world.\r\n\r\nYergin tells the inside stories of the oil market and the surge in oil prices, the race to control the resources of the former Soviet empire, and the massive mergers that transformed the landscape of world oil. He tackles the toughest questions: Will we run out of oil? Are China and the United States destined to come into conflict over oil? How will a turbulent Middle East affect the future of oil supply?\r\n\r\nxx","last_updated":"2017-08-07T12:00:24.843Z","parsed":{"xt":"urn:btih:04d253f7bba786c96e671bc952f23b16de0e560b","dn":"The Quest_ Energy, Security, and the Remaking of the Modern Worl","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"04d253f7bba786c96e671bc952f23b16de0e560b","infoHashBuffer":{"type":"Buffer","data":[4,210,83,247,187,167,134,201,110,103,27,201,82,242,59,22,222,14,86,11]},"name":"The Quest_ Energy, Security, and the Remaking of the Modern Worl","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}