{"title":"Siri Hustvedt - A Woman Looking at Men Looking at Women 2016 RET","magnet":"magnet:?xt=urn:btih:04d631b0ab5f4a4731f4f8eead90a16d332a85e2&dn=Siri+Hustvedt+-+A+Woman+Looking+at+Men+Looking+at+Women+2016+RET&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6929158","seeders":"2","leechers":"2","description":"Siri Hustvedt - A Woman Looking at Men Looking at Women 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAs well as being a prize-winning, best-selling novelist, Siri Hustvedt is widely regarded as a leading thinker in the fields of neurology, feminism, art criticism and philosophy. She believes passionately that art and science are too often kept separate and that conversations across disciplines are vital to increasing our knowledge of the human mind and body, how they connect and how we think, feel and see.\r\n\r\nThe essays in this volume - all written between 2011 and 2015 - are in three parts. A Woman Looking at Men Looking at Women brings together penetrating pieces on particular artists and writers such as Picasso, Kiefer and Susan Sontag as well as essays investigating the biases that affect how we judge art, literature and the world in general.\r\n\r\n&apos;The Delusions of Certainty&apos; is an essay about the mind/body problem, showing how this age-old philosophical puzzle has shaped contemporary debates on many subjects and how every discipline is coloured by what lies beyond argument - desire, belief and the imagination.\r\n\r\nThe essays in the final section, &apos;What Are We? Lectures on the Human Condition&apos;, tackle such elusive neurological disorders as synesthesia and hysteria. Drawing on research in sociology, neurobiology, history, genetics, statistics, psychology and psychiatry, this section also contains a profound consideration of suicide and a towering reconsideration of Kierkegaard.\r\n\r\nTogether they form an extremely stimulating, thoughtful, wide-ranging exploration of some of the fundamental questions about human beings and the human condition, delivered with Siri Hustvedt&apos;s customary lucidity, vivacity and infectiously questioning intelligence","last_updated":"2017-06-01T12:02:35.968Z","parsed":{"xt":"urn:btih:04d631b0ab5f4a4731f4f8eead90a16d332a85e2","dn":"Siri Hustvedt - A Woman Looking at Men Looking at Women 2016 RET","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"04d631b0ab5f4a4731f4f8eead90a16d332a85e2","infoHashBuffer":{"type":"Buffer","data":[4,214,49,176,171,95,74,71,49,244,248,238,173,144,161,109,51,42,133,226]},"name":"Siri Hustvedt - A Woman Looking at Men Looking at Women 2016 RET","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}