{"title":"Raspberry Pi A Quick-Start Guide, 2nd Edition by Maik Schmidt(20","magnet":"magnet:?xt=urn:btih:0501ff2c9a5a20516ae4f2cbd49213d44434f6e0&dn=Raspberry+Pi+A+Quick-Start+Guide%2C+2nd+Edition+by+Maik+Schmidt%2820&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"37447417","seeders":"2","leechers":"7","description":"\nRaspberry Pi A Quick-Start Guide, 2nd Edition by Maik Schmidt(2014) - MOBI/EPUB/PDF - zeke23\r\nPublication Date: 2014-03-31 - ISBN-13: 9781937785802 - 176 pages - MOBI/EPUB/PDF - English\r\nMost of the book is targeted at beginners in computing and programming. A few parts, such as the small electronics project and setting up a web server, assume some intermediate skills.\r\n\r\nThe Raspberry Pi is one of the most successful open source hardware projects ever. For less than $40, you get a full-blown PC, a multimedia center, and a web server--and this book gives you everything you need to get started. You&apos;ll learn the basics, progress to controlling the Pi, and then build your own electronics projects. This new edition is revised and updated with two new chapters on adding digital and analog sensors, and creating videos and a burglar alarm with the Pi camera.\r\n\r\nGet your Raspberry Pi up and running and doing cool stuff. You&apos;ll start with the basics: adding hardware, installing and configuring Debian Linux, and customizing the Pi&apos;s firmware to get the most out of your hardware.\r\n\r\nThen the fun begins. You&apos;ll connect the Pi to your home network, surf the web, and tweet messages. You&apos;ll learn how to get the most out of Midori, the Pi&apos;s standard browser, and control the desktops of other PCs with the Pi. Then you&apos;ll explore the Pi&apos;s versatility with a series of home projects. Turn it into a web server in your home network; convert the Pi into a powerful multimedia center so you can watch high-definition video and listen to your favorite music; and play classic video games.\r\n\r\nThen you&apos;ll use the GPIO pins on the Raspberry Pi to build your own electronics projects, such as an &quot;out of memory&quot; alarm. You&apos;ll learn how to use digital and analog sensors with the Pi, even though the Pi doesn&apos;t have analog input ports! Finally, you&apos;ll set up the Pi camera, create your own time-lapse videos, and build an automatic e-mailing burglar alarm. Power to the Pi!","last_updated":"2017-07-28T12:01:35.213Z","parsed":{"xt":"urn:btih:0501ff2c9a5a20516ae4f2cbd49213d44434f6e0","dn":"Raspberry Pi A Quick-Start Guide, 2nd Edition by Maik Schmidt(20","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0501ff2c9a5a20516ae4f2cbd49213d44434f6e0","infoHashBuffer":{"type":"Buffer","data":[5,1,255,44,154,90,32,81,106,228,242,203,212,146,19,212,68,52,246,224]},"name":"Raspberry Pi A Quick-Start Guide, 2nd Edition by Maik Schmidt(20","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}