{"title":"Letterman_ The Last Giant of Late Night by Jason Zinoman ePUB eB","magnet":"magnet:?xt=urn:btih:054eed08886afd1a385e836a637d4261238bd1a4&dn=Letterman_+The+Last+Giant+of+Late+Night+by+Jason+Zinoman+ePUB+eB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5419434","seeders":"0","leechers":"0","description":"xx\r\n\r\nLetterman_ The Last Giant of Late Night by Jason Zinoman ePUB eBOOK-ZAK\r\n\r\nNew York Times comedy critic Jason Zinoman delivers the definitive story of the life and artistic legacy of David Letterman, the greatest television talk show host of all time and the signature comedic voice of a generation.\r\n\r\nIn a career spanning more than 30 years, David Letterman redefined the modern talk show with an ironic comic style that transcended traditional television. While he remains one of the most famous stars in America, he is a remote, even reclusive figure whose career is widely misunderstood. In Letterman, Jason Zinoman, the first comedy critic in the history of the New York Times, mixes groundbreaking reporting with unprecedented access and probing critical analysis to explain the unique entertainer&apos;s titanic legacy. Moving from his early days in Indiana to his retirement, Zinoman goes behind the scenes of Letterman&apos;s television career to illuminate the origins of his revolutionary comedy, its overlooked influences, and how his work intersects with and reveals his famously eccentric personality.\r\n\r\nZinoman argues that Letterman had three great artistic periods, each distinct and part of his evolution. As he examines key broadcasting moments - &quot;Stupid Pet Tricks&quot; and other captivating segments that defined Late Night with David Letterman - he illuminates Letterman&apos;s relationship to his writers and, in particular, the show&apos;s cocreator, Merrill Markoe, with whom Letterman shared a long professional and personal connection.\r\n\r\nTo understand popular culture today, it&apos;s necessary to understand David Letterman. With this revealing biography, Zinoman offers a perceptive analysis of the man and the artist whose ironic voice and caustic meta-humor was critical to an entire generation of comedians and viewers - and whose singular style ushered in new tropes that have become clich&#xE9;s in comedy today.\r\n\r\nxx","last_updated":"2017-09-17T12:01:56.148Z","parsed":{"xt":"urn:btih:054eed08886afd1a385e836a637d4261238bd1a4","dn":"Letterman_ The Last Giant of Late Night by Jason Zinoman ePUB eB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"054eed08886afd1a385e836a637d4261238bd1a4","infoHashBuffer":{"type":"Buffer","data":[5,78,237,8,136,106,253,26,56,94,131,106,99,125,66,97,35,139,209,164]},"name":"Letterman_ The Last Giant of Late Night by Jason Zinoman ePUB eB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}