{"title":"Ensemble Economique 2017 In Silhouette","magnet":"magnet:?xt=urn:btih:05c68e6ea5941abcd18f83f4c6c4e062f547e038&dn=Ensemble+Economique+2017+In+Silhouette&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"audio","categoryS":"flac","size":"262299388","seeders":"6","leechers":"6","description":"Ensemble Economique ~ In Silhouette ~ 2017\r\nDenovali Records DEN278.\r\n <a href=\"\nhttp://i5.imageban.ru/out/2017/07/01/055519f9f9030794d67b8145430ccd35.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i5.imageban.ru/out/2017/07/01/055519f9f9030794d67b8145430ccd35.jpg</a>\r\n\r\n1 \tIn The Clear Blue Waters Of Memory \t\r\n2 \tBattle Cry \t\r\n3 \tGonna Get Right With God, Right After This Next Cigarette \t\r\n4 \tI Can See The Light, The Edge Of Forever \t\r\n5 \tYou In The Horizon\r\n\r\n&quot;In Silhouette&quot; is unmistakably the product of Brian Pyle, who once again returns as Ensemble Economique. Well over a decade ago, Pyle and his merry band of Starving Weirdos popped onto the scene from out of nowhere. Truth be told, that &#x2018;nowhere&#x2019; is Humboldt County, California whose grand mythologies about its marijuana industry dwarfs all others. The Weirdos, not averse to method acting through Humboldt&#x2019;s prized chemistry, stood an unusual chimera in the world of out-rock and avant-garde practitioners. Electronic-Improv, fuck-all auto-didacticism, and monotone psychedelia. Too feral to be AMM, too electronic to be NNCK, too discordant to be :zoviet*france:. As the Weirdos slowed to halt, Pyle&#x2019;s restless energy insisted that he go on. Hence Ensemble Economique. Over an impressive catalogue of albums, he steadfastly continues down this rabbithole, polishing and refining his craft into a signature polyglot of expressionist collage.\r\nPyle&#x2019;s latest opus dials up the cinematic flourishes that have graced many of his earlier recordings, through his sinewed synth-tone undulations, polyphonous ostinato, Wolfgang Voigt pulses, and fractalized cascades of generative serialism. All of this glides through the patterned electronic chiaroscuro atmospheres that are at once ethereal and haunted, dotted with male and female vocals whispering unknowable secrets. This tech-gnosticism flickers with light and shadow through Pyle&#x2019;s rich production and beckons for the big screen, as Pyle&#x2019;s work is grandiose in scale, psychologically nuanced, and deeply affecting. &quot;In Silhouette&quot; is the twelfth Ensemble Economique album","last_updated":"2017-07-01T12:01:53.761Z","parsed":{"xt":"urn:btih:05c68e6ea5941abcd18f83f4c6c4e062f547e038","dn":"Ensemble Economique 2017 In Silhouette","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"05c68e6ea5941abcd18f83f4c6c4e062f547e038","infoHashBuffer":{"type":"Buffer","data":[5,198,142,110,165,148,26,188,209,143,131,244,198,196,224,98,245,71,224,56]},"name":"Ensemble Economique 2017 In Silhouette","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}