{"title":"Addressing the Human Capital Crisis in the Federal Government","magnet":"magnet:?xt=urn:btih:062155d33ab29fa66a5049e90d294289e91729e3&dn=Addressing+the+Human+Capital+Crisis+in+the+Federal+Government&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"2188900","seeders":"20","leechers":"1","description":"President Bush&apos;s number-one management initiative for the federal government is the Strategic Management of Human Capital. According to Knowledgeworkers.com, human capital is the accumulated value of an individual&apos;s intellect, knowledge, and experience. In the U.S. federal government, a human capital crisis exists. The factors contributing to a human capital dilemma include a knowledge bleed due to retirement eligibility, changing perspectives on work, and escalating knowledge loss. According to a Joint Hearing on the Federal Human Capital, by 2005, more than half of the 1.8 million non-postal civilian employees will be eligible for early or regular retirement. An even greater percentage of the Senior Executive Service, the government&apos;s core managers, will be eligible to leave.\r\n\r\nAll government agencies are required to develop a human capital strategy by 2005. Many of these agencies have scored a &quot;red&quot; (lowest rating) on the Government Scorecard in the way they are approaching their strategic management of human capital. This book is an executive briefing on developing a successful human capital strategy based on lessons learned from analyzing existing strategies at government agencies such as NASA.\r\nUsing a knowledge management perspective, Liebowitz identifies four pillars of an effective strategy and gives examples of these in practice","last_updated":"2017-06-16T12:04:58.595Z","parsed":{"xt":"urn:btih:062155d33ab29fa66a5049e90d294289e91729e3","dn":"Addressing the Human Capital Crisis in the Federal Government","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"062155d33ab29fa66a5049e90d294289e91729e3","infoHashBuffer":{"type":"Buffer","data":[6,33,85,211,58,178,159,166,106,80,73,233,13,41,66,137,233,23,41,227]},"name":"Addressing the Human Capital Crisis in the Federal Government","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}