{"title":"Cocktail v10.3.5","magnet":"magnet:?xt=urn:btih:0651f765efbcdef265bc2c928e8fb57f0585e885&dn=Cocktail+v10.3.5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cutehtu","categoryP":"applications","categoryS":"mac","size":"2884836","seeders":"4","leechers":"0","description":"Cocktail v10.3.5\r\n\r\nOS X toolset that serves up a perfect mix of maintenance tools and tweaks, all accessible through a clean and easy to use interface\r\n\r\nCocktail is a powerful and full-featured macOS utility designed to provide you with all the tools and features required to repair, clean and optimize your Mac.\r\n\r\nMac optimizer and cleaner\r\n\r\nFrom Cocktail&#x2019;s user-friendly and clean interface you have instant access to numerous maintenance tools and tweaks that are grouped into five different categories, which can help you take care of various aspects of your Mac.\r\n\r\nIn addition, Cocktail features an automatic Pilot mode that enables you to sit back and relax while Cocktail does the hard work. The Disks tab helps you check the S.M.A.R.T. status of your drives, set disk sleep/spindown time, repair disk permissions, enable or disable journaling and Sudden Motions Sensor or reset the home directory permissions and Access Control Lists.\r\n\r\nSystem maintenance\r\n\r\nBy accessing the System tab, you can enable or disable virtual memory swapping, disable startup sound, change startup mode, set startup delay, run periodic maintenance scripts, erase Spotlight indexes and rebuild Launch Services database.\r\n\r\nMoreover, you can manage Spotlight indexing, purge inactive memory and optimize virtual memory usage, update locate and whatis databases, disable the Notification Center, personalize the Time Machine settings, force empty the Trash and manage the Spotlight indexing.\r\n\r\nCaches cleaner\r\n\r\nThe Files tab helps you clear system caches, user caches, font caches, Internet caches, virtual memory swap files, cookies, download lists, history files, form values, Adobe Flash Player caches and cookies, DNS cache and more. You can also search and find corrupted preference files, delete hidden DS Store files, unneeded localization files, locked or inaccessible items.\r\n\r\nCocktail also offers you a series of tools that allow you to change the speed, duplex and MTU of network cards, optimize network settings, configure the built-in macOS file server and change your IP configuration parameters.\r\n\r\nEasy to use system optimization and cleaning app for the Mac\r\n\r\nWhat is more, you can personalize your Finder, Dock looks and features, customize the login window, disable the leather skin in Calendar and Contacts, change hidden settings of Mail, iTunes, Safari, and QuickTime.\r\n\r\nAs mentioned earlier, the Pilot feature can help you schedule the clearing of caches and log files, repair disk permissions and run periodic maintenance scripts. Hence, you can clean, optimize and fix your system with just a few clicks of a mouse button","last_updated":"2017-06-25T12:00:32.124Z","parsed":{"xt":"urn:btih:0651f765efbcdef265bc2c928e8fb57f0585e885","dn":"Cocktail v10.3.5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0651f765efbcdef265bc2c928e8fb57f0585e885","infoHashBuffer":{"type":"Buffer","data":[6,81,247,101,239,188,222,242,101,188,44,146,142,143,181,127,5,133,232,133]},"name":"Cocktail v10.3.5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}