{"title":"Beverly Lowry - Who Killed These Girls 2016 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:06d1b9e05a4fff8fc37e6ad1408fce64f648e82f&dn=Beverly+Lowry+-+Who+Killed+These+Girls+2016+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3647274","seeders":"1","leechers":"0","description":"Beverly Lowry - Who Killed These Girls 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the author of Crossed Over, another masterful account of a horrible crime: the murder of four girls, countless other ruined lives, and the evolving complications of the justice system that frustrated the massive attempts - for 25 years now - to find and punish those who committed it.\r\n\r\nThe facts are brutally straightforward. On December 6, 1991, the naked, bound and gagged bodies of four girls - each one shot in the head - were found in an I Can&apos;t Believe It&apos;s Yogurt! shop in Austin, Texas. Grief, shock, and horror spread out from their families and friends to overtake the city itself. Though all branches of law enforcement were brought to bear, the investigation was often misdirected, and after eight years only two men (then teenagers) were tried. Moreover, their subsequent convictions were eventually overturned, and Austin PD detectives are still working on what is now a very cold case.\r\n\r\nOver the decades the story has grown to include DNA technology, false confessions, and other developments facing crime and punishment in contemporary life. But this story belongs to the scores of people involved, and from them Lowry has fashioned a riveting saga that sounds like a Russian novel - comprehensive and thoroughly engrossing","last_updated":"2017-06-14T12:00:38.326Z","parsed":{"xt":"urn:btih:06d1b9e05a4fff8fc37e6ad1408fce64f648e82f","dn":"Beverly Lowry - Who Killed These Girls 2016 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"06d1b9e05a4fff8fc37e6ad1408fce64f648e82f","infoHashBuffer":{"type":"Buffer","data":[6,209,185,224,90,79,255,143,195,126,106,209,64,143,206,100,246,72,232,47]},"name":"Beverly Lowry - Who Killed These Girls 2016 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}