{"title":"60 Seconds! v1.211","magnet":"magnet:?xt=urn:btih:07d4efef8230412324203d7c84db4e858c131446&dn=60+Seconds%21+v1.211&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"659320637","seeders":"0","leechers":"0","description":"As Ted, a responsible citizen and a family man, you are faced with a slight disturbance to your happy, suburban lifestyle. THE NUCLEAR APOCALYPSE.With only 60 seconds left to impact, guide Ted in a mad, intense and action packed dash through his house in search of his family and useful supplies. Everything will be against you - time, your very own furniture, the house that&apos;s different every time you play and the fundamental question - what to take with you and who to leave behind?Reaching the fallout shelter in time and alive is only the beginning. Whatever you scavenged and whoever you saved will play a vital role in your survival. Each survival story will be different, with every day surprising you with unexpected events. Will all of these stories end well? It&apos;s up to you. Ration food and water, make best use of your supplies, face difficult choices and even venture into the wasteland.Good luck.EXPERIENCEthe suburbian nightmare of a nuke dropping down on your neighbourhood in this atomic, dark comedy set in 1950s.SCAVENGE any supplies, you will need to survive, and family members in a 60 second rush through your procedurally generated house.PREPARE  for the worst. Don&#x2019;t just grab arbitrary items, plan your survival and follow helpful tips from emergency broadcasts","last_updated":"2017-07-22T12:00:18.158Z","parsed":{"xt":"urn:btih:07d4efef8230412324203d7c84db4e858c131446","dn":"60 Seconds! v1.211","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"07d4efef8230412324203d7c84db4e858c131446","infoHashBuffer":{"type":"Buffer","data":[7,212,239,239,130,48,65,35,36,32,61,124,132,219,78,133,140,19,20,70]},"name":"60 Seconds! v1.211","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}