{"title":"23 Things They Don't Tell You About Capitalism by Ha-Joon Chang ","magnet":"magnet:?xt=urn:btih:08520cc3d2c1a52b576e85fdb98a821345571ee5&dn=23+Things+They+Don%27t+Tell+You+About+Capitalism+by+Ha-Joon+Chang+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2832000","seeders":"0","leechers":"0","description":"xx\r\n\r\n23 Things They Don&apos;t Tell You About Capitalism by Ha-Joon Chang MOBI eBOOK-ZAK\r\n\r\nThing 1: There is no such thing as the free market.\r\nThing 4: The washing machine has changed the world more than the Internet.\r\nThing 5: Assume the worst about people, and you get the worst.\r\nThing 13: Making rich people richer doesn&apos;t make the rest of us richer.\r\n\r\nIf you&apos;ve wondered how we did not see the economic collapse coming, Ha-Joon Chang knows the answer: We didn&apos;t ask what they didn&apos;t tell us about capitalism. This is a lighthearted book with a serious purpose: to question the assumptions behind the dogma and sheer hype that the dominant school of neoliberal economists - the apostles of the freemarket - have spun since the Age of Reagan.\r\n\r\nChang, the author of the international best seller Bad Samaritans, is one of the world&apos;s most respected economists, a voice of sanity - and wit - in the tradition of John Kenneth Galbraith and Joseph Stiglitz.\r\n\r\n23 Things They Don&apos;t Tell You About Capitalism equips readers with an understanding of how global capitalism works - and doesn&apos;t. In his final chapter, &quot;How to Rebuild the World&quot;, Chang offers a vision of how we can shape capitalism to humane ends, instead of becoming slaves of the market.\r\n\r\nHa-Joon Chang teaches in the Faculty of Economics at the University of Cambridge. His books include the best-selling Bad Samaritans: The Myth of Free Trade and the Secret History of Capitalism. His Kicking Away the Ladder received the 2003 Myrdal Prize, and, in 2005, Chang was awarded the Leontief Prize for Advancing the Frontiers of Economic Thought.\r\n\r\nxx","last_updated":"2017-09-16T12:01:40.036Z","parsed":{"xt":"urn:btih:08520cc3d2c1a52b576e85fdb98a821345571ee5","dn":"23 Things They Don't Tell You About Capitalism by Ha-Joon Chang ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"08520cc3d2c1a52b576e85fdb98a821345571ee5","infoHashBuffer":{"type":"Buffer","data":[8,82,12,195,210,193,165,43,87,110,133,253,185,138,130,19,69,87,30,229]},"name":"23 Things They Don't Tell You About Capitalism by Ha-Joon Chang ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}