{"title":"Mothers Who Can't Love by Susan Forward EPUB","magnet":"magnet:?xt=urn:btih:0883590ed2613e0e32c437cd28bb401c6573a23c&dn=Mothers+Who+Can%27t+Love+by+Susan+Forward+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"283310","seeders":"23","leechers":"7","description":"xx\r\n\r\nMothers Who Can&apos;t Love by Susan Forward EPUB\r\n\r\nWith Mothers Who Can&apos;t Love: A Healing Guide for Daughters, Susan Forward, Ph.D., author of the smash #1 best-seller Toxic Parents, offers a powerful look at the devastating impact unloving mothers have on their daughters - and provides clear, effective techniques for overcoming that painful legacy.\r\n\r\nIn more than 35 years as a therapist, Forward has worked with large numbers of women struggling to escape the emotional damage inflicted by the women who raised them. Subjected to years of criticism, competition, role-reversal, smothering control, emotional neglect and abuse, these women are plagued by anxiety and depression, relationship problems, lack of confidence and difficulties with trust. They doubt their worth, and even their ability to love.\r\n\r\nForward examines the Narcissistic Mother, the Competitive Mother, the Overly Enmeshed mother, the Control Freak, Mothers who need Mothering, and mothers who abuse or fail to protect their daughters from abuse.\r\n\r\nFilled with compelling case histories, Mothers Who Can&apos;t Love outlines the self-help techniques Forward has developed to transform the lives of her clients, showing women how to overcome the pain of childhood and how to act in their own best interests.\r\n\r\nWarm and compassionate, Mothers Who Can&apos;t Love offers daughters the emotional support and tools they need to heal themselves and rebuild their confidence and self-respect.\r\n\r\nxx","last_updated":"2017-12-30T12:03:25.293Z","parsed":{"xt":"urn:btih:0883590ed2613e0e32c437cd28bb401c6573a23c","dn":"Mothers Who Can't Love by Susan Forward EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0883590ed2613e0e32c437cd28bb401c6573a23c","infoHashBuffer":{"type":"Buffer","data":[8,131,89,14,210,97,62,14,50,196,55,205,40,187,64,28,101,115,162,60]},"name":"Mothers Who Can't Love by Susan Forward EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}