{"title":"DK Eyewitness Travel Guide: Jerusalem, Israel, Petra and  Sinai(","magnet":"magnet:?xt=urn:btih:09ade3357baf826c869e5a440b694fb33a5a5ae4&dn=DK+Eyewitness+Travel+Guide%3A+Jerusalem%2C+Israel%2C+Petra+and++Sinai%28&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Bläddra zeke23","categoryP":"annat","categoryS":"e_böcker","size":"91873856","seeders":"1","leechers":"0","description":"DK Eyewitness Travel Guide: Jerusalem, Israel, Petra &amp; Sinai(2016) - PDF - zeke23\r\nISBN: 146544131X, 0241209684 | 2016 | PDF | 328 Pages | 86 MB\r\nDK Eyewitness Travel Guide: Jerusalem, Israel, Petra &amp; Sinai will lead you straight to the best attractions the region has to offer.\r\n\r\nExperience this beautiful and sacred part of the world, from the green hills and sun-drenched coast of Galilee to the holy sites of Jerusalem&apos;s Old City, and from the dramatic desert of Wadi Rum to the vibrant reefs of Dahab.\r\n\r\nDiscover DK Eyewitness Travel Guide: Jerusalem, Israel, Petra &amp; Sinai.\r\nDetailed itineraries and &quot;don&apos;t-miss&quot; destination highlights at a glance.\r\nIllustrated cutaway 3-D drawings of important sights.\r\nFloor plans and guided visitor information for major museums.\r\nGuided walking tours, local drink and dining specialties to try, things to do, and places to eat, drink, and shop by area.\r\nArea maps marked with sights.\r\nDetailed city maps each include a street finder index for easy navigation.\r\nInsights into history and culture to help you understand the stories behind the sights.\r\nHotel and restaurant listings highlight DK Choice special recommendations.\r\n\r\nWith hundreds of full-color photographs, hand-drawn illustrations, and custom maps that illuminate every page, DK Eyewitness Travel Guide: Jerusalem, Israel, Petra &amp; Sinai truly shows you what others only tell you.\r\n\r\nRecommended: For a pocket guidebook to the region, check out DK Eyewitness Travel Guide Top 10: Israel, Sinai &amp; Petra, which is packed with dozens of top 10 lists, ensuring you make the most of your time and experience the best of everything.\r\n\r\nSeries Overview: For more than two decades, DK Eyewitness Travel Guides have helped travelers experience the world through the history, art, architecture, and culture of their destinations. Expert travel writers and researchers provide independent editorial advice, recommendations, and reviews. With guidebooks to hundreds of places around the globe available in print and digital formats, DK Eyewitness Travel Guides show travelers how they can discover more.\r\n\r\nDK Eyewitness Travel Guides: the most maps, photographs, and illustrations of any guide","last_updated":"2017-06-13T12:01:13.320Z","parsed":{"xt":"urn:btih:09ade3357baf826c869e5a440b694fb33a5a5ae4","dn":"DK Eyewitness Travel Guide: Jerusalem, Israel, Petra and  Sinai(","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"09ade3357baf826c869e5a440b694fb33a5a5ae4","infoHashBuffer":{"type":"Buffer","data":[9,173,227,53,123,175,130,108,134,158,90,68,11,105,79,179,58,90,90,228]},"name":"DK Eyewitness Travel Guide: Jerusalem, Israel, Petra and  Sinai(","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}