{"title":"Science fiction classics to watch over and over and over","magnet":"magnet:?xt=urn:btih:09d3673a17224b7bbfcfa9288fa94c12ede2acbf&dn=Science+fiction+classics+to+watch+over+and+over+and+over&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"alien2660","categoryP":"video","categoryS":"other","size":"2186802837","seeders":"1","leechers":"7","description":"Good movies are enjoyable for one viewing, and great movies hold up through multiple viewings, but my favorites are the brilliant movies that are actually better the 5th or 10th time through...  I&apos;m including 3 of them on this torrent: A) &apos;Mr. Nobody,&apos; the story of the last mortal man, who was born with the ability to remember both the past and the future, who, while lying on his deathbed, looks back on his lives and the three different women he married and the multiple different ways each of those could have, (did), play out.  Jered Leto is fantastic in the titular role! B) &apos;Eternal Sunshine of the Spotless Mind,&apos; the story of a man, (Jim Carrey), who visits his girlfriend, (Kate Winslet), at work one day, where she claims she&apos;s never seen him before in her life. He learns she has had all memories of him erased from her mind, due to frustration at their relationship, which seems to be going nowhere. His immediate reaction is to have her removed from his memory as well, but in the middle of the operation he changes his mind. Most of the film takes place in his memories, as he tries to hold onto her. The real star of this film is director Michel Gondry, who filmed this mind-fuck of a movie sans special effects, a concept hard to believe as you watch its magic unwind. C) &apos;Timecrimes,&apos; a low-budget Spanish thriller about a man who sees a topless woman in a forest. When he goes to investigate, he&apos;s stabbed by a man whose face is covered in pink bandages. After a series of events, he&apos;s involved in a car accident, and wraps his head in bandages, which soon turn pink from his blood. Shortly thereafter, he stabs a man, (himself.) The time loops are nearly impossible to decipher the first, (or second, or third), time through, but the story is mesmerizing...  If you enjoy science fiction and puzzles, I guarantee you&apos;ll keep these on your computer to re-watch!\r\n\r\nAs always, support the artists by purchasing their works, and please keep these torrents alive by seeding.  I&apos;d also appreciate some feedback on my uploads, as well as suggestions for future uploads you&apos;d like to see.\r\n\r\nPlease check out my other torrents and enjoy!","last_updated":"2017-12-20T12:08:09.304Z","parsed":{"xt":"urn:btih:09d3673a17224b7bbfcfa9288fa94c12ede2acbf","dn":"Science fiction classics to watch over and over and over","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"09d3673a17224b7bbfcfa9288fa94c12ede2acbf","infoHashBuffer":{"type":"Buffer","data":[9,211,103,58,23,34,75,123,191,207,169,40,143,169,76,18,237,226,172,191]},"name":"Science fiction classics to watch over and over and over","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}