{"title":"Condoleezza Rice - Democracy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:0a93197a29ea7481a70b0b604f17d57d37ef9310&dn=Condoleezza+Rice+-+Democracy+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"31324961","seeders":"1","leechers":"0","description":"xx\r\n\r\nCondoleezza Rice - Democracy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the former secretary of state and best-selling author - a sweeping look at the global struggle for democracy and why America must continue to support the cause of human freedom.\r\n\r\nFrom the end of the Cold War and the collapse of the Soviet Union to the ongoing struggle for human rights in the Middle East, Condoleezza Rice has served on the front lines of history. As a child, she was an eyewitness to a third awakening of freedom, when her hometown of Birmingham, Alabama, became the epicenter of the civil rights movement for black Americans.\r\n\r\nIn this book, Rice explains what these epochal events teach us about democracy. At a time when people around the world are wondering whether democracy is in decline, Rice shares insights from her experiences as a policymaker, scholar, and citizen, in order to put democracy&apos;s challenges into perspective.\r\n\r\nWhen the United States was founded, it was the only attempt at self-government in the world. Today more than half of all countries qualify as democracies, and in the long run that number will continue to grow. Yet nothing worthwhile ever comes easily. Using America&apos;s long struggle as a template, Rice draws lessons for democracy around the world - from Russia, Poland, and Ukraine, to Kenya, Colombia, and the Middle East. She finds that no transitions to democracy are the same because every country starts in a different place. Pathways diverge and sometimes circle backward. Time frames for success vary dramatically, and countries often suffer false starts before getting it right. But, Rice argues, that does not mean they should not try. While the ideal conditions for democracy are well known in academia, they never exist in the real world. The question is not how to create perfect circumstances but how to move forward under difficult ones.\r\n\r\nThese same insights apply in overcoming the challenges faced by governments today. The pursuit of democracy is a continuing struggle shared by people around the world, whether they are opposing authoritarian regimes, establishing new democratic institutions, or reforming mature democracies to better live up to their ideals. The work of securing it is never finished.\r\n\r\nxx","last_updated":"2017-08-02T12:00:54.078Z","parsed":{"xt":"urn:btih:0a93197a29ea7481a70b0b604f17d57d37ef9310","dn":"Condoleezza Rice - Democracy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0a93197a29ea7481a70b0b604f17d57d37ef9310","infoHashBuffer":{"type":"Buffer","data":[10,147,25,122,41,234,116,129,167,11,11,96,79,23,213,125,55,239,147,16]},"name":"Condoleezza Rice - Democracy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}