{"title":"The Tapping Solution for Pain Relief_ A Step-by-Step Guide to Re","magnet":"magnet:?xt=urn:btih:0b36bea20f37733df4f34841e5bbde94cf62c19e&dn=The+Tapping+Solution+for+Pain+Relief_+A+Step-by-Step+Guide+to+Re&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2684002","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Tapping Solution for Pain Relief_ A Step-by-Step Guide to Reducing and Eliminating Chronic Pain by Nick Ortner ePUB eBOOK-ZAK\r\n\r\nDo you suffer from chronic pain? If so, you&apos;re not alone. In fact, more than 100 million Americans deal with this life-changing issue every day. And if you&apos;re like most of them, you&apos;ve tried all the normal &quot;solutions&quot;: doctors, injections, medications, and surgeries. While these all have a place in healing, they have fallen short in dealing with the pain epidemic. So what can you do?\r\n\r\nIn The Tapping Solution for Pain Relief, Nick Ortner presents a startling alternative. He lays out a step-by-step plan that teaches you how to use tapping, or EFT (emotional freedom techniques), to reduce or eliminate chronic pain. Looking at the scientific research surrounding pain, stress, and tapping, he opens your eyes to just how powerful tapping can be, and then outlines tips and techniques to address pain in both the short and long term.\r\n\r\nNick guides you on a journey that begins on the surface - tapping to address the pain itself - and moves to the deeper issues that often affect pain. With easy-to-follow tapping scripts and exercises, Nick helps you heal the emotional pain and underlying beliefs that often keep people stuck. He also addresses topics that you may not think of as associated with chronic pain, such as:\r\n\r\nCreating personal boundaries\r\nDealing with toxic relationships\r\nClearing resistance to change\r\nUnderstanding the power of a diagnosis\r\nWorking through anger\r\n\r\nThere are many ways the brain and body can create, increase, and prolong pain. After reading this book, you&apos;ll not only understand what&apos;s causing your pain, but also how to achieve complete and lasting relief. But let&apos;s face it; this is about more than just pain relief. It&apos;s about empowering yourself to take back your body in order to live the life you want.\r\n\r\nxx","last_updated":"2017-09-02T12:00:23.665Z","parsed":{"xt":"urn:btih:0b36bea20f37733df4f34841e5bbde94cf62c19e","dn":"The Tapping Solution for Pain Relief_ A Step-by-Step Guide to Re","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0b36bea20f37733df4f34841e5bbde94cf62c19e","infoHashBuffer":{"type":"Buffer","data":[11,54,190,162,15,55,115,61,244,243,72,65,229,187,222,148,207,98,193,158]},"name":"The Tapping Solution for Pain Relief_ A Step-by-Step Guide to Re","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}