{"title":"Additive Migration from Plastics Into Food","magnet":"magnet:?xt=urn:btih:0b5c1ac05077a1a210dc1a602f75ff338b0ae19e&dn=Additive+Migration+from+Plastics+Into+Food&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"6910875","seeders":"28","leechers":"1","description":"Additive Migration from Plastics Into Food - T.R. Crompton (Pergamon, 1979).pdf\r\n\r\nAdditive Migration from Plastics Into Food examines the intrusion of foreign chemicals into food via additives present in plastics packaging and the toxic hazards they pose to consumers. This book shows how direct contact between the packed commodity and the plastic is likely to result in the transfer of polymer additives, adventitious impurities such as monomers, catalyst remnants, and residual polymerization solvents, and low-molecular-weight polymer fractions from the plastic into the packaged material. \r\nThis book is comprised of nine chapters and begins with a discussion on the various types of plastics used in food packaging as well as the types of substances present in the plastic that might migrate into the food. Subsequent chapters review world literature on extraction testing and the analysis of extractants. The determination of various types of polymer additives and residual monomers in extractants of liquid foodstuffs and beverages, solid foods, edible oils, and fatty foodstuffs is considered. The final chapter looks at the legal requirements concerning the use of additives in food-grade plastics in various countries. \r\nThis monograph will be of interest to those in the plastics industry, food and beverage packaging industry, and large retail outlets such as supermarkets, along with medical and public health officials, legislators, environmentalists, and the general public","last_updated":"2017-06-16T12:05:11.095Z","parsed":{"xt":"urn:btih:0b5c1ac05077a1a210dc1a602f75ff338b0ae19e","dn":"Additive Migration from Plastics Into Food","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0b5c1ac05077a1a210dc1a602f75ff338b0ae19e","infoHashBuffer":{"type":"Buffer","data":[11,92,26,192,80,119,161,162,16,220,26,96,47,117,255,51,139,10,225,158]},"name":"Additive Migration from Plastics Into Food","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}