{"title":"Dan Egan - The Death and Life of the Great Lakes 2017 RETAiL ePU","magnet":"magnet:?xt=urn:btih:0b952e2e0b6811094a9a952d4408c317702c88af&dn=Dan+Egan+-+The+Death+and+Life+of+the+Great+Lakes+2017+RETAiL+ePU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12225848","seeders":"0","leechers":"0","description":"xx\r\n\r\nDan Egan - The Death and Life of the Great Lakes 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe Great Lakes - Erie, Huron, Michigan, Ontario, and Superior - hold 20 percent of the world&apos;s supply of surface fresh water and provide sustenance, work, and recreation for tens of millions of Americans. But they are under threat as never before, and their problems are spreading across the continent. The Death and Life of the Great Lakes is prize-winning reporter Dan Egan&apos;s engaging portrait of an ecological catastrophe happening right before our eyes, blending the epic story of the lakes with an examination of the perils they face and the ways we can restore and preserve them for generations to come.\r\n\r\nFor thousands of years, the pristine Great Lakes were separated from the Atlantic Ocean by the roaring Niagara Falls and from the Mississippi River basin by a &quot;subcontinental divide&quot;. Beginning in the late 1800s, these barriers were circumvented to attract oceangoing freighters from the Atlantic and to allow Chicago&apos;s sewage to float out to the Mississippi. These were engineering marvels in their time - and the changes in Chicago arrested a deadly cycle of waterborne illnesses - but they have had horrendous unforeseen consequences. Egan provides a chilling account of how sea lamprey, zebra and quagga mussels, and other invaders have made their way into the lakes, decimating native species and largely destroying the age-old ecosystem. And because the lakes are no longer isolated, the invaders now threaten water intake pipes, hydroelectric dams, and other infrastructure across the country.\r\n\r\nEgan also explores why outbreaks of toxic algae stemming from the overapplication of farm fertilizer have left massive biological &quot;dead zones&quot; that threaten the supply of fresh water. He examines fluctuations in the levels of the lakes caused by manmade climate change and overzealous dredging of shipping channels. And he reports on the chronic threats to siphon off Great Lakes water to slake drier regions of America or to be sold abroad.\r\n\r\nIn an age when dire problems like the Flint water crisis or the California drought bring ever more attention to the indispensability of safe, clean, easily available water, The Death and the Life of the Great Lakes is a powerful paean to what is arguably our most precious resource, an urgent examination of what threatens it, and a convincing call to arms about the relatively simple things we need to do to protect it.\r\n\r\nxx","last_updated":"2017-07-04T12:00:28.470Z","parsed":{"xt":"urn:btih:0b952e2e0b6811094a9a952d4408c317702c88af","dn":"Dan Egan - The Death and Life of the Great Lakes 2017 RETAiL ePU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0b952e2e0b6811094a9a952d4408c317702c88af","infoHashBuffer":{"type":"Buffer","data":[11,149,46,46,11,104,17,9,74,154,149,45,68,8,195,23,112,44,136,175]},"name":"Dan Egan - The Death and Life of the Great Lakes 2017 RETAiL ePU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}