{"title":"The Awkward Thoughts of W. Kamau Bell by W. Kamau Bell 2017 RETA","magnet":"magnet:?xt=urn:btih:0cb7e92c4e81efbd1bd7e92caa9444f30d880c40&dn=The+Awkward+Thoughts+of+W.+Kamau+Bell+by+W.+Kamau+Bell+2017+RETA&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3900561","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Awkward Thoughts of W. Kamau Bell by W. Kamau Bell 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nYou may know W. Kamau Bell from his new Emmy-nominated hit show on CNN, United Shades of America. Or maybe you&apos;ve read about him in The New York Times, which called him &quot;the most promising new talent in political comedy in many years.&quot; Or maybe from The New Yorker fawning over his brand of humor writing: &quot;Bell&apos;s gimmick is intersectional progressivism: he treats racial, gay, and women&apos;s issues as inseparable.&quot;\r\n\r\nAfter all this love and praise, it&apos;s time for the next step: a book. The Awkward Thoughts of W. Kamau Bell is a humorous, well-informed take on the world today, tackling a wide range of issues, such as race relations; fatherhood; the state of law enforcement today; comedians and superheroes; right-wing politics; left-wing politics; failure; his interracial marriage; white men; his upbringing by very strong-willed, race-conscious, yet ideologically opposite parents; his early days struggling to find his comedic voice, then his later days struggling to find his comedic voice; why he never seemed to fit in with the black comedy scene...or the white comedy scene; how he was a black nerd way before that became a thing; how it took his wife and an East Bay lesbian to teach him that racism and sexism often walk hand in hand; and much, much more.\r\n\r\nxx","last_updated":"2017-08-19T12:00:57.716Z","parsed":{"xt":"urn:btih:0cb7e92c4e81efbd1bd7e92caa9444f30d880c40","dn":"The Awkward Thoughts of W. Kamau Bell by W. Kamau Bell 2017 RETA","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0cb7e92c4e81efbd1bd7e92caa9444f30d880c40","infoHashBuffer":{"type":"Buffer","data":[12,183,233,44,78,129,239,189,27,215,233,44,170,148,68,243,13,136,12,64]},"name":"The Awkward Thoughts of W. Kamau Bell by W. Kamau Bell 2017 RETA","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}