{"title":"Own the Moment by Carl Lentz EPUB","magnet":"magnet:?xt=urn:btih:0d1cacee2d02e8bf25c411f7ca40314190183cc0&dn=Own+the+Moment+by+Carl+Lentz+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2149453","seeders":"0","leechers":"0","description":"xx\r\n\r\nOwn the Moment by Carl Lentz EPUB\r\n\r\nWhen you think of a Christian pastor, you probably don&apos;t envision a tattooed 30-something who wears a motorcycle jacket, listens to hip-hop music, references The Walking Dead and Black Lives Matter in his sermons, and every Sunday draws a standing-room only crowd to a venue normally used for rock concerts - in godless New York City, no less.\r\n\r\nBut then you clearly have never met Carl Lentz.\r\n\r\nAs head pastor of the first United States branch of global megachurch Hillsong, the former college basketball player is on a mission to make Christianity accessible in the 21st century. In Own the Moment, he shares the unlikely and inspiring story of how he went from being an average teenager who couldn&apos;t care less about church to leading one of the country&apos;s fastest-growing congregations - how one day he is trying to convince a Virginia Beach 7-Eleven clerk to attend his service, and just a few years later he is baptizing a global music icon in an NBA player&apos;s Manhattan bathtub.\r\n\r\nAmid such candid personal tales, Lentz also offers illuminating readings of Bible passages and practical tips on how to live as a person of faith in an increasingly materialistic world. How do you maintain your values - and pass them on to your children - in a society that worships money and sex and fame? How do you embrace your flaws in this Instagram era that exalts the appearance of perfection? How do you forget about &quot;living the dream&quot; and learn to embrace the beauty of your reality?\r\n\r\nThese are just a few of the many important questions Lentz answers in Own the Moment - a powerful book that redefines not just Christianity but spirituality as a whole.\r\n\r\nxx","last_updated":"2017-11-02T12:04:36.260Z","parsed":{"xt":"urn:btih:0d1cacee2d02e8bf25c411f7ca40314190183cc0","dn":"Own the Moment by Carl Lentz EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0d1cacee2d02e8bf25c411f7ca40314190183cc0","infoHashBuffer":{"type":"Buffer","data":[13,28,172,238,45,2,232,191,37,196,17,247,202,64,49,65,144,24,60,192]},"name":"Own the Moment by Carl Lentz EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}