{"title":"Strangers in Their Own Land by Arlie Russell Hochschild EPUB","magnet":"magnet:?xt=urn:btih:0d39bd512317e11e35d9e306fc2ad464dfa67b8d&dn=Strangers+in+Their+Own+Land+by+Arlie+Russell+Hochschild+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"487974","seeders":"34","leechers":"2","description":"xx\r\n\r\nStrangers in Their Own Land by Arlie Russell Hochschild EPUB\r\n\r\nIn Strangers in Their Own Land, the renowned sociologist Arlie Hochschild embarks on a thought-provoking journey from her liberal hometown of Berkeley, California, deep into Louisiana bayou country - a stronghold of the conservative right. As she gets to know people who strongly oppose many of the ideas she famously champions, Hochschild nevertheless finds common ground and quickly warms to the people she meets, among them a Tea Party activist whose town has been swallowed by a sinkhole caused by a drilling accident - people whose concerns are actually ones that all Americans share: the desire for community, the embrace of family, and hopes for their children.\r\n\r\nStrangers in Their Own Land goes beyond the commonplace liberal idea that these are people who have been duped into voting against their own interests. Instead Hochschild finds lives ripped apart by stagnant wages, a loss of home, an elusive American dream - and political choices and views that make sense in the context of their lives. Hochschild draws on her expert knowledge of the sociology of emotion to help us understand what it feels like to live in &quot;red&quot; America. Along the way she finds answers to one of the crucial questions of contemporary American politics: Why do the people who would seem to benefit most from &quot;liberal&quot; government intervention abhor the very idea?\r\n\r\nxx","last_updated":"2017-11-25T13:55:18.829Z","parsed":{"xt":"urn:btih:0d39bd512317e11e35d9e306fc2ad464dfa67b8d","dn":"Strangers in Their Own Land by Arlie Russell Hochschild EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0d39bd512317e11e35d9e306fc2ad464dfa67b8d","infoHashBuffer":{"type":"Buffer","data":[13,57,189,81,35,23,225,30,53,217,227,6,252,42,212,100,223,166,123,141]},"name":"Strangers in Their Own Land by Arlie Russell Hochschild EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}