{"title":"Fallen Glory by James Crawford EPUB","magnet":"magnet:?xt=urn:btih:0d821a8119f4a0360b1899574e43c914f0bd2eac&dn=Fallen+Glory+by+James+Crawford+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3669842","seeders":"8","leechers":"8","description":"xx\r\n\r\nFallen Glory by James Crawford EPUB\r\n\r\nAn inviting, fascinating compendium of 21 of history&apos;s most famous lost places, from the Tower of Babel to the Twin Towers.\r\n\r\nBuildings are more like us than we realize. They can be born into wealth or poverty, enjoying every privilege or struggling to make ends meet. They have parents - gods, kings and emperors, governments, visionaries and madmen - as well as friends and enemies. They have duties and responsibilities. They can endure crises of faith and purpose. They can succeed or fail. They can live. And, sooner or later, they die.\r\n\r\nIn Fallen Glory, James Crawford uncovers the biographies of some of the world&apos;s most fascinating lost and ruined buildings, from the dawn of civilization to the cyber era. The lives of these iconic structures are packed with drama and intrigue. Soap operas on the grandest scale, they feature war and religion, politics and art, love and betrayal, catastrophe and hope. Frequently their afterlives have been no less dramatic - their memories used and abused down the millennia for purposes both sacred and profane. They provide the stage for a startling array of characters, including Gilgamesh, the Cretan Minotaur, Agamemnon, Nefertiti, Genghis Khan, Henry VIII, Catherine the Great, Adolf Hitler, and even Bruce Springsteen.\r\n\r\nThe 21 structures Crawford focuses on include The Tower of Babel, The Temple of Jerusalem, The Library of Alexandria, The Bastille, Kowloon Walled City, the Berlin Wall, and the Twin Towers of the World Trade Center. Ranging from the deserts of Iraq, the banks of the Nile, and the cloud forests of Peru to the great cities of Jerusalem, Istanbul, Paris, Rome, London, and New York, Fallen Glory is a unique guide to a world of vanished architecture.\r\n\r\nxx","last_updated":"2017-12-01T12:02:49.529Z","parsed":{"xt":"urn:btih:0d821a8119f4a0360b1899574e43c914f0bd2eac","dn":"Fallen Glory by James Crawford EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0d821a8119f4a0360b1899574e43c914f0bd2eac","infoHashBuffer":{"type":"Buffer","data":[13,130,26,129,25,244,160,54,11,24,153,87,78,67,201,20,240,189,46,172]},"name":"Fallen Glory by James Crawford EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}