{"title":"The Great Agnostic_ Robert Ingersoll and American Freethought by","magnet":"magnet:?xt=urn:btih:0da404ffe4b37575bc04de8118683540e4ba8e14&dn=The+Great+Agnostic_+Robert+Ingersoll+and+American+Freethought+by&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3830376","seeders":"1","leechers":"0","description":"xx\r\n\r\nThe Great Agnostic_ Robert Ingersoll and American Freethought by Susan Jacoby ePUB eBOOK-ZAK\r\n\r\nA biography that restores America&apos;s foremost 19th-century champion of reason and secularism to our still contested 21st-century public square.\r\n\r\nDuring the Gilded Age, which saw the dawn of America&apos;s enduring culture wars, Robert Green Ingersoll was known as &quot;the Great Agnostic&quot;. The nation&apos;s most famous orator, he raised his voice on behalf of Enlightenment reason, secularism, and the separation of church and state with a vigor unmatched since America&apos;s revolutionary generation. When he died in 1899, even his religious enemies acknowledged that he might have aspired to the US presidency had he been willing to mask his opposition to religion. To the question that retains its controversial power today - was the United States founded as a Christian nation? - Ingersoll answered an emphatic no.\r\n\r\nIn this provocative biography, Susan Jacoby, the author of Freethinkers: A History of American Secularism, restores Ingersoll to his rightful place in an American intellectual tradition extending from Thomas Jefferson and Thomas Paine to the current generation of &quot;new atheists&quot;. Jacoby illuminates the ways in which America&apos;s often-denigrated and forgotten secular history encompasses issues, ranging from women&apos;s rights to evolution, as potent and divisive today as they were in Ingersoll&apos;s time. Ingersoll emerges in this portrait as one of the indispensable public figures who keep an alternative version of history alive. He devoted his life to that greatest secular idea of all - liberty of conscience belonging to the religious and nonreligious alike.\r\n\r\nxx","last_updated":"2017-08-13T12:01:24.014Z","parsed":{"xt":"urn:btih:0da404ffe4b37575bc04de8118683540e4ba8e14","dn":"The Great Agnostic_ Robert Ingersoll and American Freethought by","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0da404ffe4b37575bc04de8118683540e4ba8e14","infoHashBuffer":{"type":"Buffer","data":[13,164,4,255,228,179,117,117,188,4,222,129,24,104,53,64,228,186,142,20]},"name":"The Great Agnostic_ Robert Ingersoll and American Freethought by","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}