{"title":"Rule Britannia Music, Mischief and Morals","magnet":"magnet:?xt=urn:btih:0dc7ba6ffcc48287b4fbc254633074fcbb333dd0&dn=Rule+Britannia+Music%2C+Mischief+and+Morals&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Ravenwilde","categoryP":"video","categoryS":"tv_shows","size":"3951105887","seeders":"0","leechers":"4","description":"Rule Britannia: Music, Mischief and Moral&apos;s\r\n\r\nRule Britannia! Music, Mischief and Morals in the 18th Century Suzy Klein explores the extent to which classical music played a significant role in shaping British identity and patriotism in the 18th century. \r\n\r\nPart 1 \r\n\r\nIn the first edition, Suzy Klein investigates music as a weapon in the fight for British identity; helping to cement the power of a new German royal family and used in Jacobite uprisings against them. She discovers why Italian opera was all the rage, thanks partly to a fascination with castrated male singers. When Handel arrived in London, the city realised it has a genius on its hands, a man capable of creating music of such power, vigour and vitality that it can stir the hearts of the whole nation. Music stirred a &apos;bottom up&apos; revolution, as the Beggar&apos;s Opera brought the satirical, subversive songs of the street onto the British stage, inventing modern musical theatre as we know it. \r\n\r\nPart 2 \r\n\r\nAs money poured in from a flourishing trade empire, the British rediscovered a taste for pleasure and fun, and music was at the very centre of it. Aspiring young girls played the keyboard to attract a good husband and nothing beat dancing a minuet if you wanted a place in the best society. Europe&apos;s best composers and performers descended upon Britain, certain that the &apos;rage for music&apos; would make them rich. Music had become a tool for social mobility, but it was also starting to shape the physical fabric of Britain - concert halls, assembly rooms and pleasure gardens sprang up across the country as the thirst for entertainment grew. \r\n\r\nPart 3 \r\n\r\nAs the century went on, the quest for pleasure began to be replaced by a tougher, noisier, harder-working attitude as Britain embarked on what was to become the Industrial Revolution. Music also began to take on a different hue - more than just the sonic background to an age of roaring excess; it began to acquire a higher moral purpose. Communal singing, whether in amateur choirs or Handel oratorios, became a means of finding a kind of perfection amid the brutal reality of daily life. Romanticism began to blossom in the search for the sublime. The British folk music that travelled with emigrants to America, the songs of abolitionists that flew in the face of the British slave trade - all were an attempt to use music as a route to more perfect world","last_updated":"2017-06-15T12:01:58.154Z","parsed":{"xt":"urn:btih:0dc7ba6ffcc48287b4fbc254633074fcbb333dd0","dn":"Rule Britannia Music, Mischief and Morals","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0dc7ba6ffcc48287b4fbc254633074fcbb333dd0","infoHashBuffer":{"type":"Buffer","data":[13,199,186,111,252,196,130,135,180,251,194,84,99,48,116,252,187,51,61,208]},"name":"Rule Britannia Music, Mischief and Morals","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}