{"title":"DiRT 4 v2 [Reload]","magnet":"magnet:?xt=urn:btih:0e14f2d758391f0db2b11cd776f8fe7692cb961a&dn=DiRT+4+v2+%5BReload%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"midrozomlu26","categoryP":"games","categoryS":"pc","size":"19376453713","seeders":"0","leechers":"0","description":"Dirt 4 is a racing game focused on rallying. Players compete in timed stage events on tarmac and off-road terrain in varying weather conditions. Rally stages span five locations: Fitzroy in Australia, Tarragona in Spain, Michigan in the United States, V&#xE4;rmland in Sweden and Powys in Wales. Cars are drawn from a wide variety of competition classes and time periods, such as the Group B cars of the 1980s, Group A and Group N cars from the 1990s and 2000s, and Group R cars from the 2010s. The game does not feature World Rally Cars or any elements associated with the World Rally Championship. Dirt 4 also introduces a new feature called &quot;Your Stage&quot; that procedurally generates rally stages based on a setting and parameters that the player defines.[1] As the game does not feature any licensed content for its rally mode, Your Stage is used to generate all of the stages that the player drives on in career mode.\r\n\r\nThe game features rallycross racing and carry a FIA World Rallycross Championship license. It includes five rallycross circuits: Lydden Hill Race Circuit in Great Britain, H&#xF6;ljesbanan in Sweden, L&#xE5;nkebanen in Norway, the Circuit de Loh&#xE9;ac in France and the Pista Autom&#xF3;vel de Montalegre in Portugal. Loh&#xE9;ac and Montalegre are new to the series. Both rallycross Supercars and RX Lites are included. The game also features multiplayer and cross-platform leaderboards.[1] Landrush mode returns, featuring stadium trucks and buggy racing, with stages from locations in California, Nevada and Mexico.[2] Just like its predecessor Dirt Rally, Dirt 4 includes Steam Workshop for the PC version. Dirt 4 also sees the return of the popular Dirt 3 mode &quot;Joyride&quot; which features multiplayer mini games.\r\n\r\nDirt 4 builds upon the team management systems introduced in Dirt Rally and Grid Autosport, with the player hiring personnel to repair the car, oversee the day-to-day operations, and boost the team&apos;s profile to secure new sponsors. Players are also able to buy and sell new and used cars, with previous results and accident histories affecting the resale value of the car","last_updated":"2017-08-09T12:00:51.102Z","parsed":{"xt":"urn:btih:0e14f2d758391f0db2b11cd776f8fe7692cb961a","dn":"DiRT 4 v2 [Reload]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e14f2d758391f0db2b11cd776f8fe7692cb961a","infoHashBuffer":{"type":"Buffer","data":[14,20,242,215,88,57,31,13,178,177,28,215,118,248,254,118,146,203,150,26]},"name":"DiRT 4 v2 [Reload]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}