{"title":"The 900 Days - The Siege of Leningrad (gnv64)","magnet":"magnet:?xt=urn:btih:0e3665d47e9da99455eee435119fc45f0f47414c&dn=The+900+Days+-+The+Siege+of+Leningrad+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"30311215","seeders":"100","leechers":"14","description":"The 900 Days: The Siege of Leningrad\r\nby Harrison E Salisbury \r\nPan Books | 2000 | ISBN: 0330392824 | 656 Pages | PDF | 28.6 mb\r\n\r\nFrom September 1941 to January 1944, Leningrad was a city under seige from three German armies, with nearly three million people trapped inside. This book gives an account of one of the great dramas of World War II.\r\n\r\nHarrison E. Salisbury wrote no fewer than six books about the Soviet Union during his journalistic career. The 900 Days is a reprint of the 1969 edition that was banned in Russia, and no wonder. It implicated Stalin and his regime in the mass starvation and murder of a million and a half of his own people.\r\n\r\nIt was Salisbury&apos;s contention that &quot;Stalin seems to have felt that because Leningrad...gave birth to the 1917 revolution, the city might ultimately turn against him,&quot; and that &quot;it was in Leningrad that [the purges] were given their characteristic leitmotif of macabre paranoia.&quot; The author lays the story bare in exhaustive and often gruesome detail, through the remarkable observations of those who survived, and with reliance on his own research as a Moscow correspondent at the time.\r\n\r\nWar was only a rumor when Stalin began slowly, consciously, to turn his back on the city of Leningrad and, for reasons unknown, to ignore the clear signals that Hitler would invade Russia, with the ancient city of (formerly) St. Petersburg as a likely target. After the attacks began, just before the blockade of the city got underway, Stalin would have known that 3,400,000 people were to be fed with enough supplies on hand to last only about three or four weeks. Those who could survive the savage air bombardment would be doomed to slow starvation.\r\n\r\nBy October 1, 1941, only the army and civilian volunteers were guaranteed sufficient food. &quot;Non-workers and children...received one-third of a loaf of poor quality bread a day...as time went on, bread, such as it was, more and more often was the only food issued.&quot; The bread was an ersatz mix of denigrated rye flour, flax seeds and chaff.\r\n\r\nThe siege lasted 900 days, during which time people died by the thousands every day. During the coldest winter on record, corpses were left to lie in the snow, and the spring thaw brought forth the horrors of the stench of death and a lingering putrid flavor to the drinking water that no one who tasted it could ever forget. Caught by the camera&apos;s eye, the ones who got through that first winter were mere stick figures.\r\n <a href=\"\nhttps://s28.postimg.org/aq19820tp/The_900_Days_-_The_Siege_of_Leningrad.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s28.postimg.org/aq19820tp/The_900_Days_-_The_Siege_of_Leningrad.jpg</a>","last_updated":"2017-08-10T12:05:06.143Z","parsed":{"xt":"urn:btih:0e3665d47e9da99455eee435119fc45f0f47414c","dn":"The 900 Days - The Siege of Leningrad (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e3665d47e9da99455eee435119fc45f0f47414c","infoHashBuffer":{"type":"Buffer","data":[14,54,101,212,126,157,169,148,85,238,228,53,17,159,196,95,15,71,65,76]},"name":"The 900 Days - The Siege of Leningrad (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}