{"title":"Proust and His Banker: In Search of Time Squandered","magnet":"magnet:?xt=urn:btih:0e46a6bfce977f50c2fdd3e610fa36a042cce652&dn=Proust+and+His+Banker%3A+In+Search+of+Time+Squandered&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"2163794","seeders":"51","leechers":"6","description":"Proust and His Banker: In Search of Time Squandered - Gian Balsamo [epub]\r\n\r\nWhat Marcel Proust wanted from life most of all was unconditional requited love, and the way he went after it&#x2015;smothering the objects of his affection with gifts&#x2015;cost him a fortune. To pay for such extravagance, he engaged in daring speculations on the stock exchange. The task of his cousin and financial adviser, Lionel Hauser, was to make sure these speculations would not go sour. In Proust and His Banker, Gian Balsamo reveals that Proust was quite aware of the advantageous trade-off between financial indulgence and artistic inspiration; his liberal squandering of money provided the grist for fictional characters and incidents of surprising effectiveness, both in the artistic sphere and later on in the commercial one. But Hauser was not aware of this odd aspect of Proust&#x2019;s creativity, nor could he have been since the positive returns from the writer&#x2019;s masterpieces were late in coming.\r\n\r\nFocusing on more than 350 letters between Proust and Hauser and drawing on records of the Rothschild Archive and financial data assembled from the twenty-one-volume Kolb edition of Proust&#x2019;s letters, Balsamo reconstructs Proust&#x2019;s finances and provides a fascinating window into the writer&#x2019;s creative and speculative process. Balsamo carefully follows Proust&#x2019;s financial activities, including investments ranging from Royal Dutch Securities to American railroads to Eastern European copper mines, his exchanges with various banks and brokerage firms, his impetuous gifts, and the changing size and composition of his portfolio. Successes and failures alike provided material for Proust&#x2019;s fiction, whether from the purchase of an airplane for the object of his affections or the investigation of a deceased love&#x2019;s intimate background. Proust was, Balsamo concludes, a master at turning financial indulgence into narrative craftsmanship, economic costs into artistic opportunities.\r\n\r\nOver the course of their fifteen-year collaboration, the banker saw Proust squander three-fifths of his wealth on reckless ventures and on magnificent presents for the men and women who struck his fancy. To Hauser the writer was a virtuoso in resource mismanagement. Nonetheless, Balsamo shows, we owe it to the altruism of this generous relative, who never thought twice about sacrificing his own time and resources to Proust, that In Search of Lost Time was ever completed","last_updated":"2017-05-24T11:46:02.481Z","parsed":{"xt":"urn:btih:0e46a6bfce977f50c2fdd3e610fa36a042cce652","dn":"Proust and His Banker: In Search of Time Squandered","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e46a6bfce977f50c2fdd3e610fa36a042cce652","infoHashBuffer":{"type":"Buffer","data":[14,70,166,191,206,151,127,80,194,253,211,230,16,250,54,160,66,204,230,82]},"name":"Proust and His Banker: In Search of Time Squandered","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}