{"title":"Debriefing the President by John Nixon 2016 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:0e7a5f99aae05c6313cfe23b554c8e4c913f68a6&dn=Debriefing+the+President+by+John+Nixon+2016+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2986946","seeders":"0","leechers":"0","description":"xx\r\n\r\nDebriefing the President by John Nixon 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn December 2003, after one of the largest, most aggressive manhunts in history, US military forces captured Iraqi president Saddam Hussein near his hometown of Tikrit. Beset by body-double rumors and false alarms during a nine-month search, the Bush administration needed positive identification of the prisoner before it could make the announcement that would rocket around the world.\r\n\r\nAt the time John Nixon was a senior CIA leadership analyst who had spent years studying the Iraqi dictator. Called upon to make the official ID, Nixon looked for telltale scars and tribal tattoos and asked Hussein a list of questions only he could answer. The man was indeed Saddam Hussein, but, as Nixon learned in the ensuing weeks, both he and America had greatly misunderstood just who Saddam Hussein really was.\r\n\r\nDebriefing the President presents an astounding, candid portrait of one of our era&apos;s most notorious strongmen. Nixon, the first man to conduct a prolonged interrogation of Hussein after his capture, offers expert insight into the history and mind of America&apos;s most enigmatic enemy. After years of parsing Hussein&apos;s leadership from afar, Nixon faithfully recounts his debriefing sessions and subsequently strips away the mythology surrounding an equally brutal and complex man. His account is not an apology but a sobering examination of how preconceived ideas led Washington policymakers - and the Bush White House - astray. Unflinching and unprecedented, Debriefing the President exposes a fundamental misreading of one of the modern world&apos;s most central figures and presents a new narrative that boldly counters the received account.\r\n\r\nxx","last_updated":"2017-08-21T12:04:52.530Z","parsed":{"xt":"urn:btih:0e7a5f99aae05c6313cfe23b554c8e4c913f68a6","dn":"Debriefing the President by John Nixon 2016 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0e7a5f99aae05c6313cfe23b554c8e4c913f68a6","infoHashBuffer":{"type":"Buffer","data":[14,122,95,153,170,224,92,99,19,207,226,59,85,76,142,76,145,63,104,166]},"name":"Debriefing the President by John Nixon 2016 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}