{"title":"NuruMassage - Ella Nova { Proud Porn Parent- 10.05.2017 } 720p","magnet":"magnet:?xt=urn:btih:0fefde3b8d1564068629be1360063bd8cf8c94ac&dn=NuruMassage+-+Ella+Nova+%7B+Proud+Porn+Parent-+10.05.2017+%7D+720p&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"worldet","categoryP":"porn","categoryS":"hd___movies","size":"969358225","seeders":"13","leechers":"11","description":"Ella Nova&apos;s face turns white when her stepdad Eric Masterson confronts her about spotting her in a porn video. He still hasn&apos;t decided whether to tell her mother, then he storms off without hiding his disappointment. Whenever they cross paths at home, he refuses to look her in the face. Ella hates the silent treatment she&apos;s getting from her stepdad, so she comes up with a plan for a rapprochement. She tells him she got a new job that would make him proud. It would mean a lot to her if he&apos;d meet her there after hours tonight so she can show him what he&apos;s doing.\r\n\r\nWhen Eric realizes she&apos;s working at a spa, he expresses his relief that it&apos;s not a strip club. Ella laughs off his backhanded remark and promises he has nothing to be ashamed of anymore, now that she&apos;s an esthetician and a masseuse. She takes off her robe revealing a shimmering red string bikini. Once he&apos;s gotten an eyeful of her trim sexy body, she sends him into the shower while she prepares the gel and the mat.\r\n\r\nEric lies down on his stomach and lets his step daughter do her job. She promises that he doesn&apos;t have to worry anymore, she&apos;s a professional now. She wants him to relax and forget about everything at home, and forget about Mommy. She coats his back with the warm NURU gel.\r\n\r\nShe straddles his ass and slyly unties her string bikini top and bottoms before covering herself in the gel. She pretends she&apos;s still wearing her bathing suit when she lowers her chest onto him and slides her bodyweight along his length. Ella wants to know what he thought of her porn flick, but Eric says he turned it off as soon as he realized it was Ella.\r\n\r\nWhen she divulges her fetish for daddy daughter porn, he loses it. He turns over and lets her sit on his cock. For a moment he thinks of her mother, but Ella distracts him with a blow job.\r\n\r\nShe lowers her pussy onto his cock and he hammers it into her tight hole. She tells him how much she&apos;s always wanted him while he fucks an orgasm out of her. He spoons her and sideloads his cock into her pussy, picking up speed as she cums. Then strokes his cock over her mouth till she drains his balls down her throat.\r\n <a href=\"\nhttp://funimg.pw/img-5912a84c346d7.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://funimg.pw/img-5912a84c346d7.html</a> <a href=\"\nhttp://funimg.pw/img-5912a84c3abd7.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://funimg.pw/img-5912a84c3abd7.html</a> <a href=\"\nhttp://funimg.pw/img-5912a6876b8c6.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://funimg.pw/img-5912a6876b8c6.html</a>","last_updated":"2017-05-10T12:24:32.312Z","parsed":{"xt":"urn:btih:0fefde3b8d1564068629be1360063bd8cf8c94ac","dn":"NuruMassage - Ella Nova { Proud Porn Parent- 10.05.2017 } 720p","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0fefde3b8d1564068629be1360063bd8cf8c94ac","infoHashBuffer":{"type":"Buffer","data":[15,239,222,59,141,21,100,6,134,41,190,19,96,6,59,216,207,140,148,172]},"name":"NuruMassage - Ella Nova { Proud Porn Parent- 10.05.2017 } 720p","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}