{"title":"The Unsubstantial Air by Samuel Hynes EPUB","magnet":"magnet:?xt=urn:btih:10055c1461fafc1441ed139f89648adfd9938b42&dn=The+Unsubstantial+Air+by+Samuel+Hynes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3035724","seeders":"28","leechers":"3","description":"xx\r\n\r\nThe Unsubstantial Air by Samuel Hynes EPUB\r\n\r\nThe Unsubstantial Air is the gripping story of the Americans who fought and died in the aerial battles of World War I. Much more than a traditional military history, it is an account of the excitement of becoming a pilot and flying in combat over the Western Front, told through the voices of the aviators themselves. A World War II pilot himself, the memoirist and critic Samuel Hynes revives the adventurous young men who inspired his own generation to take to the sky. The volunteer fliers were often privileged - the sorts of college athletes and Ivy League students who might appear in an F. Scott Fitzgerald novel. Hynes follows them from the flying clubs of Harvard, Princeton, and Yale to training grounds in Europe and on to the front, where they learned how to fight a war in the air.\r\n\r\nBy drawing on letters sent home, diaries kept, and memoirs published in the years that followed, Hynes brings to life the emotions, anxieties, and triumphs of the young pilots. They gasp in wonder at the world seen from a plane, struggle to keep their hands from freezing in open air cockpits, party with actresses and aristocrats, rest at Voltaire&apos;s castle, and search for their friends&apos; bodies on the battlefield. Their romantic war becomes more than that - a harsh but often thrilling reality.\r\n\r\nxx","last_updated":"2017-10-25T12:03:00.335Z","parsed":{"xt":"urn:btih:10055c1461fafc1441ed139f89648adfd9938b42","dn":"The Unsubstantial Air by Samuel Hynes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"10055c1461fafc1441ed139f89648adfd9938b42","infoHashBuffer":{"type":"Buffer","data":[16,5,92,20,97,250,252,20,65,237,19,159,137,100,138,223,217,147,139,66]},"name":"The Unsubstantial Air by Samuel Hynes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}