{"title":"Why Buddhism is True_ The Science and Philosophy of Meditation a","magnet":"magnet:?xt=urn:btih:10eae44a03dd9b494e52f6190037ea340e6bbbce&dn=Why+Buddhism+is+True_+The+Science+and+Philosophy+of+Meditation+a&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4352202","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhy Buddhism is True_ The Science and Philosophy of Meditation and Enlightenment by Robert Wright ePUB eBOOK-ZAK\r\n\r\nFrom one of America&apos;s greatest minds, a journey through psychology, philosophy, and lots of meditation to show how Buddhism holds the key to moral clarity and enduring happiness.\r\n\r\nRobert Wright famously explained in The Moral Animal how evolution shaped the human brain. The mind is designed to often delude us, he argued, about ourselves and about the world. And it is designed to make happiness hard to sustain.\r\n\r\nBut if we know our minds are rigged for anxiety, depression, anger, and greed, what do we do? Wright locates the answer in Buddhism, which figured out thousands of years ago what scientists are discovering only now. Buddhism holds that human suffering is a result of not seeing the world clearly - and proposes that seeing the world more clearly, through meditation, will make us better, happier people.\r\n\r\nIn Why Buddhism Is True, Wright leads readers on a journey through psychology, philosophy, and a great many silent retreats to show how and why meditation can serve as the foundation for a spiritual life in a secular age. At once excitingly ambitious and wittily accessible, this is the first book to combine evolutionary psychology with cutting-edge neuroscience to defend the radical claims at the heart of Buddhist philosophy. With bracing honesty and fierce wisdom, it will persuade you not just that Buddhism is true - which is to say, a way out of our delusion - but that it can ultimately save us from ourselves, as individuals and as a species.\r\n\r\nxx","last_updated":"2017-08-09T12:00:25.256Z","parsed":{"xt":"urn:btih:10eae44a03dd9b494e52f6190037ea340e6bbbce","dn":"Why Buddhism is True_ The Science and Philosophy of Meditation a","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"10eae44a03dd9b494e52f6190037ea340e6bbbce","infoHashBuffer":{"type":"Buffer","data":[16,234,228,74,3,221,155,73,78,82,246,25,0,55,234,52,14,107,187,206]},"name":"Why Buddhism is True_ The Science and Philosophy of Meditation a","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}