{"title":"Empires in the Sun (gnv64)","magnet":"magnet:?xt=urn:btih:11ba2a420b27edb0b8a1c2e5856f415dd9da1b0f&dn=Empires+in+the+Sun+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"15695255","seeders":"4","leechers":"86","description":"Empires in the Sun: The Struggle for the Mastery of Africa\r\nby Lawrence James\r\nPegasus Books | June 2017 | ISBN-10: 1681774631 | ePUB/MOBI/PDF | 3.47/3.71/7.30 mb\r\nPDF conversion is mine.\r\n\r\nThe one hundred year history of how Europe coerced the African continent into its various empires-and the resulting story of how Africa succeeded in decolonization.\r\n\r\nIn this dramatic (and often tragic) story of an era that radically changed the course of world history, Lawrence James investigates how, within one hundred years, Europeans persuaded and coerced Africa into becoming a subordinate part of the modern world. His narrative is laced with the experiences of participants and onlookers and introduces the men and women who, for better or worse, stamped their wills on Africa. The continent was a magnet for the high-minded, the adventurous, the philanthropic, the unscrupulous. Visionary pro-consuls rubbed shoulders with missionaries, explorers, soldiers, big-game hunters, entrepreneurs, and physicians.\r\nBetween 1830 and 1945, Britain, France, Belgium, Germany, Portugal, Italy and the United States exported their languages, laws, culture, religions, scientific and technical knowledge and economic systems to Africa. The colonial powers imposed administrations designed to bring stability and peace to a continent that appeared to lack both. The justification for occupation was emancipation from slavery-and the common assumption that late nineteenth-century Europe was the summit of civilization.\r\nBy 1945 a transformed continent was preparing to take charge of its own affairs, a process of decolonization that took a quick twenty years. This magnificent history also pauses to ask: what did not happen and why?\r\n\r\nAbout the Author\r\nLawrence James was a founding member of the University of York and then took a research degree at Merton College, Oxford. After a distinguished teaching career he became a full-time writer in 1985 and has emerged as one of the outstanding narrative historians on the subject of empire, including The Rise and Fall of the British Empire and Churchill and Empire: Portrait of an Imperialist. He lives in England.\r\n <a href=\"\nhttps://s9.postimg.org/sjbfvtijz/Empires_in_the_Sun.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s9.postimg.org/sjbfvtijz/Empires_in_the_Sun.jpg</a>","last_updated":"2017-06-23T12:02:41.418Z","parsed":{"xt":"urn:btih:11ba2a420b27edb0b8a1c2e5856f415dd9da1b0f","dn":"Empires in the Sun (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"11ba2a420b27edb0b8a1c2e5856f415dd9da1b0f","infoHashBuffer":{"type":"Buffer","data":[17,186,42,66,11,39,237,176,184,161,194,229,133,111,65,93,217,218,27,15]},"name":"Empires in the Sun (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}