{"title":"\nThe Attention Merchants_ The Epic Scramble to Get Inside Our Hea","magnet":"magnet:?xt=urn:btih:11d9f29cdfff5280592d93ab7bcde59bc128b5d2&dn=The+Attention+Merchants_+The+Epic+Scramble+to+Get+Inside+Our+Hea&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5816862","seeders":"19","leechers":"13","description":"xx\r\n\r\nThe Attention Merchants_ The Epic Scramble to Get Inside Our Heads by Tim Wu 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom Tim Wu, author of the award-winning The Master Switch and who coined the phrase &quot;net neutrality&quot;, a revelatory look at the rise of &quot;attention harvesting&quot;, and its transformative effect on our society and our selves.\r\n\r\nAttention merchant: an industrial-scale harvester of human attention. A firm whose business model is the mass capture of attention for resale to advertisers.\r\n\r\nIn nearly every moment of our waking lives, we face a barrage of advertising enticements, branding efforts, sponsored social media, commercials and other efforts to harvest our attention. Over the last century, few times or spaces have remained uncultivated by the &quot;attention merchants&quot;, contributing to the distracted, unfocused tenor of our times. Tim Wu argues that this is not simply the byproduct of recent inventions but the end result of more than a century&apos;s growth and expansion in the industries that feed on human attention. From the pre-Madison Avenue birth of advertising to TV&apos;s golden age to our present age of radically individualized choices, the business model of &quot;attention merchants&quot; has always been the same. He describes the revolts that have risen against these relentless attempts to influence our consumption, from the remote control to FDA regulations to Apple&apos;s ad-blocking OS. But he makes clear that attention merchants grow ever-new heads, and their means of harvesting our attention have given rise to the defining industries of our time, changing our nature - cognitive, social, and otherwise - in ways unimaginable even a generation ago.\r\n\r\nxx","last_updated":"2017-09-23T12:05:08.557Z","parsed":{"xt":"urn:btih:11d9f29cdfff5280592d93ab7bcde59bc128b5d2","dn":"The Attention Merchants_ The Epic Scramble to Get Inside Our Hea","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"11d9f29cdfff5280592d93ab7bcde59bc128b5d2","infoHashBuffer":{"type":"Buffer","data":[17,217,242,156,223,255,82,128,89,45,147,171,123,205,229,155,193,40,181,210]},"name":"The Attention Merchants_ The Epic Scramble to Get Inside Our Hea","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}