{"title":"A Truck Full of Money by Tracy Kidder 2016 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:12306a4ec0049d9dfc0da1e694c52d86612981db&dn=A+Truck+Full+of+Money+by+Tracy+Kidder+2016+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3150653","seeders":"2","leechers":"5","description":"xx\r\n\r\nA Truck Full of Money by Tracy Kidder 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nTracy Kidder, the &quot;master of the nonfiction narrative&quot; (The Baltimore Sun) and author of the best-selling classic The Soul of a New Machine, now tells the story of Paul English, a kinetic and unconventional inventor and entrepreneur who as a boy rebelled against authority. Growing up in working-class Boston, English discovered a medium for his talents the first time he saw a computer. As a young man, despite suffering from what would eventually be diagnosed as bipolar disorder, he began his pilgrim&apos;s journey through the ups and downs in the brave new world of computers. Relating to the Internet as if it were an extension of his own mind, he discovered that he had a talent for conceiving innovative enterprises and building teams that can develop them, becoming &quot;a Pied Piper&quot; of geeks. His innovative management style, success, and innate sense of fair play inspire intense loyalty. Early on one colleague observed, &quot;Someday this boy&apos;s going to get hit by a truck full of money, and I&apos;m going to be standing beside him&quot;. Yet when English did indeed make a fortune - when the travel website Kayak was sold for almost $2 billion - the first thing he thought about was how to give the money away: &quot;What else would you do with it?&quot; The second thing he thought was, &quot;What&apos;s next?&quot;\r\n\r\nWith the power of a consummate storyteller, Tracy Kidder casts a fresh, critical, and often humorous eye on the way new ideas and new money are reshaping our culture and the world. A Truck Full of Money is a mesmerizing portrait of an irresistibly endearing man who is indefatigable, original, and as unpredictable as America itself.\r\n\r\nxx","last_updated":"2017-08-31T12:00:32.283Z","parsed":{"xt":"urn:btih:12306a4ec0049d9dfc0da1e694c52d86612981db","dn":"A Truck Full of Money by Tracy Kidder 2016 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"12306a4ec0049d9dfc0da1e694c52d86612981db","infoHashBuffer":{"type":"Buffer","data":[18,48,106,78,192,4,157,157,252,13,161,230,148,197,45,134,97,41,129,219]},"name":"A Truck Full of Money by Tracy Kidder 2016 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}