{"title":"David Owen - Where the Water Goes 2017 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:12b213b22b9b915fbd01c73310b555a98fa3715a&dn=David+Owen+-+Where+the+Water+Goes+2017+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4101679","seeders":"18","leechers":"2","description":"xx\r\n\r\nDavid Owen - Where the Water Goes 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA brilliant, eye-opening account of where our water comes from and where it all goes.\r\n\r\nThe Colorado River is a crucial resource for a surprisingly large part of the United States, and every gallon that flows down it is owned or claimed by someone. David Owen traces all that water from the Colorado&apos;s headwaters to its parched terminus, once a verdant wetland but now a million-acre desert. He takes readers on an adventure downriver, along a labyrinth of waterways, reservoirs, power plants, farms, fracking sites, ghost towns, and RV parks, to the spot near the US-Mexico border where the river runs dry.\r\n\r\nWater problems in the western United States can seem tantalizingly easy to solve: just turn off the fountains at the Bellagio, stop selling hay to China, ban golf, cut down the almond trees, and kill all the lawyers. But a closer look reveals a vast man-made ecosystem that is far more complex and more interesting than the headlines let on.\r\n\r\nThe story Owen tells in Where the Water Goes is crucial to our future: how a patchwork of engineering marvels, byzantine legal agreements, aging infrastructure, and neighborly cooperation enables life to flourish in the desert, and the disastrous consequences we face when any part of this tenuous system fails.\r\n\r\nxx","last_updated":"2017-07-05T12:01:23.672Z","parsed":{"xt":"urn:btih:12b213b22b9b915fbd01c73310b555a98fa3715a","dn":"David Owen - Where the Water Goes 2017 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"12b213b22b9b915fbd01c73310b555a98fa3715a","infoHashBuffer":{"type":"Buffer","data":[18,178,19,178,43,155,145,95,189,1,199,51,16,181,85,169,143,163,113,90]},"name":"David Owen - Where the Water Goes 2017 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}