{"title":"\nTemplars_ The Rise and Spectacular Fall of God's Holy Warriors b","magnet":"magnet:?xt=urn:btih:130721c0d3bbc6f1defb326e6eca31612dad6e90&dn=Templars_+The+Rise+and+Spectacular+Fall+of+God%27s+Holy+Warriors+b&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9579094","seeders":"21","leechers":"17","description":"xx\r\n\r\nTemplars_ The Rise and Spectacular Fall of God&apos;s Holy Warriors by Dan Jones ePUB eBOOK-ZAK\r\n\r\nJerusalem, 1119: A small group of knights seeking a purpose in the violent aftermath of the First Crusade decides to set up a new order. These are the first Knights of Templar, a band of elite warriors prepared to give their lives to protect Christian pilgrims to the Holy Land.\r\n\r\nOver the next 200 years, the Templars would become the most powerful religious order of the medieval world. Their legend has inspired fervent speculation ever since. But who were they, and what actually happened? In this groundbreaking narrative history, the best-selling author of The Plantagenets tells the true story of the Templars for the first time in a generation, drawing on extensive original sources to build a gripping account of these Christian holy warriors whose heroism and depravity have so often been shrouded in myth.\r\n\r\nThe Templars were protected by the pope and sworn to strict vows of celibacy. They fought the forces of Islam in hand-to-hand combat on the sunbaked hills where Jesus lived and died. They found their nemesis in Saladin, who vowed to drive all Christians from the lands of Islam. They were experts at channeling money across borders. They established the medieval world&apos;s first global bank and waged private wars against anyone who threatened their interests. Then, in 1307, as they struggled to secure their last strongholds in the Kingdom of Jerusalem, the Templars fell afoul of the vindictive and impulsive king of France.\r\n\r\nOn Friday, October 13, hundreds of brothers were arrested en masse, imprisoned, tortured, and disbanded amid accusations of lurid sexual misconduct and heresy. They were tried by the Vatican in secret proceedings. But were they heretics or victims of a ruthlessly repressive state? Dan Jones goes back to the sources to bring their dramatic tale, so relevant to our own times, to life in an audiobook that is at once authoritative and compulsively readable.\r\n\r\nxx","last_updated":"2017-09-27T12:05:32.472Z","parsed":{"xt":"urn:btih:130721c0d3bbc6f1defb326e6eca31612dad6e90","dn":"Templars_ The Rise and Spectacular Fall of God's Holy Warriors b","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"130721c0d3bbc6f1defb326e6eca31612dad6e90","infoHashBuffer":{"type":"Buffer","data":[19,7,33,192,211,187,198,241,222,251,50,110,110,202,49,97,45,173,110,144]},"name":"Templars_ The Rise and Spectacular Fall of God's Holy Warriors b","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}