{"title":"Jason Pinter-The Castle (epub)","magnet":"magnet:?xt=urn:btih:138bdce6e7530d04d5bacb3409912f217aa71a37&dn=Jason+Pinter-The+Castle+%28epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"twocows","categoryP":"other","categoryS":"e_books","size":"720886","seeders":"34","leechers":"3","description":"Jason Pinter-The Castle\r\n\r\nThe Political Thriller of the Year\r\nPolitics is war. And nobody survives a war with Rawson Griggs.\r\nFor fans of Vince Flynn and Harlan Coben comes an unputdownable new thriller from internationally bestselling author Jason Pinter that will have you reading long into the night.Remy Stanton is a young, ambitious corporate strategist who intervenes in an armed robbery one night, saves two lives, but is nearly killed in the process. And when he wakes up in the hospital, Remy learns that one of the intended victims was Alena Griggs, the daughter and sole heir of Rawson Griggs, a brilliant, brash billionaire &#x2013; and one of the most powerful men in the world. Suddenly Remy finds that he has become an overnight celebrity &#x2013; and he receives an offer he can&#x2019;t refuse.\r\nRawson Griggs is about to announce an unprecedented run for President of the United States, and he offers Remy, the man who saved his beloved daughter&#x2019;s life, a position in his campaign. Suddenly Remy is thrust into the maelstrom of the most controversial Presidential election in history, where buried secrets and stunning acts of violence rock the nation. And as his own star grows brighter, Remy finds himself drawn to the intelligent yet down-to-earth Alena Griggs, whose marriage is strained by the relentless pressures of fame and politics.\r\n\r\nYet as the revolutionary Griggs movement builds steam, shocking events cause Remy to suspect a dark undercurrent running beneath Rawson&#x2019;s campaign. And when he discovers the full, disturbing truth, Remy will have to make a choice: stay the course, or jeopardize everything he cares about. And possibly lose his life in the process","last_updated":"2017-08-08T12:03:36.696Z","parsed":{"xt":"urn:btih:138bdce6e7530d04d5bacb3409912f217aa71a37","dn":"Jason Pinter-The Castle (epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"138bdce6e7530d04d5bacb3409912f217aa71a37","infoHashBuffer":{"type":"Buffer","data":[19,139,220,230,231,83,13,4,213,186,203,52,9,145,47,33,122,167,26,55]},"name":"Jason Pinter-The Castle (epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}