{"title":"Gene Kim - The Phoenix Project: A Novel about IT, DevOps, and He","magnet":"magnet:?xt=urn:btih:138f77efb298a4fafe7404f6d1ec688282f54035&dn=Gene+Kim+-+The+Phoenix+Project%3A+A+Novel+about+IT%2C+DevOps%2C+and+He&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"suprbayrequest","categoryP":"other","categoryS":"e_books","size":"618405","seeders":"0","leechers":"0","description":"\r\nThe Phoenix Project: A Novel about IT, DevOps, and Helping Your Business Win\r\nby Gene Kim, Kevin Behr and George Spafford\r\n\r\nretail epub\r\n\r\nPublisher: IT Revolution Press; 1st edition (January 10, 2013)\r\nLanguage: English\r\nISBN-10: 0988262592\r\nISBN-13: 978-0988262591\r\n\r\n\r\nIn The Phoenix Project, we describe the underpinning principles that all the DevOps patterns can be derived from as &apos;The Three Ways&apos;. It is intended to describe the values and philosophies that guide DevOps processes and practices.\r\n\r\nThe First Way is about the left-to-right flow of work from Development to IT Operations to the customer. To maximize flow, we need small batch sizes and intervals of work, never passing defects to down-stream work centers and to constantly optimize for the global goals (as opposed to local goals such as Dev feature completion rates, Test find/fix ratios or Ops availability measures).\r\n\r\nThe necessary practices include continuous build, integration and deployment, creating environments on demand, limiting work in process, and building safe systems and organizations that are safe to change.\r\n\r\nThe Second Way is about the constant flow of fast feedback from right-to-left at all stages of the value stream, amplifying it to ensure that we can prevent problems from happening again or enable faster detection and recovery. By doing this, we create quality at the source, creating or embedding knowledge where we need it.\r\n\r\nThe necessary practices include &apos;stopping the production line&apos; when our builds and tests fail in the deployment pipeline, constantly elevating the improvement of daily work over daily work, creating fast automated test suites to ensure that code is always in a potentially deployable state, creating shared goals and shared pain between Development and IT Operations and creating pervasive production telemetry so that every-one can see whether code and environments are operating as designed and that customer goals are being met.\r\n\r\nThe Third Way is about creating a culture that fosters two things: continual experimentation, which requires taking risks and learning from success and failure and understanding that repetition and practice is the prerequisite to mastery. \r\n\r\n\r\nThe audiobook is here: <a href=\" https://thepiratebay.org/torrent/12785844/.\" rel=\"nofollow\" target=\"_NEW\"> https://thepiratebay.org/torrent/12785844/.</a> \r\n\r\n <a href=\"\nhttps://pirates-forum.org/Forum-Requests\" rel=\"nofollow\" target=\"_NEW\">\nhttps://pirates-forum.org/Forum-Requests</a>","last_updated":"2017-08-07T12:00:54.048Z","parsed":{"xt":"urn:btih:138f77efb298a4fafe7404f6d1ec688282f54035","dn":"Gene Kim - The Phoenix Project: A Novel about IT, DevOps, and He","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"138f77efb298a4fafe7404f6d1ec688282f54035","infoHashBuffer":{"type":"Buffer","data":[19,143,119,239,178,152,164,250,254,116,4,246,209,236,104,130,130,245,64,53]},"name":"Gene Kim - The Phoenix Project: A Novel about IT, DevOps, and He","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}