{"title":"\nMidnight in the Pacific_ Guadalcanal_ The World War II Battle Th","magnet":"magnet:?xt=urn:btih:142b73f2b20e274fbbc92336b44f50dea63bfa8f&dn=Midnight+in+the+Pacific_+Guadalcanal_+The+World+War+II+Battle+Th&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5493298","seeders":"17","leechers":"10","description":"xx\r\n\r\nMidnight in the Pacific_ Guadalcanal_ The World War II Battle That Turned the Tide of War by Joseph Wheelan ePUB eBOOK-ZAK\r\n\r\nA sweeping narrative history - the first in over 20 years - of America&apos;s first major offensive of World War II, the brutal, no-quarter-given campaign to take Japanese-occupied Guadalcanal.\r\n\r\nFrom early August until mid-November of 1942, US marines, sailors, and pilots struggled for dominance against an implacable enemy: Japanese soldiers, inculcated with the bushido tradition of death before dishonor, avatars of bayonet combat - close-up, personal, and gruesome. The glittering prize was Henderson Airfield. Japanese planners knew that if they neutralized the airfield, the battle was won. So did the marines who stubbornly defended it.\r\n\r\nThe outcome of the long slugfest remained in doubt under the pressure of repeated Japanese air, land, and sea operations. And losses were heavy. At sea, in a half-dozen fiery combats, the US Navy fought the Imperial Japanese Navy to a draw, but at a cost of more than 4,500 sailors. More American sailors died in these battles off Guadalcanal than in all previous US wars, and each side lost 24 warships. On land, more than 1,500 soldiers and marines died, and the air war claimed more than 500 US planes. Japan&apos;s losses on the island were equally devastating - starving Japanese soldiers called it &quot;the island of death&quot;.\r\n\r\nBut when the attritional struggle ended, American marines, sailors, and airmen had halted the Japanese juggernaut that for five years had whirled through Asia and the Pacific. Guadalcanal was America&apos;s first major ground victory against Japan and, most importantly, the Pacific War&apos;s turning point.\r\n\r\nPublished on the 75th anniversary of the battle and utilizing vivid accounts written by the combatants at Guadalcanal, along with marine corps and army archives and oral histories, Midnight in the Pacific is both a sweeping narrative and a compelling drama of individual marines, soldiers, and sailors caught in the crosshairs of history.\r\n\r\nxx","last_updated":"2017-10-04T12:04:42.436Z","parsed":{"xt":"urn:btih:142b73f2b20e274fbbc92336b44f50dea63bfa8f","dn":"Midnight in the Pacific_ Guadalcanal_ The World War II Battle Th","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"142b73f2b20e274fbbc92336b44f50dea63bfa8f","infoHashBuffer":{"type":"Buffer","data":[20,43,115,242,178,14,39,79,187,201,35,54,180,79,80,222,166,59,250,143]},"name":"Midnight in the Pacific_ Guadalcanal_ The World War II Battle Th","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}