{"title":"Ray and Joan by Lisa Napoli 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:145369fa86b5051302f9404c934279febc8ac595&dn=Ray+and+Joan+by+Lisa+Napoli+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3416649","seeders":"0","leechers":"0","description":"xx\r\n\r\nRay and Joan by Lisa Napoli 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe dramatic relationship between Ray Kroc, the man who amassed a fortune as chairman of one of America&apos;s most controversial and iconic companies - McDonald&apos;s - and the passionate woman - his wife, Joan - who then gave that fortune away.\r\n\r\nRay &amp; Joan is a quintessentially American tale of corporate intrigue and private passion: a struggling Mad Men-era salesman with a vision for a fast-food franchise that would become one of the world&apos;s most enduring brands and a beautiful woman willing to risk her marriage and her reputation to promote controversial causes that touched her deeply.\r\n\r\nRay Kroc was peddling franchises around the country for a fledgling hamburger stand in the 1950s - McDonald&apos;s, it was called - when he entered a St. Paul supper club and encountered a beautiful young piano player who would change his life forever. The attraction between Ray and Joan was instantaneous and instantly problematic. Yet even the fact that both were married to other people couldn&apos;t derail their roller coaster of a romance.\r\n\r\nTo the outside world, Ray and Joan were happy, enormously rich, and giving. But privately Joan was growing troubled over Ray&apos;s temper and dark secret, something she was reluctant to publicly reveal. Those close to them compared their relationship to that of Elizabeth Taylor and Richard Burton. And yet this volatility paved the way for Joan&apos;s transformation into one of the greatest philanthropists of our time. A force in the peace movement, she produced activist films, books, and music and ultimately gave away billions of dollars, including landmark gifts to the Salvation Army and NPR.\r\n\r\nxx","last_updated":"2017-08-23T12:02:13.938Z","parsed":{"xt":"urn:btih:145369fa86b5051302f9404c934279febc8ac595","dn":"Ray and Joan by Lisa Napoli 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"145369fa86b5051302f9404c934279febc8ac595","infoHashBuffer":{"type":"Buffer","data":[20,83,105,250,134,181,5,19,2,249,64,76,147,66,121,254,188,138,197,149]},"name":"Ray and Joan by Lisa Napoli 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}