{"title":"The Secret History Of Twin Peaks (audiobook/EPUB)","magnet":"magnet:?xt=urn:btih:145cfdf8546025325d968555394f60dbcd6e706c&dn=The+Secret+History+Of+Twin+Peaks+%28audiobook%2FEPUB%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"thejabberwocky","categoryP":"audio","categoryS":"audio_books","size":"292403973","seeders":"13","leechers":"6","description":"The Secret History of Twin Peaks is an epistolary (dossier-style) novel by Mark Frost, which provides background information on the history of the fictional town and characters from the television series Twin Peaks. The book was published in October 2016, several months before the debut of a new season of the series in May 2017.\r\n\r\nThe book takes the form of a dossier of documents, letters, clippings and notes compiled by an unnamed individual referred to as The Archivist. The dossier was recovered in a steel lockbox at an undisclosed crime scene, and has been assigned by Federal Bureau of Investigation Deputy Director Gordon Cole to an FBI analyst with the initials &apos;TP&apos; for review and investigation.[2]\r\n\r\nThe documents are presented in chronological order, beginning with the exploration of the area by the Lewis and Clark Expedition, correspondence with President Thomas Jefferson, and Meriwether Lewis&apos;s mysterious death in 1809. The next section concerns the flight of the Nez Perce people from the area, with their leader Chief Joseph. Both Lewis and Joseph are mentioned to have experienced &quot;vision quests&quot; in the area where Twin Peaks would be founded.\r\n\r\nThe town of Twin Peaks is founded when two families, the Packards and the Martells, form two rival sawmills on either side of the river. In 1927, young boy scouts Andrew Packard and Doug Milford see a giant figure in the woods during a camping trip. Douglas Milford&#x2014;a minor character in the television series&#x2014;becomes one of the key figures in the book. Milford&apos;s involvement with the Roswell UFO incident while with the U.S. Army Air Forces sees him assigned to investigate UFO sightings and abduction claims for Project Sign and Project Blue Book, and to establish Listening Post Alpha, a SETI facility near Twin Peaks. In 1940, three children including Maggie Coulson (the Log Lady), Carl Rodd (the trailer park owner from Fire Walk With Me) and Alan Traherne, go missing in the woods, re-appearing with no memory of that day and strange triangular markings.\r\n\r\nThe last section covers the events of the television series, including the murder of Laura Palmer. The backstories of several other characters including Josie Packard, Lawrence Jacoby, Ed and Nadine Hurley, and Norma and Hank Jennings are revealed in extracts from a book on notable local families by Dr. Jacoby&apos;s brother Robert. The Archivist is revealed to be Major Garland Briggs, whose final entry in the dossier notes that &quot;something&apos;s wrong&quot; with Dale Cooper and ends with the word &quot;*M*A*Y*D*A*Y*&quot;. The FBI analyst notes that Briggs subsequently disappeared and Cooper&apos;s whereabouts are also unknown, with files on them at the USAF and FBI classified well above top secret. She signs off her investigation notes as Special Agent Tamara Preston","last_updated":"2017-06-01T12:13:32.801Z","parsed":{"xt":"urn:btih:145cfdf8546025325d968555394f60dbcd6e706c","dn":"The Secret History Of Twin Peaks (audiobook/EPUB)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"145cfdf8546025325d968555394f60dbcd6e706c","infoHashBuffer":{"type":"Buffer","data":[20,92,253,248,84,96,37,50,93,150,133,85,57,79,96,219,205,110,112,108]},"name":"The Secret History Of Twin Peaks (audiobook/EPUB)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}