{"title":"The Diet Trap Solution_ Train Your Brain to Lose Weight and Keep","magnet":"magnet:?xt=urn:btih:14ef51c3f16064431a83e8718c1c6dce1eb1fecc&dn=The+Diet+Trap+Solution_+Train+Your+Brain+to+Lose+Weight+and+Keep&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3286893","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Diet Trap Solution_ Train Your Brain to Lose Weight and Keep It Off for Good by Judith S Beck and Deborah Beck Busis ePUB eBOOK-ZAK\r\n\r\nThe New York Times best-selling author of The Beck Diet Solution teams up with her daughter and colleague at the Beck Institute for Cognitive Behavior to teach readers how to think their way thin, offering practical, proven tools for escaping common diet traps for good.\r\n\r\nMost diet programs work at first. But then life happens - stress, bad habits, holidays, travel - and we revert to bad habits, and the weight comes back. In this invaluable book, Dr. Judith Beck offers the solution to break free from these common diet traps and keep the weight off for life.\r\n\r\nDr. Beck explains that when it comes to losing weight, it&apos;s not just about what we eat. It&apos;s also about how we think. To consistently eat differently, we must learn to think differently. Diets fail us because they don&apos;t offer effective strategies for overcoming the common traps - emotional eating, social pressure, dining out - that can derail us. Now she and her daughter, Deborah Beck Busis, share the techniques they have successfully used with thousands of clients, revealing how to overcome the thoughts and behaviors that have held us back. With The Diet Trap Solution, readers on any diet regimen can learn to identify their specific diet traps and create action plans to strengthen their &quot;resistance muscle&quot; - making losing weight easy, sustainable, and enjoyable.\r\n\r\nxx","last_updated":"2017-09-03T12:00:18.620Z","parsed":{"xt":"urn:btih:14ef51c3f16064431a83e8718c1c6dce1eb1fecc","dn":"The Diet Trap Solution_ Train Your Brain to Lose Weight and Keep","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"14ef51c3f16064431a83e8718c1c6dce1eb1fecc","infoHashBuffer":{"type":"Buffer","data":[20,239,81,195,241,96,100,67,26,131,232,113,140,28,109,206,30,177,254,204]},"name":"The Diet Trap Solution_ Train Your Brain to Lose Weight and Keep","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}