{"title":"Napoleon the Great by Andrew Roberts EPUB","magnet":"magnet:?xt=urn:btih:154157414067cf8cde87faea695101586ec6ae8d&dn=Napoleon+the+Great+by+Andrew+Roberts+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"121425076","seeders":"0","leechers":"0","description":"xx\r\n\r\nNapoleon the Great by Andrew Roberts EPUB\r\n\r\nNapoleon Bonaparte lived one of the most extraordinary of all human lives. In the space of just 20 years, from October 1795, when as a young artillery captain he cleared the streets of Paris of insurrectionists, to his final defeat at the (horribly mismanaged) battle of Waterloo in June 1815, Napoleon transformed France and Europe.\r\n\r\nAfter seizing power in a coup d&apos;&#xE9;tat, he ended the corruption and incompetence into which the revolution had descended. In a series of dazzling battles, he reinvented the art of warfare; in peace he completely remade the laws of France, modernised her systems of education and administration, and presided over a flourishing of the beautiful Empire style in the arts.\r\n\r\nThe impossibility of defeating his most persistent enemy, Great Britain, led him to make draining and ultimately fatal expeditions into Spain and Russia, where half a million Frenchmen died, and his empire began to unravel.\r\n\r\nMore than any other modern biographer, Andrew Roberts conveys Napoleon&apos;s tremendous energy, both physical and intellectual, and the attractiveness of his personality even to his enemies. He has walked 53 of Napoleon&apos;s 60 battlefields and has absorbed the gigantic new French edition of Napoleon&apos;s letters, which allows a complete reevaluation of this exceptional man.\r\n\r\nHe overturns many received opinions, including the myth of a great romance with Josephine: She took a lover immediately after their marriage, and, as Roberts shows, he had three times as many mistresses as he acknowledged.\r\n\r\nOf the climactic Battle of Leipzig in 1813, as the fighting closed around them, a French sergeant major wrote, &quot;No-one who has not experienced it can have any idea of the enthusiasm that burst forth among the half-starved, exhausted soldiers when the Emperor was there in person. If all were demoralised and he appeared, his presence was like an electric shock. All shouted &apos;Vive l&apos;Empereur!&apos; and everyone charged blindly into the fire.&quot;\r\n\r\nAndrew Roberts is a biographer and historian of international renown whose books include Salisbury: Victorian Titan (winner, the Wolfson Prize for History); Masters and Commanders; and The Storm of War, which reached number two on the Sunday Times best seller list. Roberts is a fellow of the Royal Societies of Literature and Arts. He appears regularly on British television and radio and writes for the Sunday Telegraph, Spectator, Literary Review, Mail on Sunday and Daily Telegraph.\r\n\r\nxx","last_updated":"2017-12-13T12:00:54.501Z","parsed":{"xt":"urn:btih:154157414067cf8cde87faea695101586ec6ae8d","dn":"Napoleon the Great by Andrew Roberts EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"154157414067cf8cde87faea695101586ec6ae8d","infoHashBuffer":{"type":"Buffer","data":[21,65,87,65,64,103,207,140,222,135,250,234,105,81,1,88,110,198,174,141]},"name":"Napoleon the Great by Andrew Roberts EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}