{"title":"Tiffany Dufu - Drop the Ball 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:154bb7d5904f368bd8af821a5a04b4aebad46b21&dn=Tiffany+Dufu+-+Drop+the+Ball+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2891816","seeders":"2","leechers":"2","description":"Tiffany Dufu - Drop the Ball 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA bold and inspiring memoir and manifesto from a renowned voice in the women&apos;s leadership movement who shows women how to cultivate the single skill they really need in order to thrive: the ability to let go.\r\n\r\nOnce the poster girl for doing it all, after she had her first child, Tiffany Dufu struggled to accomplish everything she thought she needed to in order to succeed. Like so many driven and talented women who have been brought up to believe that to have it all they must do it all, Dufu began to feel that achieving her career and personal goals was an impossibility. Eventually she discovered the solution: letting go. In Drop the Ball, Dufu recounts how she learned to reevaluate expectations, shrink her to-do list, and meaningfully engage the assistance of others - freeing the space she needed to flourish at work and to develop deeper, more meaningful relationships at home.\r\n\r\nEven though women are half the workforce, they still represent only 18 percent of the highest level leaders. The reasons are obvious: Just as women reach middle management, they are also starting families. Mounting responsibilities at work and home leave them with no bandwidth to do what will most lead to their success. Offering new perspective on why the women&apos;s leadership movement has stalled, and packed with actionable advice, Tiffany Dufu&apos;s Drop the Ball urges women to embrace imperfection and to expect less of themselves and more from others - only then can they focus on what they truly care about, devote the necessary energy to achieving their real goals, and create the type of rich, rewarding life we all desire","last_updated":"2017-05-25T11:59:17.942Z","parsed":{"xt":"urn:btih:154bb7d5904f368bd8af821a5a04b4aebad46b21","dn":"Tiffany Dufu - Drop the Ball 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"154bb7d5904f368bd8af821a5a04b4aebad46b21","infoHashBuffer":{"type":"Buffer","data":[21,75,183,213,144,79,54,139,216,175,130,26,90,4,180,174,186,212,107,33]},"name":"Tiffany Dufu - Drop the Ball 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}