{"title":"Wentworth Season 4 Complete 720p HDTV x264 [i_c]","magnet":"magnet:?xt=urn:btih:15ea68cb8cadf7aa57954898b4317b2bddc5a3b8&dn=Wentworth+Season+4+Complete+720p+HDTV+x264+%5Bi_c%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ice_cracked","categoryP":"video","categoryS":"hd___tv_shows","size":"7363051516","seeders":"0","leechers":"0","description":"Fans of the iconic Prisoner Cell Block H series, which pushed boundaries over three decades ago and still boasts a loyal following worldwide today, will remember Bea Smith as gutsy and fearless, ruling Wentworth Correctional Centre with an iron fist. But who was Bea Smith before prison? How did a wife and mother from the suburbs become a top dog without rival? Wentworth Prison is a dynamic, often confronting, drama series that begins with Bea&apos;s early days in prison. Set in the present day, it is a modern adaptation of Prisoner Cell Block H that contemporises legendary characters and their stories for today&apos;s audience.\r\n\r\nThis series takes the viewer inside to an uncompromising environment that explores the politics of women in a world without men, and how such a threatening experience both challenges and often changes those confined and working behind the razor wire. The audience will be introduced to Bea all over again and meet her allies and enemies in the form of iconic inmates: Doreen Anderson, Liz Birdsworth and Franky Doyle, and there are new faces such as Jacs Holt, the ruthless matriarch of a crime family who now reigns over Wentworth. Favourite offices will also return. Meg Jackson carries a shameful secret; Vera Bennett, the well-meaning officer who discovers everyone has a price; Erica Davidson, the crusading Lawyer and Matthew Fletcher who believes in retribution rather than rehabilitation. And a new face, Meg&apos;s husband Will Jackson, whose past still haunts him.\r\n\r\nEach episode explores an individual character&apos;s back story, providing an insight to what makes them tick and the circumstances that led them to Wentworth. In doing so we discover that the difference between an inmate and an officer is sometimes simply geography, because they&apos;re all prisoners in surprisingly different ways. Like the original Prisoner Cell Block H, Wentworth Prison is, at its heart, a series about survival, a character drama featuring women living in a pressure cooker environment. Despite the rivalries and power struggles, this family of misfits and rebels are forced to forge unlikely friendships and allegiances if they want to survive their time inside","last_updated":"2017-08-25T12:01:03.830Z","parsed":{"xt":"urn:btih:15ea68cb8cadf7aa57954898b4317b2bddc5a3b8","dn":"Wentworth Season 4 Complete 720p HDTV x264 [i_c]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"15ea68cb8cadf7aa57954898b4317b2bddc5a3b8","infoHashBuffer":{"type":"Buffer","data":[21,234,104,203,140,173,247,170,87,149,72,152,180,49,123,43,221,197,163,184]},"name":"Wentworth Season 4 Complete 720p HDTV x264 [i_c]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}