{"title":"Rise to Ruins InDev 26 Unstable 5","magnet":"magnet:?xt=urn:btih:1624923e348ec82351b52c6ec964c8ec4aa6637e&dn=Rise+to+Ruins+InDev+26+Unstable+5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"444761068","seeders":"0","leechers":"0","description":"Rise to Ruins is at heart a godlike village simulator, but it also throws in plenty of familiar game play mechanics from classic 90s era real-time strategy games like Warcraft, along with some tower defense and survival elements in an attempt to create a new kind of village simulator. The goal is to try to bridge the gap between the depth and complexity of traditional village simulators, the fun of godlikes and the simplicity of real-time strategy.Build a village, and die trying!A major part of the game is village management, and trying to discover new and creative ways to use the tools at your disposal to keep yourself alive as long as possible. In this game, you will lose frequently, but with every failure you learn a little bit more about how to survive and apply that knowledge to your next attempt.Several Game ModesCurrently, the game offers three game modes. Survival, Sandbox and Peaceful.Survival is the game the way it was meant to be played, as a brutal survival style village sim, you will probably die often trying to figure out the best way to survive, but that&apos;s half the fun right?!Peaceful is very similar to Survival, but it&apos;s balanced much like a traditional village simulator with some godlike and RTS elements sprinkled on top. The monster spawn rates are much lower, and the main focus is keeping your village happy and fed. It&apos;s a very easy mode, designed for casual players, or players just wanting to experiment.Sandbox, like the name implies, is a mode where you can play around with the game mechanics. Change the time of","last_updated":"2017-06-02T12:00:57.026Z","parsed":{"xt":"urn:btih:1624923e348ec82351b52c6ec964c8ec4aa6637e","dn":"Rise to Ruins InDev 26 Unstable 5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1624923e348ec82351b52c6ec964c8ec4aa6637e","infoHashBuffer":{"type":"Buffer","data":[22,36,146,62,52,142,200,35,81,181,44,110,201,100,200,236,74,166,99,126]},"name":"Rise to Ruins InDev 26 Unstable 5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}