{"title":"World of Final Fantasy: Day One Edition","magnet":"magnet:?xt=urn:btih:1668cd4f4d990fd7794084b4eb53eed40cfe6e83&dn=World+of+Final+Fantasy%3A+Day+One+Edition&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"awadita","categoryP":"games","categoryS":"pc","size":"7326730240","seeders":"4","leechers":"3","description":"World of Final Fantasy: Day One Edition (MULTi8)\r\n\r\nATTENTION! The minimum size of the repack is 5.8 GB, read repack features section for details.\r\n\r\nDescription:\r\n\r\nCAPTURE, CUSTOMISE AND EVOLVE! Embark on a magical journey with siblings Reynn and Lann \r\nas they explore the vast land of Grymoire to rediscover their past and save the future. \r\nWith charming and stylised visuals, players will capture, customise and evolve iconic \r\ncreatures by stacking them to form adorable yet strategic monster towers. \r\nThe memorable legends of FINAL FANTASY come to life in this imaginative, \r\ncolourful world as an epic story fit for the smallest of heroes unfolds. \r\n\r\nThe WORLD OF FINAL FANTASY: Day One Edition is available from November 21, 2017 until November 28, 2017 and includes the following bonus content:\r\n- A digital soundtrack sampler featuring enchanting tracks from the game.\r\n- A stunning wallpaper showcasing legendary FINAL FANTASY heroes and creatures (Sizes: 1024 x 768, 1280 x 1024, 1920 x 1080, 2560 x 1600)\r\n\r\nGame Features\r\n\r\nA New Twist on Classic Battles: master an all new battle system where players can \r\nutilise their captured monsters to create powerful towers of monsters to fight foes. \r\nUse the monsters&apos; size, element, and order effectively to win the battle!\r\nCapture, Customise and Evolve: strategise over endless customisation options by \r\nturning creatures into ability-boosting magicite, leveling and evolving them to \r\ngain new specialisations, or simply ride them to travel faster over the vast landscapes of this enchanting world.\r\nA World of Vertical Possibility: dive into vertically stacked dungeons and use \r\ncreature abilities and magicite effects to get past obstacles and progress. \r\nIn this world of stacking objects, the sky is truly the limit!","last_updated":"2017-11-22T12:03:24.389Z","parsed":{"xt":"urn:btih:1668cd4f4d990fd7794084b4eb53eed40cfe6e83","dn":"World of Final Fantasy: Day One Edition","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1668cd4f4d990fd7794084b4eb53eed40cfe6e83","infoHashBuffer":{"type":"Buffer","data":[22,104,205,79,77,153,15,215,121,64,132,180,235,83,238,212,12,254,110,131]},"name":"World of Final Fantasy: Day One Edition","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}