{"title":"I Was Told to Come Alone - My Journey Behind the Lines of Jihad ","magnet":"magnet:?xt=urn:btih:1668e60ba59d4d6bf120c84a881bca8dc05e09e0&dn=I+Was+Told+to+Come+Alone+-+My+Journey+Behind+the+Lines+of+Jihad+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"2861593","seeders":"0","leechers":"0","description":"I Was Told to Come Alone - My Journey Behind the Lines of Jihad (2017) (Epub) Gooner\r\n\r\nPublisher: Henry Holt &amp; Company (13 Jun. 2017)\r\nAuthor: Souad Mekhennet \r\nLanguage: English\r\nISBN-10: 1627798978\r\nISBN-13: 9781627798976\r\nASIN: B01MFFEU8Q\r\n\r\n&quot;I was told to come alone. I was not to carry any identification, and would have to leave my cell phone, audio recorder, watch, and purse at my hotel. . . .&quot;\r\n\r\nFor her whole life, Souad Mekhennet, a reporter for The Washington Post who was born and educated in Germany, has had to balance the two sides of her upbringing - Muslim and Western. She has also sought to provide a mediating voice between these cultures, which too often misunderstand each other.\r\n\r\nIn this compelling and evocative memoir, we accompany Mekhennet as she journeys behind the lines of jihad, starting in the German neighborhoods where the 9/11 plotters were radicalized and the Iraqi neighborhoods where Sunnis and Shia turned against one another, and culminating on the Turkish/Syrian border region where ISIS is a daily presence. In her travels across the Middle East and North Africa, she documents her chilling run-ins with various intelligence services and shows why the Arab Spring never lived up to its promise. She then returns to Europe, first in London, where she uncovers the identity of the notorious ISIS executioner &quot;Jihadi John,&quot; and then in France, Belgium, and her native Germany, where terror has come to the heart of Western civilization.\r\n\r\nMekhennet&apos;s background has given her unique access to some of the world&apos;s most wanted men, who generally refuse to speak to Western journalists. She is not afraid to face personal danger to reach out to individuals in the inner circles of Al Qaeda, the Taliban, ISIS, and their affiliates; when she is told to come alone to an interview, she never knows what awaits at her destination.\r\n\r\nSouad Mekhennet is an ideal guide to introduce us to the human beings behind the ominous headlines, as she shares her transformative journey with us. Hers is a story you will not soon forget","last_updated":"2017-06-16T12:00:51.460Z","parsed":{"xt":"urn:btih:1668e60ba59d4d6bf120c84a881bca8dc05e09e0","dn":"I Was Told to Come Alone - My Journey Behind the Lines of Jihad ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1668e60ba59d4d6bf120c84a881bca8dc05e09e0","infoHashBuffer":{"type":"Buffer","data":[22,104,230,11,165,157,77,107,241,32,200,74,136,27,202,141,192,94,9,224]},"name":"I Was Told to Come Alone - My Journey Behind the Lines of Jihad ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}