{"title":"It's Your Ship_ Management Techniques from the Best Damn Ship in","magnet":"magnet:?xt=urn:btih:16c7b1fdb6a5b08266c95b7105f67650c5852b80&dn=It%27s+Your+Ship_+Management+Techniques+from+the+Best+Damn+Ship+in&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2698298","seeders":"59","leechers":"15","description":"xx\r\n\r\nIt&apos;s Your Ship_ Management Techniques from the Best Damn Ship in the Navy by D Michael Abrashoff ePUB eBOOK-ZAK\r\n\r\nThe story of Captain D. Michael Abrashoff and his command of USS Benfold has become legendary inside and outside the Navy. Now Abrashoff offers this fascinating tale of top-down change for anyone trying to navigate today&apos;s uncertain business seas. When Captain Abrashoff took over as commander of the Benfold, a ship armed with every cutting-edge system available, it was like a business that had all the latest technology but only some of the productivity.\r\n\r\nKnowing that responsibility for improving performance rested with him, he realized he had to improve his own leadership skills before he could improve his ship. Within months he created a crew of confident and inspired problem-solvers eager to take the initiative and take responsibility for their actions. The slogan on board became &quot;It&apos;s your ship,&quot; and Benfold was soon recognized far and wide as a model of naval efficiency. How did Abrashoff do it?\r\n\r\nAgainst the backdrop of today&apos;s United States Navy - Benfold was a key player in our Persian Gulf fleet - Abrashoff shares his secrets of successful management including:\r\n\r\nSee the ship through the eyes of the crew: By soliciting a sailor&apos;s suggestions, Abrashoff drastically reduced tedious chores that provided little additional value.\r\n\r\nCommunicate, communicate, communicate: The more Abrashoff communicated the plan, the better the crew&apos;s performance. His crew would eventually call him &quot;Megaphone Mike&quot;, since they heard from him so often.\r\n\r\nCreate discipline by focusing on purpose: Discipline skyrocketed when Abrashoff&apos;s crew believed that what they were doing was important.\r\n\r\nListen aggressively: After learning that many sailors wanted to use the GI Bill, Abrashoff brought a test official aboard the ship-and held the SATs forty miles off the Iraqi coast.\r\n\r\nFrom achieving amazing cost savings to winning the highest gunnery score in the Pacific Fleet, Captain Abrashoff&apos;s extraordinary campaign sent shock waves through the U.S. Navy. It can help you change the course of your ship, no matter where your business battles are fought.\r\n\r\nxx","last_updated":"2017-08-31T12:07:33.996Z","parsed":{"xt":"urn:btih:16c7b1fdb6a5b08266c95b7105f67650c5852b80","dn":"It's Your Ship_ Management Techniques from the Best Damn Ship in","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"16c7b1fdb6a5b08266c95b7105f67650c5852b80","infoHashBuffer":{"type":"Buffer","data":[22,199,177,253,182,165,176,130,102,201,91,113,5,246,118,80,197,133,43,128]},"name":"It's Your Ship_ Management Techniques from the Best Damn Ship in","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}