{"title":"Japan's Last Bid for Victory: The Invasion of India 1944","magnet":"magnet:?xt=urn:btih:173b69d990436ea3c4ac271dc020883e12af44ce&dn=Japan%27s+Last+Bid+for+Victory%3A+The+Invasion+of+India+1944&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"3723350","seeders":"77","leechers":"5","description":"Japan&apos;s Last Bid for Victory: The Invasion of India 1944 - Robert Lyman [epub]\r\n\r\nRobert Lyman&#x2019;s deep knowledge and understanding of the war in Burma, and the great battles at Kohima and Imphal in 1944, are well known. In this book he uses original documents, published works and personal accounts to weave together an enthralling account of some of the bitterest fighting of WWII. Not only does he use British sources for his research but he has also included material from the Naga tribes of north-east India, on whose land these battles were fought, and from Japanese accounts, including interviews with Japanese veterans of the fighting. Thus he has been able to produce what is arguably the most balanced history of the battles that were pivotal in ending the Japanese empire. \r\n\r\nFergal Keane, journalist and author of Road to Bones: The Siege of Kohima 1944 wrote to the author saying &#x2018;What a triumph! I finished it last night. You have done a wonderful job. I only wish I&#x2019;d read it before writing my own book!&#x2019; He goes on to say &#x2018;Robert Lyman is one of the great writers about men and war and in this book he has succeeded in conveying the courage, genius and folly of an epic struggle. I cannot think of a writer engaged in the subject of the Second World War who can match Lyman for his integrity or the soundness of his judgments.&#x2019;\r\n\r\nBorn in New Zealand in 1963 Dr Robert Lyman was educated at Scotch College, Melbourne and the Royal Military Academy, Sandhurst. He spent twenty years as an officer in the British Army. He has degrees from the universities of York, Wales (Aberystwyth), Cranfield, London (King&apos;s College) and East Anglia. He is a Fellow of the Royal Historical Society.\r\n\r\nPrint Length: 304 pages\r\nPublisher: Pen &amp; Sword (November 19, 2011)","last_updated":"2018-01-01T12:04:39.691Z","parsed":{"xt":"urn:btih:173b69d990436ea3c4ac271dc020883e12af44ce","dn":"Japan's Last Bid for Victory: The Invasion of India 1944","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"173b69d990436ea3c4ac271dc020883e12af44ce","infoHashBuffer":{"type":"Buffer","data":[23,59,105,217,144,67,110,163,196,172,39,29,192,32,136,62,18,175,68,206]},"name":"Japan's Last Bid for Victory: The Invasion of India 1944","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}