{"title":"Age.of.Empires.II.HD.The.Rise.of.the.Rajas-RELOADED","magnet":"magnet:?xt=urn:btih:17b5e1709bbeb891fb6087b115df5540c701acb9&dn=Age.of.Empires.II.HD.The.Rise.of.the.Rajas-RELOADED&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dupiiii1","categoryP":"games","categoryS":"pc","size":"399472293","seeders":"0","leechers":"0","description":"\r\n\r\n\r\nAge of Empires II HD Rise of the Rajas (c) Microsoft Studios\r\n\r\n12/2016: RELEASE.DATE .. PROTECTION: Steam\r\n1: DISC(S) .. GAME.TYPE: Strategy\r\nWelcome to Age of Empires II HD: The Rise of the Rajas; the third new\r\nofficial expansion for the Age of Empires II universe in over 17 years\r\nChallenge friends with four additional civilizations, new units\r\ntechnologies, and build your empire on both water and land. Guide history&apos;s\r\ngreatest heroes in Southeast Asia through four additional campaigns and\r\nconquer your foes with mighty hordes of elephants under your command!\r\n\r\n* 4 New Civilizations\r\n* Burmese Assemble the largest empire in the history of Southeast Asia\r\nthrough a legion of Battle Elephants that can demolish the most powerful\r\nof defenses. The Burmese unique unit is the Arambai, a ranged cavalry\r\nunit with a deadly but low accuracy attack\r\n* Khmer Construct the largest religious monument in the world and amass\r\nan immortal army of devastating siege weapons. The Khmer unique unit is\r\nthe Ballista Elephant, a mounted scorpion that can be upgraded to fire\r\ntwo bolts simultaneously\r\n* Malay Conquer Southeast Asia with the vast island empire of Malay and\r\nupgrade your docks to harbours which can shoot arrows. The Malay unique\r\nunit is the Karambit Warrior, an extremely cheap infantry unit that can\r\nquickly overwhelm its foes\r\n* Vietnamese Lead your people to independence and wage guerilla warfare\r\nwith an extremely powerful arsenal of ranged units. The Vietnamese unique\r\nunit is the Rattan Archer, a heavily-armored ranged unit that is\r\neffectively impervious to enemy archer attacks\r\n* 4 New, Fully Voiced Campaigns\r\n\r\n* Gajah Mada: On the island of Java, a new power is rising. Gajah Mada\r\nprime minister of Majapahit, conspires to build an empire to rule the\r\nwaves and islands of the Archipelago. Will he be able to balance his\r\nunquestioned loyalty to the king with his growing ambitions?\r\n* Suryavarman I: It is the early 11th century and the Khmer Empire is in\r\nturmoil, torn apart by competing factions and surrounded by hostile\r\nneighbors. Only one prince, Suryavarman, has the courage and cunning to\r\ndefeat his rivals and restore the Khmer to their former glory. Seizing\r\nthe throne, however, is just the first of many tasks. Will Suryavarman","last_updated":"2017-07-14T12:00:44.662Z","parsed":{"xt":"urn:btih:17b5e1709bbeb891fb6087b115df5540c701acb9","dn":"Age.of.Empires.II.HD.The.Rise.of.the.Rajas-RELOADED","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"17b5e1709bbeb891fb6087b115df5540c701acb9","infoHashBuffer":{"type":"Buffer","data":[23,181,225,112,155,190,184,145,251,96,135,177,21,223,85,64,199,1,172,185]},"name":"Age.of.Empires.II.HD.The.Rise.of.the.Rajas-RELOADED","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}