{"title":"The Silk Roads: A New History of the World","magnet":"magnet:?xt=urn:btih:17d965d6fc48c9a98fa25f11e0d34125ccc175d7&dn=The+Silk+Roads%3A+A+New+History+of+the+World&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4165495","seeders":"112","leechers":"8","description":"The Silk Roads: A New History of the World - Peter Frankopan [epub]\r\n\r\nIt was on the Silk Roads that East and West first encountered each other through trade and conquest, leading to the spread of ideas, cultures and religions. From the rise and fall of empires to the spread of Buddhism and the advent of Christianity and Islam, right up to the great wars of the twentieth century&#x2014;this book shows how the fate of the West has always been inextricably linked to the East.\r\n\r\nPeter Frankopan realigns our understanding of the world, pointing us eastward. He vividly re-creates the emergence of the first cities in Mesopotamia and the birth of empires in Persia, Rome and Constantinople, as well as the depredations by the Mongols, the transmission of the Black Death and the violent struggles over Western imperialism. Throughout the millennia, it was the appetite for foreign goods that brought East and West together, driving economies and the growth of nations. \r\n\r\nFrom the Middle East and its political instability to China and its economic rise, the vast region stretching eastward from the Balkans across the steppe and South Asia has been thrust into the global spotlight in recent years. Frankopan teaches us that to understand what is at stake for the cities and nations built on these intricate trade routes, we must first understand their astounding pasts. Far more than a history of the Silk Roads, this book is truly a revelatory new history of the world, promising to destabilize notions of where we come from and where we are headed next.\r\n\r\nPeter Frankopan is a historian based at Oxford University. He is the author of The First Crusade: The Call from the East, a major monograph about Byzantium, Islam and the West in the eleventh and twelfth centuries. He is a senior research fellow at Worcester College, Oxford, and the director of the Oxford Centre for Byzantine Research at Oxford University. His revised translation of The Alexiad was published in the United States in 2009.\r\n\r\nPrint Length: 657 pages\r\nPublisher: Vintage; Reprint edition (February 16, 2016)","last_updated":"2017-09-05T12:07:18.615Z","parsed":{"xt":"urn:btih:17d965d6fc48c9a98fa25f11e0d34125ccc175d7","dn":"The Silk Roads: A New History of the World","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"17d965d6fc48c9a98fa25f11e0d34125ccc175d7","infoHashBuffer":{"type":"Buffer","data":[23,217,101,214,252,72,201,169,143,162,95,17,224,211,65,37,204,193,117,215]},"name":"The Silk Roads: A New History of the World","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}