{"title":"World Without Mind_ The Existential Threat of Big Tech by Frankl","magnet":"magnet:?xt=urn:btih:189534a5892a91ae8177be492df632a59143ce91&dn=World+Without+Mind_+The+Existential+Threat+of+Big+Tech+by+Frankl&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3071512","seeders":"19","leechers":"14","description":"xx\r\n\r\nWorld Without Mind_ The Existential Threat of Big Tech by Franklin Foer MOBI eBOOK-ZAK\r\n\r\nFranklin Foer reveals the existential threat posed by big tech and in his brilliant polemic gives us the toolkit to fight their pervasive influence.\r\n\r\nOver the past few decades, there has been a revolution in terms of who controls knowledge and information. This rapid change has imperiled the way we think. Without pausing to consider the cost, the world has rushed to embrace the products and services of four titanic corporations. We shop with Amazon; socialize onturn to Apple for entertainment; and rely on Google for information. These firms sell their efficiency and purport to make the world a better place, but what they have done instead is to enable an intoxicating level of daily convenience. As these companies have expanded, marketing themselves as champions of individuality and pluralism, their algorithms have pressed us into conformity and laid waste to privacy. They have produced an unstable and narrow culture of misinformation and put us on a path to a world without private contemplation, autonomous thought, or solitary introspection - a world without mind. In order to restore our inner lives, we must avoid being coopted by these gigantic companies and understand the ideas that underpin their success.\r\n\r\nElegantly tracing the intellectual history of computer science - from Descartes and the Enlightenment to Alan Turing to Stuart Brand and the hippie origins of today&apos;s Silicon Valley - Foer exposes the dark underpinnings of our most idealistic dreams for technology. The corporate ambitions of Google,Apple, and Amazon, he argues, are trampling longstanding liberal values, especially intellectual property and privacy. This is a nascent stage in the total automation and homogenization of social, political, and intellectual life. By reclaiming our private authority over how we intellectually engage with the world, we have the power to stem the tide.\r\n\r\nAt stake is nothing less than who we are and what we will become. There have been monopolists in the past, but today&apos;s corporate giants have far more nefarious aims. They&apos;re monopolists who want access to every facet of our identities and influence over every corner of our decision making. Until now, few have grasped the sheer scale of the threat. Foer explains not just the looming existential crisis but the imperative of resistance.\r\n\r\nxx","last_updated":"2017-09-19T12:42:54.361Z","parsed":{"xt":"urn:btih:189534a5892a91ae8177be492df632a59143ce91","dn":"World Without Mind_ The Existential Threat of Big Tech by Frankl","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"189534a5892a91ae8177be492df632a59143ce91","infoHashBuffer":{"type":"Buffer","data":[24,149,52,165,137,42,145,174,129,119,190,73,45,246,50,165,145,67,206,145]},"name":"World Without Mind_ The Existential Threat of Big Tech by Frankl","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}