{"title":"Why Did the Chicken Cross the World by Andrew Lawler EPUB","magnet":"magnet:?xt=urn:btih:18c4220db86000e1dadc2dd82a0133b08a2c0a4d&dn=Why+Did+the+Chicken+Cross+the+World+by+Andrew+Lawler+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2426813","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhy Did the Chicken Cross the World by Andrew Lawler EPUB\r\n\r\nFrom ancient empires to modern economics, veteran journalist Andrew Lawler delivers a sweeping history of the animal that has been most crucial to the spread of civilization across the globe: the chicken.\r\n\r\nQueen Victoria was obsessed with it. Socrates&apos; last words were about it. Charles Darwin and Louis Pasteur made their scientific breakthroughs using it. Catholic popes, African shamans, Chinese philosophers, and Muslim mystics praised it. Throughout the history of civilization, humans have embraced it in every form imaginable--as a messenger of the gods, a powerful sex symbol, a gambling aid, an emblem of resurrection, an all-purpose medicine, a handy research tool, an inspiration for bravery, the epitome of evil, and, of course, the star of the world&apos;s most famous joke.\r\n\r\nIn Why Did the Chicken Cross the World?, science writer Andrew Lawler takes us on an adventure from prehistory to the modern era with a fascinating account of the partnership between human and chicken (the most successful of all cross-species relationships). Beginning with the recent discovery in Montana that the chicken&apos;s unlikely ancestor is T. rex, this book builds on Lawler&apos;s popular Smithsonian cover article, &quot;How the Chicken Conquered the World&quot;, to track the chicken from its original domestication in the jungles of Southeast Asia some 10,000 years ago to postwar America, where it became the most engineered of animals, to the uncertain future of what is now humanity&apos;s single most important source of protein.\r\n\r\nIn a masterful combination of historical sleuthing and journalistic exploration on four continents, Lawler reframes the way we feel and think about our most important animal partner--and, by extension, all domesticated animals and even nature itself. Lawler&apos;s narrative reveals the secrets behind the chicken&apos;s transformation from a shy jungle bird into an animal of astonishing versatility, capable of serving our species&apos; changing needs.\r\n\r\nxx","last_updated":"2018-01-01T12:00:43.046Z","parsed":{"xt":"urn:btih:18c4220db86000e1dadc2dd82a0133b08a2c0a4d","dn":"Why Did the Chicken Cross the World by Andrew Lawler EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"18c4220db86000e1dadc2dd82a0133b08a2c0a4d","infoHashBuffer":{"type":"Buffer","data":[24,196,34,13,184,96,0,225,218,220,45,216,42,1,51,176,138,44,10,77]},"name":"Why Did the Chicken Cross the World by Andrew Lawler EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}