{"title":"\nThe State of Affairs by Esther Perel EPUB","magnet":"magnet:?xt=urn:btih:18d5cd2e8969ba6650af333ef4d87ea12252e8ad&dn=The+State+of+Affairs+by+Esther+Perel+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2022019","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe State of Affairs by Esther Perel EPUB\r\n\r\nIconic couples&apos; therapist and best-selling author of Mating in Captivity Esther Perel returns with a groundbreaking and provocative look at infidelity, arguing for a more nuanced and less judgmental conversation about our transgressions.\r\n\r\nAn affair: It can rob a couple of their relationship, their happiness, their very identity. And yet this extremely common human experience is so poorly understood. Adultery has existed since marriage was invented, and so, too, the prohibition against it - in fact it has a tenacity that marriage can only envy.\r\n\r\nSo what are we to make of this time-honored taboo, universally forbidden yet universally practiced? For the past 10 years, master therapist Esther Perel has traveled the globe and worked with hundreds of couples who have been shattered by infidelity. In The State of Affairs she asks, why do we cheat? And why do happy people cheat? Why does infidelity hurt so much? And when we say infidelity, what exactly do we mean? Is an affair always the end of a marriage?\r\n\r\nAffairs, she writes, have a lot to teach us about relationships. They provide unusual insight into our personal and cultural attitudes about love, lust, and commitment. Betrayal hurts, but it can be healed. An affair can even be the doorway to a new marriage - with the same person. With the right approach, Perel argues, couples can grow and learn from these tumultuous experiences, together or apart.\r\n\r\nFiercely intelligent, The State of Affairs provides a daring framework for understanding the intricacies of love and desire. As Perel writes, &quot;Love is messy; infidelity more so. But it is also a window, like no other, into the crevices of the human heart.&quot;\r\n\r\nxx","last_updated":"2017-10-21T12:01:08.611Z","parsed":{"xt":"urn:btih:18d5cd2e8969ba6650af333ef4d87ea12252e8ad","dn":"The State of Affairs by Esther Perel EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"18d5cd2e8969ba6650af333ef4d87ea12252e8ad","infoHashBuffer":{"type":"Buffer","data":[24,213,205,46,137,105,186,102,80,175,51,62,244,216,126,161,34,82,232,173]},"name":"The State of Affairs by Esther Perel EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}