{"title":"Gertrudis Graphics GMX-PhotoPainter v2.8.0.1154 + Activator","magnet":"magnet:?xt=urn:btih:1aa41549bb8ac81b4e7f816b71f64af86f8e26bd&dn=Gertrudis+Graphics+GMX-PhotoPainter+v2.8.0.1154+%2B+Activator&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"39280981","seeders":"12","leechers":"3","description":"Easily Turn your Digital Photos into Paintings! GMX-PhotoPainter is Perfect for Photographers, Artists, Hobbyists and Students. Choose from Pen and Ink, Crayon, Oil, Watercolor or Pastel, and Paint like Van Gogh, Seurat or Matisse. Create your own styles by combining different brushes, textures and painting techniques, the number of combinations is endless.As with traditional painting, PhotoPainter paintings are composed of many overlapped brushstrokes. You have the creative freedom to choose and combine your own styles and settings, but at the same time guiding the painting process by automatically choosing the colors and directions of the brushstrokes.\r\n\r\nAlthough it comes bundled with many dedicated parameters, the GUI doesn&#x2019;t look overcrowded at all. It actually sports a clean and intuitive layout that allows you to switch to a full screen mode, so you can focus better on the drawing process. It works with the following file formats: JPG, PNG, and BMP. Additionally, the tool lets you paste the image copied to the clipboard in the working environment. GMX-PhotoPainter puts at your disposal four different painting tools, such as AutoPaint, Freehand painting, Pattern, and BandPaint. The first one is designed to help you automatically determine the brushstroke directions based on the characteristics of the picture, without having to move the mouse in a certain direction to pick the orientation of the brushstrokes. The Freehand painting gives you the freedom to draw one stroke at a time following the path given by hand and is useful especially for drawing details, while the Pattern mode enables you to choose between different preset patterns or create a custom one. Last but not least, you can make use of the BandPaint option for making a group of brushstrokes following the path given by a free hand trace","last_updated":"2017-05-29T13:19:41.870Z","parsed":{"xt":"urn:btih:1aa41549bb8ac81b4e7f816b71f64af86f8e26bd","dn":"Gertrudis Graphics GMX-PhotoPainter v2.8.0.1154   Activator","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1aa41549bb8ac81b4e7f816b71f64af86f8e26bd","infoHashBuffer":{"type":"Buffer","data":[26,164,21,73,187,138,200,27,78,127,129,107,113,246,74,248,111,142,38,189]},"name":"Gertrudis Graphics GMX-PhotoPainter v2.8.0.1154   Activator","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}