{"title":"Limbo (v1.0 R6)","magnet":"magnet:?xt=urn:btih:1ae2f8776d5f65f4b638a90440ecbd0e11216786&dn=Limbo+%28v1.0+R6%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Rex_Havok","categoryP":"games","categoryS":"pc","size":"76114283","seeders":"1","leechers":"2","description":"Limbo is a puzzle-platform video game developed by independent studio Playdead. The game was released in July 2010 on Xbox Live Arcade, and has since been ported to several other systems, including the PlayStation 3 and Microsoft Windows. Limbo is a 2D side-scroller, incorporating a physics system that governs environmental objects and the player character. The player guides an unnamed boy through dangerous environments and traps as he searches for his sister. The developer built the game&apos;s puzzles expecting the player to fail before finding the correct solution. Playdead called the style of play &quot;trial and death&quot;, and used gruesome imagery for the boy&apos;s deaths to steer the player from unworkable solutions.\r\n\r\nThe game is presented in black-and-white tones, using lighting, film grain effects and minimal ambient sounds to create an eerie atmosphere often associated with the horror genre. Journalists praised the dark presentation, describing the work as comparable to film noir and German Expressionism. Based on its aesthetics, reviewers classified Limbo as an example of video games as an art form. Limbo received positive reviews, but its minimal story polarised critics; some critics found the open-ended work to have deeper meaning that tied well with the game&apos;s mechanics, while others believed the lack of significant plot and abrupt ending detracted from the game. A common point of criticism from reviewers was that the high cost of the game relative to its short length might deter players from purchasing the title, but some reviews proposed that Limbo had an ideal length. The title was the third-highest selling game on the Xbox Live Arcade service in 2010, generating around $7.5 million in revenue. The title won several awards from industry groups after its release, and was named as one of the top games for 2010 by several publications. Playdead&apos;s next title, Inside, was released in 2016, and revisited many of the same themes presented in Limbo.\r\n <a href=\"\nhttp://images.vfl.ru/ii/1502095668/69b4e079/18167110.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://images.vfl.ru/ii/1502095668/69b4e079/18167110.jpg</a> <a href=\"\nhttp://images.vfl.ru/ii/1502095668/5166a20a/18167111.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://images.vfl.ru/ii/1502095668/5166a20a/18167111.jpg</a> <a href=\"\nhttp://images.vfl.ru/ii/1502095668/8dd21f02/18167112.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://images.vfl.ru/ii/1502095668/8dd21f02/18167112.jpg</a> <a href=\"\nhttp://images.vfl.ru/ii/1502095668/948f9e26/18167113.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://images.vfl.ru/ii/1502095668/948f9e26/18167113.jpg</a>","last_updated":"2017-08-07T12:02:10.573Z","parsed":{"xt":"urn:btih:1ae2f8776d5f65f4b638a90440ecbd0e11216786","dn":"Limbo (v1.0 R6)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1ae2f8776d5f65f4b638a90440ecbd0e11216786","infoHashBuffer":{"type":"Buffer","data":[26,226,248,119,109,95,101,244,182,56,169,4,64,236,189,14,17,33,103,134]},"name":"Limbo (v1.0 R6)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}