{"title":"Encyclopedia of Information Science and Technology(2017) - EPUB ","magnet":"magnet:?xt=urn:btih:1b24270be1b1cb5e690215e198f0641a0e5a420c&dn=Encyclopedia+of+Information+Science+and+Technology%282017%29+-+EPUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"491975428","seeders":"0","leechers":"0","description":"\nEncyclopedia of Information Science and Technology(2017) - EPUB - zeke23\r\nISBN: 1522522557 | 2017 | True EPUB/PDF | 7500 Pages | 469 MB\r\nIn recent years, our world has experienced a profound shift and progression in available computing and knowledge sharing innovations. These emerging advancements have developed at a rapid pace, disseminating into and affecting numerous aspects of contemporary society. This has created a pivotal need for an innovative compendium encompassing the latest trends, concepts, and issues surrounding this relevant discipline area. During the past 15 years, the Encyclopedia of Information Science and Technology has become recognized as one of the landmark sources of the latest knowledge and discoveries in this discipline. The Encyclopedia of Information Science and Technology, Fourth Edition is a commanding 10-volume set consisting of 705 completely new and original articles that impart a full range of applications and techniques, as well as critical perspectives on the impact of information science management and new technologies in modern settings. This authoritative content covers over 80 timely and trending categories, including but not limited to cloud computing, big data, educational technologies, management science, web technologies, and library science and administration, that spread across 11 major subject areas: Business, Computer Science, Education, Social Science, Library Science, Healthcare, Media and Communications, Security, Engineering, and Environmental Science. More than 1,100 experts from 74 unique countries contributed their specialized knowledge on these topics in order to challenge the academic community with some of the most timely and diverse research findings studied in the past few years","last_updated":"2017-07-21T12:00:25.617Z","parsed":{"xt":"urn:btih:1b24270be1b1cb5e690215e198f0641a0e5a420c","dn":"Encyclopedia of Information Science and Technology(2017) - EPUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1b24270be1b1cb5e690215e198f0641a0e5a420c","infoHashBuffer":{"type":"Buffer","data":[27,36,39,11,225,177,203,94,105,2,21,225,152,240,100,26,14,90,66,12]},"name":"Encyclopedia of Information Science and Technology(2017) - EPUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}