{"title":"Love from Boy by Donald Sturrock EPUB","magnet":"magnet:?xt=urn:btih:1b52c475baff3182372b1532aa884c102532c2f1&dn=Love+from+Boy+by+Donald+Sturrock+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8911513","seeders":"5","leechers":"5","description":"xx\r\n\r\nLove from Boy by Donald Sturrock EPUB\r\n\r\nFrom the author of The BFG - soon to be a major motion picture directed by Steven Spielberg and starring Mark Rylance, Ruby Barnhill, Penelope Wilton, Jemaine Clement, Bill Hader, and Adam Godley - a whimsical, witty, and revealing collection of the legendary children&apos;s author and writer Roald Dahl&apos;s letters written to his mother, from early childhood through Dahl&apos;s travels to Africa; his career in the Royal Air Force; his work in postwar Washington, DC, and Hollywood; and the books that made him a literary star.\r\n\r\nRoald Dahl penned his first letter to his mother, Sofie Magdalene, when he was just nine years old. The origins of a brilliantly funny, subversive, creative mind were evident in boarding school, and as he entered adulthood, his penchant for storytelling emerged in his missives home from Africa, where he was stationed by Shell Oil, and then the desert camps of the Royal Air Force. His skills were sharpened after a plane crash in Egypt landed him in Washington, DC, where his cheery letters home were cover for his work in the British Secret Service, along with gossipy updates on his spontaneous rise in Hollywood and his budding New York literary career.\r\n\r\nHis mother was, in many ways, Dahl&apos;s first reader, and without her correspondence he might never have become a writer. Sofie Magdalene kept every letter her son wrote to her (sadly, her own side of the correspondence did not survive). It was she who encouraged him to tell stories and nourished his desire to fabricate, exaggerate, and entertain.\r\n\r\nIn these letters Dahl began practicing his craft, developing the dark sense of humor and fantastical imagination that would later produce his timeless tales. The author of James and the Giant Peach, Charlie and the Chocolate Factory, Matilda, and The BFG, Dahl is known by millions the world over today. But writing candidly to the person who knew him best, Dahl was as singular a character as any he created on paper.\r\n\r\nAssembled by Dahl&apos;s authorized biographer, Donald Sturrock, Love from Boy is a remarkable collection of never-before-published writing that spans four decades and chronicles the remarkable, unpredictable life of its author. While Dahl&apos;s books remain best-selling favorites for all ages, Love from Boy provides an unprecedented glimpse of the author through his own eyes - a life punctuated by tragedy, creative stagnation, unexpected fame, and fantastic adventure.\r\n\r\nxx","last_updated":"2017-11-07T12:02:33.101Z","parsed":{"xt":"urn:btih:1b52c475baff3182372b1532aa884c102532c2f1","dn":"Love from Boy by Donald Sturrock EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1b52c475baff3182372b1532aa884c102532c2f1","infoHashBuffer":{"type":"Buffer","data":[27,82,196,117,186,255,49,130,55,43,21,50,170,136,76,16,37,50,194,241]},"name":"Love from Boy by Donald Sturrock EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}