{"title":"Isabella of Castile by Giles Tremlett 2017 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:1bae49485763a24fff00af24a0693bb13c135d77&dn=Isabella+of+Castile+by+Giles+Tremlett+2017+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11151556","seeders":"0","leechers":"0","description":"xx\r\n\r\nIsabella of Castile by Giles Tremlett 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn 1474, a 23-year-old woman ascended the throne of Castile, the largest and strongest kingdom in Spain. Ahead of her lay the considerable challenge not only of being a young female ruler in an overwhelmingly male-dominated world but also of reforming a major European kingdom that was riddled with crime, corruption, and violent political factionism. Her marriage to Ferdinand of Aragon was crucial to her success, bringing together as it did two kingdoms, but it was a royal partnership in which Isabella more than held her own. Her pivotal reign was long and transformative, uniting Spain and setting the stage for its golden era of global dominance. For by the time of her death in 1504, Isabella had laid the foundations not just of modern Spain but of one of the world&apos;s greatest empires.\r\n\r\nAcclaimed historian Giles Tremlett chronicles the life of Isabella of Castile as she led her country out of the murky middle ages and harnessed the newest ideas and tools of the early Renaissance to turn her ill-disciplined, quarrelsome nation into a sharper, modern state with a powerful, clear-minded, and ambitious monarch at its centre. With authority, insight and flair, he relates the story of this legendary, if controversial, first initiate in a small club of great European queens that includes Elizabeth I of England, Russia&apos;s Catherine the Great, and Britain&apos;s Queen Victoria.\r\n\r\nxx","last_updated":"2017-09-03T12:00:25.750Z","parsed":{"xt":"urn:btih:1bae49485763a24fff00af24a0693bb13c135d77","dn":"Isabella of Castile by Giles Tremlett 2017 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1bae49485763a24fff00af24a0693bb13c135d77","infoHashBuffer":{"type":"Buffer","data":[27,174,73,72,87,99,162,79,255,0,175,36,160,105,59,177,60,19,93,119]},"name":"Isabella of Castile by Giles Tremlett 2017 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}