{"title":"Sheryl Sandberg - Option B 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:1bc06dc5bee645f0be073388533028cb3041b99e&dn=Sheryl+Sandberg+-+Option+B+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7514921","seeders":"0","leechers":"0","description":"xx\r\n\r\nSheryl Sandberg - Option B 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFromCOO and Wharton&apos;s top-rated professor, the number-one New York Times best-selling authors of Lean In and Originals: a powerful, inspiring, and practical book about building resilience and moving forward after life&apos;s inevitable setbacks.\r\n\r\nAfter the sudden death of her husband, Sheryl Sandberg felt certain that she and her children would never feel pure joy again. &quot;I was in &apos;the void,&apos;&quot; she writes, &quot;a vast emptiness that fills your heart and lungs and restricts your ability to think or even breathe.&quot; Her friend Adam Grant, a psychologist at Wharton, told her there are concrete steps people can take to recover and rebound from life-shattering experiences. We are not born with a fixed amount of resilience. It is a muscle that everyone can build.\r\n\r\nOption B combines Sheryl&apos;s personal insights with Adam&apos;s eye-opening research on finding strength in the face of adversity. Beginning with the gut-wrenching moment when she finds her husband, Dave Goldberg, collapsed on a gym floor, Sheryl opens up her heart - and her journal - to describe the acute grief and isolation she felt in the wake of his death. But Option B goes beyond Sheryl&apos;s loss to explore how a broad range of people have overcome hardships including illness, job loss, sexual assault, natural disasters, and the violence of war. Their stories reveal the capacity of the human spirit to persevere...and to rediscover joy.\r\n\r\nResilience comes from deep within us and from support outside us. Even after the most devastating events, it is possible to grow by finding deeper meaning and gaining greater appreciation in our lives. Option B illuminates how to help others in crisis, develop compassion for ourselves, raise strong children, and create resilient families, communities, and workplaces. Many of these lessons can be applied to everyday struggles, allowing us to brave whatever lies ahead.\r\n\r\nxx","last_updated":"2017-07-12T12:00:25.332Z","parsed":{"xt":"urn:btih:1bc06dc5bee645f0be073388533028cb3041b99e","dn":"Sheryl Sandberg - Option B 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1bc06dc5bee645f0be073388533028cb3041b99e","infoHashBuffer":{"type":"Buffer","data":[27,192,109,197,190,230,69,240,190,7,51,136,83,48,40,203,48,65,185,158]},"name":"Sheryl Sandberg - Option B 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}