{"title":"The Main Street Vegan Academy Cookbook (gnv64)","magnet":"magnet:?xt=urn:btih:1c6b744e6d75079a0fc2a774af684869d6f0351c&dn=The+Main+Street+Vegan+Academy+Cookbook+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"52074526","seeders":"120","leechers":"21","description":"The Main Street Vegan Academy Cookbook: Over 100 Plant-Sourced Recipes Plus Practical Tips for the Healthiest, Most Compassionate You\r\nby Victoria Moran and JL Fields\r\nBenBella Books | December 2017 | ISBN-10: 1944648682 | ePUB | 49.2 mb\r\n\r\nWhen someone goes vegan on Park Avenue or Beverly Drive, they have a private chef and a personal assistant to do the troubleshooting.\r\nFor nearly six years, acclaimed author, speaker, podcaster, and Main Street Vegan Academy director, Victoria Moran, has trained individuals to become vegan lifestyle coaches and educators. Now, Victoria has teamed up with one her Academy alums turned faculty member, cookbook author, culinary instructor, and radioJL Fields, to bring that very same coaching to you.\r\nIn The Main Street Vegan Academy Cookbook, Victoria and JL, along with over a hundred certified vegan lifestyle coaches, join you in the kitchen as you navigate more than 100 of their favorite plant-sourced recipes. Whether you&apos;re new to the diet or a seasoned plant-based eater, vegan or just veg-curious, their tips, tricks, shortcuts, and strategies will transform your cooking, your eating, and your life.\r\n\r\nAbout the Authors <a href=\"\nhttps://s9.postimg.org/ecr64j8vj/Victoria_Moran.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s9.postimg.org/ecr64j8vj/Victoria_Moran.jpg</a>\r\nVictoria Moran (www.mainstreetvegan.net) is a vegan of over three decades, an obesity survivor, and the 2016/17 winner of the &quot;Peta&apos;s Sexiest Vegan Over 50.&quot; Listed by VegNews among the Top 10 Living Vegetarian Authors, she&apos;s written twelve books. She is also producer of the upcoming documentary from filmmaker Thomas Wade Jackson, The Compassion Project, introducing veganism to people of faith. <a href=\"\nhttps://s9.postimg.org/hwd3ud6gf/JL_Fields.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s9.postimg.org/hwd3ud6gf/JL_Fields.jpg</a>\r\nJL Fields is the founder and culinary director of the Colorado Springs Vegan Cooking Academy. She is a vegan lifestyle coach &amp; educator, Food for Life instructor, chef instructor in the culinary program at the University of New Mexico-Taos, personal chef, career coach, and a corporate consultant offering wellness training, brand representation, and strategic planning services.\r\n\r\nCONTENTS\r\nForeword by Jane Velez-Mitchell\r\nIntroduction\r\nCHAPTER 1. IT&#x2019;S REALLY EASY BEING GREEN - Debunking the myths of expensive, complicated, and weird\r\nCHAPTER 2. FIFTY SHADES OF VEGAN - There are lots of ways to eat plants and respect animals; your way is just right\r\nCHAPTER 3. GOOD MORNING AND GREAT NEWS - There is life after bacon\r\nCHAPTER 4. THE SOCIAL VEGAN - Omni-pleasing small plates, snacks, and hors d&#x2019;oeuvres\r\nCHAPTER 5. SALAD DAYS AND SOUP FOR SUPPER - They&#x2019;re not just starters anymore\r\nCHAPTER 6. SET IT AND FORGET IT - One-pot meals for all\r\nCHAPTER 7. MAIN STREET MAINS - You won&#x2019;t miss the meat\r\nCHAPTER 8. CHOCOLATE AND OTHER PLEASURES - A little of what you fancy does you good\r\nCHAPTER 9. VEGAN OUTSIDE THE KITCHEN - Igniting the kindness revolution\r\nIndex\r\nRecipe Index\r\nAcknowledgments \r\nAbout the Authors\r\n <a href=\"\nhttps://s9.postimg.org/a2ci95tkf/The_Main_Street_Vegan_Academy_Cookbook.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s9.postimg.org/a2ci95tkf/The_Main_Street_Vegan_Academy_Cookbook.jpg</a>","last_updated":"2017-12-26T12:08:32.086Z","parsed":{"xt":"urn:btih:1c6b744e6d75079a0fc2a774af684869d6f0351c","dn":"The Main Street Vegan Academy Cookbook (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1c6b744e6d75079a0fc2a774af684869d6f0351c","infoHashBuffer":{"type":"Buffer","data":[28,107,116,78,109,117,7,154,15,194,167,116,175,104,72,105,214,240,53,28]},"name":"The Main Street Vegan Academy Cookbook (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}