{"title":"Liu Xiaobo - Selected Essays and Poems (Nobel Peace Prize, 2010)","magnet":"magnet:?xt=urn:btih:1ca0e8b306f1853a73e497fce666a5fa2b93e5e1&dn=Liu+Xiaobo+-+Selected+Essays+and+Poems+%28Nobel+Peace+Prize%2C+2010%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"7094898","seeders":"68","leechers":"7","description":"\r\nLIU XIAOBO (b. 1955) is a Chinese literary critic, writer, professor, and human rights activist who has called for political reforms and the end of communist single-party rule.  He was awarded the 2010 Nobel Peace Prize &quot;for his long and non-violent struggle for fundamental human rights in China&quot;.\r\n\r\nIn 1989, Liu left his position as a visiting scholar at Columbia University to return to Beijing to participate in the 1989 Democracy Movement. On June 2, Liu and three others went on a hunger strike in Tiananmen Square to protest martial law and appeal for peaceful negotiations between the students and the government.  After the crackdown, Liu was held in Beijing&apos;s Qincheng Prison until 1991, when he was found guilty of &quot;counter-revolutionary propaganda and incitement&quot; but exempted from punishment.\r\n\r\nIn 1996, he was sentenced to three years of Reeducation-Through-Labour on charges of &quot;rumor-mongering and slander&quot; and &quot;disturbing social order&quot; after drafting the &quot;Anti-Corruption Proposals&quot; and letters appealing for official reassessment of the June Fourth crackdown.\r\n\r\nLiu was arrested again in June 2009 for his participation with the Charter 08 manifesto and &quot;inciting subversion of state power&quot;, and subsequently sentenced to eleven years&apos; imprisonment and two years&apos; deprivation of political rights.  On 26 June 2017, Liu was granted medical parole after being diagnosed with terminal liver cancer.\r\n\r\nThe selected essays and poems in NO ENEMIES, NO HATRED (2012) span two decades and provide insight into all aspects of Chinese life.  These works not only chronicle Liu&apos;s struggle against tyranny but enrich the record of universal longing for freedom and dignity.  He speaks pragmatically, yet with deep-seated passion, about peasant land disputes, the Han Chinese in Tibet, child slavery, the CCP&apos;s Olympic strategy, the Internet in China, the contemporary craze for Confucius, and the Tiananmen massacre. \r\n\r\n\r\nThe following works are in PDF format unless otherwise noted:\r\n\r\n* Atop a Volcano (China Rights Forum, 2005)\r\n\r\n* Authoritarianism in the Light of the Olympic Flame (PEN, July 2009)\r\n\r\n* I Have No Enemies (Nobel Lecture in absentia, 2010)\r\n\r\n* No Enemies, No Hatred: Selected Essays and Poems (Harvard UP, 2012) - ePUB\r\n\r\n* Remembering June 4th for China&apos;s Future (China Rights Forum, 2005)\r\n\r\n* Rise of Civil Society in China, The (China Rights Forum, 2003)\r\n\r\n____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): <a href=\" https://pirates-forum.org/User-workerbee\" rel=\"nofollow\" target=\"_NEW\"> https://pirates-forum.org/User-workerbee</a>  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","last_updated":"2017-06-28T12:08:34.540Z","parsed":{"xt":"urn:btih:1ca0e8b306f1853a73e497fce666a5fa2b93e5e1","dn":"Liu Xiaobo - Selected Essays and Poems (Nobel Peace Prize, 2010)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1ca0e8b306f1853a73e497fce666a5fa2b93e5e1","infoHashBuffer":{"type":"Buffer","data":[28,160,232,179,6,241,133,58,115,228,151,252,230,102,165,250,43,147,229,225]},"name":"Liu Xiaobo - Selected Essays and Poems (Nobel Peace Prize, 2010)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}