{"title":"Head Ball Coach by Steve Spurrier 2016 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:1d320593e40a8d927319bbd88cf97fd9cf2ca340&dn=Head+Ball+Coach+by+Steve+Spurrier+2016+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"autre","categoryS":"e_books","size":"57185331","seeders":"0","leechers":"0","description":"xx\r\n\r\nHead Ball Coach by Steve Spurrier 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nCollege football&apos;s most colorful, endearing, and successful pioneer, Steve Spurrier, shares his story of a life in football - from growing up in Tennessee to winning the Heisman Trophy to playing and coaching in the pros to leading the Florida Gators to six SEC Championships and a National Championship to elevating the South Carolina program to new heights - and coaching like nobody else.\r\n\r\nHe&apos;s been called brash, cocky, arrogant, pompous, egotistical, and hilarious, but, mostly, he&apos;s known as the Head Ball Coach, a self-ordained term introduced to the lexicon of football by none other than the man himself, Steve Spurrier. He is the only coach who can claim to be the winningest coach at two different SEC schools, and the only person who has won both the Heisman Trophy as a player and a national championship as a coach. Or who has won a Heisman and coached a Heisman winner.\r\n\r\nFrom the beginning, Spurrier didn&apos;t want to sound like other coaches, dress like other coaches, and, especially, coach like other coaches. As a controversial football pioneer, he ushered in a different style of leadership and play. Spurrier&apos;s press conferences were glorious - he refused to lapse into coachspeak and was always entertaining, although he took his football very seriously. He was known for his fierce competitiveness, roaming up and down the sidelines, often throwing his signature visor to the ground in disgust. Now resigned from coaching at age 70 - he doesn&apos;t like to say &quot;retired&quot; yet - Spurrier has calmed down, but don&apos;t mistake that for a lack of fire. He can be just as feisty as the day he set foot on the East Tennessee dirt in Johnson City&apos;s Kiwanis Park, where he grew up to become one of the state&apos;s all-time greatest athletes, and went on to play for Florida where he launched one of sports history&apos;s all-time great careers.\r\n\r\nxx","last_updated":"2017-08-21T12:06:08.827Z","parsed":{"xt":"urn:btih:1d320593e40a8d927319bbd88cf97fd9cf2ca340","dn":"Head Ball Coach by Steve Spurrier 2016 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1d320593e40a8d927319bbd88cf97fd9cf2ca340","infoHashBuffer":{"type":"Buffer","data":[29,50,5,147,228,10,141,146,115,25,187,216,140,249,127,217,207,44,163,64]},"name":"Head Ball Coach by Steve Spurrier 2016 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}