{"title":"The Art of the Good Life by Rolf Dobelli EPUB","magnet":"magnet:?xt=urn:btih:1d4fff26a1a8df8b9a711bd0021dc01f2eab7a08&dn=The+Art+of+the+Good+Life+by+Rolf+Dobelli+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"655179","seeders":"91","leechers":"8","description":"xx\r\n\r\nThe Art of the Good Life by Rolf Dobelli EPUB\r\n\r\nSince antiquity, people have been asking themselves what it means to live a good life. How should I live? What constitutes a good life? What&apos;s the role of fate? What&apos;s the role of money? Is leading a good life a question of mind-set, or is it more about reaching your goals? Is it better to actively seek happiness or to avoid unhappiness?\r\n\r\nEach generation poses these questions anew, and somehow the answers are always fundamentally disappointing. Why? Because we&apos;re constantly searching for a single principle, a single tenet, a single rule. Yet this holy grail - a single, simple path to happiness - doesn&apos;t exist. Rolf Dobelli - successful businessman, founder of the TED-style ideas conference Zurich Minds, best-selling author, and all-around seeker of big ideas - has made finding a shortcut to happiness his life&apos;s mission. He&apos;s synthesized the leading thinkers and the latest science in happiness to find the best shortcuts to satisfaction in The Art of the Good Life, his follow-up to the international best seller The Art of Thinking Clearly (which has sold more than 2.5 million copies in 40 languages all around the globe).\r\n\r\nThe Art of the Good Life is a toolkit designed for practical living. Here you&apos;ll find 52 happiness hacks - from guilt-free shunning of technology to gleefully paying your parking tickets - that are certain to optimize your happiness. These tips may not guarantee you a good life, but they&apos;ll give you a better chance (and that&apos;s all any of us can ask for).\r\n\r\nxx","last_updated":"2017-12-10T12:07:33.982Z","parsed":{"xt":"urn:btih:1d4fff26a1a8df8b9a711bd0021dc01f2eab7a08","dn":"The Art of the Good Life by Rolf Dobelli EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1d4fff26a1a8df8b9a711bd0021dc01f2eab7a08","infoHashBuffer":{"type":"Buffer","data":[29,79,255,38,161,168,223,139,154,113,27,208,2,29,192,31,46,171,122,8]},"name":"The Art of the Good Life by Rolf Dobelli EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}