{"title":"Paul Brinkley Rogers - Please Enjoy Your Happiness 2016 RETAiL e","magnet":"magnet:?xt=urn:btih:1dc40de46a23141f855e71950a2efb10d928afcb&dn=Paul+Brinkley+Rogers+-+Please+Enjoy+Your+Happiness+2016+RETAiL+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6433538","seeders":"27","leechers":"3","description":"Paul Brinkley Rogers - Please Enjoy Your Happiness 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn evocative memoir. A beautiful journey to half a century and half a world away. An ageless love story.\r\n\r\nPulitzer Prize-winning war correspondent Paul Brinkley-Rogers has lived an adventurous life all over the world. But there is one story he cannot forget: that of his haunting love affair with a mysterious older Japanese woman in 1959. Paul was a sailor aboard the USS Shangri La that long-ago summer when he met Kaji Yukiko in the seaport of Yokosuka. A fierce intellectual, Yukiko shared her astonishing knowledge of literature, film, and poetry with Paul and encouraged, even demanded that he use his gifts to become the writer he is today.\r\n\r\nBut theirs was not a quiet love story. When a member of the yakuza, Japan&apos;s brutal crime syndicate, attempted to kidnap Yukiko, Paul realized that there was much more to her - and to Japan in the devastating wake of World War II - than he saw at first glance. Through the searing letters that Yukiko wrote to him and Paul&apos;s vivid telling of a history made all the more powerful and poignant by the weight of time, Please Enjoy Your Happiness reaches across decades and continents, inviting us all to revisit those loves of our lives that never do end","last_updated":"2017-05-23T19:06:29.895Z","parsed":{"xt":"urn:btih:1dc40de46a23141f855e71950a2efb10d928afcb","dn":"Paul Brinkley Rogers - Please Enjoy Your Happiness 2016 RETAiL e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1dc40de46a23141f855e71950a2efb10d928afcb","infoHashBuffer":{"type":"Buffer","data":[29,196,13,228,106,35,20,31,133,94,113,149,10,46,251,16,217,40,175,203]},"name":"Paul Brinkley Rogers - Please Enjoy Your Happiness 2016 RETAiL e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}