{"title":"XStoryPlayer 3.5 [3.5.0002] (X Moon Productions) [uncen] + MOD","magnet":"magnet:?xt=urn:btih:1df5d2b2457d708ecc680efd2d57fde29b158b85&dn=XStoryPlayer+3.5+%5B3.5.0002%5D+%28X+Moon+Productions%29+%5Buncen%5D+%2B+MOD&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"keny.bro","categoryP":"porn","categoryS":"games","size":"1070909961","seeders":"5","leechers":"4","description":"THis is one of the best porn game ever! Realy.\r\nJust try\r\nSupports  HTC Vive &amp; Oculus CV1 support \r\n\r\nVersion 3.x has been a big improvement over version 2.x. Especially animation and physics wise there is now an extreme amount of freedom. Making XStoryPlayer the most realistic erotic game on the market.\r\n\r\nYou can move the characters around, undress them, use toys on them and also let them have fun together. All without any fade-overs or cut-scenes.\r\n\r\nAlso the dungeon fast-sex scene is full of toys and machines. And the characters remain fully interactive while being used by a machine or another character.\r\n\r\nTo top things off there is a lot of detail in the sexual interaction. From cum-wires to realistic facials.\r\n\r\nThere are lots of settings, cloths and textures to choose from to customize the characters.\r\n\r\nVersion 3 also supports modding, so new cloth, skins and other mods are being made, also see the forum for this.\r\n\r\nAll cloth are fully interactive and have buttons and zippers to be used accordingly. Making the experience of undressing a girl as realistic as possible.\r\n(When used in combination with the Oculus Rift, the experience is creepingly real)\r\n\r\nWith XStoryPlayer you play erotic stories of different nature. You can chat with girls through a dating site. Go into the city and meet them at public places.\r\n\r\nOnce a relationship with a girl is established you can take it to the next level. Dont rush things, when a girl lets you know things are going to fast be carefull not to force it. If you messed up, no worries, just reload the game from the last savepoint and try again (I wish that was possible in real life).\r\n\r\nSome girls are more kinky than others and may suprise you in their fantasies. Once a girl is fully won over she is your love toy for life.\r\n\r\nOne of the elements that sets our software apart from other game engines is the fact that physics is always enabled on: characters, fluids, cloth, soft bodies etc. We do not use animations in the traditional sense, you can always interact with a girls body during the game (if she allows it of course).\r\n\r\nWhen a girl is won over there&apos;s no restrictions in what you can do. If you want to open her legs more, just do so. If you want to come on her face, just make it happen. Peek inside bikinis, open shirts, pull down dresses its all possible.\r\n\r\nWe do however recommend restricting yourself because our characters do have feelings and may resist if being handled too roughly","last_updated":"2017-06-23T12:04:48.140Z","parsed":{"xt":"urn:btih:1df5d2b2457d708ecc680efd2d57fde29b158b85","dn":"XStoryPlayer 3.5 [3.5.0002] (X Moon Productions) [uncen]   MOD","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1df5d2b2457d708ecc680efd2d57fde29b158b85","infoHashBuffer":{"type":"Buffer","data":[29,245,210,178,69,125,112,142,204,104,14,253,45,87,253,226,155,21,139,133]},"name":"XStoryPlayer 3.5 [3.5.0002] (X Moon Productions) [uncen]   MOD","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}