{"title":"The Shipwreck Hunter","magnet":"magnet:?xt=urn:btih:1e68851547d988f1f156937cd6967dd26a6fe810&dn=The+Shipwreck+Hunter&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"13781988","seeders":"71","leechers":"8","description":"The Shipwreck Hunter: A lifetime of extraordinary discoveries on the ocean floor - David L. Mearns [epub]\r\n\r\nDavid Mearns has discovered some of the world&apos;s most fascinating and elusive shipwrecks. From the mighty battlecruiser HMS Hood to the crumbling wooden skeletons of Vasco da Gama&apos;s 16th century fleet, David has searched for and found dozens of sunken vessels in every ocean of the world.\r\n\r\nThe Shipwreck Hunter is an account of David&apos;s most intriguing and fascinating finds. It details both the meticulous research and the mid-ocean stamina and courage required to find a wreck miles beneath the sea, as well as the moving human stories that lie behind each of these oceanic tragedies.\r\n\r\nCombining the derring-do of Indiana Jones with the precision of a surgeon, in The Shipwreck Hunter David Mearns opens a porthole into the shadowy depths of the ocean.\r\n\r\nDavid L. Mearns OAM is one of the world&#x2019;s most experienced and successful deep-sea shipwreck hunters having located 24 major shipwrecks with an overall success rate of 89%. His formidable reputation has been built on a career finding notoriously difficult wrecks that others predicted would never be found or their mysteries solved. David&#x2019;s most important discoveries include MV Lucona, MV Derbyshire, HMS Hood, the Portuguese East Indiaman Esmeralda, HMAS Sydney, HSK Kormoran, AHS Centaur and Rio Grande the Guinness World Record for the deepest shipwreck ever found at 5,762 metres. David was also a key member of Paul Allen&#x2019;s team that located and filmed the iconic Japanese battleship Musashi in 2015, based on the research and search area analysis he conducted.\r\n\r\nHardcover: 416 pages\r\nPublisher: Allen &amp; Unwin; Main edition (5 Oct. 2017)","last_updated":"2017-09-03T12:01:58.330Z","parsed":{"xt":"urn:btih:1e68851547d988f1f156937cd6967dd26a6fe810","dn":"The Shipwreck Hunter","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1e68851547d988f1f156937cd6967dd26a6fe810","infoHashBuffer":{"type":"Buffer","data":[30,104,133,21,71,217,136,241,241,86,147,124,214,150,125,210,106,111,232,16]},"name":"The Shipwreck Hunter","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}