{"title":"\nHit Refresh_ The Quest to Rediscover Microsoft's Soul and Imagin","magnet":"magnet:?xt=urn:btih:1ea698b20a71de4f02417050522f7e746d9e8134&dn=Hit+Refresh_+The+Quest+to+Rediscover+Microsoft%27s+Soul+and+Imagin&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4160959","seeders":"0","leechers":"0","description":"xx\r\n\r\nHit Refresh_ The Quest to Rediscover Microsoft&apos;s Soul and Imagine a Better Future for Everyone by Satya Nadella ePUB eBOOK-ZAK\r\n\r\nForeword by Bill Gates\r\nMicrosoft&apos;s CEO tells the inside story of the company&apos;s continuing transformation, tracing his own personal journey from a childhood in India to leading some of the most significant technological changes in the digital era. As much a humanist as an engineer and executive, Nadella concludes with his vision for the coming wave of intelligent technologies and a distinct call to action for leaders everywhere.\r\n\r\nHit Refresh is about individual change, about the transformation happening inside of Microsoft and the technology that will soon impact all of our lives - the arrival of the most exciting and disruptive wave of technology humankind has experienced: artificial intelligence, mixed reality, and quantum computing.\r\n\r\nIt&apos;s about how people, organizations, and societies can and must transform &quot;hit refresh&quot; in their persistent quest for new energy, new ideas, and continued relevance and renewal. At its core, it&apos;s about us humans and how our one unique quality - empathy - will become ever more valuable in a world where technological advancement will disrupt the status quo as never before.\r\n\r\nSatya Nadella explores a fascinating childhood before immigrating to the US and how he learned to lead along the way. He then shares his meditations as sitting CEO - one who is mostly unknown following the brainy Bill Gates and energetic Steve Ballmer. He tells the inside story of how a company rediscovered its soul - transforming everything from culture to their fiercely competitive landscape and industry partnerships. Nadella concludes with his vision for the coming wave of technology and by exploring the potential impact to society and delivering a call to action for world leaders.\r\n\r\n&quot;Ideas excite me,&quot; Nadella explains. &quot;Empathy grounds and centers me.&quot; Hit Refresh is a reflection, meditations, and series of recommendations presented as algorithms from a principled, deliberative leader searching for improvement - for himself, for a storied company, and for society.\r\n\r\nxx","last_updated":"2017-09-28T12:03:08.666Z","parsed":{"xt":"urn:btih:1ea698b20a71de4f02417050522f7e746d9e8134","dn":"Hit Refresh_ The Quest to Rediscover Microsoft's Soul and Imagin","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1ea698b20a71de4f02417050522f7e746d9e8134","infoHashBuffer":{"type":"Buffer","data":[30,166,152,178,10,113,222,79,2,65,112,80,82,47,126,116,109,158,129,52]},"name":"Hit Refresh_ The Quest to Rediscover Microsoft's Soul and Imagin","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}