{"title":"Christopher Finan - Drunks_ An American History 2017 RETAiL ePUB","magnet":"magnet:?xt=urn:btih:1efc5c793f6bb1eb35e18c7d0da0683f92622eca&dn=Christopher+Finan+-+Drunks_+An+American+History+2017+RETAiL+ePUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6839077","seeders":"15","leechers":"7","description":"xx\r\n\r\nChristopher Finan - Drunks_ An American History 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA social history of alcoholism in the United States, from the 17th century to the present day.\r\n\r\nToday, millions of Americans are struggling with alcoholism, but millions are also in long-term recovery. Alcoholics Anonymous and a growing number of recovery organizations are providing support for alcoholics who will face the danger of relapse for the rest of their lives. We have finally come to understand alcoholism as a treatable illness rather than a moral failure. Today&apos;s advocates can draw inspiration from the victories of sober drunks throughout American history.\r\n\r\nChristopher Finan recounts the nation&apos;s history with alcohol and its search for sobriety, which began among Native Americans in the colonial period, when liquor was used to cheat them of their property. He introduces us to the first of a colorful cast of characters, a remarkable Iroquois leader named Handsome Lake, who dedicated his life to helping his people renounce hard liquor. And we meet Carrie Nation, the wife of an alcoholic who destroyed bars with an ax in her anger over what alcohol had done to her family, as well as the idealistic and energetic Washingtonians, reformed drunks who led the first national movement to save men like themselves.\r\n\r\nFinan also tells the dramatic story of Bill Wilson and Dr. Bob Smith, the two drunks who helped each other stay sober and then created AA, which survived its tumultuous early years and has made it possible for millions of men and women to quit drinking. This is narrative history at its best: entertaining and authoritative, an important portrait of one of America&apos;s great liberation movements.\r\n\r\nxx","last_updated":"2017-08-09T12:01:35.886Z","parsed":{"xt":"urn:btih:1efc5c793f6bb1eb35e18c7d0da0683f92622eca","dn":"Christopher Finan - Drunks_ An American History 2017 RETAiL ePUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1efc5c793f6bb1eb35e18c7d0da0683f92622eca","infoHashBuffer":{"type":"Buffer","data":[30,252,92,121,63,107,177,235,53,225,140,125,13,160,104,63,146,98,46,202]},"name":"Christopher Finan - Drunks_ An American History 2017 RETAiL ePUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}