{"title":"Black Fleet Trilogy by Joshua Dalzelle epub mobi RtR","magnet":"magnet:?xt=urn:btih:1f011aa72daf809f861b7ba3bec39203d5709b9e&dn=Black+Fleet+Trilogy+by+Joshua+Dalzelle+epub+mobi+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13828548","seeders":"1","leechers":"3","description":"Black Fleet Trilogy by Joshua Dalzelle epub mobi RtR\r\n\r\nWarship: Black Fleet Trilogy, Book 1\r\n\r\nFrom Joshua Dalzelle, author of the best-selling Omega Force series, comes an all new vision of humanity&apos;s future.\r\n\r\nIn the 25th century, humans have conquered space. The advent of faster-than-light travel has opened up hundreds of habitable planets for colonization, and humans have exploited the virtually limitless space and resources for hundreds of years with impunity. So complacent have they become with the overabundance that armed conflict is a thing of the past, and their machines of war are obsolete and decrepit. What would happen if they were suddenly threatened by a terrifying new enemy? Would humanity fold and surrender, or would they return to their evolutionary roots and meet force with force?\r\n\r\nOne ship - and one captain - will soon be faced with this very choice.\r\n\r\nCall to Arms: Black Fleet Trilogy, Book 2\r\n\r\nFrom Joshua Dalzelle comes the follow-up to the number-one best seller Warship. Captain Jackson Wolfe survived the initial incursion of a vicious alien species into human space...barely. He had assumed the juggernaut that had devastated three Terran systems was the herald for a full invasion, but for the last few years it has been eerily quiet along the Frontier. Jackson now struggles to convince the Confederate leadership the threat is still imminent and needs to be taken seriously. While powerful factions make backroom deals, he is desperate to find irrefutable proof that the invaders are coming, and if humanity expects to survive they must marshal their forces and make a stand before it&apos;s too late.\r\n\r\nCounterstrike: Black Fleet Trilogy, Book 3\r\n\r\nCaptain Jackson Wolfe never thought he&apos;d see the end of the Phage War in his lifetime. The enemy was too powerful, too numerous, and utterly determined to exterminate humanity.\r\n\r\nBut the appearance of a new ally in the fight has changed all of that. For the first time since the original incursion, Wolfe thinks that maybe there&apos;s a chance to stop their implacable enemy before they have the chance to wipe out any more human planets. That opportunity comes at great cost, however, and even as he makes plans for their first offensive move on the Phage, Jackson is all too aware that most of them will not survive","last_updated":"2017-05-25T11:58:53.620Z","parsed":{"xt":"urn:btih:1f011aa72daf809f861b7ba3bec39203d5709b9e","dn":"Black Fleet Trilogy by Joshua Dalzelle epub mobi RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f011aa72daf809f861b7ba3bec39203d5709b9e","infoHashBuffer":{"type":"Buffer","data":[31,1,26,167,45,175,128,159,134,27,123,163,190,195,146,3,213,112,155,158]},"name":"Black Fleet Trilogy by Joshua Dalzelle epub mobi RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}