{"title":"The Witches of New York by Ami McKay EPUB","magnet":"magnet:?xt=urn:btih:1f19521d1e0c469cd5fa7cf86dcea1e299e55d8c&dn=The+Witches+of+New+York+by+Ami+McKay+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"18051441","seeders":"0","leechers":"1","description":"xx\r\n\r\nThe Witches of New York by Ami McKay EPUB\r\n\r\nRespectable Lady Seeks Dependable Shop Girl. Those averse to magic need not apply.\r\n\r\nNew York in the spring of 1880 is a place alive with wonder and curiosity. Determined to learn the truth about the world, its residents enthusiastically engage in both scientific experimentation and spiritualist pursuits. S&#xE9;ances are the entertainment of choice in exclusive social circles, and many enterprising women - some possessed of true intuitive powers and some gifted with the art of performance - find work as mediums.\r\n\r\nEnter Adelaide Thom and Eleanor St. Clair. At their humble tea shop, Tea and Sympathy, they provide a place for whispered confessions, secret cures, and spiritual assignations for a select society of ladies who speak the right words and ask the right questions. But the profile of Tea and Sympathy is about to change with the fortuitous arrival of Beatrice Dunn.\r\n\r\nWhen 17-year-old Beatrice leaves the safety of her village to answer an ad that reads &quot;Respectable Lady Seeks Dependable Shop Girl. Those averse to magic need not apply&quot;, she has little indication of what the job will demand of her. Beatrice doesn&apos;t know it yet, but she is no ordinary small-town girl; she has great spiritual gifts - ones that will serve as her greatest asset and also place her in grave danger. Under the tutelage of Adelaide and Eleanor, Beatrice comes to harness many of her powers, but not even they can prepare her for the evils lurking in the darkest corners of the city or the courage it will take to face them.\r\n\r\nxx","last_updated":"2017-11-05T12:00:47.574Z","parsed":{"xt":"urn:btih:1f19521d1e0c469cd5fa7cf86dcea1e299e55d8c","dn":"The Witches of New York by Ami McKay EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f19521d1e0c469cd5fa7cf86dcea1e299e55d8c","infoHashBuffer":{"type":"Buffer","data":[31,25,82,29,30,12,70,156,213,250,124,248,109,206,161,226,153,229,93,140]},"name":"The Witches of New York by Ami McKay EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}