{"title":"Blood on the Moon: The Assassination of Abraham Lincoln","magnet":"magnet:?xt=urn:btih:1f83379f740676abefcd698fd2a7f87a1800b52c&dn=Blood+on+the+Moon%3A+The+Assassination+of+Abraham+Lincoln&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"6129794","seeders":"0","leechers":"0","description":"Blood on the Moon: The Assassination of Abraham Lincoln - Edward Steers Jr. [epub]\r\n\r\nThe assassination of Abraham Lincoln is usually told as a tale of a lone deranged actor who struck from a twisted lust for revenge. This is not only too simple an explanation; Blood on the Moon reveals that it is completely wrong.\r\n\r\nJohn Wilkes Booth was neither mad nor alone in his act of murder. He received the help of many, not the least of whom was Dr. Samuel Alexander Mudd, the Charles County physician who has been portrayed as the innocent victim of a vengeful government.\r\n\r\nBooth was also aided by the Confederate leadership in Richmond. As he made his plans to strike at Lincoln, Booth was in contact with key members of the Confederate underground, and after the assassination these same forces used all of their resources to attempt his escape.\r\n\r\nNoted Lincoln authority Edward Steers Jr. introduces the cast of characters in this ill-fated drama, he explores why they were so willing to help pull the trigger, and corrects the many misconceptions surrounding this defining moment that changed American history.\r\n\r\nAfter completing an acclaimed career as a research scientist at the National Institutes of Health, Edward Steers Jr. has turned his research skills to the Lincoln assassination. He is the author of several books about the president, including The Trial. He lives in Berkeley Springs, West Virginia.\r\n\r\nWinner of the 2001 The Lincoln Group of New York&apos;s Award of Achievement\r\nA History Book Club Selection","last_updated":"2017-05-24T11:47:32.998Z","parsed":{"xt":"urn:btih:1f83379f740676abefcd698fd2a7f87a1800b52c","dn":"Blood on the Moon: The Assassination of Abraham Lincoln","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1f83379f740676abefcd698fd2a7f87a1800b52c","infoHashBuffer":{"type":"Buffer","data":[31,131,55,159,116,6,118,171,239,205,105,143,210,167,248,122,24,0,181,44]},"name":"Blood on the Moon: The Assassination of Abraham Lincoln","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}