{"title":"Blood on the Water by Anne Perry (William Monk series) epub RtR","magnet":"magnet:?xt=urn:btih:1fc6868ba03e7d0af893e7578e1376ee06367bd0&dn=Blood+on+the+Water+by+Anne+Perry+%28William+Monk+series%29+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4733124","seeders":"28","leechers":"5","description":"Blood on the Water by Anne Perry (William Monk series) epub RtR\r\n\r\nAs Anne Perry&apos;s New York Times best-selling novels always remind us, she is a matchless guide to both the splendor and the shame of the British Empire at the height of its influence. In her 20th William Monk mystery, she brings us to London&apos;s grand Mayfair mansions, where the arrogant masters of the Western world hold sway - and to the teeming Thames waterfront, where one summer afternoon, Monk witnesses the horrifying explosion of the pleasure boat Princess Mary, which takes nearly 200 of the merrymakers on board to their deaths.\r\n\r\nThe tragedy is no accident. As commander of the River Police, Monk should handle the case, but the investigation is turned over to the commissioner of the Metropolitan Police. An Egyptian man is swiftly caught, tried, and sentenced to die. But almost as quickly, Monk presents evidence that Habib Beshara, though a nasty piece of work, was elsewhere at the time of the blast. The investigation, now in complete disarray, is hastily turned over to Monk. Is the crime connected with the soon-to-be-opened Suez Canal, which will enormously benefit wealthy British shipping companies? Or did all of those innocent people drown to ensure the murder of only one of them? How did the bomber board the ship, and how did he manage to escape? Is he an anarchist or a madman?\r\n\r\nBacked up by his astute wife, Hester, and his old reliable friend Oliver Rathbone, Monk vows to find answers - but instead finds himself treading the dangerous waters of international intrigue, his questions politely turned aside by a formidable array of the powerful and privileged. Events twist and turn like the Thames itself, leading to the shattering moment when Monk realizes, perhaps too late, that he is the next target","last_updated":"2017-05-27T09:03:37.014Z","parsed":{"xt":"urn:btih:1fc6868ba03e7d0af893e7578e1376ee06367bd0","dn":"Blood on the Water by Anne Perry (William Monk series) epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1fc6868ba03e7d0af893e7578e1376ee06367bd0","infoHashBuffer":{"type":"Buffer","data":[31,198,134,139,160,62,125,10,248,147,231,87,142,19,118,238,6,54,123,208]},"name":"Blood on the Water by Anne Perry (William Monk series) epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}