{"title":"Amani Al Khatahtbeh - Muslim Girl 2016 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:1fd47040a2469d0901e22368ee1250307ed44e3d&dn=Amani+Al+Khatahtbeh+-+Muslim+Girl+2016+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3332709","seeders":"28","leechers":"1","description":"Amani Al Khatahtbeh - Muslim Girl 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nRequired listening from the founder of MuslimGirl.com - a harrowing and candid memoir about coming of age as a Muslim American in the wake of 9/11, during the never-ending war on terror, and through the Trump era of casual racism.\r\n\r\nAt nine years old, Amani Al-Khatahtbeh watched from her home in New Jersey as two planes crashed into the World Trade Center on September 11, 2001. That same year she heard her first racial slur. At age 11, when the United States had begun to invade Iraq and the television was flooded with anti-Muslim commentary, Amani felt overwhelmed with feelings of intense alienation from American society.\r\n\r\nAt 13 her family took a trip to her father&apos;s native homeland of Jordan, and Amani experienced firsthand a culture built on pure religion, not Islamic stereotypes. Inspired by her trip, and after years of feeling like her voice as a Muslim woman was marginalized and neglected during a time when all the media could talk about was, ironically, Muslim women, Amani created a website called MuslimGirl. As the editor in chief, she put together a team of Muslim women and started a life dedicated to activism.\r\n\r\nThis is the extraordinary account of Amani&apos;s journey through adolescence as a Muslim girl, from the Islamophobia she&apos;s faced on a daily basis to the website she launched that became a cultural phenomenon to the nation&apos;s political climate in the 2016 election cycle with Donald Trump as the Republican nominee. While dispelling the myth that a headscarf makes you a walking target for terrorism, she shares both her own personal accounts and anecdotes from the sisterhood of writers that serve as her editorial team at MuslimGirl. Amani&apos;s honest, urgent message is fresh, timely, and a deeply necessary counterpoint to the current rhetoric about the Middle East","last_updated":"2017-05-23T19:06:06.530Z","parsed":{"xt":"urn:btih:1fd47040a2469d0901e22368ee1250307ed44e3d","dn":"Amani Al Khatahtbeh - Muslim Girl 2016 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1fd47040a2469d0901e22368ee1250307ed44e3d","infoHashBuffer":{"type":"Buffer","data":[31,212,112,64,162,70,157,9,1,226,35,104,238,18,80,48,126,212,78,61]},"name":"Amani Al Khatahtbeh - Muslim Girl 2016 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}