{"title":"Salamanca 1812","magnet":"magnet:?xt=urn:btih:1fd64c6fea116b57efceed658e4364e3a8a077f8&dn=Salamanca+1812&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4211327","seeders":"50","leechers":"2","description":"Salamanca 1812 - Rory Muir [epub]\r\n\r\nJuly 22, 1812. Salamanca, Spain. Frustrated at their first advance, British forces under Wellington&#x2019;s command have spent the last four days maneuvering and retreating from the French army. Patient and cautious, Wellington is determined not to make a fatal mistake. He glimpses a moment of opportunity and grasps it, committing all of his troops to a sudden devastating attack. At the end of the day, the French army is broken, panic-stricken, and reeling; Wellington has achieved the finest victory of his brilliant military career.\r\n\r\nThis book examines in unprecedented detail the battle of Salamanca, a critical British victory that proved crushing to French pride and morale in the Peninsular War (1808-1814). Focusing on the day of the battle, award-winning author Rory Muir conveys the experience of ordinary soldiers on both sides, dissects each phase of the fighting, and explores the crucial decisions each commander made. Muir employs wide-ranging British and French sources&#x2015;many unpublished or obscure&#x2015;to reconstruct every aspect of the battle.\r\n\r\nHaving walked the battlefield itself, a site which remains today much as it was in 1812, he relates the ebb and flow of the battle with particular vividness. Muir also discusses in separate commentary sections his sources of information and explains how he has dealt with the inevitable contradictions and gaps in evidence that emerged during his research. Complete with maps, battleground plans, and other illustrations, this compelling book focuses long overdue attention on a single day in Salamanca that changed European history","last_updated":"2017-06-05T12:04:06.966Z","parsed":{"xt":"urn:btih:1fd64c6fea116b57efceed658e4364e3a8a077f8","dn":"Salamanca 1812","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"1fd64c6fea116b57efceed658e4364e3a8a077f8","infoHashBuffer":{"type":"Buffer","data":[31,214,76,111,234,17,107,87,239,206,237,101,142,67,100,227,168,160,119,248]},"name":"Salamanca 1812","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}