{"title":"The Encyclopedia of Ancient Giants in North America by Fritz Zim","magnet":"magnet:?xt=urn:btih:20257bbaceeceb1345a0a6ecca5452f3dfa918bc&dn=The+Encyclopedia+of+Ancient+Giants+in+North+America+by+Fritz+Zim&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"48937276","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Encyclopedia of Ancient Giants in North America by Fritz Zimmerman PDF eBOOK-ZAK\r\n\r\nThe Encyclopedia of Ancient Giants in North America chronicles two distinct waves of giant humans migrating to North America. As early as 7,000 BC, strange people arrived on the North American shores of gigantic size with Neanderthal-looking skulls. Their spread across the American landscape is documented not only by their massive skeletons but by an identical material culture that was found buried with their remains. Double rows of teeth and skulls with protruding horns make them one of America&apos;s most intriguing mysteries.\r\n\r\nAt the advent of the Bronze Age, another migration of giant humans found their way to North America. A persistent legend exists with Native Americans of a people who came to trade and mine the copper from the Upper Great Lakes. They left an indelible mark upon the landscape of the Ohio Valley with their large burial mounds and earthworks aligned to solar, lunar, and stellar events. The measurements of these works reveal that they were constructed with the knowledge of advanced mathematics. The discovery of giant humans in North America is the result of pouring through over 10,000 state, county and township histories at one of the largest genealogical libraries in America. Hundreds of additional accounts were also found within newspaper archives.\r\n\r\nxx","last_updated":"2017-08-11T12:01:35.972Z","parsed":{"xt":"urn:btih:20257bbaceeceb1345a0a6ecca5452f3dfa918bc","dn":"The Encyclopedia of Ancient Giants in North America by Fritz Zim","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"20257bbaceeceb1345a0a6ecca5452f3dfa918bc","infoHashBuffer":{"type":"Buffer","data":[32,37,123,186,206,236,235,19,69,160,166,236,202,84,82,243,223,169,24,188]},"name":"The Encyclopedia of Ancient Giants in North America by Fritz Zim","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}