{"title":"Jon Stewart - The Daily Show The Book 2016 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:20334bae43e35e98570caf489fba3f913df3446b&dn=Jon+Stewart+-+The+Daily+Show+The+Book+2016+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"31756500","seeders":"2","leechers":"5","description":"Jon Stewart - The Daily Show The Book 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe complete uncensored history of the award-winning The Daily Show with Jon Stewart, as told by its correspondents, writers, and host.\r\n\r\nFor almost 17 years, The Daily Show with Jon Stewart brilliantly redefined the borders between television comedy, political satire, and opinionated news coverage. It launched the careers of some of today&apos;s most significant comedians, highlighted the hypocrisies of the powerful, and garnered 23 Emmys. Now the show&apos;s behind-the-scenes gags, controversies, and camaraderie are chronicled by the players themselves, from legendary host Jon Stewart to the star cast members and writers - including Samantha Bee, Stephen Colbert, John Oliver, Steve Carell, Lewis Black, Jessica Williams, John Hodgman, and Larry Wilmore - plus some of The Daily Show&apos;s most prominent guests and adversaries: John and Cindy McCain, Glenn Beck, Tucker Carlson, and many more.\r\n\r\nThis oral history takes the reader behind the curtain for all the show&apos;s highlights, from its origins as Comedy Central&apos;s underdog late-night program hosted by Craig Kilborn to Jon Stewart&apos;s long reign to Trevor Noah&apos;s succession, rising from a scrappy jester in the 24-hour political news cycle to become part of the beating heart of politics - a trusted source for not only comedy but also commentary, with a reputation for calling bullshit and an ability to effect real change in the world.\r\n\r\nThrough years of incisive election coverage, Jon Stewart&apos;s emotional monologue in the wake of 9/11, his infamous confrontation on Crossfire, passionate debates with President Obama and Hillary Clinton, feuds with Bill O&apos;Reilly and Fox, the Indecisions, Mess O&apos;Potamia, and provocative takes on Wall Street and racism, The Daily Show has been a cultural touchstone. Now, for the first time, the people behind the show&apos;s seminal moments come together to share their memories of the last-minute rewrites, improvisations, pranks, romances, blowups, and moments of Zen both on and off the set of one of America&apos;s most groundbreaking shows","last_updated":"2017-06-05T12:00:49.715Z","parsed":{"xt":"urn:btih:20334bae43e35e98570caf489fba3f913df3446b","dn":"Jon Stewart - The Daily Show The Book 2016 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"20334bae43e35e98570caf489fba3f913df3446b","infoHashBuffer":{"type":"Buffer","data":[32,51,75,174,67,227,94,152,87,12,175,72,159,186,63,145,61,243,68,107]},"name":"Jon Stewart - The Daily Show The Book 2016 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}