{"title":"The Shape of Bones_ A Novel by Daniel Galera ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:22417f34a5f7c8a7ac54f352a10238156ea5d057&dn=The+Shape+of+Bones_+A+Novel+by+Daniel+Galera+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4075576","seeders":"14","leechers":"2","description":"xx\r\n\r\nThe Shape of Bones_ A Novel by Daniel Galera ePUB eBOOK-ZAK\r\n\r\nA young man wakes up at dawn to drive to the Andes, to climb the Cerro Bonete - a mountain untouched by ice axes and climbers, one of the planet&apos;s final mountains to be conquered - as an act of heroic bravado - or foolishness. But instead he finds himself dragged by the undertow of memory to Esplanada, the neighborhood he grew up in, to the brotherhood of his old friends, and to the clearing in the woods where he witnessed an act that has run like a scar through the rest of his life.\r\n\r\nBack in Esplanada, the young man revisits his initiation into adulthood and recalls his boyhood friends who formed a strange and volatile pack. Together they play video games, get drunk around bonfires, pick fights, and goad each other into bike races where the winner is the boy who has the most spectacular crash. Caught between the threat of not being man enough, the desire to please his friends, and the intoxicating contact high of danger, the boy finds himself following the rules of the pack even as the risks mount. And in a moment that reverberates and repeats itself in new ways in his adulthood, his fantasies of who he is and what it means to be a man come crashing down, and life asserts itself as an endless rehearsal for a heroic moment that may never arrive.\r\n\r\nFrom one of Brazil&apos;s most dazzling writers, The Shape of Bones is an exhilarating story of mythic power. Daniel Galera has written a pulse-racing novel with the otherworldly wisdom of a parable.\r\n\r\nxx","last_updated":"2017-09-20T12:03:47.090Z","parsed":{"xt":"urn:btih:22417f34a5f7c8a7ac54f352a10238156ea5d057","dn":"The Shape of Bones_ A Novel by Daniel Galera ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"22417f34a5f7c8a7ac54f352a10238156ea5d057","infoHashBuffer":{"type":"Buffer","data":[34,65,127,52,165,247,200,167,172,84,243,82,161,2,56,21,110,165,208,87]},"name":"The Shape of Bones_ A Novel by Daniel Galera ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}