{"title":"Sting by Sandra Brown EPUB","magnet":"magnet:?xt=urn:btih:2280c6999a2bf6b8cb0914965c8e65a61949faf9&dn=Sting+by+Sandra+Brown+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"561266","seeders":"48","leechers":"5","description":"xx\r\n\r\nSting by Sandra Brown EPUB\r\n\r\nNumber-one New York Times and USA Today best-selling author Sandra Brown jolts the reader from the first page of this heart-pounding story of corruption, treachery, and ceaseless deception...where nothing is what it seems and every truth brought to light exposes a darker lie.\r\n\r\nWhen Jordie Bennet and Shaw Kinnard lock eyes across a disreputable backwater bar, something definitely sparks. Shaw gives off a dangerous vibe that makes men wary and inspires women to sit up and take notice. None feel that undercurrent more strongly than savvy businesswoman Jordie, who doesn&apos;t belong in a seedy dive on the banks of a bayou. But here she is...and Shaw Kinnard is here to kill her.\r\n\r\nAs Shaw and his partner take aim, Jordie is certain her time has come. But Shaw has other plans and abducts Jordie, hoping to get his hands on the $30 million her brother has stolen and, presumably, hidden. However, Shaw is not the only one looking for the fortune. Her brother&apos;s ruthless boss and the FBI are after it as well. Now on the run from the feds and a notorious criminal, Jordie and Shaw must rely on their wits - and each other - to stay alive.\r\n\r\nMiles away from civilization and surrounded by swampland, the two play each other against their common enemies. Jordie&apos;s only chance of survival is to outwit Shaw, but it soon becomes clear to Shaw that Jordie isn&apos;t entirely trustworthy, either. Was she in on her brother&apos;s scam, or is she an innocent pawn in a deadly vendetta? And just how valuable is her life to Shaw, her remorseless and manipulative captor? Burning for answers - and for each other - this unlikely pair ultimately make a desperate move that could be their last.\r\n\r\nWith nonstop plot twists and the tantalizing sexual tension that has made Sandra Brown one of the world&apos;s best-loved authors, Sting will keep readers on the edges of their seats until the final minutes.\r\n\r\nxx","last_updated":"2017-12-11T12:06:37.685Z","parsed":{"xt":"urn:btih:2280c6999a2bf6b8cb0914965c8e65a61949faf9","dn":"Sting by Sandra Brown EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2280c6999a2bf6b8cb0914965c8e65a61949faf9","infoHashBuffer":{"type":"Buffer","data":[34,128,198,153,154,43,246,184,203,9,20,150,92,142,101,166,25,73,250,249]},"name":"Sting by Sandra Brown EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}