{"title":"The Year of the Flood (The MaddAddam Trilogy_book 2) by Margaret","magnet":"magnet:?xt=urn:btih:22afe621a353f8d4219f20dd2ad24889b137e80b&dn=The+Year+of+the+Flood+%28The+MaddAddam+Trilogy_book+2%29+by+Margaret&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"sonstiges","categoryS":"e_bücher","size":"4609296","seeders":"4","leechers":"15","description":"xx\r\n\r\nThe Year of the Flood (The MaddAddam Trilogy_book 2) by Margaret Atwood epub RtR\r\n\r\nThe long-awaited new novel from Margaret Atwood. The Year of the Flood is a dystopic masterpiece and a testament to her visionary power.\r\n\r\nThe times and species have been changing at a rapid rate, and the social compact is wearing as thin as environmental stability. Adam One, the kindly leader of the God&apos;s Gardeners - a religion devoted to the melding of science and religion, as well as the preservation of all plant and animal life - has long predicted a natural disaster that will alter Earth as we know it. Now it has occurred, obliterating most human life. Two women have survived: Ren, a young trapeze dancer locked inside the high-end sex club Scales and Tails, and Toby, a God&apos;s Gardener barricaded inside a luxurious spa where many of the treatments are edible.\r\n\r\nHave others survived? Ren&apos;s bioartist friend Amanda? Zeb, her eco-fighter stepfather? Her onetime lover, Jimmy? Or the murderous Painballers, survivors of the mutual-elimination Painball prison? Not to mention the shadowy, corrupt policing force of the ruling powers . . .\r\n\r\nMeanwhile, gene-spliced life forms are proliferating: the lion/lamb blends, the Mo&apos;hair sheep with human hair, the pigs with human brain tissue. As Adam One and his intrepid hemp-clad band make their way through this strange new world, Ren and Toby will have to decide on their next move. They can&apos;t stay locked away . . .\r\n\r\nBy turns dark, tender, violent, thoughtful, and uneasily hilarious, The Year of the Flood is Atwood at her most brilliant and inventive.\r\n\r\nxx","last_updated":"2017-07-24T12:02:37.863Z","parsed":{"xt":"urn:btih:22afe621a353f8d4219f20dd2ad24889b137e80b","dn":"The Year of the Flood (The MaddAddam Trilogy_book 2) by Margaret","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"22afe621a353f8d4219f20dd2ad24889b137e80b","infoHashBuffer":{"type":"Buffer","data":[34,175,230,33,163,83,248,212,33,159,32,221,42,210,72,137,177,55,232,11]},"name":"The Year of the Flood (The MaddAddam Trilogy_book 2) by Margaret","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}