{"title":"African, American: From Tarzan To Dreams From My Father--Africa ","magnet":"magnet:?xt=urn:btih:22e9afb22f0cfa669649608868a07a073d54290f&dn=African%2C+American%3A+From+Tarzan+To+Dreams+From+My+Father--Africa+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"1236581","seeders":"0","leechers":"0","description":"African, American: From Tarzan To Dreams From My Father--Africa In The Usng Imagination/ David del Mar/2017/EPUB/\r\n\r\nEnglish|Non-Fiction|ISBN-13:978-1783608539|352pg|\r\n\r\nFrom the Edenic wilderness of Edgar Rice Burroughs&#x2019;s Tarzan novels to Marcus Garvey&#x2019;s Back to Africa movement, Africa has gripped the imaginations of Americans, white or black, male or female. But why is this?\r\n\r\n In African, American, David Peterson del Mar uncovers the answer, exploring the ways in which American fantasies of Africa have evolved over time and how Africans themselves have played a role in subverting American attitudes toward the continent.\r\n\r\nIn this remarkable, panoramic work, Peterson del Mar draws on a wide range of sources from literature, film, and music, in addition to accounts by missionaries, aid workers, and travel writers, incorporating pop culture references as well as historical perspectives from Ernest Hemingway to Richard Wright, from the African Queen to the Lion King, in order to trace our continued fascination with Africa.\r\n\r\n The book spans several decades, beginning in the postwar period and continuing to the present, addressing such topical events as American responses to the Ebola crisis and reactions to Obama&#x2019;s Kenyan roots.\r\n \r\nAnd it compares white and African American views on Africa, looking at how they have changed in light of the increased prominence enjoyed by African writers in America, including Teju Cole and Chimamanda Adichie.\r\n\r\nAll together, African, American provides a fascinating deconstruction of the idea of Africa as it exists in the American mind","last_updated":"2017-07-16T12:00:27.278Z","parsed":{"xt":"urn:btih:22e9afb22f0cfa669649608868a07a073d54290f","dn":"African, American: From Tarzan To Dreams From My Father--Africa ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"22e9afb22f0cfa669649608868a07a073d54290f","infoHashBuffer":{"type":"Buffer","data":[34,233,175,178,47,12,250,102,150,73,96,136,104,160,122,7,61,84,41,15]},"name":"African, American: From Tarzan To Dreams From My Father--Africa ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}