{"title":"Caves of Qud v2.0.6386.986","magnet":"magnet:?xt=urn:btih:23578ff6691dd22cfd5c4e0cd2c3c52370367957&dn=Caves+of+Qud+v2.0.6386.986&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"73789137","seeders":"5","leechers":"3","description":"Caves of Qud is a science fantasy roguelike epic steeped in retrofuturism, deep simulation, and swathes of sentient plants. Come inhabit an exotic world and chisel through layers of thousand-year-old civilizations. Decide: is it a dying earth, or is it on the verge of rebirth?Who are you?Play the role of a mutant indigenous to the salt-spangled dunes and jungles of Qud, or play a pure-strain descendant from one of the few remaining eco-domes&#x2014;the toxic arboreta of Ekuemekiyye, the Holy City; the ice-sheathed arcology of Ibul; or the crustal mortars of Yawningmoon.You arrive at the oasis-hamlet of Joppa, along the far rim of Moghra&apos;yi, the Great Salt Desert. All around you, moisture farmers tend to groves of viridian watervine. There are huts wrought from rock salt and brinestalk. On the horizon, Qud&apos;s jungles strangle chrome steeples and rusted archways to the earth. Further and beyond, the fabled Spindle rises above the fray and pierces the cloud-ribboned sky.You clutch your rifle, or your vibroblade, or your tattered scroll, or your poisonous stinger, or your hypnotized goat. You approach a watervine farmer&#x2014;he lifts the brim of his straw hat and says, &quot;Live and drink, friend.&quot;What can you do?Anything and everything. Caves of Qud is a deeply simulated, biologically","last_updated":"2017-07-01T12:03:11.995Z","parsed":{"xt":"urn:btih:23578ff6691dd22cfd5c4e0cd2c3c52370367957","dn":"Caves of Qud v2.0.6386.986","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"23578ff6691dd22cfd5c4e0cd2c3c52370367957","infoHashBuffer":{"type":"Buffer","data":[35,87,143,246,105,29,210,44,253,92,78,12,210,195,197,35,112,54,121,87]},"name":"Caves of Qud v2.0.6386.986","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}