{"title":"\nMy Friend Michael (Jackson)_ An Ordinary Friendship With An Extr","magnet":"magnet:?xt=urn:btih:23ba997e6377b4fe0b2ed886db09c1ed191878b7&dn=My+Friend+Michael+%28Jackson%29_+An+Ordinary+Friendship+With+An+Extr&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5774015","seeders":"17","leechers":"9","description":"xx\r\n\r\nMy Friend Michael (Jackson)_ An Ordinary Friendship With An Extraordinary Man by Frank Cascio ePUB eBOOK-ZAK\r\n\r\nEveryone knows Michael Jackson - the myth. This is the revealing true story of Michael Jackson - the man.\r\n\r\nTo Frank Cascio, Michael Jackson was many things - second father, big brother, boss, mentor, and teacher, but most of all he was a friend. Though Cascio was just a few years old when he first met Jackson in 1984, at the peak of the pop star&#x2019;s career, Jackson was at the center of his life for the next twenty-five years, allowing Cascio to observe firsthand the greatest entertainer the world had ever seen. In that time, he became the ultimate Michael Jackson insider, yet remained publicly silent about his experiences. Until now.\r\n\r\nIn My Friend Michael, Cascio refutes the rumors, lies, and accusations that have accumulated over the years, providing a candid look at the Michael Jackson he knew for more than two decades. Offering an uplifting and definitive account of the legend, Cascio details how he grew up alongside Jackson, traveling the world with him on concert tours and eventually working for him. Through this lens, Cascio captures Jackson&#x2019;s most private and tumultuous moments, while also setting the record straight on the entertainer&#x2019;s notorious and misunderstood lifestyle - from his Peter Pan reality and his sexuality to the false allegations against him.\r\n\r\nAs Cascio shows, there was a great deal more to Michael Jackson than the headlines about him have suggested. Cascio reveals his friend in all his complexity, bringing to light his passions and joys as well as his flaws and eccentricities. Including stories about Jackson that have never before been made public, Cascio creates a balanced, human look at the pop star, one that shows Jackson as the very real person he was - a lively friend with an endearingly juvenile sense of humor.\r\n\r\nxx","last_updated":"2017-09-30T12:06:08.188Z","parsed":{"xt":"urn:btih:23ba997e6377b4fe0b2ed886db09c1ed191878b7","dn":"My Friend Michael (Jackson)_ An Ordinary Friendship With An Extr","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"23ba997e6377b4fe0b2ed886db09c1ed191878b7","infoHashBuffer":{"type":"Buffer","data":[35,186,153,126,99,119,180,254,11,46,216,134,219,9,193,237,25,24,120,183]},"name":"My Friend Michael (Jackson)_ An Ordinary Friendship With An Extr","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}