{"title":"The Patch by Chris Turner EPUB","magnet":"magnet:?xt=urn:btih:23f53d9eef870b818410664cac90708473e24edc&dn=The+Patch+by+Chris+Turner+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3101098","seeders":"10","leechers":"7","description":"xx\r\n\r\nThe Patch by Chris Turner EPUB\r\n\r\nBest-selling author Chris Turner brings readers onto the streets of Fort McMurray, showing the myriad ways the oil sands impact our lives and demanding that we ask the question: To both fuel the world and to save it, what do we do about the Patch?\r\n\r\nThe Patch is the story of Fort McMurray and the oil sands in northern Alberta, the world&apos;s second largest proven reserve of oil. But this is no conventional story about the oil business. Rather, it is a portrait of the life cycle of the Patch, showing just how deeply it continues to impact the lives of everyone around the world.\r\n\r\nIn its heyday, the oil sands represented an industrial triumph and the culmination of a century of innovation, experiment, engineering, policy, and finance. Fort McMurray was a boomtown, the centre of a new gold rush, and the oil sands were reshaping the global energy, political, and financial landscapes.\r\n\r\nBut in 2008, a new narrative emerged. As financial markets collapsed and the cold, hard, scientific reality of the Patch&apos;s effect on the environment became clear, the region turned into a boogeyman and a lightning rod for the global movement combating climate change. Suddenly, the streets of Fort McMurray were the front line of a high-stakes collision between two conflicting worldviews - one of industrial triumph and another of environmental stewardship - each backed by major players on the world stage.\r\n\r\nThe Patch is a narrative-driven account of this ongoing conflict. It follows a select group of key characters whose experiences in and with the oil sands overlap in concentric narrative arcs. Through this insightful combination of global perspective and on-the-ground action, The Patch will show how the reach of the oil sands extends to all of us. From Fort Mac to the Bakken shale country of North Dakota, from Houston to London, from Saudi Arabia to the shores of Brazil, the whole world is connected in this enterprise. And it demands that we ask the question: What do we do about the Patch?\r\n\r\nxx","last_updated":"2017-11-05T12:01:35.883Z","parsed":{"xt":"urn:btih:23f53d9eef870b818410664cac90708473e24edc","dn":"The Patch by Chris Turner EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"23f53d9eef870b818410664cac90708473e24edc","infoHashBuffer":{"type":"Buffer","data":[35,245,61,158,239,135,11,129,132,16,102,76,172,144,112,132,115,226,78,220]},"name":"The Patch by Chris Turner EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}