{"title":"The Gatekeepers: How the White House Chiefs of Staff Define...","magnet":"magnet:?xt=urn:btih:245e54128cc142735c8630e61fb3b84ed64f4760&dn=The+Gatekeepers%3A+How+the+White+House+Chiefs+of+Staff+Define...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"1763834","seeders":"55","leechers":"6","description":"The Gatekeepers: How the White House Chiefs of Staff Define Every Presidency - Chris Whipple [epub]\r\n\r\nWhat do Dick Cheney and Rahm Emanuel have in common? Aside from polarizing personalities, both served as chief of staff to the president of the United States &#x2014; as did Donald Rumsfeld, Leon Panetta, and a relative handful of others.\r\n\r\nThe chiefs of staff, often referred to as &quot;the gatekeepers,&quot; wield tremendous power in Washington and beyond; they decide who is allowed to see the president, negotiate with Congress to push POTUS&apos;s agenda, and &#x2014; most crucially &#x2014; enjoy unparalleled access to the leader of the free world. Each chief can make or break an administration, and each president reveals himself by the chief he picks. \r\n\r\nThrough extensive, intimate interviews with all seventeen living chiefs and two former presidents, award-winning journalist and producer Chris Whipple pulls back the curtain on this unique fraternity. In doing so, he revises our understanding of presidential history, showing us how James Baker&#x2019;s expert managing of the White House, the press, and Capitol Hill paved the way for the Reagan Revolution &#x2014; and, conversely, how Watergate, the Iraq War, and even the bungled Obamacare rollout might have been prevented by a more effective chief. \r\n\r\nFilled with shrewd analysis and never-before-reported details, The Gatekeepers offers an essential portrait of the toughest job in Washington","last_updated":"2017-05-24T11:46:20.856Z","parsed":{"xt":"urn:btih:245e54128cc142735c8630e61fb3b84ed64f4760","dn":"The Gatekeepers: How the White House Chiefs of Staff Define...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"245e54128cc142735c8630e61fb3b84ed64f4760","infoHashBuffer":{"type":"Buffer","data":[36,94,84,18,140,193,66,115,92,134,48,230,31,179,184,78,214,79,71,96]},"name":"The Gatekeepers: How the White House Chiefs of Staff Define...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}