{"title":"\n[req] Golden Age and Other Stories by Naomi Novik ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:246a89fa9b8518c6c3c86e1989b2766a09abc01a&dn=%5Breq%5D+Golden+Age+and+Other+Stories+by+Naomi+Novik+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2252244","seeders":"21","leechers":"7","description":"xx\r\n\r\n[req] Golden Age and Other Stories by Naomi Novik ePUB eBOOK-ZAK\r\n\r\nNaomi Novik ended her acclaimed, beloved nine-volume Temeraire series last year with a stunning finale, League of Dragons. Fans missing their favorite series can now rejoice: Novik returns with Golden Age and Other Stories, an original Temeraire collection as unique as the world she has created, with each tale inspired by an accompanying piece of fan art. In addition to the wonderful stories, the book contains over thirty brand-new illustrations.\r\n\r\nThe Temeraire novels provide a window into an alternate nineteenth century populated with Novik&#x2019;s own richly human and unforgettably draconic characters as they adventure alongside well-known historical figures. That tradition continues here. Readers will delight at appearances by fan-favorite characters from the series and historical figures like the famed explorer Matteo Ricci. In &#x201C;Planting Season,&#x201D; Novik shows us an early glimpse of American dragon John Wampanoag at Boston harbor. &#x201C;Golden Age&#x201D; finds a dragon who believes he remembers being called Celeste hatch from a shipwreck-tossed crate onto an island where he meets others of his kind. But other famous fictional characters are to be discovered here as well. Readers will certainly recognize a certain Miss Bennet (here Captain Bennet) and her suitor, Mr. Darcy, in &#x201C;Dragons and Decorum.&#x201D;\r\n\r\nFilled with the inventive world-building, rich detail, sparkling wit, and deep emotion that readers have come to expect from Novik&#x2019;s work, Golden Age and Other Stories is a treasure at home on any Temeraire-lover&#x2019;s bookshelf.\r\n\r\nxx","last_updated":"2017-10-07T12:06:33.012Z","parsed":{"xt":"urn:btih:246a89fa9b8518c6c3c86e1989b2766a09abc01a","dn":"[req] Golden Age and Other Stories by Naomi Novik ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"246a89fa9b8518c6c3c86e1989b2766a09abc01a","infoHashBuffer":{"type":"Buffer","data":[36,106,137,250,155,133,24,198,195,200,110,25,137,178,118,106,9,171,192,26]},"name":"[req] Golden Age and Other Stories by Naomi Novik ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}