{"title":"The Politically Incorrect Guide to Communism by Paul Kengor MOBI","magnet":"magnet:?xt=urn:btih:2484cbb18953f01ae2c95fd10ced031aae0e3fff&dn=The+Politically+Incorrect+Guide+to+Communism+by+Paul+Kengor+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2605779","seeders":"5","leechers":"10","description":"xx\r\n\r\nThe Politically Incorrect Guide to Communism by Paul Kengor MOBI\r\n\r\nThe worst idea in history is back!\r\n\r\nCommunism has wrecked national economies, enslaved whole peoples, and killed more than a hundred million men and women. What&apos;s not to like?\r\n\r\nToo many young Americans are supporting communism. Millennials prefer socialism to capitalism, and 25 percent have a positive view of Lenin. One in four Americans believe that George W. Bush killed more people than Joseph Stalin. And 69 percent of millennials would vote for a socialist for president.\r\n\r\nThey ought to know better. Communism is the most dangerous idea in world history, producing dire poverty, repression, and carnage wherever it has been tried. And no wonder - because communism flatly denies morality, human nature, and basic facts. But it&apos;s always going to be different this time.\r\n\r\nRenowned scholar and best-selling author Paul Kengor unmasks communism, exposing its blood-drenched history and the strange sway it has long exercised over much of American media and education. He reveals:\r\n\r\nStalin alone killed six times as many people as Hitler\r\nThe Khmer Rouge slaughtered more than a third of the population of Cambodia\r\nCommunists in Eastern Europe and worldwide tortured Christians\r\nCommunist Party USA (CPUSA) was directly controlled by the Soviets\r\nObama&apos;s CIA director voted for the CPUSA candidate for president in 1980\r\nUnrepentant 60s-era communists are educating American teachers today\r\n\r\nThe Politically Incorrect Guide to Communism debunks the world&apos;s worst ideology, sounds the alarm about its disturbing popular resurgence, and arms you with facts you need to refute its appeal.\r\n\r\nxx","last_updated":"2017-12-22T12:03:58.420Z","parsed":{"xt":"urn:btih:2484cbb18953f01ae2c95fd10ced031aae0e3fff","dn":"The Politically Incorrect Guide to Communism by Paul Kengor MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2484cbb18953f01ae2c95fd10ced031aae0e3fff","infoHashBuffer":{"type":"Buffer","data":[36,132,203,177,137,83,240,26,226,201,95,209,12,237,3,26,174,14,63,255]},"name":"The Politically Incorrect Guide to Communism by Paul Kengor MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}