{"title":"I Can't Make This Up_ Life Lessons by Kevin Hart ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:250f874ff8fd42f2f94adcdab32a73112a49061d&dn=I+Can%27t+Make+This+Up_+Life+Lessons+by+Kevin+Hart+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7802481","seeders":"11","leechers":"7","description":"xx\r\n\r\nI Can&apos;t Make This Up_ Life Lessons by Kevin Hart ePUB eBOOK-ZAK\r\n\r\nSuperstar comedian and Hollywood box-office star Kevin Hart turns his immense talent to the written word by writing some words. Some of those words include: the, a, for, above, and even even. Put them together and you have the funniest, most heartfelt, and most inspirational memoir on survival, success, and the importance of believing in yourself since Old Yeller.\r\n\r\nIt begins in North Philadelphia. He was born an accident, unwanted by his parents. His father was a drug addict who was in and out of jail. His brother was a crack dealer and petty thief. And his mother was overwhelmingly strict, beating him with belts, frying pans, and his own toys.\r\n\r\nThe odds, in short, were stacked against our young hero, just like the odds that are stacked against the release of a new book in this era of social media (where Hart has a following of over 100 million, by the way).\r\n\r\nBut Kevin Hart, like Ernest Hemingway, J.K. Rowling, and Chocolate Droppa before him, was able to defy the odds and turn it around. In his literary debut, he takes the reader on a journey through what his life was, what it is today, and how he&apos;s overcome each challenge to become the man he is today.\r\n\r\nAnd that man happens to be the biggest comedian in the world, with tours that sell out football stadiums and films that have collectively grossed over $3.5 billion.\r\n\r\nHe achieved this not just through hard work, determination, and talent: It was through his unique way of looking at the world. Because just like a book has chapters, Hart sees life as a collection of chapters that each person gets to write for himself or herself.\r\n\r\n&quot;Not only do you get to choose how you interpret each chapter, but your interpretation writes the next chapter,&quot; he says. &quot;So why not choose the interpretation that serves your life the best?&quot;\r\n\r\nxx","last_updated":"2017-08-29T12:04:16.874Z","parsed":{"xt":"urn:btih:250f874ff8fd42f2f94adcdab32a73112a49061d","dn":"I Can't Make This Up_ Life Lessons by Kevin Hart ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"250f874ff8fd42f2f94adcdab32a73112a49061d","infoHashBuffer":{"type":"Buffer","data":[37,15,135,79,248,253,66,242,249,74,220,218,179,42,115,17,42,73,6,29]},"name":"I Can't Make This Up_ Life Lessons by Kevin Hart ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}