{"title":"FuckingMachines--FM-41903 Kira Noir Hi Pics","magnet":"magnet:?xt=urn:btih:2589f65a7bbece1d69a4e9ed53e0160505f27602&dn=FuckingMachines--FM-41903+Kira+Noir+Hi+Pics&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"merzedes","categoryP":"porn","categoryS":"movie_clips","size":"403383767","seeders":"2","leechers":"2","description":"\r\n\r\nYoung and Athletic Ebony Bombshell Gets an Anal Machine-Fucking\r\n\r\nJun 7, 2017 - Kira Noir \r\n\r\n\r\nHi MP4 + Pics.\r\n\r\n\r\nIt is rare treat to have a stunning, all-natural, athletic, ebony hottie grace Fucking Machines with their slutty presence. Kira Noir triumphantly returns and gets machine-fucked until her eyes roll back and she collapses to the floor. She first strips out of a slim red dress, leaving only her sexy high heels on as she strokes and pleasures herself with a Hitachi. Her toned body flexes and contracts as one orgasms flows into the next in an endless waves of erotic vibrator ecstasy. She moans and begs for more. And more is what Kira gets. To show off her stunning body she contorts into a spectacular doggie style posture. Her ass points upward and her lower back sways as the machines dildo slowly warms her up. Instantly the vaginal penetration arouses her and her muscles begin to quiver. Kira begs for the speed to increase and the machine complies. Soon she is being slammed harder and faster than any man as ever fucked her before. Her all-natural small tits shake and her nipples stiffen as machine ceaselessly fucks her tiny pussy over and over. After she can&apos;t possibly handle another orgasm while being fucked from behind, she rolls over and lets the machine have its way with her while she lays on her back. At this point all she can do is sit back and let the machine take her on the ride of her life. She spreads her pussy wide open and the huge dildo exposes her perfect pink cunt and makes her pussy juices coat the machine with a sheen of sexual ecstasy. But this isn&apos;t enough for Kira. She needs more and offers her tight asshole to the power of the fucking machine. The dildo pounds her asshole and shakes her round ass in perfect rhythm with the pulse of the machine. The deep anal probing stimulates her G-spot while she lays on her perfect and flat abdomen. She cums again and again and begs for more. Her asshole is hungry and has never been fucked like this before. Her back arches in ecstatic release and with a hushed scream she submits one last time to the power of the machine. When she simply can&apos;t handle even one more orgasm she collapses in a pool of her own pussy juices and purrs with delight. Kira Noir is a divine sex-kitten that loves Fucking Machines!! \r\n\r\nScreens <a href=\"\nhttps://www.kink.com/shoot/41903\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.kink.com/shoot/41903</a>\r\n <a href=\"\nhttps://s29.pixxxels.org/6hqchkybr/FM_-_Jun_07_2017_-_Kira_Noir_41903_.mp4_thumbs.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s29.pixxxels.org/6hqchkybr/FM_-_Jun_07_2017_-_Kira_Noir_41903_.mp4_thumbs.jpg</a>\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n23 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n\r\n1337X FAQ: http://i.xomf.com/gdqkv.jpg\r\n\r\nThePirateBay FAQ: http://i.xomf.com/hgyrj.jpg\r\n\r\nCheers :-)","last_updated":"2017-07-29T12:00:59.784Z","parsed":{"xt":"urn:btih:2589f65a7bbece1d69a4e9ed53e0160505f27602","dn":"FuckingMachines--FM-41903 Kira Noir Hi Pics","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2589f65a7bbece1d69a4e9ed53e0160505f27602","infoHashBuffer":{"type":"Buffer","data":[37,137,246,90,123,190,206,29,105,164,233,237,83,224,22,5,5,242,118,2]},"name":"FuckingMachines--FM-41903 Kira Noir Hi Pics","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}