{"title":"Win Bigly by Scott Adam","magnet":"magnet:?xt=urn:btih:25c82a57073fd79512a7ac5e16cba5f363a11906&dn=Win+Bigly+by+Scott+Adam&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4744627","seeders":"20","leechers":"7","description":"xx\r\n\r\nWin Bigly by Scott Adams MOBI\r\n\r\n&quot;If you watched the entire election cycle and concluded that Trump was nothing but a lucky clown, you missed one of the most important perceptual shifts in the history of humankind. I&apos;ll fix that for you in this book.&quot;\r\n\r\nAdams was one of the earliest public figures to predict Trump&apos;s win, doing so a week after Nate Silver put Trump&apos;s odds at 2 percent in his FiveThirtyEight.com blog. The mainstream media regarded Trump as a novelty and a sideshow. But Adams recognized in Trump a level of persuasion you only see once in a generation.\r\n\r\nTrump triggered massive cognitive dissonance and confirmation bias on both the left and the right. We&apos;re hardwired to respond to emotion, not reason. We might listen to 10 percent of a speech - a hand gesture here, a phrase there - and if the right buttons are pushed, we decide we agree with the speaker and invent reasons to justify that decision after the fact.\r\n\r\nThe point isn&apos;t whether Trump was right or wrong, good or bad. Win Bigly goes beyond politics to look at persuasion tools that can work in any setting - the same ones Adams saw in Steve Jobs when he invested in Apple decades ago. For instance:\r\n\r\nIf you need to convince people that something is important, make a claim that&apos;s directionally accurate but has a big exaggeration in it. Everyone will spend endless hours talking about how wrong it is and will remember the issue as high priority.\r\n\r\nStop wasting time on elaborate presentation preparations. In this book you&apos;ll learn which components of your messaging matter and where you can wing it.\r\n\r\nPlanting simple, sticky ideas (such as &quot;Crooked Hillary&quot;) is more powerful than stating facts. Just find a phrase without previous baggage that grabs your audience at an emotional level.\r\n\r\nAdams offers nothing less than &quot;access to the admin passwords to human beings&quot;. This is a must-read if you care about persuading others in any field - or if you just want to resist the tactics of emotional persuasion when they&apos;re used on you.\r\n\r\nxx","last_updated":"2017-11-05T12:01:39.017Z","parsed":{"xt":"urn:btih:25c82a57073fd79512a7ac5e16cba5f363a11906","dn":"Win Bigly by Scott Adam","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"25c82a57073fd79512a7ac5e16cba5f363a11906","infoHashBuffer":{"type":"Buffer","data":[37,200,42,87,7,63,215,149,18,167,172,94,22,203,165,243,99,161,25,6]},"name":"Win Bigly by Scott Adam","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}