{"title":"Tippi Hedren - Tippi 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:25e0841358d5e12f0c4eb63bf9c0c665a6d09a03&dn=Tippi+Hedren+-+Tippi+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9327149","seeders":"0","leechers":"0","description":"xx\r\n\r\nTippi Hedren - Tippi 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn this absorbing and surprising memoir, one of the biggest names of classic Hollywood - the star of Alfred Hitchcock&apos;s The Birds and Marnie - tells her story, including never-before-revealed experiences on the sets of some of the biggest cult films of all time.\r\n\r\nFor decades Tippi Hedren&apos;s luminous beauty radiated from the silver screen, enchanting moviegoers and cementing her position among Hollywood&apos;s elite - beauty and star power that continue to endure. For too long Hedren&apos;s story has been told by others through whispered gossip and tabloid headlines. Now Hedren sets the record straight, recalling how a young and virtuous Lutheran girl from small-town Minnesota became a worldwide legend as one of the most famous Hitchcock girls, as an unwavering animal activist, and as the matriarch of a powerful Hollywood dynasty that includes her movie star daughter Melanie Griffith and rising star Dakota Johnson, her granddaughter.\r\n\r\nFor the first time, Hedren digs deep into her complicated relationship with the man who discovered her talent, director Alfred Hitchcock, the benefactor who would become a repulsive and controlling director who contractually controlled her every move. She speaks openly about the dark pain she endured working with him on their most famous collaborations, The Birds and Marnie, and finding the courage she needed to break away.\r\n\r\nHedren&apos;s incandescent spirit shines through as she talks about working with the great Charlie Chaplin, sharing the screen with some of the most esteemed actors in Hollywood, her experiences on some of the most intriguing and troubling film sets - including filming Roar, one of the most dangerous movies ever made - and the struggles of being a single mother balancing her dedication to her work and her devotion to her daughter and her commitment to helping animals.\r\n\r\nxx","last_updated":"2017-07-05T12:00:14.404Z","parsed":{"xt":"urn:btih:25e0841358d5e12f0c4eb63bf9c0c665a6d09a03","dn":"Tippi Hedren - Tippi 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"25e0841358d5e12f0c4eb63bf9c0c665a6d09a03","infoHashBuffer":{"type":"Buffer","data":[37,224,132,19,88,213,225,47,12,78,182,59,249,192,198,101,166,208,154,3]},"name":"Tippi Hedren - Tippi 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}