{"title":"Arun Gandhi - The Gift of Anger 2017 RETAiL ePUB eBOOK-DiSTRiBUT","magnet":"magnet:?xt=urn:btih:2665c71169ee089d6c31703a5551a31006b97205&dn=Arun+Gandhi+-+The+Gift+of+Anger+2017+RETAiL+ePUB+eBOOK-DiSTRiBUT&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"anders","categoryS":"e_books","size":"5690351","seeders":"1","leechers":"3","description":"xx\r\n\r\nArun Gandhi - The Gift of Anger 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nDiscover 10 vital and extraordinary life lessons from one of the most important and influential philosophers and peace activists of the 20th century - Mahatma Gandhi - in this poignant and timely exploration of the true path from anger to peace, as recounted by Gandhi&apos;s grandson, Arun Gandhi. In the current troubled climate, in our country and in the world, these lessons are needed more than ever before.\r\n\r\n&quot;We should not be ashamed of anger. It&apos;s a very good and a very powerful thing that motivates us. But what we need to be ashamed of is the way we abuse it.&quot; (Mahatma Gandhi)\r\n\r\nArun Gandhi was just 12 years old when his parents dropped him off at Sevagram, his grandfather&apos;s famous ashram. To Arun, the man who fought for India&apos;s independence and was the country&apos;s beloved preeminent philosopher and leader was simply a family member. He lived there for two years under his grandfather&apos;s wing until Gandhi&apos;s assassination.\r\n\r\nWhile each chapter contains a singular timeless lesson, The Gift of Anger also takes you along with Arun on a moving journey of self-discovery as he learns to overcome his own struggle to express his emotions and harness the power of anger to bring about good. He learns to see the world through new eyes under the tutelage of his beloved grandfather and provides a rare three-dimensional portrait of this icon for the ages.\r\n\r\nThe 10 vital life lessons strike a universal chord about self-discovery, identity, dealing with anger, depression, loneliness, friendship, and family - perfect for anyone searching for a way to effect healing change in a fractured world.\r\n\r\nxx","last_updated":"2017-07-05T12:01:23.275Z","parsed":{"xt":"urn:btih:2665c71169ee089d6c31703a5551a31006b97205","dn":"Arun Gandhi - The Gift of Anger 2017 RETAiL ePUB eBOOK-DiSTRiBUT","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2665c71169ee089d6c31703a5551a31006b97205","infoHashBuffer":{"type":"Buffer","data":[38,101,199,17,105,238,8,157,108,49,112,58,85,81,163,16,6,185,114,5]},"name":"Arun Gandhi - The Gift of Anger 2017 RETAiL ePUB eBOOK-DiSTRiBUT","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}