{"title":"The Great Influenza_ The Epic Story of the Deadliest Plague in H","magnet":"magnet:?xt=urn:btih:268d0ea0dac4bdb71411435660f31818c114f81c&dn=The+Great+Influenza_+The+Epic+Story+of+the+Deadliest+Plague+in+H&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3573438","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Great Influenza_ The Epic Story of the Deadliest Plague in History by John M. Barry ePUB eBOOK-ZAK\r\n\r\nNo disease the world has ever known even remotely resembles the great influenza epidemic of 1918. Presumed to have begun when sick farm animals infected soldiers in Kansas, spreading and mutating into a lethal strain as troops carried it to Europe, it exploded across the world with unequaled ferocity and speed. It killed more people in 20 weeks than AIDS has killed in 20 years; it killed more people in a year than the plagues of the Middle Ages killed in a century. Victims bled from the ears and nose, turned blue from lack of oxygen, suffered aches that felt like bones being broken, and died. In the United States, where bodies were stacked without coffins on trucks, nearly seven times as many people died of influenza as in the First World War.\r\n\r\nIn his powerful new book, award-winning historian John M. Barry unfolds a tale that is magisterial in its breadth and in the depth of its research, and spellbinding as he weaves multiple narrative strands together. In this first great collision between science and epidemic disease, even as society approached collapse, a handful of heroic researchers stepped forward, risking their lives to confront this strange disease. Titans like William Welch at the newly formed Johns Hopkins Medical School and colleagues at Rockefeller University and others from around the country revolutionized American science and public health, and their work in this crisis led to crucial discoveries that we are still using and learning from today.\r\n\r\nxx","last_updated":"2017-08-13T12:00:19.931Z","parsed":{"xt":"urn:btih:268d0ea0dac4bdb71411435660f31818c114f81c","dn":"The Great Influenza_ The Epic Story of the Deadliest Plague in H","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"268d0ea0dac4bdb71411435660f31818c114f81c","infoHashBuffer":{"type":"Buffer","data":[38,141,14,160,218,196,189,183,20,17,67,86,96,243,24,24,193,20,248,28]},"name":"The Great Influenza_ The Epic Story of the Deadliest Plague in H","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}