{"title":"Never Caught: The Washingtons' Relentless Pursuit of Their Runaw","magnet":"magnet:?xt=urn:btih:2723d04b3b27d5255b08da8ebc4c314d7f022962&dn=Never+Caught%3A+The+Washingtons%27+Relentless+Pursuit+of+Their+Runaw&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"30171750","seeders":"0","leechers":"0","description":"Never Caught: The Washingtons&apos; Relentless Pursuit of Their Runaway Slave, Ona Judge/Erica A.Dunbar/2017/EPUB/\r\n\r\nEnglish|Non-Fiction|ISBN: 1501126393|273pg|28MB\r\n\r\n&#x201C;A fascinating and moving account of a courageous and resourceful woman. Beautifully written and utilizing previously untapped sources it sheds new light both on the father of our country and on the intersections of slavery and freedom.&#x201D; &#x2014;Eric Foner, Pulitzer Prize-winning author of The Fiery Trial and Gateway to Freedom\r\n\r\nA startling and eye-opening look into America&#x2019;s First Family, Never Caught is the powerful narrative of Ona Judge, George and Martha Washington&#x2019;s runaway slave who risked everything to escape the nation&#x2019;s capital and reach freedom.\r\n\r\nWhen George Washington was elected president, he reluctantly left his beloved Mount Vernon to serve in Philadelphia, the temporary seat of the nation&#x2019;s capital. In setting up his household he took Tobias Lear, his celebrated secretary and eight slaves, including Ona Judge, about whom little has been written.\r\n\r\nAs he grew accustomed to Northern ways, there was one change he couldn&#x2019;t get his arms around: Pennsylvania law required enslaved people be set free after six months of residency in the state. Rather than comply, Washington decided to circumvent the law. Every six months he sent the slaves back down south just as the clock was about to expire.\r\n\r\nThough Ona Judge lived a life of relative comfort, the few pleasantries she was afforded were nothing compared to freedom, a glimpse of which she encountered first-hand in Philadelphia.\r\n\r\nSo, when the opportunity presented itself, Judge left everything she knew to escape to New England. Yet freedom would not come without its costs.\r\n\r\nAt just twenty-two-years-old, Ona became the subject of an intense manhunt led by George Washington, who used his political and personal contacts to recapture his property.\r\n\r\nWith impeccable research, historian Erica Armstrong Dunbar weaves a powerful tale and offers fascinating new scholarship on how one young woman risked it all to gain freedom from the famous founding father","last_updated":"2017-06-24T12:00:23.908Z","parsed":{"xt":"urn:btih:2723d04b3b27d5255b08da8ebc4c314d7f022962","dn":"Never Caught: The Washingtons' Relentless Pursuit of Their Runaw","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2723d04b3b27d5255b08da8ebc4c314d7f022962","infoHashBuffer":{"type":"Buffer","data":[39,35,208,75,59,39,213,37,91,8,218,142,188,76,49,77,127,2,41,98]},"name":"Never Caught: The Washingtons' Relentless Pursuit of Their Runaw","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}