{"title":"Blind Man's Bluff_ The Untold Story Of American Submarine Espion","magnet":"magnet:?xt=urn:btih:272934439cb3848a75429f0b4464ae77406ff39d&dn=Blind+Man%27s+Bluff_+The+Untold+Story+Of+American+Submarine+Espion&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5938353","seeders":"23","leechers":"8","description":"xx\r\n\r\nBlind Man&apos;s Bluff_ The Untold Story Of American Submarine Espionage by Christopher Drew and Sherry Sontag ePUB eBOOK-ZAK\r\n\r\nNo espionage missions have been kept more secret than those involving American submarines. Now, Blind Man&apos;s Bluff shows for the first time how the navy sent submarines wired with self-destruct charges into the heart of Soviet seas to tap crucial underwater telephone cables. It unveils how the navy&apos;s own negligence might have been responsible for the loss of the USS Scorpion, a submarine that disappeared, all hands lost, 30 years ago. It tells the complete story of the audacious attempt to steal a Soviet submarine with the help of eccentric billionaire Howard Hughes and how it was doomed from the start. And it reveals how the navy used the comforting notion of deep-sea rescue vehicles to hide operations that were more James Bond than Jacques Cousteau.\r\n\r\nBlind Man&apos;s Bluff contains an unforgettable array of characters, including the cowboy sub commander who brazenly outraced torpedoes and couldn&apos;t resist sneaking up to within feet of unaware enemy subs. It takes us inside clandestine Washington meetings where top submarine captains briefed presidents and where the espionage war was planned one sub and one dangerous encounter at a time. Stretching from the years immediately after World War II to the operations of the Clinton administration, it is an epic story of daring and deception. A magnificent achievement in investigative reporting, it feels like a spy thriller but with one important difference: Everything in it is true.\r\n\r\nxx","last_updated":"2017-09-07T12:01:59.555Z","parsed":{"xt":"urn:btih:272934439cb3848a75429f0b4464ae77406ff39d","dn":"Blind Man's Bluff_ The Untold Story Of American Submarine Espion","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"272934439cb3848a75429f0b4464ae77406ff39d","infoHashBuffer":{"type":"Buffer","data":[39,41,52,67,156,179,132,138,117,66,159,11,68,100,174,119,64,111,243,157]},"name":"Blind Man's Bluff_ The Untold Story Of American Submarine Espion","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}