{"title":"The New Worlds of Thomas Robert Malthus: Rereading the...","magnet":"magnet:?xt=urn:btih:27630707b16b5cf30a84147010afb7c959dfa03a&dn=The+New+Worlds+of+Thomas+Robert+Malthus%3A+Rereading+the...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"6056266","seeders":"0","leechers":"0","description":"The New Worlds of Thomas Robert Malthus: Rereading the Principle of Population - Alison Bashford, Joyce E. Chaplin [epub]\r\n\r\nThe New Worlds of Thomas Robert Malthus is a sweeping global and intellectual history that radically recasts our understanding of Malthus&apos;s Essay on the Principle of Population, the most famous book on population ever written or ever likely to be. Malthus&apos;s Essay is also persistently misunderstood. First published anonymously in 1798, the Essay systematically argues that population growth tends to outpace its means of subsistence unless kept in check by factors such as disease, famine, or war, or else by lowering the birth rate through such means as sexual abstinence.\r\n\r\nChallenging the widely held notion that Malthus&apos;s Essay was a product of the British and European context in which it was written, Alison Bashford and Joyce Chaplin demonstrate that it was the new world, as well as the old, that fundamentally shaped Malthus&apos;s ideas. They explore what the Atlantic and Pacific new worlds&#x2015;from the Americas and the Caribbean to New Zealand and Tahiti&#x2015;meant to Malthus, and how he treated them in his Essay. Bashford and Chaplin reveal how Malthus, long vilified as the scourge of the English poor, drew from his principle of population to conclude that the extermination of native populations by European settlers was unjust.\r\n\r\nElegantly written and forcefully argued, The New Worlds of Thomas Robert Malthus relocates Malthus&apos;s Essay from the British economic and social context that has dominated its reputation to the colonial and global history that inspired its genesis.\r\n\r\nHardcover: 368 pages\r\nPublisher: Princeton University Press (April 26, 2016)","last_updated":"2017-07-27T12:00:33.524Z","parsed":{"xt":"urn:btih:27630707b16b5cf30a84147010afb7c959dfa03a","dn":"The New Worlds of Thomas Robert Malthus: Rereading the...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"27630707b16b5cf30a84147010afb7c959dfa03a","infoHashBuffer":{"type":"Buffer","data":[39,99,7,7,177,107,92,243,10,132,20,112,16,175,183,201,89,223,160,58]},"name":"The New Worlds of Thomas Robert Malthus: Rereading the...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}