{"title":"\nFantasyMassage - August Ames, Uma Jolie (A Taxing Massage Aftern","magnet":"magnet:?xt=urn:btih:288abc7b5d9d835b7e8cf516edd0e9f9eca6e713&dn=FantasyMassage+-+August+Ames%2C+Uma+Jolie+%28A+Taxing+Massage+Aftern&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"388193522","seeders":"0","leechers":"0","description":"Client August Ames is getting her taxes done when masseur Bill Bailey rings her doorbell. She invites him inside and introduces him to her beautiful bookkeeper Uma Jolie. Bill shakes Uma&apos;s hand and follows the leggy brunette August outside to the patio. He sets up his table as she gets undressed. She takes off her see-through lace bodysuit and lies on the portable table. Bill compliments her flawless body as he warms up her back. He massages her ass and strokes her pussy. August laughs appreciatively that she hired the right massage therapist; he is zoning in on her needs. He applies oil to her hairless pussy lips and fingers her hole. Uma calls out to August to check on something important but August refuses to go inside. She whips out Bill&apos;s cock and starts to blow him. Uma interrupts them again and August goes inside butt naked to tend to business. Uma is confused as to why the masseur is naked too. While August makes them coffee, Uma chats with Bill. She asks him for a shoulder massage in the meantime. He repeated bumps into her with his dick until Uma decides to take care of it herself. She gives him a blowjob. August returns with the coffee and joins Uma between Bill&apos;s legs. August gets onto all fours and Uma spreads her ass cheeks for Bill to penetrate her pussy. He fucks her hard. Once August cums, Uma takes a ride on his joystick. Bill switches back to fucking August while Uma rubs her clit. He pummels Uma&apos;s pussy in missionary position till he cums all over August&apos;s big tits!\r\nCategories Oil, Big Tits, Brunette, Blowjob, Facial, Deepthroat, Threesome, Hardcore, Cum On Tits, Fingering\r\n <a href=\"\nhttp://img.imgdone.com/image/pWPZU\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/pWPZU</a>\r\n <a href=\"\nhttp://img.imgdone.com/image/pWkn2\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/pWkn2</a>","last_updated":"2017-10-04T12:00:51.501Z","parsed":{"xt":"urn:btih:288abc7b5d9d835b7e8cf516edd0e9f9eca6e713","dn":"FantasyMassage - August Ames, Uma Jolie (A Taxing Massage Aftern","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"288abc7b5d9d835b7e8cf516edd0e9f9eca6e713","infoHashBuffer":{"type":"Buffer","data":[40,138,188,123,93,157,131,91,126,140,245,22,237,208,233,249,236,166,231,19]},"name":"FantasyMassage - August Ames, Uma Jolie (A Taxing Massage Aftern","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}