{"title":"C++17 STL Cookbook by Jacek Galowicz(2017) - PDF - zeke23","magnet":"magnet:?xt=urn:btih:28912e8cdf2c9f111ddc22e609250394ea8143f3&dn=+C%2B%2B17+STL+Cookbook+by+Jacek+Galowicz%282017%29+-+PDF+-+zeke23&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"11808426","seeders":"36","leechers":"5","description":"[IMG]https://coderprog.com/wp-content/cover/c17-stl-cookbook.jpg[/IMG]\r\n C++17 STL Cookbook by Jacek Galowicz(2017) - PDF - zeke23\r\nEnglish | 2017 | ISBN: 1787120495 | 532 Pages | PDF (conv) | 12 MB\r\n\r\nOver 90 recipes that leverage the powerful features of the Standard Library in C++17\r\nC++ has come a long way and is in use in every area of the industry. Fast, efficient, and flexible, it is used to solve many problems. The upcoming version of C++ will see programmers change the way they code. If you want to grasp the practical usefulness of the C++17 STL in order to write smarter, fully portable code, then this book is for you.\r\nBeginning with new language features, this book will help you understand the language&#x2019;s mechanics and library features, and offers insight into how they work. Unlike other books, ours takes an implementation-specific, problem-solution approach that will help you quickly overcome hurdles. You will learn the core STL concepts, such as containers, algorithms, utility classes, lambda expressions, iterators, and more, while working on practical real-world recipes. These recipes will help you get the most from the STL and show you how to program in a better way.\r\nBy the end of the book, you will be up to date with the latest C++17 features and save time and effort while solving tasks elegantly using the STL.\r\nWhat You Will Learn\r\n\r\n    Learn about the new core language features and the problems they were intended to solve\r\n    Understand the inner workings and requirements of iterators by implementing them\r\n    Explore algorithms, functional programming style, and lambda expressions\r\n    Leverage the rich, portable, fast, and well-tested set of well-designed algorithms provided in the STL\r\n    Work with strings the STL way instead of handcrafting C-style code\r\n    Understand standard support classes for concurrency and synchronization, and how to put them to work\r\n    Use the filesystem library addition available with the C++17 STL","last_updated":"2017-07-30T12:03:40.442Z","parsed":{"xt":"urn:btih:28912e8cdf2c9f111ddc22e609250394ea8143f3","dn":" C  17 STL Cookbook by Jacek Galowicz(2017) - PDF - zeke23","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"28912e8cdf2c9f111ddc22e609250394ea8143f3","infoHashBuffer":{"type":"Buffer","data":[40,145,46,140,223,44,159,17,29,220,34,230,9,37,3,148,234,129,67,243]},"name":" C  17 STL Cookbook by Jacek Galowicz(2017) - PDF - zeke23","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}