{"title":"An Uncommon History of Common Things Vol 1+2 (gnv64)","magnet":"magnet:?xt=urn:btih:28d8c0028bc6dc21acbae6145fd02e89fecb7750&dn=An+Uncommon+History+of+Common+Things+Vol+1%2B2+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"155724190","seeders":"0","leechers":"15","description":"An Uncommon History of Common Things\r\nNational Geographic | November 2009 | ISBN-10: 1426204205 | ePUB | 110 mb\r\n\r\nSometime about 30,000 years ago, somebody stuck a sharp rock into a split stick&#x2014;and presto! The axe was born. Our inquisitive species just loves tinkering, testing, and pushing the limits, and this delightfully different book is a freewheeling reference to hundreds of customs, notions, and inventions that reflect human ingenuity throughout history.\r\nFrom hand tools to holidays to weapons to washing machines, An Uncommon History of Common Things features hundreds of colorful illustrations, timelines, sidebars, and more as it explores just about every subject under the sun. Who knew that indoor plumbing has been around for 4,600 years, but punctuation, capital letters, and the handy spaces between written words only date back to the Dark Ages? Or that ancient soldiers baked a kind of pizza on their shields&#x2014;when they weren&#x2019;t busy flying kites to frighten their foes?\r\nEvery page of this quirky compendium catalogs something fascinating, surprising, or serendipitous. A lively, incomparably browsable read for history buffs, pop culture lovers, and anyone who relishes the odd and extraordinary details hidden in the everyday, it will inform, amuse, astonish&#x2014;and alter the way you think about the clever creatures we call humans.\r\n\r\n-------------------------------------------\r\n\r\nAn Uncommon History of Common Things Vol. 2\r\nNational Geographic | October 2015 | ISBN-10: 1426215843 | ePUB | 36.9 mb\r\n\r\nThis vivid, engrossing book reveals the fascinating stories behind the objects in your world, what you wear, what you eat, what entertains you, and more. Discover the history behind the world&apos;s tallest skyscrapers, find out when people first started drinking caffeine and why it wakes us up, and learn how GPS came to be. \r\nFor those who loved the first installment of An Uncommon History of Common Things come even more short entries illustrated by full color photos. These incorporate quirky anecdotes about the history of everyday objects, including the personalities and pitfalls along the path to innovation and unusual facts behind things we frequently see and use. Smart, surprising, and informative, this book is the ultimate resource for history and trivia buffs alike. Dive into these entertaining pages and let your curiosity to run wild!\r\n <a href=\"\nhttps://s1.postimg.org/3irsb3s8sv/An_Uncommon_History_of_Common_Things_Vol_1_2.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s1.postimg.org/3irsb3s8sv/An_Uncommon_History_of_Common_Things_Vol_1_2.jpg</a>","last_updated":"2017-10-23T12:01:29.348Z","parsed":{"xt":"urn:btih:28d8c0028bc6dc21acbae6145fd02e89fecb7750","dn":"An Uncommon History of Common Things Vol 1 2 (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"28d8c0028bc6dc21acbae6145fd02e89fecb7750","infoHashBuffer":{"type":"Buffer","data":[40,216,192,2,139,198,220,33,172,186,230,20,95,208,46,137,254,203,119,80]},"name":"An Uncommon History of Common Things Vol 1 2 (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}