{"title":"Sam Horn - Got Your Attention How to Create Intrigue and Connect","magnet":"magnet:?xt=urn:btih:28e1e5cdf5989e566bcc1f182782492aba2bf700&dn=Sam+Horn+-+Got+Your+Attention+How+to+Create+Intrigue+and+Connect&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9533393","seeders":"0","leechers":"0","description":"Sam Horn - Got Your Attention How to Create Intrigue and Connect with Anyone 2015 RETAiL ePub eBOOk-rebOOk\r\n\r\nIn an impatient world of infobesity, people don&apos;t want more information - they want to be intrigued and they want to be intrigued fast. After all, goldfish have longer attention spans than humans - nine seconds to our eight. So, right now, people want to know, &quot;How is this relevant and useful to me? Why are you worth my valuable time, mind, and dime?&quot;\r\n\r\nBestselling author and ace communication strategist Sam Horn reveals her &quot;secret sauce&quot; for truly connecting with people - whether it&apos;s one or one million. Her disruptive eight-stage INTRIGUE process teaches readers how to replace boring, overlong, one-way communications with concise, compelling, mutually rewarding two-way interactions that add value for all involved. This is a must- for executives, entrepreneurs, sales and marketing professionals, nonprofit leaders - anyone who wants to build meaningful relationships with others.\r\n\r\nThe bottom line? If you can&apos;t get people&apos;s favorable attention, you&apos;ll never get their business. The insights and instantly useful ideas here will get smartphones down and eyebrows up - this book has been called How to Win Friends and Influence People for our digital device-driven era. Readers will appreciate these innovative but proven ways to win respect and motivate people to take action now, whether that&apos;s to hire you, refer you, fund you, or say yes to you","last_updated":"2017-07-02T12:00:43.564Z","parsed":{"xt":"urn:btih:28e1e5cdf5989e566bcc1f182782492aba2bf700","dn":"Sam Horn - Got Your Attention How to Create Intrigue and Connect","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"28e1e5cdf5989e566bcc1f182782492aba2bf700","infoHashBuffer":{"type":"Buffer","data":[40,225,229,205,245,152,158,86,107,204,31,24,39,130,73,42,186,43,247,0]},"name":"Sam Horn - Got Your Attention How to Create Intrigue and Connect","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}