{"title":"Psychic Warrior: The Cover-Up of the CIA's Stargate Program","magnet":"magnet:?xt=urn:btih:290d1f940f0290f86d28b03d8f0e7570bfe9229a&dn=Psychic+Warrior%3A+The+Cover-Up+of+the+CIA%27s+Stargate+Program&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"398857","seeders":"70","leechers":"6","description":"Psychic Warrior: The True Story of America&apos;s Foremost Psychic Spy and the Cover-Up of the CIA&apos;s Top-Secret Stargate Program - David Morehouse [epub]\r\n\r\nDavid Morehouse - A highly decorated, exemplary Army officer, special operations infantryman, and elite Airborne Ranger Company Commander. Wounded by machine-gun fire during a training mission, Morehouse began to have inexplicable visions and haunting nighmares - an experience that would redirect his military career and land him in the government&apos;s top-secret Stargate Program. His life would never be the same...\r\n\r\nStargate - For nearly two decades, the United States military intelligence community delved into the dark world of psychic espionage, recruiting a team of psychic spies to serve as &quot;remote viewers,&quot; individuals who used their paranormal gifts to transcend time and space and uncover the highly guarded military secrets of other nations.\r\n\r\nWhen David Morehouse walked through the doors of the Stargate Program, he had little idea what awaited him: a paranormal hell that would bring him to the front lines of some of the most horrific disasters in recent history - and nearly destroy him. In chilling detail, Morehouse describes his psychic espionage work as a remote viewer, from the shattering explosion of Pan Am Flight 103 to the choking smoke of Desert Storm, even further back in time to Hiroshima and the darkest days of Nazi Germany. And more startling yet is his account of the U.S. government, an organization bent on the destructive use of psychic powers - and on stopping the one man who was brave enough to blow the lid off their top-secret Stargate Program.\r\n\r\nPaperback: 310 pages\r\nPublisher: St. Martin&apos;s Paperbacks; Reprint edition (January 15, 1998)","last_updated":"2017-09-05T12:07:08.836Z","parsed":{"xt":"urn:btih:290d1f940f0290f86d28b03d8f0e7570bfe9229a","dn":"Psychic Warrior: The Cover-Up of the CIA's Stargate Program","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"290d1f940f0290f86d28b03d8f0e7570bfe9229a","infoHashBuffer":{"type":"Buffer","data":[41,13,31,148,15,2,144,248,109,40,176,61,143,14,117,112,191,233,34,154]},"name":"Psychic Warrior: The Cover-Up of the CIA's Stargate Program","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}