{"title":"The Ballroom by Anna Hope EPUB","magnet":"magnet:?xt=urn:btih:295e8bd42a0720dbebaad1c64bf8e0d78f29697c&dn=The+Ballroom+by+Anna+Hope+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"399010","seeders":"28","leechers":"2","description":"xx\r\n\r\nThe Ballroom by Anna Hope EPUB\r\n\r\nA searing novel of forbidden love on the Yorkshire moors - &quot;a British version of One Flew Over the Cuckoo&apos;s Nest&quot; (The Times UK) - from the author of the critically acclaimed debut Wake\r\n\r\nEngland, 1911. At Sharston Asylum, men and women are separated by thick walls and barred windows. But on Friday nights, they are allowed to mingle in the asylum&apos;s magnificent ballroom. From its balconies and vaulted ceilings to its stained glass, the ballroom is a sanctuary. Onstage, the orchestra plays Strauss and Debussy while the patients twirl across the gleaming dance floor.\r\n\r\nAmid this heady ambience, John Mulligan and Ella Fay first meet. John is a sure-footed dancer with a clouded, secretive face; Ella is as skittish as a colt, with her knobby knees and flushed cheeks. Despite their grim circumstances, the unlikely pair strikes up a tenuous courtship. During the week he writes letters smuggled to her in secret, unaware that Ella cannot read. She enlists a friend to read them aloud and gains resolve from the force of John&apos;s words, each sentence a stirring incantation. And, of course, there&apos;s always the promise of the ballroom. Then one of them receives an unexpected opportunity to leave Sharston for good.\r\n\r\nAs Anna Hope&apos;s powerful, bittersweet novel unfolds, John and Ella face an agonizing dilemma: whether to cling to familiar comforts or to confront a new world - living apart, yet forever changed.\r\n\r\nxx","last_updated":"2017-10-23T12:01:12.880Z","parsed":{"xt":"urn:btih:295e8bd42a0720dbebaad1c64bf8e0d78f29697c","dn":"The Ballroom by Anna Hope EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"295e8bd42a0720dbebaad1c64bf8e0d78f29697c","infoHashBuffer":{"type":"Buffer","data":[41,94,139,212,42,7,32,219,235,170,209,198,75,248,224,215,143,41,105,124]},"name":"The Ballroom by Anna Hope EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}