{"title":"10% Happier by Dan Harris EPUB","magnet":"magnet:?xt=urn:btih:29cbcdd50d77fa40cde03e96ea98dfeb72d3d67b&dn=10%25+Happier+by+Dan+Harris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"391386","seeders":"40","leechers":"9","description":"xx\r\n\r\n10% Happier by Dan Harris EPUB\r\n\r\nNightline anchor Dan Harris embarks on an unexpected, hilarious, and deeply skeptical odyssey through the strange worlds of spirituality and self-help, and discovers a way to get happier that is truly achievable.\r\n\r\nAfter having a nationally televised panic attack on Good Morning America, Dan Harris knew he had to make some changes. A lifelong nonbeliever, he found himself on a bizarre adventure, involving a disgraced pastor, a mysterious self-help guru, and a gaggle of brain scientists. Eventually, Harris realized that the source of his problems was the very thing he always thought was his greatest asset: the incessant, insatiable voice in his head, which had both propelled him through the ranks of a hyper-competitive business and also led him to make the profoundly stupid decisions that provoked his on-air freak-out.\r\n\r\nWe all have a voice in our head. It&apos;s what has us losing our temper unnecessarily, checking our email compulsively, eating when we&apos;re not hungry, and fixating on the past and the future at the expense of the present. Most of us would assume we&apos;re stuck with this voice that there&apos;s nothing we can do to rein it in but Harris stumbled upon an effective way to do just that. It&apos;s a far cry from the miracle cures peddled by the self-help swamis he met; instead, it&apos;s something he always assumed to be either impossible or useless: meditation. After learning about research that suggests meditation can do everything from lower your blood pressure to essentially rewire your brain, Harris took a deep dive into the underreported world of CEOs, scientists, and even marines who are now using it for increased calm, focus, and happiness.\r\n\r\n10% Happier takes readers on a ride from the outer reaches of neuroscience to the inner sanctum of network news to the bizarre fringes of America&apos;s spiritual scene, and leaves them with a takeaway that could actually change their lives.\r\n\r\nxx","last_updated":"2017-12-09T12:08:46.574Z","parsed":{"xt":"urn:btih:29cbcdd50d77fa40cde03e96ea98dfeb72d3d67b","dn":"10% Happier by Dan Harris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"29cbcdd50d77fa40cde03e96ea98dfeb72d3d67b","infoHashBuffer":{"type":"Buffer","data":[41,203,205,213,13,119,250,64,205,224,62,150,234,152,223,235,114,211,214,123]},"name":"10% Happier by Dan Harris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}