{"title":"Unsubscribe_ How to Kill Email Anxiety .. by Jocelyn Glei EPUB","magnet":"magnet:?xt=urn:btih:2a17d733a9965c0a8d0aa8751e9f36bf2fac5b6d&dn=Unsubscribe_+How+to+Kill+Email+Anxiety+..+by+Jocelyn+Glei+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4325830","seeders":"0","leechers":"0","description":"xx\r\n\r\nUnsubscribe_ How to Kill Email Anxiety .. by Jocelyn Glei EPUB\r\n\r\nThe average person checks email 77 times a day, sends and receives more than 122 email messages a day, and spends 28 percent or more of their workweek managing a constant influx of email. Even when we&apos;re away from work, checking email is the most popular activity we engage in on our mobile devices, outranking even browsing the web or social networks.\r\n\r\nEmail is an incredibly powerful and essential tool for doing our daily work, but it has become a near-constant source of frustration, anxiety, and distraction from our work. We have reached a tipping point where &quot;email overload&quot; is no longer a unique problem - it is everyone&apos;s problem. So how can we solve it?\r\n\r\nWith Unsubscribe, Jocelyn K. Glei, founding editor of Behance&apos;s 99U and author of Manage Your Day-to-Day shows readers how to repair their relationship with email, transforming it from a constant source of distraction into a productive tool again. She explains how and why email is so overwhelming and addicting, and lays out strategies for limiting the energy you spend on email by setting meaningful work goals, clarifying which people and messages truly matter, and creating a daily work routine that aligns with your natural creative rhythms.\r\n\r\nThrough her actionable, thoughtful advice, Glei will help you to:\r\n\r\nStop letting email dictate your mood, your focus, and your to-do list\r\nProcess your inbox efficiently based on what and who really matters to you\r\nDispatch excess email without guilt\r\nCompose messages that get people to take action\r\nDeliver criticism in an effective, considerate way\r\nEstablish boundaries that allow you to engage in more meaningful work.\r\n\r\nWith activities and style checklists, Unsubscribe makes the task of learning how to manage email easy, approachable, and fun. What&apos;s more, by completely transforming the way we relate to our inboxes, it helps us make room in our lives for more meaningful work and more creativity.\r\n\r\nxx","last_updated":"2017-10-27T12:07:13.596Z","parsed":{"xt":"urn:btih:2a17d733a9965c0a8d0aa8751e9f36bf2fac5b6d","dn":"Unsubscribe_ How to Kill Email Anxiety .. by Jocelyn Glei EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2a17d733a9965c0a8d0aa8751e9f36bf2fac5b6d","infoHashBuffer":{"type":"Buffer","data":[42,23,215,51,169,150,92,10,141,10,168,117,30,159,54,191,47,172,91,109]},"name":"Unsubscribe_ How to Kill Email Anxiety .. by Jocelyn Glei EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}