{"title":"A Dog Called Hope_ A Wounded Warrior and the Service Dog Who Sav","magnet":"magnet:?xt=urn:btih:2a7834e79c6f89c072b70ddc83e08b8c09291d23&dn=A+Dog+Called+Hope_+A+Wounded+Warrior+and+the+Service+Dog+Who+Sav&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"31971141","seeders":"1","leechers":"0","description":"xx\r\n\r\nA Dog Called Hope_ A Wounded Warrior and the Service Dog Who Saved Him by Damien Lewis and Jason Morgan ePUB eBOOK-ZAK\r\n\r\nLone Survivor meets Marley &amp; Me in this inspiring buddy memoir of an extraordinary service dog whose enduring love brought a wounded soldier back to life.\r\n\r\nA decade ago Special Forces warrior Jason Morgan parachuted into the Central American jungle on an anti-narcotics raid. He&apos;d served with the famous Night Stalkers on countless such missions. This one turned out very different. Months later he regained consciousness in a US military hospital, with no memory of how he&apos;d gotten there. The first words he heard were from his surgeon, telling him he would never walk again. The determined soldier responded, &quot;Sir, yes, I will.&quot;\r\n\r\nAfter multiple surgeries, unbearable chronic pain, and numerous setbacks, Morgan was finally making progress when his wife left him and their three young sons. He was a single father confined to a wheelchair and tortured by his pain. At this very dark, very low point, Morgan found light: Napal, the black Labrador who would change his life forever.\r\n\r\nA Dog Called Hope is the incredible story of a remarkable service dog who brought a devastated warrior back from the brink. It is the story of one funny, lovable dog&apos;s power to heal a family and teach a wounded man how to be a true father. It is the story of an amazing dog with boundless loyalty who built bridges between his wheelchair-bound battle buddy and the rest of able-bodied humankind. It is the story of how one very special dog gave a man&apos;s life true meaning. Humorous, intensely moving, and uplifting, Jason and Napal&apos;s heartwarming tale will brighten any day and lift every heart.\r\n\r\nxx","last_updated":"2017-08-02T12:01:01.722Z","parsed":{"xt":"urn:btih:2a7834e79c6f89c072b70ddc83e08b8c09291d23","dn":"A Dog Called Hope_ A Wounded Warrior and the Service Dog Who Sav","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2a7834e79c6f89c072b70ddc83e08b8c09291d23","infoHashBuffer":{"type":"Buffer","data":[42,120,52,231,156,111,137,192,114,183,13,220,131,224,139,140,9,41,29,35]},"name":"A Dog Called Hope_ A Wounded Warrior and the Service Dog Who Sav","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}