{"title":"The Toddler Survival Guide (2017) (Epub) Gooner","magnet":"magnet:?xt=urn:btih:2a7c3abaf5d61ea7a291668f42142e0e689e7ecc&dn=The+Toddler+Survival+Guide+%282017%29+%28Epub%29+Gooner&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"13297785","seeders":"0","leechers":"1","description":"The Toddler Survival Guide - Complete Protection from the Whiny Unfed (2017) (Epub) Gooner\r\n\r\nPublisher: Voyageur Press (3 Aug. 2017)\r\nAuthor: Mike Spohr &amp; Heather Spohr\r\nLanguage: English\r\nISBN-10: 0760352194\r\nISBN-13: 9780760352199\r\nASIN: B071WTVCJP\r\n\r\nRaising a toddler and surviving a zombie attack may not seem like very similar experiences on the face of it, but they&apos;re actually much more alike than you realize.\r\n\r\nToddlers and zombies both communicate mainly through groans, clumsily trail after you everywhere you go (especially into the bathroom in the toddler&apos;s case), and--upon entering your life--leave you frazzled, on edge, and deeply sleep deprived.\r\n\r\nThe Toddler Survival Guide is a hilarious parody of Max Brooks&apos;s The Zombie Survival Guide (and survival guides in general) that will leave parents laughing out loud even as it provides practical advice on how they can make it to the other side of toddlerhood intact. Written by parents who have studied toddlers up-close in their natural habitat, the book will cover survival skills including how you can outfit your home to outlast a toddler occupation (baby gate, cabinet locks, wine), how you can subdue an angry toddler (&quot;Elmo&apos;s Song,&quot; mac and cheese, smartphone) and even how you can safely venture out in public together without your toddler--or you--bursting into tears.\r\n\r\nChapters include: Preparing the Home for a Toddler Invasion, Communicating with Your Toddler, Feeding a Toddler, Socializing Your Toddler, Grooming Your Toddler, Venturing into Public with a Toddler, Documenting Your Life with a Toddler, Vacationing with a Toddler, Toddler Entertainment and Birthdays, Surviving Bedtime and Potty Training, Technology and the Toddler, and Parental Self-Preservation","last_updated":"2017-08-09T12:00:59.674Z","parsed":{"xt":"urn:btih:2a7c3abaf5d61ea7a291668f42142e0e689e7ecc","dn":"The Toddler Survival Guide (2017) (Epub) Gooner","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2a7c3abaf5d61ea7a291668f42142e0e689e7ecc","infoHashBuffer":{"type":"Buffer","data":[42,124,58,186,245,214,30,167,162,145,102,143,66,20,46,14,104,158,126,204]},"name":"The Toddler Survival Guide (2017) (Epub) Gooner","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}