{"title":"Lost in Translation by Nicole Mone eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:2accf00a5553454cd86f8b36635b45f6dee68982&dn=Lost+in+Translation+by+Nicole+Mone+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3134211","seeders":"0","leechers":"0","description":"xx\r\n\r\nLost in Translation by Nicole Mones MOBI eBOOK-ZAK\r\n\r\nA novel of searing intelligence and startling originality, Lost in Translation heralds the debut of a unique new voice on the literary landscape. Nicole Mones creates an unforgettable story of love and desire, of family ties and human conflict, and of one woman&apos;s struggle to lose herself in a foreign land - only to discover her home, her heart, herself.\r\n\r\nAt dawn in Beijing, Alice Mannegan pedals a bicycle through the deserted streets. An American by birth, a translator by profession, she spends her nights in Beijing&apos;s smoke-filled bars, and the Chinese men she so desires never misunderstand her intentions. All around her rushes the air of China, the scent of history and change, of a world where she has come to escape her father&apos;s love and her own pain. It is a world in which, each night as she slips from her hotel, she hopes to lose herself forever.\r\n\r\nFor Alice, it began with a phone call from an American archaeologist seeking a translator. And it ended in an intoxicating journey of the heart - one that would plunge her into a nation&apos;s past, and into some of the most rarely glimpsed regions of China. Hired by an archaeologist searching for the bones of Peking Man, Alice joins an expedition that penetrates a vast, uncharted land and brings Professor Lin Shiyang into her life. As they draw closer to unearthing the secret of Peking Man, as the group&apos;s every move is followed, their every whisper recorded, Alice and Lin find shelter in each other, slowly putting to rest the ghosts of their pasts. What happens between them becomes one of the most breathtakingly erotic love stories in recent fiction.\r\n\r\nIndeed, Lost in Translation is a novel about love - between a nation and its past, between a man and a memory, between a father and a daughter. It&apos;s powerful impact confirms the extraordinary gifts of a master storyteller, Nicole Mones.\r\n\r\nxx","last_updated":"2017-09-18T12:03:26.024Z","parsed":{"xt":"urn:btih:2accf00a5553454cd86f8b36635b45f6dee68982","dn":"Lost in Translation by Nicole Mone eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2accf00a5553454cd86f8b36635b45f6dee68982","infoHashBuffer":{"type":"Buffer","data":[42,204,240,10,85,83,69,76,216,111,139,54,99,91,69,246,222,230,137,130]},"name":"Lost in Translation by Nicole Mone eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}