{"title":"Terroir v1.08","magnet":"magnet:?xt=urn:btih:2b10a18aaa6fe9156008f541b248777f35b74b7e&dn=Terroir+v1.08&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"125221630","seeders":"0","leechers":"0","description":"About This Game\r\nTerroir is a 3D tile-based tycoon game where you manage your very own vineyard. In Terroir, you grow a variety of different grape varietals, craft your wine, and expand and manage your Chateau. You&apos;ll also have to deal with factors such as weather and random events, which can either make or break your business.\r\nFeatures\r\nSome of the game&apos;s features and mechanics include:\r\n\r\n    Choose from a selection of different grape varieties, each with their own demands\r\n    Dynamic weather system patterned after the Bordeaux wine region&apos;s climate.\r\n    Each complete playthrough lasts 70 in-game years, but Players can continue playing without contributing to their final score.\r\n    Craft wine through the game&apos;s 4 winemaking processes: Crushing, Fermentation, Pressing and Ageing. Each type of grape needs to be crafted a certain way to achieve the best results, so you&apos;ll have to learn and master each one.\r\n    Start out with a single planting tile, then expand your Chateau to up to 33 tiles, using 6 different tile types. Some tiles affect the ones around it, so placement is key.\r\n    Coming Soon: CHANCE &amp; CIRCUMSTANCE: Terroir&apos;s random event and mission system. Players can open the Mystery Box and choose between CHANCE (a random event that could either have a positive or undesirable outcome) or CIRCUMSTANCE (a mission that a Player completes for rewards, or gets penalized for failing).\r\n    Clean, minimalist design and gorgeous low-poly 3D models.\r\n    Original soundtrack composed and performed by Singapore&apos;s CLARQuinet ensemble.\r\n    Mac and Linux versions to be released in the coming weeks after EA release","last_updated":"2017-08-03T12:00:12.598Z","parsed":{"xt":"urn:btih:2b10a18aaa6fe9156008f541b248777f35b74b7e","dn":"Terroir v1.08","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2b10a18aaa6fe9156008f541b248777f35b74b7e","infoHashBuffer":{"type":"Buffer","data":[43,16,161,138,170,111,233,21,96,8,245,65,178,72,119,127,53,183,75,126]},"name":"Terroir v1.08","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}