{"title":"Man Interrupted_ Why Young Men are Struggling and What We Can Do","magnet":"magnet:?xt=urn:btih:2b324e913c47e9f3220b2fe3570ab07713589429&dn=Man+Interrupted_+Why+Young+Men+are+Struggling+and+What+We+Can+Do&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4051836","seeders":"0","leechers":"0","description":"xx\r\n\r\nMan Interrupted_ Why Young Men are Struggling &amp; What We Can Do About It by Philip Zimbardo ePUB eBOOK-ZAK\r\n\r\nIn 2011, Philip Zimbardo gave a TED Talk called &quot;The Demise of Guys,&quot; which has been viewed by over 1.8 million people. A TED eBook short followed that chronicled how in record numbers men are flaming out academically and failing socially and sexually with women. This new book is an expansion of that brief polemic based on Zimbardo&apos;s observations, research, and the survey that was completed by over 20,000 viewers of the original TED Talk.\r\n\r\nThe premise here is that we are facing a not-so-brave new world; a world in which young men are getting left behind. Philip Zimbardo and Nikita Coulombe say that an addiction to video games and online porn have created a generation of shy, socially awkward, emotionally removed, and risk-averse young men who are unable (and unwilling) to navigate the complexities and risks inherent to real-life relationships, school, and employment. Taking a critical look at a problem that is tearing at families and societies everywhere, Man, Interrupted suggests that our young men are suffering from a new form of &quot;arousal addiction,&quot; and introduce a bold new plan for getting them back on track.\r\n\r\nThe concluding chapters offer a set of solutions that can be affected by different segments of society including schools, parents, and young men themselves.\r\n\r\nFilled with telling anecdotes, results of fascinating research, perceptive analysis, and concrete suggestions for change, Man, Interrupted is a book for our time. It is a book that informs, challenges, and ultimately inspires.\r\n\r\nxx","last_updated":"2017-09-11T12:00:32.689Z","parsed":{"xt":"urn:btih:2b324e913c47e9f3220b2fe3570ab07713589429","dn":"Man Interrupted_ Why Young Men are Struggling and What We Can Do","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2b324e913c47e9f3220b2fe3570ab07713589429","infoHashBuffer":{"type":"Buffer","data":[43,50,78,145,60,71,233,243,34,11,47,227,87,10,176,119,19,88,148,41]},"name":"Man Interrupted_ Why Young Men are Struggling and What We Can Do","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}