{"title":"Chipper Jones - Ballplayer 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:2b9a27a2c75b616bd3b3a2f5bb50e089742dc803&dn=Chipper+Jones+-+Ballplayer+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"21138944","seeders":"3","leechers":"7","description":"xx\r\n\r\nChipper Jones - Ballplayer 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAtlanta Braves third baseman Chipper Jones - one of the greatest switch-hitters in baseball history - shares his remarkable story while capturing the magic nostalgia that sets baseball apart from every other sport.\r\n\r\nBefore Chipper Jones became an eight-time All-Star who amassed Hall of Fame-worthy statistics during a 19-year career with the Atlanta Braves, he was just a country kid from small-town Pierson, Florida. A kid who grew up playing baseball in the backyard with his dad, dreaming that one day he&apos;d be a major league ballplayer.\r\n\r\nWith his trademark candor and astonishing recall, Chipper Jones tells the story of his rise to the MLB ranks and what it took to stay with one organization his entire career in an era of booming free agency. His journey begins with learning the art of switch-hitting and takes off after the Braves made him the number one overall pick in the 1990 draft, setting him on course to become the linchpin of their lineup at the height of their 14-straight division-title run.\r\n\r\nBallplayer takes readers into the clubhouse of the Braves&apos; extraordinary dynasty, from the climax of the World Series championship in 1995 to the last-gasp division win by the 2005 &quot;Baby Braves&quot;, all the while sharing pitch-by-pitch dissections of clashes at the plate with some of the all-time great starters, such as Clemens and Johnson, as well as closers such as Wagner and Papelbon. He delves into his relationships with Bobby Cox and his famous Braves brothers - Maddux, Glavine, Smoltz, among them - and opponents from Cal Ripken Jr. to Barry Bonds. The National League MVP also opens up about his overnight rise to superstardom and the personal pitfalls that came with fame; his spirited rivalry with the New York Mets; his reflections on baseball in the modern era - outrageous money, steroids, and all; and his special last season in 2012.\r\n\r\nxx","last_updated":"2017-07-26T12:01:55.350Z","parsed":{"xt":"urn:btih:2b9a27a2c75b616bd3b3a2f5bb50e089742dc803","dn":"Chipper Jones - Ballplayer 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2b9a27a2c75b616bd3b3a2f5bb50e089742dc803","infoHashBuffer":{"type":"Buffer","data":[43,154,39,162,199,91,97,107,211,179,162,245,187,80,224,137,116,45,200,3]},"name":"Chipper Jones - Ballplayer 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}