{"title":"Becky Bond - Rules for Revolutionaries 2016 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:2bb4cc5a5f33e9c9b2d6ff0a2ab72fa9c19ca5bd&dn=Becky+Bond+-+Rules+for+Revolutionaries+2016+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3551905","seeders":"34","leechers":"3","description":"Becky Bond - Rules for Revolutionaries 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nLessons from the groundbreaking grassroots campaign that helped launch a new political revolution.\r\n\r\nRules for Revolutionaries is a bold challenge to the political establishment and the &quot;rules&quot; that govern campaign strategy.\r\n\r\nIt tells the story of a breakthrough experiment conducted on the fringes of the Bernie Sanders presidential campaign: A technology-driven team empowered volunteers to build and manage the infrastructure to make 75 million calls, launch eight million text messages, and hold more than 100,000 public meetings - in an effort to put Bernie Sanders&apos;s insurgent campaign over the top.\r\n\r\nBond and Exley, digital iconoclasts who have been reshaping the way politics is practiced in America for two decades, have identified 22 rules of &quot;Big Organizing&quot; that can be used to drive social change movements of any kind. And they tell the inside story of one of the most amazing grassroots political campaigns ever run.\r\n\r\nFast-paced, provocative, and profound, Rules for Revolutionaries stands as a liberating challenge to the low expectations and small thinking that dominates too many advocacy, non-profit, and campaigning organizations - and points the way forward to a future where political revolution is truly possible","last_updated":"2017-05-23T19:05:30.838Z","parsed":{"xt":"urn:btih:2bb4cc5a5f33e9c9b2d6ff0a2ab72fa9c19ca5bd","dn":"Becky Bond - Rules for Revolutionaries 2016 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2bb4cc5a5f33e9c9b2d6ff0a2ab72fa9c19ca5bd","infoHashBuffer":{"type":"Buffer","data":[43,180,204,90,95,51,233,201,178,214,255,10,42,183,47,169,193,156,165,189]},"name":"Becky Bond - Rules for Revolutionaries 2016 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}