{"title":"Sallie Krawcheck - Own It 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:2bc3b1fa6ecb623781542feb4114ebd4e935bc2e&dn=Sallie+Krawcheck+-+Own+It+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4625061","seeders":"22","leechers":"2","description":"Sallie Krawcheck - Own It 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA new kind of career playbook for a new era of feminism, offering women a new set of rules for professional success: one that plays to their strengths and builds on the power they already have.\r\n\r\nWeren&apos;t women supposed to have &quot;arrived&quot;? Perhaps with the nation&apos;s first female president, equal pay on the horizon, true diversity in the workplace to come thereafter? Or at least the end of &quot;fat shaming&quot; and &quot;locker room talk&quot;?\r\n\r\nWell, we aren&apos;t quite there yet. But does that mean that progress for women in business has come to a screeching halt? It&apos;s true that the old rules didn&apos;t get us as far as we hoped. But we can go the distance, and we can close the gaps that still exist. We just need a new way.\r\n\r\nIn fact there are many reasons to be optimistic about the future, says former Wall Street powerhouse-turned-entrepreneur Sallie Krawcheck. That&apos;s because the business world is changing fast - driven largely by technology - and it&apos;s changing in ways that give us more power and opportunities than ever, and even more than we yet realize.\r\n\r\nSuccess for professional women will no longer be about trying to compete at the men&apos;s version of the game, she says. And it will no longer be about contorting ourselves to men&apos;s expectations of how powerful people behave. Instead it&apos;s about embracing and investing in our innate strengths as women - and bringing them proudly and unapologetically to work.\r\n\r\nWhen we do, she says, we gain the power to advance in our careers in more natural ways. We gain the power to initiate courageous conversations in the workplace. We gain the power to forge nontraditional career paths, to leave companies that don&apos;t respect our worth and instead go start our own. And we gain the power to invest our economic muscle in making our lives and the world better.\r\n\r\nHere Krawcheck draws on her experiences at the highest levels of business, both as one of the few women at the top rungs of the biggest boy&apos;s club in the world and as an entrepreneur, to show women how to seize this seismic shift in power to take their careers to the next level.\r\n\r\nThis change is real, and it&apos;s coming fast. It&apos;s time to own it","last_updated":"2017-05-23T19:06:20.512Z","parsed":{"xt":"urn:btih:2bc3b1fa6ecb623781542feb4114ebd4e935bc2e","dn":"Sallie Krawcheck - Own It 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2bc3b1fa6ecb623781542feb4114ebd4e935bc2e","infoHashBuffer":{"type":"Buffer","data":[43,195,177,250,110,203,98,55,129,84,47,235,65,20,235,212,233,53,188,46]},"name":"Sallie Krawcheck - Own It 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}