{"title":"Dawn of the New Everything by Jaron Lanier EPUB","magnet":"magnet:?xt=urn:btih:2c2e21c1aab5a6c576cb163f26ebce812ccecf23&dn=Dawn+of+the+New+Everything+by+Jaron+Lanier+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"20304755","seeders":"0","leechers":"0","description":"xx\r\n\r\nDawn of the New Everything by Jaron Lanier EPUB\r\n\r\nIn this captivating book, Jaron Lanier - the father of virtual reality - explains its dazzling possibilities by reflecting on his own lifelong relationship with technology\r\n\r\nBridging the gap between tech mania and the experience of being inside the human body, Dawn of the New Everything is a look at what it means to be human at a moment of unprecedented technological possibility.\r\n\r\nThrough a fascinating look back over his life in technology, Jaron Lanier, an interdisciplinary scientist and father of the term virtual reality, exposes VR&apos;s ability to illuminate and amplify our understanding of our species and gives readers a new perspective on how the brain and body connect to the world. An inventive blend of autobiography, science writing, philosophy, and advice, this book tells the wild story of his personal and professional life as a scientist, from his childhood in the UFO territory of New Mexico to the loss of his mother, the founding of the first start-up, and finally becoming a world-renowned technological guru.\r\n\r\nUnderstanding virtual reality as being both a scientific and a cultural adventure, Lanier demonstrates it to be a humanistic setting for technology. While his previous publications offered a more critical view of social media and other manifestations of technology, in this book he argues that virtual reality can actually make our lives richer and fuller.\r\n\r\nxx","last_updated":"2017-12-10T12:00:58.833Z","parsed":{"xt":"urn:btih:2c2e21c1aab5a6c576cb163f26ebce812ccecf23","dn":"Dawn of the New Everything by Jaron Lanier EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2c2e21c1aab5a6c576cb163f26ebce812ccecf23","infoHashBuffer":{"type":"Buffer","data":[44,46,33,193,170,181,166,197,118,203,22,63,38,235,206,129,44,206,207,35]},"name":"Dawn of the New Everything by Jaron Lanier EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}