{"title":"The Conservative Heart by Arthur C. Brook","magnet":"magnet:?xt=urn:btih:2c68fa7165254c0f2f8b65e3dbef1d349a68561e&dn=The+Conservative+Heart+by+Arthur+C.+Brook&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"889111","seeders":"3","leechers":"5","description":"xx\r\n\r\nThe Conservative Heart by Arthur C. Brooks MOBI\r\n\r\nThe prominent economist and president of the American Enterprise Institute - the leading intellectual think tank on the right - offers a bold new vision for conservatism as a movement for social and economic justice.\r\n\r\nIn The Conservative Heart, Arthur C. Brooks contends that after years of focusing on economic growth and traditional social values, it is time for a new kind of conservatism - one that helps the vulnerable without mortgaging our children&apos;s future. In Brooks&apos; daring vision, this conservative movement fights poverty, promotes equal opportunity, celebrates earned success, and values spiritual enlightenment. It is an inclusive movement with a positive agenda to help people lead happier, more hopeful, and more satisfied lives.\r\n\r\nOne of the country&apos;s leading scholars and policy thinkers, Brooks has considered these issues for decades. Drawing on years of research on the sources of happiness, he asserts that what people most need are four &quot;institutions of meaning&quot; - faith, family, community, and meaningful work. These are not only the foundations of personal well-being but also the necessary means for building a better nation.\r\n\r\nCombining reporting, original research, and case studies, and free of vituperative politics, The Conservative Heart is an intelligent and compelling manifesto for renewal. Clear, well reasoned, and accessible, it is a welcome new strategy for disconsolate conservatives looking for fresh, actionable ideas to address the serious problems confronting us today and to reclaim our future, and it is for politically independent citizens who believe that neither political party addresses their needs or concerns.\r\n\r\nxx","last_updated":"2017-10-31T12:02:54.396Z","parsed":{"xt":"urn:btih:2c68fa7165254c0f2f8b65e3dbef1d349a68561e","dn":"The Conservative Heart by Arthur C. Brook","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2c68fa7165254c0f2f8b65e3dbef1d349a68561e","infoHashBuffer":{"type":"Buffer","data":[44,104,250,113,101,37,76,15,47,139,101,227,219,239,29,52,154,104,86,30]},"name":"The Conservative Heart by Arthur C. Brook","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}