{"title":"Vuze 5.7.5.1 ( +crack)","magnet":"magnet:?xt=urn:btih:2ce8d5ccd8ff0d4ff6be3ca6c360ae79c99abde8&dn=Vuze+5.7.5.1+%28+%2Bcrack%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BYud1n","categoryP":"applications","categoryS":"mac","size":"34677365","seeders":"2","leechers":"5","description":"Torrent files remain one of the fastest way to share large files with your friends over the internet. Vuze is a torrent client that provides support for end-to-end transfers between computers.\r\n\r\nJava based cross-platform BitTorrent client\r\n\r\nVuze requires the Java Runtime Environment and, as a result, you must make sure it is present on your Mac before launching the Vuze installer.\r\n\r\nDuring the installation process, you can customize the app&#x2019;s interface, but you will also encounter installation agreements for third party software, so make sure you read everything carefully before moving forward.\r\n\r\nThe Vuze interface is quite clean and organized: the left side panel enables you to quickly browse your content, while the main area provides information about your torrents.\r\n\r\nLow-key status bar menu for easy and quick access\r\n\r\nMoreover, Vuze comes with a minimalist status bar menu that allows you to access the main window in no time. The same menu offers you the possibility to open a transfers bar window (for easy monitoring) and includes transfers management tools (stop, start, pause, resume).\r\n\r\nFurthermore, Vuze is also capable to open specific magnetic links or torrent files (you can choose to send the torrent files to Vuze directly from your browser) or you can find new content via the built in search bar. Furthermore, you can subscribe to automatically receive notifications about similar content","last_updated":"2017-09-17T12:10:07.688Z","parsed":{"xt":"urn:btih:2ce8d5ccd8ff0d4ff6be3ca6c360ae79c99abde8","dn":"Vuze 5.7.5.1 (  crack)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2ce8d5ccd8ff0d4ff6be3ca6c360ae79c99abde8","infoHashBuffer":{"type":"Buffer","data":[44,232,213,204,216,255,13,79,246,190,60,166,195,96,174,121,201,154,189,232]},"name":"Vuze 5.7.5.1 (  crack)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}