{"title":"The Russian Revolution_ A New History by Sean McMeekin ePUB eBOO","magnet":"magnet:?xt=urn:btih:2d10951f97aaa8496c5ee585a31c830e20418e78&dn=The+Russian+Revolution_+A+New+History+by+Sean+McMeekin+ePUB+eBOO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"beau42m","categoryP":"other","categoryS":"e_books","size":"9194981","seeders":"25","leechers":"16","description":"xx\r\n\r\nThe Russian Revolution_ A New History by Sean McMeekin ePUB eBOOK-ZAK\r\n\r\nIn The Russian Revolution, acclaimed historian Sean McMeekin traces the events that ended Romanov rule, ushered the Bolsheviks into power, and introduced communism to the world.\r\n\r\nBetween 1917 and 1922, Russia underwent a complete and irreversible transformation. Taking advantage of the collapse of the Tsarist regime in the middle of World War I, the Bolsheviks staged a hostile takeover of the Russian Imperial Army, promoting mutinies and mass desertions of men in order to fulfill Lenin&apos;s program of turning the &quot;imperialist war&quot; into civil war. By the time the Bolsheviks had snuffed out the last resistance five years later, over 20 million people had died, and the Russian economy had collapsed so completely that communism had to be temporarily abandoned. Still, Bolshevik rule was secure, owing to the new regime&apos;s monopoly on force, enabled by illicit arms deals signed with capitalist neighbors such as Germany and Sweden, who sought to benefit - politically and economically - from the revolutionary chaos in Russia.\r\n\r\nDrawing on scores of previously untapped files from Russian archives and a range of other repositories in Europe, Turkey, and the United States, McMeekin delivers exciting, groundbreaking research about this turbulent era. The first comprehensive history of these momentous events in two decades, The Russian Revolution combines cutting-edge scholarship and a fast-paced narrative to shed new light on one of the most significant turning points of the 20th century.\r\n\r\nxx","last_updated":"2017-08-07T12:02:12.090Z","parsed":{"xt":"urn:btih:2d10951f97aaa8496c5ee585a31c830e20418e78","dn":"The Russian Revolution_ A New History by Sean McMeekin ePUB eBOO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2d10951f97aaa8496c5ee585a31c830e20418e78","infoHashBuffer":{"type":"Buffer","data":[45,16,149,31,151,170,168,73,108,94,229,133,163,28,131,14,32,65,142,120]},"name":"The Russian Revolution_ A New History by Sean McMeekin ePUB eBOO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}