{"title":"Angel_ How to Invest in Technology Startups by Jason Calacanis e","magnet":"magnet:?xt=urn:btih:2d3ef6a13178a21004a9fa6bee22dde19d9ca2e3&dn=Angel_+How+to+Invest+in+Technology+Startups+by+Jason+Calacanis+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3088151","seeders":"0","leechers":"0","description":"xx\r\n\r\nAngel_ How to Invest in Technology Startups by Jason Calacanis ePUB eBOOK-ZAK\r\n\r\nOne of Silicon Valley&apos;s most successful angel investors shares his rules for investing in start-ups.\r\n\r\nThere are two ways to make money in start-ups: create something valuable - or invest in the people that are creating valuable things.\r\n\r\nOver the past 25 years, Jason Calacanis has made a fortune investing in creators, spotting and helping build and fund a number of successful technology start-ups - investments that have earned him tens of millions of dollars. Now, in this enlightening guide that is sure to become the bible for 21st century investors, Calacanis takes potential angels step by step through his proven method of creating massive wealth: start-ups.\r\n\r\nAs Calacanis makes clear, you can get rich - even if you came from humble beginnings (his dad was a bartender, his mom a nurse), didn&apos;t go to the right schools, and weren&apos;t a top student. The trick is learning how angel investors think. Calacanis takes you inside the minds of these successful moneymen, helping you understand how they prioritize and make the decisions that have resulted in phenomenal profits. He guides you step by step through the process, revealing how leading investors evaluate new ventures, calculating the risks and rewards, and explains how the best start-ups leverage relationships with angel investors for the best results.\r\n\r\nWhether you&apos;re an aspiring investor or a budding entrepreneur, Angel will inspire and educate you on all the ins of outs. Buckle up for a wild ride into the world of angel investing!\r\n\r\nxx","last_updated":"2017-08-09T12:00:25.377Z","parsed":{"xt":"urn:btih:2d3ef6a13178a21004a9fa6bee22dde19d9ca2e3","dn":"Angel_ How to Invest in Technology Startups by Jason Calacanis e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2d3ef6a13178a21004a9fa6bee22dde19d9ca2e3","infoHashBuffer":{"type":"Buffer","data":[45,62,246,161,49,120,162,16,4,169,250,107,238,34,221,225,157,156,162,227]},"name":"Angel_ How to Invest in Technology Startups by Jason Calacanis e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}