{"title":"David Leite - Notes on a Banana 2017 RETAiL ePUB eBOOK-DiSTRiBUT","magnet":"magnet:?xt=urn:btih:2d7a8ea0f924602299a7f5fd48ce9601ac78b529&dn=David+Leite+-+Notes+on+a+Banana+2017+RETAiL+ePUB+eBOOK-DiSTRiBUT&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3308747","seeders":"3","leechers":"2","description":"xx\r\n\r\nDavid Leite - Notes on a Banana 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe stunning and long-awaited memoir from the beloved founder of the James Beard Award-winning website Leite&apos;s Culinaria - a candid, courageous, and at times laugh-out-loud funny story of family, food, mental illness, and sexual identity.\r\n\r\nBorn into a family of Azorean immigrants, David Leite grew up in the 1960s in a devoutly Catholic blue-collar, food-crazed Portuguese home in Fall River, Massachusetts. A clever and determined dreamer with a vivid imagination and a flair for the dramatic, &quot;Banana&quot;, as his mother endearingly called him, obsessed over proper hair care, yearned to live in a middle-class house with a swinging kitchen door like the ones on television, and fell in love with everything French thanks to his Portuguese and French-Canadian godmother. But David also struggled with the emotional devastation of bipolar disorder. Until he was diagnosed in his mid-30s, David found relief from his wild mood swings in cooking, Julia Child, and a Viking stove he named Thor.\r\n\r\nNotes on a Banana is his heartfelt, unflinchingly honest, yet tender memoir of growing up, accepting himself, and turning his love of food into an award-winning career. Reminiscing about the people and events that shaped him, David looks back at the highs and lows of his life, from his rejection of being gay and his attempt to &quot;turn straight&quot; through Aesthetic Realism, a cult in downtown Manhattan, to becoming a writer, cookbook author, and web publisher, to his 23-year relationship with Alan, known to millions of David&apos;s readers and listeners as &quot;The One&quot;, which began with (what else?) food. Woven throughout these stories are the dishes David loves - the tastes that led him to happiness, health, and success.\r\n\r\nxx","last_updated":"2017-07-26T12:01:51.467Z","parsed":{"xt":"urn:btih:2d7a8ea0f924602299a7f5fd48ce9601ac78b529","dn":"David Leite - Notes on a Banana 2017 RETAiL ePUB eBOOK-DiSTRiBUT","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2d7a8ea0f924602299a7f5fd48ce9601ac78b529","infoHashBuffer":{"type":"Buffer","data":[45,122,142,160,249,36,96,34,153,167,245,253,72,206,150,1,172,120,181,41]},"name":"David Leite - Notes on a Banana 2017 RETAiL ePUB eBOOK-DiSTRiBUT","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}