{"title":"Michael Wallis - The Best Land Under Heaven 2017 RETAiL ePUB eBO","magnet":"magnet:?xt=urn:btih:2d80d31a95d8ee06473fa3a0461fe65691fcc028&dn=Michael+Wallis+-+The+Best+Land+Under+Heaven+2017+RETAiL+ePUB+eBO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"29171353","seeders":"0","leechers":"0","description":"xx\r\n\r\nMichael Wallis - The Best Land Under Heaven 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nCutting through 160 years of mythmaking, best-selling historian Michael Wallis presents the ultimate cautionary tale of America&apos;s westward expansion.\r\n\r\n&quot;Westward ho! For Oregon and California!&quot;\r\n\r\nIn the eerily warm spring of 1846, George Donner placed this advertisement in a local newspaper as he and a restless caravan prepared for what they hoped would be the most rewarding journey of a lifetime. But in eagerly pursuing what would a century later become known as the &quot;American dream&quot;, this optimistic yet motley crew of emigrants was met with a chilling nightmare; in the following months, their jingoistic excitement would be replaced by desperate cries for help that would fall silent in the deadly snow-covered mountains of the Sierra Nevada.\r\n\r\nWe know these early pioneers as the Donner Party, a name that has elicited horror since the late 1840s. Now, celebrated historian Michael Wallis - beloved for his myth-busting portraits of legendary American figures - continues his life&apos;s work of parsing fact from fiction to tell the true story of one of the most embroidered sagas in Western history.\r\n\r\nWallis begins the story in 1846, a momentous &quot;year of decision&quot; for the nation, when incredible territorial strides were being made in Texas, New Mexico, and California. Against this dramatic backdrop, an unlikely band of travelers appeared, stratified in age, wealth, education, and ethnicity. At the forefront were the Donners: brothers George and Jacob, true sons of the soil determined to tame the wild land of California; and the Reeds, headed by adventurous, business-savvy patriarch James. In total the Donner-Reed group would reach 87 men, women, and children, and though personal motives varied - bachelors thirsting for adventure, parents wanting greater futures for their children - everyone was linked by the same unwavering belief that California was theirs for the taking.\r\n\r\nSkeptical of previous accounts of how the group ended up in peril, Wallis has spent years retracing its ill-fated journey, uncovering hundreds of new documents that illuminate how a combination of greed, backbiting, and recklessness led the group to become hopelessly snowbound at the infamous Donner Pass in present-day California. Climaxing with the grim stories of how the party&apos;s paltry rations soon gave way to unimaginable hunger, Wallis not only details the cannibalism that has in perpetuity haunted their legacy but also the heroic rescue parties that managed to reach the stranded, only to discover that just 48 had survived the ordeal.\r\n\r\nAn unflinching and historically invaluable account of the darkest side of Manifest Destiny, The Best Land Under Heaven offers a brilliant, revisionist examination of one of America&apos;s most calamitous and sensationalized catastrophes.\r\n\r\nxx","last_updated":"2017-08-14T12:01:24.057Z","parsed":{"xt":"urn:btih:2d80d31a95d8ee06473fa3a0461fe65691fcc028","dn":"Michael Wallis - The Best Land Under Heaven 2017 RETAiL ePUB eBO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2d80d31a95d8ee06473fa3a0461fe65691fcc028","infoHashBuffer":{"type":"Buffer","data":[45,128,211,26,149,216,238,6,71,63,163,160,70,31,230,86,145,252,192,40]},"name":"Michael Wallis - The Best Land Under Heaven 2017 RETAiL ePUB eBO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}