{"title":"American Wolf by Nate Blakeslee EPUB","magnet":"magnet:?xt=urn:btih:2e6393f63b55d2e4ee9d70f7877d79a60fe3e3e8&dn=American+Wolf+by+Nate+Blakeslee+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"629712","seeders":"0","leechers":"0","description":"xx\r\n\r\nAmerican Wolf by Nate Blakeslee EPUB\r\n\r\nThe enthralling story of the rise and reign of O-Six, the celebrated Yellowstone wolf, and the people who loved or feared her.\r\n\r\nBefore men ruled the earth, there were wolves. Once abundant in North America, these majestic creatures were hunted to near extinction in the lower 48 states by the 1920s. But in recent decades, conservationists have brought wolves back to the Rockies, igniting a battle over the very soul of the West.\r\n\r\nWith novelistic detail, Nate Blakeslee tells the gripping story of one of these wolves, O-Six, a charismatic alpha female named for the year of her birth. Uncommonly powerful, with gray fur and faint black ovals around each eye, O-Six is a kind and merciful leader, a fiercely intelligent fighter, and a doting mother. She is beloved by wolf watchers, particularly renowned naturalist Rick McIntyre, and becomes something of a social media star, with followers around the world.\r\n\r\nBut as she raises her pups and protects her pack, O-Six is challenged on all fronts: by hunters who compete with wolves for the elk they both prize; by cattle ranchers who are losing livestock and have the ears of politicians; and by other Yellowstone wolves who are vying for control of the park&apos;s stunningly beautiful Lamar Valley.\r\n\r\nThese forces collide in American Wolf, a riveting multigenerational saga of hardship and triumph that tells a larger story about the ongoing cultural clash in the West - between those fighting for a vanishing way of life and those committed to restoring one of the country&apos;s most iconic landscapes.\r\n\r\nxx","last_updated":"2017-10-24T12:03:47.592Z","parsed":{"xt":"urn:btih:2e6393f63b55d2e4ee9d70f7877d79a60fe3e3e8","dn":"American Wolf by Nate Blakeslee EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2e6393f63b55d2e4ee9d70f7877d79a60fe3e3e8","infoHashBuffer":{"type":"Buffer","data":[46,99,147,246,59,85,210,228,238,157,112,247,135,125,121,166,15,227,227,232]},"name":"American Wolf by Nate Blakeslee EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}