{"title":"Secret Viking Sea Chart: Discovered in Rosslyn Chapel","magnet":"magnet:?xt=urn:btih:2eecfde5ff22f880bf8c4a0a0f349591b398fb8c&dn=Secret+Viking+Sea+Chart%3A+Discovered+in+Rosslyn+Chapel&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"beau42m","categoryP":"other","categoryS":"e_books","size":"3996885","seeders":"76","leechers":"8","description":"Secret Viking Sea Chart: Discovered in Rosslyn Chapel - Ashley Cowie [epub]\r\n\r\nHidden in a chamber beneath Rosslyn Chapel in Scotland, TV Historian Ashley Cowie discovered a unique group of symbols and spent ten years exhaustively deciphering their meaning. After presenting his research at the International Science Festival his discovery was tested by professional scientists at Bradford University who confirmed that he had discovered an extraordinarily rare Viking sea chart.\r\n\r\nRosslyn Chapel was built in the 15th century by Sir William St Clair, a direct descendant of the powerful Viking Rollo who became Duke of Normandy. After exploring the St Clair&apos;s Norse heritage, this highly graphical book deciphers the layers of navigational information encoded into the chart revealing it was constructed following the cartographic methods established by the ancient Greek mathematician Ptolemy around 150 AD. \r\n\r\nNot only does the chart reveal an ancient prime meridian lying dormant in the northern Scottish landscapes, but it also identifies several Viking power bases, including North America, which the Viking&#x2019;s colonised around 1000 CE, five hundred years before Columbus set sail. \r\n\r\nConsidering the chart is carved on a 12th century wall, it might be the oldest cartographic reference to North America ever discovered opening up a fresh and exciting volume in the history of cartography and oceanic navigation","last_updated":"2017-06-05T12:04:07.050Z","parsed":{"xt":"urn:btih:2eecfde5ff22f880bf8c4a0a0f349591b398fb8c","dn":"Secret Viking Sea Chart: Discovered in Rosslyn Chapel","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2eecfde5ff22f880bf8c4a0a0f349591b398fb8c","infoHashBuffer":{"type":"Buffer","data":[46,236,253,229,255,34,248,128,191,140,74,10,15,52,149,145,179,152,251,140]},"name":"Secret Viking Sea Chart: Discovered in Rosslyn Chapel","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}