{"title":"The Future Rice Strategy for India","magnet":"magnet:?xt=urn:btih:2f3de7bf1329a9e6bec1662b7dd26e488b07facb&dn=The+Future+Rice+Strategy+for+India&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"66152198","seeders":"25","leechers":"5","description":"The Future Rice Strategy for India presents forward-looking insights toward achieving sustainable development of the rice sector, ensuring future food and nutritional security. As a staple food for many in India, including the economically disadvantaged, there are many concerns that affect the development of rice sector. Facing issues from environmental demands to economic stagnation, access to food, food inflation, and the Food Security Act (demand &#x2013; supply &#x2013; distribution of rice) achieving sustainability in production and exports is an important and urgent challenge. \r\n\r\nUsing case studies to illustrate existing and potential issues, challenges and solutions, The Future Rice Strategy for India presents key strategic options while considering the implicit consequences. In addition, the findings enrich the strategy and policy formulation considerations for the role of rice in the country.\r\n\r\nThis multidisciplinary approach features the expertise of rice scientists covering different aspects of rice sector; from breeding to consumer preferences and markets and trade.\r\nUses analysis based on agro ecological zones (AEZ) patterns providing understanding of future growth patterns based on rice ecologiesIncludes case studies with proposed solutions taking into consideration pros and cons of each, allowing readers facing similar concerns and issues to identify an appropriate solution more efficiently and effectively","last_updated":"2017-07-06T12:04:26.679Z","parsed":{"xt":"urn:btih:2f3de7bf1329a9e6bec1662b7dd26e488b07facb","dn":"The Future Rice Strategy for India","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2f3de7bf1329a9e6bec1662b7dd26e488b07facb","infoHashBuffer":{"type":"Buffer","data":[47,61,231,191,19,41,169,230,190,193,102,43,125,210,110,72,139,7,250,203]},"name":"The Future Rice Strategy for India","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}