{"title":"All Day by Liza Jessie Peterson EPUB","magnet":"magnet:?xt=urn:btih:2f3d7e5bd64895f98affd0b4ab2c0f7431e360cb&dn=All+Day+by+Liza+Jessie+Peterson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2203788","seeders":"0","leechers":"0","description":"xx\r\n\r\nAll Day by Liza Jessie Peterson EPUB\r\n\r\nAll Day is a behind-the-bars, personal glimpse into the issue of mass incarceration via an unpredictable, insightful, and ultimately hopeful reflection on teaching teens while they await sentencing.\r\n\r\nTold with equal parts raw honesty and unbridled compassion, All Day recounts a year in Liza Jessie Peterson&apos;s classroom at Island Academy, the high school for inmates detained at New York City&apos;s Rikers Island. A poet and an actress who had done occasional workshops at the correctional facility, Peterson was ill prepared for a full-time stint teaching in the GED program for the incarcerated youths. For the first time faced with full days teaching the rambunctious, hyper, and fragile adolescent inmates, &quot;Ms. P&quot; comes to understand the essence of her predominantly black and Latino students as she attempts not only to educate them but to instill them with a sense of self-worth long stripped from their lives.\r\n\r\n&quot;I have quite a spirited group of drama kings, court jesters, flyboy gangsters, tricksters, and wannabe pimps all in my charge, all up in my face, to educate,&quot; Peterson discovers. &quot;Corralling this motley crew of bad-news bears to do any lesson is like running boot camp for hyperactive gremlins. I have to be consistent, alert, firm, witty, fearless, and demanding, and, most important, I have to have strong command of the subject I&apos;m teaching.&quot; Discipline is always a challenge, with the students spouting street-infused backtalk and often bouncing off the walls with pent-up testosterone. Peterson learns quickly that she must keep the upper hand - set the rules and enforce them with rigor, even when her sympathetic heart starts to waver.\r\n\r\nDespite their relentless bravura and antics - and in part because of it - Peterson becomes a fierce advocate for her students. She works to instill the young men, mostly black, with a sense of pride about their history and culture, from their African roots to Langston Hughes and Malcolm X. She encourages them to explore and express their true feelings by writing their own poems and essays. When the boys push her buttons (on an almost daily basis), she pushes back, demanding that they not only meet her expectations or the standards of the curriculum but set expectations for themselves - something most of them have never before been asked to do. She witnesses some amazing successes as some of the boys come into their own under her tutelage.\r\n\r\nPeterson vividly captures the prison milieu and the exuberance of the kids who have been handed a raw deal by society and have become lost within the system. Her time in the classroom teaches her something, too - that these boys want to be rescued. They want normalcy and love and opportunity.\r\n\r\nxx","last_updated":"2017-11-02T12:04:40.401Z","parsed":{"xt":"urn:btih:2f3d7e5bd64895f98affd0b4ab2c0f7431e360cb","dn":"All Day by Liza Jessie Peterson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2f3d7e5bd64895f98affd0b4ab2c0f7431e360cb","infoHashBuffer":{"type":"Buffer","data":[47,61,126,91,214,72,149,249,138,255,208,180,171,44,15,116,49,227,96,203]},"name":"All Day by Liza Jessie Peterson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}