{"title":"\nGang Leader for a Day_ A Rogue Sociologist Takes to the Streets ","magnet":"magnet:?xt=urn:btih:2f5be2fe0800fa78180040d93fd5e9f26627e02f&dn=Gang+Leader+for+a+Day_+A+Rogue+Sociologist+Takes+to+the+Streets+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2799461","seeders":"0","leechers":"0","description":"xx\r\n\r\nGang Leader for a Day_ A Rogue Sociologist Takes to the Streets by Sudhir Venkatesh ePUB eBOOK-ZAK\r\n\r\nThe story of the young sociologist who studied a Chicago crack-dealing gang from the inside captured the world&apos;s attention when it was first described in Freakonomics. Gang Leader for a Day is the fascinating full story of how Sudhir Venkatest managed to gain entree into the gang, what he learned, and how his method revolutionized the academic establishment.\r\n\r\nWhen Venkatesh walked into an abandoned building in one of Chicago&apos;s most notorious housing projects, he was looking for people to take a multiple-choice survey on urban poverty. A first-year grad student hoping to impress his professors with his boldness, he never imagined that as a result of the assignment he would befriend a gang leader named JT and spend the better part of a decade inside the projects under JT&apos;s protection, documenting what he saw there.\r\n\r\nOver the next seven years, Venkatesh got to know the neighborhood dealers, crackheads, squatters, prostitutes, pimps, activists, cops, organizers, and officials. From his privileged position of unprecedented access, he observed JT and the rest of the gang as they operated their crack-selling business, conducted PR within their community, and rose up or fell within the ranks of the gang&apos;s complex organizational structure.\r\n\r\nIn Hollywood speak, Gang Leader for a Day is The Wire meets the University of Chicago. It&apos;s a brazen and fundamentally honest view into the morally ambiguous, highly intricate, often corrupt struggle to survive in what is tantamount to an urban war zone. It is also the story of a complicated friendship between Sudhir and JT: two young and ambitious men a universe apart.\r\n\r\nxx","last_updated":"2017-09-21T12:01:08.557Z","parsed":{"xt":"urn:btih:2f5be2fe0800fa78180040d93fd5e9f26627e02f","dn":"Gang Leader for a Day_ A Rogue Sociologist Takes to the Streets ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2f5be2fe0800fa78180040d93fd5e9f26627e02f","infoHashBuffer":{"type":"Buffer","data":[47,91,226,254,8,0,250,120,24,0,64,217,63,213,233,242,102,39,224,47]},"name":"Gang Leader for a Day_ A Rogue Sociologist Takes to the Streets ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}