{"title":"The Storms: Adventure and Tragedy on Everest","magnet":"magnet:?xt=urn:btih:2f5c0dee67fc48b8d6ee46dffd73b16d8e78b63f&dn=The+Storms%3A+Adventure+and+Tragedy+on+Everest&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"6645698","seeders":"50","leechers":"7","description":"The Storms: Adventure and Tragedy on Everest - Mike Trueman [epub]\r\n\r\nIn August 1979 twenty-seven-year-old Mike Trueman set sail from the south-west coast of Wales, en route to Cornwall. The young army helicopter pilot was helping to move his friend&apos;s yacht from Northern Ireland to the south coast of England. But as they sailed out into the Irish Sea, the sky turned progressively darker and the winds gathered pace. Over the next twenty-four hours the two young sailors battled to survive force-10 gales in what became known as the Fastnet disaster and which claimed the lives of fifteen sailors off the coast of Ireland.\r\n\r\nAlmost seventeen years later, Trueman was at Camp 2 at 6,400 metres on Mount Everest as the May 1996 tragedy unfolded high above him. As stricken guides, clients and Sherpas tried to survive the fierce storms which engulfed the upper mountain, Trueman was able to descend and - using his twenty-four years of experience as an officer in the British Army - coordinate the rescue effort from Base Camp. The Storms is the remarkable memoir of a British Army Gurkha officer.\r\n\r\nTrueman, a veteran of twenty expeditions to the Himalaya, gives a candid account of life inside expeditions to the highest mountain in the world. He gives a unique personal perspective on the 1996 Everest storm, as well as on the fateful day in May 1999 when Briton Mike Matthews disappeared high on the mountain after he and Trueman had summited","last_updated":"2017-06-05T12:04:07.779Z","parsed":{"xt":"urn:btih:2f5c0dee67fc48b8d6ee46dffd73b16d8e78b63f","dn":"The Storms: Adventure and Tragedy on Everest","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"2f5c0dee67fc48b8d6ee46dffd73b16d8e78b63f","infoHashBuffer":{"type":"Buffer","data":[47,92,13,238,103,252,72,184,214,238,70,223,253,115,177,109,142,120,182,63]},"name":"The Storms: Adventure and Tragedy on Everest","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}