{"title":"SexArt - Linda Sweet (Bare Love) NEW 02 July 2017","magnet":"magnet:?xt=urn:btih:300543c6ea1fb5252cac83d31de527985747489f&dn=SexArt+-+Linda+Sweet+%28Bare+Love%29+NEW+02+July+2017&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"247493965","seeders":"8","leechers":"15","description":"Sexy Linda Sweet dives naked into a swimming pool, swiftly followed by Ricky for some underwater sexual gymnastics, at the start of Andrej Lupin&#x2019;s stylish summer celebration &#x201C;Bare Love.&#x201D; When they emerge poolside, water still dripping from their perfect bodies, they waste no time locking lips, and hot redhead Linda slowly strokes her fellow Czech countryman&#x2019;s cock to full stiffness. Ricky leans back with his huge erection pointing majestically at Linda&#x2019;s beautiful face. Still half submerged in the water, she feeds Ricky&#x2019;s hardness into her mouth and licks up and down the shaft, pausing only to concentrate on sucking the throbbing tip. After this oral opener, the lovers reconvene to a poolside lounger, where Linda straddles the supine Ricky with her shaved, pierced pussy hovering over his face, and lowers it onto his eager tongue. Linda grinds her pussy against Ricky&#x2019;s mouth as his tongue flickers and laps along her juicy labia, then turns into a sixty-nine and feasts on Ricky&#x2019;s engorged cock as he continues eating her voraciously. Linda straddles Ricky, slides her dripping wet pussy down the length of his bone, and takes complete control. Ricky lies still, groaning with pleasure, as luscious Linda bucks wildly on his cock. Eventually she allows him to sit up and lift her undulating body on and off his rock hard erection. They kiss avidly as Linda increases the pace, riding her man hard, their flesh slapping loudly with every thrust, until a powerful orgasm sweeps over her. She rides Ricky&#x2019;s cock cowgirl and reverse cowgirl, until she climaxes again &#x2013; at the exact moment that Ricky unleashes his load. Mentally and physically drained they lie together unable to move, a perfect testament to the intensity of their &#x201C;Bare Love.&#x201D;\r\n <a href=\"\nhttp://img.imgdone.com/image/dIhXW\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/dIhXW</a>\r\n <a href=\"\nhttp://img.imgdone.com/image/dIJTf\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/dIJTf</a>","last_updated":"2017-07-02T12:00:48.790Z","parsed":{"xt":"urn:btih:300543c6ea1fb5252cac83d31de527985747489f","dn":"SexArt - Linda Sweet (Bare Love) NEW 02 July 2017","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"300543c6ea1fb5252cac83d31de527985747489f","infoHashBuffer":{"type":"Buffer","data":[48,5,67,198,234,31,181,37,44,172,131,211,29,229,39,152,87,71,72,159]},"name":"SexArt - Linda Sweet (Bare Love) NEW 02 July 2017","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}