{"title":"Into the Lion's Mouth by Larry Loftis EPUB","magnet":"magnet:?xt=urn:btih:308787021dc6617a86448c38b3a089a90b4f270f&dn=Into+the+Lion%27s+Mouth+by+Larry+Loftis+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2498040","seeders":"3","leechers":"0","description":"xx\r\n\r\nInto the Lion&apos;s Mouth by Larry Loftis EPUB\r\n\r\nJames Bond has nothing on Dusko Popov. A double agent for the Abwehr, MI5 and MI6, and the FBI during World War II, Popov seduced numerous women, spoke five languages, and was a crack shot, all while maintaining his cover as a Yugoslavian diplomat....\r\n\r\nOn a cool August evening in 1941, a Serbian playboy created a stir at Casino Estoril in Portugal by throwing down an outrageously large baccarat bet to humiliate his opponent. The Serbian was a British double agent, and the money - which he had just stolen from the Germans - belonged to the British. From the sideline, watching with intent interest, was none other than Ian Fleming.\r\n\r\nThe Serbian was Dusko Popov. As a youngster he had been expelled from his London prep school. Years later he would be arrested and banished from Germany for making derogatory statements about the Third Reich. When World War II ensued, the playboy became a spy, eventually serving three dangerous masters: the Abwehr, MI5 and MI6, and the FBI.\r\n\r\nOn August 10, 1941, the Germans sent Popov to the United States to construct a spy network and gather information on Pearl Harbor. The FBI ignored his German questionnaire, but J. Edgar Hoover succeeded in blowing his cover. While MI5 desperately needed Popov to deceive the Abwehr about the D-day invasion, they assured him that a return to the German secret service headquarters in Lisbon would result in torture and execution. He went anyway....\r\n\r\nInto the Lion&apos;s Mouth is a globe-trotting account of a man&apos;s entanglement with espionage, murder, assassins, and lovers - including enemy spies and a Hollywood starlet. It is a story of subterfuge and seduction, patriotism, and cold-blooded courage. It is the story of Dusko Popov - the inspiration for James Bond.\r\n\r\nxx","last_updated":"2017-12-30T12:03:26.183Z","parsed":{"xt":"urn:btih:308787021dc6617a86448c38b3a089a90b4f270f","dn":"Into the Lion's Mouth by Larry Loftis EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"308787021dc6617a86448c38b3a089a90b4f270f","infoHashBuffer":{"type":"Buffer","data":[48,135,135,2,29,198,97,122,134,68,140,56,179,160,137,169,11,79,39,15]},"name":"Into the Lion's Mouth by Larry Loftis EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}