{"title":"Think Skinny, Feel Fit: 7 Steps to Transform Your Emotional Weig","magnet":"magnet:?xt=urn:btih:30e77e7f7e7ac2324e835c54eb2b37c5b7bf73b1&dn=Think+Skinny%2C+Feel+Fit%3A+7+Steps+to+Transform+Your+Emotional+Weig&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"3231703","seeders":"2","leechers":"8","description":"\nThink Skinny, Feel Fit: 7 Steps to Transform Your Emotional Weight and Have an Awesome Life(2017) - EPUB - zeke23\r\nISBN: 150113003X | 2017 | EPUB | 256 Pages | 3 MB\r\nBefore you can lose pounds, you must shed weight.\r\nAlejandro Chabin suffered from being overweight as a child and from anorexia and bulimia as an adolescent, and desperately tried to have a healthy body. Then, after trying different diets and exercise regimens, he finally lost 150 pounds. But he discovered that even though his body was thin, in his mind, he was still overweight. This realization inspired him to develop techniques to accept these feelings and transform them into powerful practices. In 2012, this proven method led Alejandro to found Yes You Can!?, a program that has helped thousands of people to follow a healthy lifestyle with a Latin flavor.\r\n\r\nIn Think Skinny, Feel Fit, Alejandro shares for the first time the seven steps that were essential in helping him master his mind in order to transform his body. Using personal anecdotes and examples, Alejandro explains in detail what it means to be emotionally overweight, how emotions and physical well-being are connected, and how best to identify the mental obstacles that weigh down your mind and body. These steps, grounded in positive-thinking techniques, meditation, and self-acceptance and commitment, will help you lead a happier, healthier life. Now you can say &quot;Yes!&quot; to finally taking care of yourself the way you deserve","last_updated":"2017-07-22T12:00:36.303Z","parsed":{"xt":"urn:btih:30e77e7f7e7ac2324e835c54eb2b37c5b7bf73b1","dn":"Think Skinny, Feel Fit: 7 Steps to Transform Your Emotional Weig","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"30e77e7f7e7ac2324e835c54eb2b37c5b7bf73b1","infoHashBuffer":{"type":"Buffer","data":[48,231,126,127,126,122,194,50,78,131,92,84,235,43,55,197,183,191,115,177]},"name":"Think Skinny, Feel Fit: 7 Steps to Transform Your Emotional Weig","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}