{"title":"Sting Like a Bee by Leigh Montville 2017 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:31045466472867ee50e2917f96adc806c7fc3732&dn=Sting+Like+a+Bee+by+Leigh+Montville+2017+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"24220814","seeders":"0","leechers":"0","description":"xx\r\n\r\nSting Like a Bee by Leigh Montville 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn insightful portrait of Muhammed Ali from the New York Times best-selling author of At the Altar of Speed and The Big Bam. It centers on the cultural and political implications of Ali&apos;s refusal of service in the military - and the key moments in a life that was as high profile and transformative as any in the 20th century.\r\n\r\nWith the death of Muhammad Ali in June 2016, the media and America in general have remembered a hero, a heavyweight champion, an Olympic gold medalist, an icon, and a man who represents the sheer greatness of America. New York Times best-selling author Leigh Montville goes deeper, with a fascinating chronicle of a story that has been largely untold.\r\n\r\nMuhammad Ali, in the late 1960s, was young, successful, brash, and hugely admired - but with some reservations. He was bombastic and cocky in a way that captured the imagination of America but also drew its detractors. He was a bold young African American in an era when few people were as outspoken. He renounced his name - Cassius Clay - as being his &apos;slave name&apos; and joined the Nation of Islam, renaming himself Muhammad Ali. And finally, in 1966, after being drafted, he refused to join the military for religious and conscientious reasons, triggering a fight that was larger than any of his bouts in the ring. What followed was a period of legal battles, of cultural obsession, and in some ways of being the very embodiment of the civil rights movement located in the heart of one man.\r\n\r\nMuhammad Ali was the tip of the arrow, and Leigh Montville brilliantly assembles all the boxing, the charisma, the cultural and political shifting tides, and ultimately the enormous waft of entertainment that always surrounded Ali. Sting Like a Bee: Muhammed Ali vs. the United States of America, 1966-1971is an important and incredibly engaging book.\r\n\r\nxx","last_updated":"2017-08-23T12:00:23.923Z","parsed":{"xt":"urn:btih:31045466472867ee50e2917f96adc806c7fc3732","dn":"Sting Like a Bee by Leigh Montville 2017 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"31045466472867ee50e2917f96adc806c7fc3732","infoHashBuffer":{"type":"Buffer","data":[49,4,84,102,71,40,103,238,80,226,145,127,150,173,200,6,199,252,55,50]},"name":"Sting Like a Bee by Leigh Montville 2017 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}