{"title":"Nocturnal by Scott Sigler epub RtR","magnet":"magnet:?xt=urn:btih:3121b6c82b24c9882da86cb2baaeef91aa94214c&dn=Nocturnal+by+Scott+Sigler+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5013245","seeders":"0","leechers":"0","description":"xx\r\n\r\nNocturnal by Scott Sigler epub RtR\r\n\r\nHomicide detective Bryan Clauser is losing his mind. How else to explain the dreams he keeps having - dreams that mirror, with impossible accuracy, the gruesome serial murders taking place all over San Francisco? How else to explain the feelings these dreams provoke in him - not disgust, not horror, but excitement?\r\n\r\nAs Bryan and his longtime partner, Lawrence &apos;Pookie&apos; Chang, investigate the murders, they learn that things are even stranger than they at first seem. For the victims are all enemies of a seemingly ordinary young boy - a boy who is gripped by the same dreams that haunt Bryan. Meanwhile, a shadowy vigilante, seemingly armed with superhuman powers, is out there killing the killers. And Bryan and Pookie&apos;s superiors - from the mayor on down - seem strangely eager to keep the detectives from discovering the truth.\r\n\r\nDoubting his own sanity and stripped of his badge, Bryan begins to suspect that he&apos;s stumbled into the crosshairs of a shadow war that has gripped his city for more than a century - a war waged by a race of killers living in San Francisco&apos;s unknown, underground ruins, emerging at night to feed on those who will not be missed.\r\n\r\nAnd as Bryan learns the truth about his own intimate connections to the killings, he discovers that those who matter most to him are in mortal danger&#x2026;and that he may be the only man gifted - or cursed - with the power to do battle with the nocturnals.\r\n\r\nFeaturing a dazzlingly plotted mystery and a terrifying descent into a nightmarish underworld - long with some of the most incredible action scenes ever put to paper, and an explosive, gut-wrenching conclusion you won&apos;t soon forget, Nocturnal is the most spectacular outing to date from one of the genre&apos;s brightest stars.\r\n\r\nxx","last_updated":"2017-07-15T12:00:36.478Z","parsed":{"xt":"urn:btih:3121b6c82b24c9882da86cb2baaeef91aa94214c","dn":"Nocturnal by Scott Sigler epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3121b6c82b24c9882da86cb2baaeef91aa94214c","infoHashBuffer":{"type":"Buffer","data":[49,33,182,200,43,36,201,136,45,168,108,178,186,174,239,145,170,148,33,76]},"name":"Nocturnal by Scott Sigler epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}