{"title":"Spoonbenders_ A Novel by Daryl Gregory ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:317bb0c6df50b9385cc93ae6c5d480fc4fe98855&dn=Spoonbenders_+A+Novel+by+Daryl+Gregory+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4580602","seeders":"11","leechers":"1","description":"xx\r\n\r\nSpoonbenders_ A Novel by Daryl Gregory ePUB eBOOK-ZAK\r\n\r\nTeddy Telemachus is a charming con man with a gift for sleight of hand and some shady underground associates. In need of cash, he tricks his way into a classified government study about telekinesis and its possible role in intelligence gathering. There he meets Maureen McKinnon, and it&apos;s not just her piercing blue eyes that leave Teddy forever charmed but her mind - Maureen is a genuine psychic of immense and mysterious power. After a whirlwind courtship, they marry, have three gifted children, and become the Amazing Telemachus Family, performing astounding feats across the country. Irene is a human lie detector. Frankie can move objects with his mind. And Buddy, the youngest, can see the future. Then one night tragedy leaves the family shattered.\r\n\r\nDecades later the Telemachuses are not so amazing. Irene is a single mom whose ear for truth makes it hard to hold down a job, much less hold together a relationship. Frankie&apos;s in serious debt to his dad&apos;s old mob associates. Buddy has completely withdrawn into himself and inexplicably begun digging a hole in the backyard. To make matters worse, the CIA has come knocking, looking to see if there&apos;s any magic left in the Telemachus clan. And there is: Irene&apos;s son Matty has just had his first out-of-body experience. But he hasn&apos;t told anyone, even though his newfound talent might just be what his family needs to save themselves - if it doesn&apos;t tear them apart in the process.\r\n\r\nHarnessing the imaginative powers that have made him a master storyteller, Daryl Gregory delivers a stunning, laugh-out-loud new novel about a family of gifted dreamers and the invisible forces that bind us all.\r\n\r\nxx","last_updated":"2017-08-10T12:01:52.281Z","parsed":{"xt":"urn:btih:317bb0c6df50b9385cc93ae6c5d480fc4fe98855","dn":"Spoonbenders_ A Novel by Daryl Gregory ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"317bb0c6df50b9385cc93ae6c5d480fc4fe98855","infoHashBuffer":{"type":"Buffer","data":[49,123,176,198,223,80,185,56,92,201,58,230,197,212,128,252,79,233,136,85]},"name":"Spoonbenders_ A Novel by Daryl Gregory ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}