{"title":"Dynamo - The Book Of Secrets (gnv64)","magnet":"magnet:?xt=urn:btih:3219acc9067997f07e30447074d140727b1547e7&dn=Dynamo+-+The+Book+Of+Secrets+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"27886504","seeders":"106","leechers":"21","description":"Dynamo: The Book Of Secrets: Learn 30 mind-blowing illusions to amaze your friends and family\r\nby Dynamo\r\nBLINK Publishing | November 2017 | ISBN-10: 1911600400 | ePUB | 26 mb\r\n\r\nCan you keep a secret? Inside this book you will find many, from the mind of one of the most talented magicians in the world: Dynamo.\r\nIn this fully illustrated guide to modern magic, Dynamo shows you how you can perform magic yourself. Learn how to make water freeze instantly, read your friends&apos; minds, make chewing gum float 360 degrees around your head, slice a banana without even touching it, discover superhuman strength and many more mind-blowing illusions.\r\nA magical masterclass, The Book of Secrets will be the first step on an exciting journey for budding magicians, providing hours of breathtaking fun for all the family.\r\n\r\nAbout the Author\r\nBorn Steven Frayne in 1982, Dynamo&apos;s ascent from unknown, working class magician, hailing from the Delph Hill estate in Bradford, to multi award-winning, global superstar has been nothing short of miraculous. The closest thing to a real life, comic book superhero, Dynamo has walked on water across the river Thames, levitated in front of Christ the Redeemer in Rio de Janeiro and walked down the outside of the L.A. Times building.His hit TV show Magician Impossible has enthralled over 400 million viewers across 180 territories since it&apos;s inception in 2011 and won a plethora of awards, while his critically acclaimed live show Seeing is Believing quickly erupted from a 10-date run into a year long tour, selling over 600,000 tickets and filling arenas across the UK and Australia. Dynamo is the first magician in history to headline the world famous O2 in London and is credited with redefining modern magic for the millennial generation. He is also the Sunday Times bestselling author of autobiography Nothing Is Impossible.\r\n <a href=\"\nhttps://s18.postimg.org/n4vu1jeax/Dynamo_-_The_Book_Of_Secrets.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s18.postimg.org/n4vu1jeax/Dynamo_-_The_Book_Of_Secrets.jpg</a>","last_updated":"2018-01-01T12:01:55.850Z","parsed":{"xt":"urn:btih:3219acc9067997f07e30447074d140727b1547e7","dn":"Dynamo - The Book Of Secrets (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3219acc9067997f07e30447074d140727b1547e7","infoHashBuffer":{"type":"Buffer","data":[50,25,172,201,6,121,151,240,126,48,68,112,116,209,64,114,123,21,71,231]},"name":"Dynamo - The Book Of Secrets (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}