{"title":"DJ Muerte Cohones Presents Chipster","magnet":"magnet:?xt=urn:btih:321de552b409dc687bbcc622dfdf65fc00075701&dn=DJ+Muerte+Cohones+Presents+Chipster&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"bracer_crane","categoryP":"audio","categoryS":"music","size":"25495159","seeders":"0","leechers":"0","description":"Dj Muerte Cohones&apos;s first Chiptunes EP. Download this now, in three hundred years people will pay you millions of an original digital copy of this masterpiece. Trust me.\r\n\r\nTime allocation during this project:\r\nMaking the music: 20%\r\nPhotoshop for the cover: 3%\r\nTrying to be creative with the song titles: 73% (after a few weeks I settled for a pun based album name and song titles. \r\n\r\nNone of the songs are mastered and It took about 15 minutes to push one out.\r\nAll of the puns are carefully thought over implementing puns, wordplay and toying with acronyms. It took more time to think these than to do the whole album, music-wise.\r\n\r\nTracklisting:\r\n(and the pun explained for listeners who hail from the Isle of Man.)\r\n\r\n1. Fami-dot-com\r\n(Holy shit guys I just blew the motherfucking bank with the first one. Do I even need to explain this? Ok, if you insist. The famicom (known as the Nintendo Entertainment System in the West) was iconic in the late 80&apos;s. The dot-com bubble was the biggest scam of the early 90&apos;s. YOU JUST GOT HISTORY&apos;D... HISTORIED... HISTORYED? I reminded you of a historic thing.)\r\n\r\n2. Chipster\r\n(Jesus Christ on a stick, another instant classic! I just took a regular term, that means a person who wears a lot of plaid and wears glasses without corrective lenses, and put a C in the beginning! Now it&apos;s a pun because this is chip-style music! OH GOD I&apos;M PISSING MYSELF IM SO FUNNI OMGZ :-----D)\r\n\r\n3. Terminal Velocity\r\n(Okay, now we go deep into computer jargon. The title means &apos;terminal&apos; as in the tty that we all know and love, but it connects the term with speed so now it&apos;s a pop reference. I can understand if you didn&apos;t understand this one, but admit it: it&apos;s one hell of a wordplay.)\r\n\r\n4. I can&apos;t Feel My Pulse (Wave)\r\n(Oh lawd here we go again with these goddamn jewels of puns. Pulse is at the same time the waveform I used for all the beep boop sounds but it&apos;s also your heartbeat. THAT&apos;S WHY I CAN&apos;T FEEL IT BECAUSE I&apos;M HAVING A HEART ATTACK PROPABLY OH GOD THE PAIN.)\r\n\r\n5. Ghost in the BASH\r\n(I thought I&apos;d serve my Animu-fanboy segment with this masterpiece of a filename that even Beethoven would be jelly about. You see, a BASH is acronym from Bourne Again Shell. And the really sub-par and quite frankly a really bad anime-flick is called Ghost in the Shell. \r\n\r\nPS: Anime is shit.)\r\n\r\n6. Arpeggio Pardon\r\n(1. Imagine you are Michael Caine\r\n 2. Pronounce this filename like Michael Caine does\r\n 3. Pronounce &quot;I Peg Your Pardon&quot; like Michael Caine Does\r\n 4. Laugh.)\r\n\r\n7. Fish n Chipstep\r\n(BLAM, JUST LIKE THAT. FOOD BASED PUNS.)\r\n\r\n8. I ran out of puns\r\n(*META)\r\n\r\nAlso contains the &quot;End of the year and world&quot; Two bonus songs as DLC.\r\n\r\n9. Follow the trails to the Emergency Room\r\n(&quot;Follow the trails&quot; as in Track and Emergency room as in ER. What you get is the software I used for these songs. Kinda Meta-ish but not quite.)\r\n\r\n10. Autodesk Maya 2012 (End of the World Edition)\r\n(If Autodesk was to release an End of the World Edition from it, I would be the first to give them all my money for it.)\r\n\r\n\r\nListen, share if you like and use them in anything you like. You can credit me if you want but it really isn&apos;t my first priority in life.\r\n\r\nALL RIGHTS RESERVED BY &quot;BLAH BLAH DON&apos;T GIVE A FUCK ABOUT COPYRIGHT SO NEITHER SHOULD YOU&quot; 2013","last_updated":"2017-06-20T12:02:28.663Z","parsed":{"xt":"urn:btih:321de552b409dc687bbcc622dfdf65fc00075701","dn":"DJ Muerte Cohones Presents Chipster","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"321de552b409dc687bbcc622dfdf65fc00075701","infoHashBuffer":{"type":"Buffer","data":[50,29,229,82,180,9,220,104,123,188,198,34,223,223,101,252,0,7,87,1]},"name":"DJ Muerte Cohones Presents Chipster","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}