{"title":"Moving Kings_ A Novel by Joshua Cohen ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:33800748c646b16d871c8ddcdbaf424b58042c54&dn=Moving+Kings_+A+Novel+by+Joshua+Cohen+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7866915","seeders":"3","leechers":"6","description":"xx\r\n\r\nMoving Kings_ A Novel by Joshua Cohen ePUB eBOOK-ZAK\r\n\r\nA propulsive, incendiary novel about faith, race, class, and what it means to have a home, from Joshua Cohen, &quot;a major American writer&quot; (The New York Times)\r\n\r\nOne of the boldest voices of his generation, Joshua Cohen returns with Moving Kings, a powerful and provocative novel that interweaves, in profoundly intimate terms, the housing crisis in America&apos;s poor black and Hispanic neighborhoods with the world&apos;s oldest conflict, in the Middle East.\r\n\r\nThe year is 2015, and 21-year-olds Yoav and Uri, veterans of the last Gaza War, have just completed their compulsory military service in the Israel Defense Forces. In keeping with national tradition, they take a year off for rest, recovery, and travel. They come to New York City and begin working for Yoav&apos;s distant cousin David King - a proud American patriot, Republican, and Jew, and the recently divorced proprietor of King&apos;s Moving Inc., a heavyweight in the tristate area&apos;s moving and storage industries. Yoav and Uri now must struggle to become reacquainted with civilian life, but it&apos;s not easy to move beyond their traumatic pasts when their days are spent kicking down doors as eviction movers in the ungentrified corners of the Bronx, Brooklyn, and Queens, throwing out delinquent tenants and seizing their possessions. And what starts off as a profitable if eerily familiar job - an &quot;occupation&quot; - quickly turns violent when they encounter one homeowner seeking revenge.\r\n\r\nxx","last_updated":"2017-07-25T12:00:29.832Z","parsed":{"xt":"urn:btih:33800748c646b16d871c8ddcdbaf424b58042c54","dn":"Moving Kings_ A Novel by Joshua Cohen ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"33800748c646b16d871c8ddcdbaf424b58042c54","infoHashBuffer":{"type":"Buffer","data":[51,128,7,72,198,70,177,109,135,28,141,220,219,175,66,75,88,4,44,84]},"name":"Moving Kings_ A Novel by Joshua Cohen ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}