{"title":"Eden Robinson - Son of a Trickster (epub)","magnet":"magnet:?xt=urn:btih:33b76614a0cdb6e3ffb760a12f6dd81732fefa8e&dn=Eden+Robinson+-+Son+of+a+Trickster+%28epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"propbay2","categoryP":"other","categoryS":"e_books","size":"2970680","seeders":"21","leechers":"2","description":"Shortlisted for the Scotiabank Giller Prize: With striking originality and precision, Eden Robinson, the author of the classic Monkey Beach and winner of the Writers&#x2019; Trust of Canada Fellowship, blends humour with heartbreak in this compelling coming-of-age novel. Everyday teen existence meets indigenous beliefs, crazy family dynamics, and cannibalistic river otters . . . The exciting first novel in her trickster trilogy.\r\n\r\nEveryone knows a guy like Jared: the burnout kid in high school who sells weed cookies and has a scary mom who&apos;s often wasted and wielding some kind of weapon. Jared does smoke and drink too much, and he does make the best cookies in town, and his mom is a mess, but he&apos;s also a kid who has an immense capacity for compassion and an impulse to watch over people more than twice his age, and he can&apos;t rely on anyone for consistent love and support, except for his flatulent pit bull, Baby Killer (he calls her Baby)--and now she&apos;s dead.\r\n     Jared can&apos;t count on his mom to stay sober and stick around to take care of him. He can&apos;t rely on his dad to pay the bills and support his new wife and step-daughter. Jared is only sixteen but feels like he is the one who must stabilize his family&apos;s life, even look out for his elderly neighbours. But he struggles to keep everything afloat...and sometimes he blacks out. And he puzzles over why his maternal grandmother has never liked him, why she says he&apos;s the son of a trickster, that he isn&apos;t human. Mind you, ravens speak to him--even when he&apos;s not stoned.\r\n     You think you know Jared, but you don&apos;t","last_updated":"2017-12-27T12:05:36.290Z","parsed":{"xt":"urn:btih:33b76614a0cdb6e3ffb760a12f6dd81732fefa8e","dn":"Eden Robinson - Son of a Trickster (epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"33b76614a0cdb6e3ffb760a12f6dd81732fefa8e","infoHashBuffer":{"type":"Buffer","data":[51,183,102,20,160,205,182,227,255,183,96,161,47,109,216,23,50,254,250,142]},"name":"Eden Robinson - Son of a Trickster (epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}