{"title":"Mafia.III.Faster.Baby-RELOADED","magnet":"magnet:?xt=urn:btih:33cfc16787438c9c233985cbb62f7a4faba84f3d&dn=Mafia.III.Faster.Baby-RELOADED&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"8obaraks5","categoryP":"games","categoryS":"pc","size":"350398151","seeders":"4101","leechers":"404","description":"\r\n\r\nAbout the game\r\n\r\nIt&#xFFFD;s 1968 and after years of combat in Vietnam, Lincoln Clay knows this truth: family isn&#xFFFD;t who you&#xFFFD;re born with, it&#xFFFD;s who you die for. Now back home in New Bordeaux, Lincoln is set on escaping a criminal past. But when his surrogate family, the black mob, is betrayed and wiped out by the Italian Mafia, Lincoln builds a new family on the ashes of the old and blazes a path of military-grade revenge through those responsible. Intense gun fights, visceral hand-to-hand combat, white knuckle driving and street smarts will all be needed. But with the right crew, tough decisions and some dirty hands, it&#xFFFD;s possible to make it to the top of the city&apos;s underworld.\r\n\r\n   - New Bordeaux, A Reimagined 1968 New Orleans: A vast, diverse and seedy open world ruled by the mob and corrupt officials and richly detailed with the sights, sounds and emotionally-charged social atmosphere of the era.\r\n   - An Unintended and Lethal Anti-Hero: Be Lincoln Clay, an orphan and Vietnam veteran hell bent on revenge against the Italian Mafia for the brutal slaughter of the black mob, the closest thing to family he&#xFFFD;s ever had.\r\n   - Revenge Your Way: Choose your own personal play-style, from brute force and blazing guns to stalk-and-kill tactics as you use Lincoln&#xFFFD;s military training and gathered intel to tear down the Italian Mafia.\r\n   - A New Family on the Ashes of the Old: Build a new criminal empire in your own unique way by deciding which of your lieutenants you reward, and which you betray&#xFFFD;","last_updated":"2017-06-26T12:01:42.754Z","parsed":{"xt":"urn:btih:33cfc16787438c9c233985cbb62f7a4faba84f3d","dn":"Mafia.III.Faster.Baby-RELOADED","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"33cfc16787438c9c233985cbb62f7a4faba84f3d","infoHashBuffer":{"type":"Buffer","data":[51,207,193,103,135,67,140,156,35,57,133,203,182,47,122,79,171,168,79,61]},"name":"Mafia.III.Faster.Baby-RELOADED","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}