{"title":"The Stargate Chronicles by Joseph McMoneagle EPUB","magnet":"magnet:?xt=urn:btih:3400f655046f2b9b905369289efbb762e95cdff4&dn=The+Stargate+Chronicles+by+Joseph+McMoneagle+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1201774","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Stargate Chronicles by Joseph McMoneagle EPUB\r\n\r\nThe Remarkable Life of U.S. Government Remote Viewer 001\r\n\r\nJoseph McMoneagle is now known as the best Operational Remote Viewer in the history of the U.S. Army&apos;s Special Project-Stargate. His intelligence collection results have never been surpassed and rarely equaled. Among his achievements:\r\n\r\nHe described the interior of a top-secret Soviet manufacturing plant and accurately predicted a new class of submarine under construction there.\r\n\r\nHe sketched the location and described the thoughts of a kidnapped U.S. Army General being held by the Red Brigade in Northern Italy.\r\n\r\nNearly a year in advance he accurately predicted when Skylab would leave orbit and where it would impact on the Earth&apos;s surface.\r\n\r\nAfter conventional reconnaissance failed, he and others were able to locate a downed Soviet bomber that had been carrying nuclear materials.\r\n\r\nHe achieved these results using scientifically designed and tested double-blind protocols. And in the years since his retirement he has continued to demonstrate these abilities on camera for national television in three countries, in the lab at the famed Monroe Institute, and for private companies.\r\n\r\nAre his abilities a natural gift, or taught? Was it his largely unsuspected psychic ability that helped keep him alive in Vietnam, and aided in his invaluable contributions to the cold war effort, that made McMoneagle a first-class remote viewer? How much did he owe to his near-death experience in the 1970s? And why would he give up a safe and distinguished career as an advisor to the Commanding General of the U.S. Army Intelligence and Security Command to become Remote Viewer 001? This is his story.\r\n\r\nxx","last_updated":"2017-11-24T12:00:39.607Z","parsed":{"xt":"urn:btih:3400f655046f2b9b905369289efbb762e95cdff4","dn":"The Stargate Chronicles by Joseph McMoneagle EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3400f655046f2b9b905369289efbb762e95cdff4","infoHashBuffer":{"type":"Buffer","data":[52,0,246,85,4,111,43,155,144,83,105,40,158,251,183,98,233,92,223,244]},"name":"The Stargate Chronicles by Joseph McMoneagle EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}