{"title":"The Map Thief","magnet":"magnet:?xt=urn:btih:344d942669bc50687ff553fed74e1e5e80ce9444&dn=The+Map+Thief&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"22495878","seeders":"0","leechers":"0","description":"The Map Thief: The Gripping Story of an Esteemed Rare-Map Dealer Who Made Millions Stealing Priceless Maps - Michael Blanding [epub]\r\n\r\nMaps have long exerted a special fascination on viewers&#x2014;both as beautiful works of art and as practical tools to navigate the world. But to those who collect them, the map trade can be a cutthroat business, inhabited by quirky and sometimes disreputable characters in search of a finite number of extremely rare objects.\r\n \r\nOnce considered a respectable antiquarian map dealer, E. Forbes Smiley spent years doubling as a map thief &#x2014;until he was finally arrested slipping maps out of books in the Yale University library. The Map Thief delves into the untold history of this fascinating high-stakes criminal and the inside story of the industry that consumed him.\r\n \r\nAcclaimed reporter Michael Blanding has interviewed all the key players in this stranger-than-fiction story, and shares the fascinating histories of maps that charted the New World, and how they went from being practical instruments to quirky heirlooms to highly coveted objects. Though pieces of the map theft story have been written before, Blanding is the first reporter to explore the story in full&#x2014;and had the rare privilege of having access to Smiley himself after he&#x2019;d gone silent in the wake of his crimes. Moreover, although Smiley swears he has admitted to all of the maps he stole, libraries claim he stole hundreds more&#x2014;and offer intriguing clues to prove it. Now, through a series of exclusive interviews with Smiley and other key individuals, Blanding teases out an astonishing tale of destruction and redemption.\r\n \r\nThe Map Thief interweaves Smiley&#x2019;s escapades with the stories of the explorers and mapmakers he knew better than anyone. Tracking a series of thefts as brazen as the art heists in Provenance and a subculture as obsessive as the oenophiles in The Billionaire&#x2019;s Vinegar, Blanding has pieced together an unforgettable story of high-stakes crime.\r\n\r\nPaperback: 320 pages\r\nPublisher: Avery; Reprint edition (June 2, 2015)","last_updated":"2017-12-30T12:00:29.361Z","parsed":{"xt":"urn:btih:344d942669bc50687ff553fed74e1e5e80ce9444","dn":"The Map Thief","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"344d942669bc50687ff553fed74e1e5e80ce9444","infoHashBuffer":{"type":"Buffer","data":[52,77,148,38,105,188,80,104,127,245,83,254,215,78,30,94,128,206,148,68]},"name":"The Map Thief","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}