{"title":"\nIt's Okay to Laugh (Crying Is Cool Too) by Nora McInerny Purmort","magnet":"magnet:?xt=urn:btih:34ae4d5ac02863a077a4c8e06fa44f5f3f548d15&dn=It%27s+Okay+to+Laugh+%28Crying+Is+Cool+Too%29+by+Nora+McInerny+Purmort&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3039949","seeders":"0","leechers":"0","description":"xx\r\n\r\nIt&apos;s Okay to Laugh (Crying Is Cool Too) by Nora McInerny Purmort ePUB eBOOK-ZAK\r\n\r\nJoining the ranks of Let&apos;s Pretend This Never Happened and Carry On, Warrior, a fierce, hysterically funny memoir that reminds us that comedy equals tragedy plus time.\r\n\r\nTwentysomething Nora McInerny Purmort bounced from boyfriend to boyfriend and job to job. Then she met Aaron, a charismatic art director and her kindred spirit. They made mixtapes (and pancakes) into the wee hours of the morning. They finished each other&apos;s sentences. They just knew.\r\n\r\nWhen Aaron was diagnosed with a rare brain cancer, they refused to let it limit their love. They got engaged on Aaron&apos;s hospital bed and married after his first surgery. They had a baby when he was on chemo. They shared an amazing summer filled with happiness and laughter. A few months later, Aaron died in Nora&apos;s arms in another hospital bed. His wildly creative obituary, which they wrote together, touched the world.\r\n\r\nNow Nora shares hysterical, moving, and painfully honest stories about her journey with Aaron. It&apos;s Okay to Laugh explores universal themes of love, marriage, work, (single) motherhood, and depression through her refreshingly frank viewpoint. A love letter to life in all of its messy glory and what it&apos;s like to still be kickin&apos;, It&apos;s Okay to Laugh is like a long chat with a close friend over a cup of coffee (or chardonnay).\r\n\r\nxx","last_updated":"2017-09-22T12:00:45.363Z","parsed":{"xt":"urn:btih:34ae4d5ac02863a077a4c8e06fa44f5f3f548d15","dn":"It's Okay to Laugh (Crying Is Cool Too) by Nora McInerny Purmort","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"34ae4d5ac02863a077a4c8e06fa44f5f3f548d15","infoHashBuffer":{"type":"Buffer","data":[52,174,77,90,192,40,99,160,119,164,200,224,111,164,79,95,63,84,141,21]},"name":"It's Okay to Laugh (Crying Is Cool Too) by Nora McInerny Purmort","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}