{"title":"Lucy Kaplansky-The Tide, Flesh and Bone. Folky singer/songwriter","magnet":"magnet:?xt=urn:btih:35226e75267cfd1fe64e3965a2f8f735c6822bbb&dn=Lucy+Kaplansky-The+Tide%2C+Flesh+and+Bone.+Folky+singer%2Fsongwriter&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"639736088","seeders":"16","leechers":"8","description":"This is one of my favorite Lucy Kaplansky discs. Like her astounding live performances, it&apos;s filled with wonderful material -- her own compositions, up to the standards we&apos;ve come to expect, and some other great choices as well. \r\n&apos;Scorpion&apos; opens the album nicely with a well-written, catchy take on the &apos;dangerous&apos; side of romance. &apos;This is mine&apos; is one of her strongest personal statements -- years from now I think this song will rate as one of her best. She does a great cover of the Elvis Costello classic &apos;(What&apos;s so funny &apos;bout) Peace love and understanding&apos;, and a VERY nice job on the traditional Irish song &apos;Mary and the soldier&apos;, which she gathered in from the singing of the great Paul Brady (Check out his version on his classic album with Andy Irvine). \r\nAll in all, this is simply a great cd -- and there&apos;s a hidden bonus, for those of you who can access it: an outstanding acoustic version of the Beatles classic &apos;I&apos;ve just seen a face&apos;. In order to play this track, which is &apos;hidden&apos; at the first of the program, insert the disc and hold down the &apos;backtrack&apos; button (equivalent of rewind on a cassette) to scan backward through the track to its beginning. Not every cd player will do this, but it&apos;s a treat if you can access it. \r\nEvery cd Lucy has released is quality music -- it&apos;s hard to go wrong with any of them. And if you get the chance to hear her live, don&apos;t pass it up. She has one of the most distinctive voices in contemporary music, and she puts it to good use -- a great talent and a musical treasure. (Amazon review of &apos;Flesh and Bone&apos;","last_updated":"2017-11-24T12:06:10.833Z","parsed":{"xt":"urn:btih:35226e75267cfd1fe64e3965a2f8f735c6822bbb","dn":"Lucy Kaplansky-The Tide, Flesh and Bone. Folky singer/songwriter","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"35226e75267cfd1fe64e3965a2f8f735c6822bbb","infoHashBuffer":{"type":"Buffer","data":[53,34,110,117,38,124,253,31,230,78,57,101,162,248,247,53,198,130,43,187]},"name":"Lucy Kaplansky-The Tide, Flesh and Bone. Folky singer/songwriter","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}