{"title":"\nDiaspora by Greg Egan EPUB","magnet":"magnet:?xt=urn:btih:3578b2ff1415c8da38838577d7d3f9b5556057ee&dn=Diaspora+by+Greg+Egan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"412750","seeders":"0","leechers":"0","description":"xx\r\n\r\nDiaspora by Greg Egan EPUB\r\n\r\nBehold the orphan. Born into a world that is not a world. A digital being grown from a mind seed, a genderless cybernetic citizen in a vast network of probes, satellites, and servers knitting the Solar System into one scape, from the outer planets to the fiery surface of the Sun. Since the Introdus in the 21st century, humanity has reconfigured itself drastically. Most chose immortality, joining the polises to become conscious software.\r\n\r\nOthers opted for gleisners: Disposable, renewable robotic bodies that remain in contact with the physical world of force and friction. Many of these have left the Solar System forever in fusion drive starships.\r\n\r\nAnd there are the holdouts. The fleshers left behind in the muck and jungle of Earth - some devolved into dream-apes; others cavorting in the seas or the air; while the statics and bridges try to shape out a roughly human destiny.\r\n\r\nBut the complacency of the citizens is shattered when an unforeseen disaster ravages the fleshers, and reveals the possibility that the polises themselves might be at risk from bizarre astrophysical processes that seem to violate fundamental laws of nature. The Orphan joins a group of citizens and flesher refugees in a search for the knowledge that will guarantee their safety - a search that puts them on the trail of the ancient and elusive Transmuters, who have the power to reshape subatomic particles, and to cross into the macrocosmos, where the universe we know is nothing but a speck in the higher-dimensional vacuum.\r\n\r\nxx","last_updated":"2017-10-21T12:01:10.235Z","parsed":{"xt":"urn:btih:3578b2ff1415c8da38838577d7d3f9b5556057ee","dn":"Diaspora by Greg Egan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3578b2ff1415c8da38838577d7d3f9b5556057ee","infoHashBuffer":{"type":"Buffer","data":[53,120,178,255,20,21,200,218,56,131,133,119,215,211,249,181,85,96,87,238]},"name":"Diaspora by Greg Egan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}