{"title":"\nMemoirs by David Rockefeller","magnet":"magnet:?xt=urn:btih:36633467a0ceac7c84848c81a2f8f6ea42718470&dn=Memoirs+by+David+Rockefeller&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"5970702","seeders":"22","leechers":"11","description":"Memoirs - David Rockefeller [epub]\r\n\r\nAs a military intelligence officer in World War II, Rockefeller learned his effectiveness depended on his &quot;ability to develop a network of people with reliable information and influence.&quot; During his long life he amassed a Rolodex of more than 1,000 contacts, and in this satisfying autobiography, he describes firsthand encounters with Pablo Picasso, Sigmund Freud, Fiorello La Guardia, oil sheikhs, Latin American strongmen and others.\r\n\r\nCritics say Rockefeller&apos;s not too choosy about the company he keeps; they claim he&apos;s &quot;never met a dictator he didn&apos;t like.&quot; Indeed, he has been roundly criticized for the role he and Henry Kissinger played in persuading the Carter administration to allow the exiled shah of Iran into the U.S., an event widely believed to have sparked the hostage crisis. But this memoir is much more than a titillating account of wealth and international intrigue.\r\n\r\nRockefeller also meticulously recounts the modernizing of Chase Bank, where he worked for 35 years, rising to become chairman and chief executive, finally giving the company-which merged with JP Morgan in 2001-a written history on a par with Ron Chernow&apos;s The House of Morgan. New York City also dominates here; after Robert Moses, the Rockefeller clan has had the strongest hand in shaping the modern urban landscape, from Wall Street to midtown to Morningside Heights. Indispensable for anyone interested in financial and American history, Rockefeller&apos;s well-organized remembrances present a deeply fascinating, thorough look into his life.\r\n\r\nPaperback: 560 pages\r\nPublisher: Random House; Reprint edition (October 28, 2003)","last_updated":"2017-10-07T12:06:02.738Z","parsed":{"xt":"urn:btih:36633467a0ceac7c84848c81a2f8f6ea42718470","dn":"Memoirs by David Rockefeller","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"36633467a0ceac7c84848c81a2f8f6ea42718470","infoHashBuffer":{"type":"Buffer","data":[54,99,52,103,160,206,172,124,132,132,140,129,162,248,246,234,66,113,132,112]},"name":"Memoirs by David Rockefeller","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}