{"title":"Unity by Jeremy Robinson EPUB","magnet":"magnet:?xt=urn:btih:36db1cf80fdb51fa60c5342349fa81ed24ee424e&dn=Unity+by+Jeremy+Robinson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1080368","seeders":"33","leechers":"4","description":"xx\r\n\r\nUnity by Jeremy Robinson EPUB\r\n\r\nEuphemia Williams, known to her few friends as Effie, and everyone else as Eff-Bomb, will punch you for looking at her funny, for using her full name or for noticing that she&apos;s a genius. But when an elite global entity known as Unity takes note of her intelligence and offers her a chance to escape the hum-drum life of a foster-child, she signs up. At best, she expects her time abroad to be a vacation. At worst, an actual challenge. But what she finds, upon being swept up in a futuristic transport, is far, far worse.\r\n\r\nEn route to a secret location in the Pacific, a meteor punches through the atmosphere triggering an electromagnetic pulse that sends the transport plummeting to the ocean. While fighting to escape the crash and climb onto an island beach, the meteor slams into the sea. A tsunami races across the island, pursuing Effie and her fellow survivors deeper into the volcanic island&apos;s lush jungle.\r\n\r\nBeaten, terrified, and abandoned, the small group discovers that they are not alone on the island. The locals are ruthless and well-trained. With the survivors looking to her for leadership, Effie struggles - and fails - to keep everyone alive as they fight for survival.\r\n\r\nAlong the way, Effie uncovers a series of shocking truths: the parents she never knew were part of the island&apos;s strange history, which includes massive robots known as Shugoten, and the meteor that sent them careening into the ocean, wasn&apos;t a meteor at all.\r\n\r\nThe daikaiju have arrived - and one of them is headed her way.\r\n\r\nJeremy Robinson, creator of the &apos;Kaiju Thriller&apos; genre, and international best-selling author of the Project Nemesis novel and comic book series, launches this new series combining the behind-enemy-lines themes of Red Dawn with the high-tech monster-fighting robots of Robotech, infusing it with his frenetic pacing and character-driven plots.\r\n\r\nxx","last_updated":"2017-12-25T12:07:27.852Z","parsed":{"xt":"urn:btih:36db1cf80fdb51fa60c5342349fa81ed24ee424e","dn":"Unity by Jeremy Robinson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"36db1cf80fdb51fa60c5342349fa81ed24ee424e","infoHashBuffer":{"type":"Buffer","data":[54,219,28,248,15,219,81,250,96,197,52,35,73,250,129,237,36,238,66,78]},"name":"Unity by Jeremy Robinson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}