{"title":"The Secret History of the World_ As Laid Down by the Secret Soci","magnet":"magnet:?xt=urn:btih:376187cf48dbd0db79d2e6b3ad5aa4de9b5bdcbf&dn=The+Secret+History+of+the+World_+As+Laid+Down+by+the+Secret+Soci&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"20971344","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Secret History of the World_ As Laid Down by the Secret Societies by Mark Booth ePUB eBOOK-ZAK\r\n\r\nThey say that history is written by the victors. But what if history - or what we have come to know as history - has all along been written by the wrong people? What if everything we&apos;ve been told is only part of the story? What if it&apos;s the wrong part?\r\n\r\nIn this groundbreaking new work, Mark Booth embarks on an enthralling intellectual tour of our world&apos;s secret histories. Starting from a dangerous premise - that everything we&apos;ve been taught about our world&apos;s past is corrupted, and that the stories put forward by the various cults and mystery schools throughout history are true - Booth produces nothing short of an alternate history of the past 3,000 years.\r\n\r\nHistory is more than a list of things that have happened; it&apos;s a measure of consciousness and experience. And in The Secret History of the World, Booth&apos;s take on history is relentless, charging through time and space and thought in interdisciplinary fashion. Embracing cognitive science, religion, psychology, historiography, and philosophy, he draws a new timeline, and a huge swath of our cultural heritage that has long been hidden is restored. From Greek and Egyptian mythology to Jewish folklore, from Christian cults to Freemasons, from Charlemagne to Don Quixote, from George Washington to Hitler - Booth shows without a doubt that history as we know it needs a revolutionary rethink, and he has 3,000 years of hidden wisdom to back it up.\r\n\r\nxx","last_updated":"2017-08-09T12:01:02.070Z","parsed":{"xt":"urn:btih:376187cf48dbd0db79d2e6b3ad5aa4de9b5bdcbf","dn":"The Secret History of the World_ As Laid Down by the Secret Soci","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"376187cf48dbd0db79d2e6b3ad5aa4de9b5bdcbf","infoHashBuffer":{"type":"Buffer","data":[55,97,135,207,72,219,208,219,121,210,230,179,173,90,164,222,155,91,220,191]},"name":"The Secret History of the World_ As Laid Down by the Secret Soci","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}