{"title":"\nLost Enlightenment_ Central Asia's Golden Age from the Arab Conq","magnet":"magnet:?xt=urn:btih:3903dae50525ad7612d158dcbb561665421b46b8&dn=Lost+Enlightenment_+Central+Asia%27s+Golden+Age+from+the+Arab+Conq&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14303543","seeders":"0","leechers":"1","description":"xx\r\n\r\nLost Enlightenment_ Central Asia&apos;s Golden Age from the Arab Conquest to Tamerlane by S Frederick Starr ePUB eBOOK-ZAK\r\n\r\nIn this rich and sweeping history, S. Frederick Starr tells the fascinating but largely unknown story of Central Asia&apos;s medieval enlightenment through the eventful lives and astonishing accomplishments of its greatest minds - remarkable figures who built a bridge to the modern world. Because nearly all of these figures wrote in Arabic, they were long assumed to have been Arabs. In fact, they were from Central Asia - drawn from the Persianate and Turkic peoples of a region that today extends from Kazakhstan southward through Afghanistan, and from the easternmost province of Iran through Xinjiang, China.\r\n\r\nLost Enlightenment recounts how, between the years 800 and 1200, Central Asia led the world in trade and economic development, the size and sophistication of its cities, the refinement of its arts, and, above all, in the advancement of knowledge in many fields. Central Asians achieved signal breakthroughs in astronomy, mathematics, geology, medicine, chemistry, music, social science, philosophy, and theology, among other subjects. They gave algebra its name, calculated the earth&apos;s diameter with unprecedented precision, wrote the books that later defined European medicine, and penned some of the world&apos;s greatest poetry.\r\n\r\nOne scholar, working in Afghanistan, even predicted the existence of North and South America - five centuries before Columbus. Rarely in history has a more impressive group of polymaths appeared at one place and time. No wonder that their writings influenced European culture from the time of St. Thomas Aquinas down to the scientific revolution, and had a similarly deep impact in India and much of Asia.\r\n\r\nLost Enlightenment chronicles this forgotten age of achievement, seeks to explain its rise, and explores the competing theories about the cause of its eventual demise. Informed by the latest scholarship yet presented in a lively and accessible style, this is a book that will surprise general readers and specialists alike.\r\n\r\nxx","last_updated":"2017-10-06T12:03:44.552Z","parsed":{"xt":"urn:btih:3903dae50525ad7612d158dcbb561665421b46b8","dn":"Lost Enlightenment_ Central Asia's Golden Age from the Arab Conq","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3903dae50525ad7612d158dcbb561665421b46b8","infoHashBuffer":{"type":"Buffer","data":[57,3,218,229,5,37,173,118,18,209,88,220,187,86,22,101,66,27,70,184]},"name":"Lost Enlightenment_ Central Asia's Golden Age from the Arab Conq","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}