{"title":"Glenn Frankel - High Noon 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:39346cd653fd2e0876dec1738db7f9ab432a4845&dn=Glenn+Frankel+-+High+Noon+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12242731","seeders":"0","leechers":"0","description":"Glenn Frankel - High Noon 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIt&apos;s one of the most revered movies of Hollywood&apos;s golden era. Starring screen legend Gary Cooper and Grace Kelly in her first significant film role, High Noon was shot on a lean budget over just 32 days but achieved instant box-office and critical success. It won four Academy Awards in 1953, including a best actor win for Cooper. And it became a cultural touchstone, often cited by politicians as a favourite film, celebrating moral fortitude.\r\n\r\nYet what has been often overlooked is that High Noon was made during the height of the Hollywood blacklist, a time of political inquisition and personal betrayal. In the middle of the film shoot, screenwriter Carl Foreman was forced to testify before the House Committee on Un-American Activities about his former membership in the Communist Party. Refusing to name names, he was eventually blacklisted and fled the United States. (His coauthored screenplay for another classic, The Bridge on the River Kwai, went uncredited in 1957.) Examined in light of Foreman&apos;s testimony, High Noon&apos;s emphasis on courage and loyalty takes on deeper meaning and importance.\r\n\r\nIn this book, Pulitzer Prize-winning journalist Glenn Frankel tells the story of the making of a great American Western, exploring how Carl Foreman&apos;s concept of High Noon evolved from idea to first draft to final script, taking on allegorical weight. Both the classic film and its turbulent political times emerge newly illuminated","last_updated":"2017-05-25T10:50:16.785Z","parsed":{"xt":"urn:btih:39346cd653fd2e0876dec1738db7f9ab432a4845","dn":"Glenn Frankel - High Noon 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"39346cd653fd2e0876dec1738db7f9ab432a4845","infoHashBuffer":{"type":"Buffer","data":[57,52,108,214,83,253,46,8,118,222,193,115,141,183,249,171,67,42,72,69]},"name":"Glenn Frankel - High Noon 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}