{"title":"Caitlin Shetterly - Modified 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:3a1ad655a78407d5c82ffb38e2dd5e945201ea6b&dn=Caitlin+Shetterly+-+Modified+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3793602","seeders":"1","leechers":"0","description":"Caitlin Shetterly - Modified 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA disquieting and meditative look at the issue that started the biggest food fight of our time: GMOs. From a journalist and mother who learned that genetically modified corn was the culprit behind what was making her and her child sick, a must-read book for anyone trying to parse the incendiary discussion about genetically modified foods.\r\n\r\nGMO products are among the most consumed and the least understood substances in the United States today. They appear not only in the food we eat but in everything from the interior coating of paper coffee cups and medicines to diapers and toothpaste. We are often completely unaware of their presence.\r\n\r\nCaitlin Shetterly discovered the importance of GMOs the hard way. Shortly after she learned that her son had an alarming sensitivity to GMO corn, she was told that she had the same condition, and her family&apos;s daily existence changed forever. An expansion of Shetterly&apos;s viral Elle article &quot;The Bad Seed&quot;, Modified delves deep into the heart of the matter - from the cornfields of Nebraska to the beekeeping conventions in Brussels - to shine a light on the people, the science, and the corporations behind the food we serve ourselves and our families every day. Deeper than an expos&#xE9; and written by a mother and journalist whose journey had no agenda other than to understand the nuance and confusion behind GMOs, Modified is a rare breed of book that will at once make you weep at the majestic beauty of our Great Plains and force you to harvest deep seeds of doubt about the invisible monsters currently infiltrating our food and our land and threatening our future","last_updated":"2017-06-14T12:00:37.521Z","parsed":{"xt":"urn:btih:3a1ad655a78407d5c82ffb38e2dd5e945201ea6b","dn":"Caitlin Shetterly - Modified 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3a1ad655a78407d5c82ffb38e2dd5e945201ea6b","infoHashBuffer":{"type":"Buffer","data":[58,26,214,85,167,132,7,213,200,47,251,56,226,221,94,148,82,1,234,107]},"name":"Caitlin Shetterly - Modified 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}