{"title":"Cathi Hanauer - The Bitch Is Back 2016 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:3a423f8c7b6bc3e33d4a74b4b56de32fb7b0f249&dn=Cathi+Hanauer+-+The+Bitch+Is+Back+2016+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3051888","seeders":"28","leechers":"8","description":"Cathi Hanauer - The Bitch Is Back 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nMore than a decade after the New York Times best-selling anthology The Bitch in the House spoke up loud and clear for a generation of young women, nine of the original contributors are back - along with 16 captivating new voices - sharing their ruminations from an older, stronger, and wiser perspective about love, sex, work, family, independence, body image, health, and aging: the critical flash points of women&apos;s lives today.\r\n\r\n&quot;Born out of anger&quot;, the essays in The Bitch in the House chronicled the face of womanhood at the beginning of a new millennium. Now those funny, smart, passionate contributors - today less bitter and resentful and more confident, competent, and content - capture the spirit of postfeminism in this equally provocative, illuminating, and compelling companion anthology.\r\n\r\nHaving aged into their 40s, 50s, and 60s, these &quot;bitches&quot; - best-selling authors, renowned journalists, and critically acclaimed novelists - are back...and better than ever. In The Bitch Is Back, Cathi Hanauer, Kate Christensen, Sarah Crichton, Debora Spar, Ann Hood, Veronica Chambers, and 19 other women offer unique views on womanhood and feminism today. Some of the &quot;original bitches&quot; (OBs) revisit their earlier essays to reflect on their previous selves. All reveal how their lives have changed in the intervening years - whether they stayed coupled, left marriages, or had affairs; developed cancer or other physical challenges; coped with partners who strayed, died, or remained faithful; became full-time wage earners or homemakers; opened up their marriages; remained childless or became parents; or experienced other meaningful life transitions.\r\n\r\nAs a new wave of feminists begins to take center stage, this powerful, timely collection sheds a much-needed light on both past and present, offering understanding, compassion, and wisdom for modern women&apos;s lives, all the while pointing toward the exciting possibilities of tomorrow","last_updated":"2017-06-06T12:05:08.948Z","parsed":{"xt":"urn:btih:3a423f8c7b6bc3e33d4a74b4b56de32fb7b0f249","dn":"Cathi Hanauer - The Bitch Is Back 2016 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3a423f8c7b6bc3e33d4a74b4b56de32fb7b0f249","infoHashBuffer":{"type":"Buffer","data":[58,66,63,140,123,107,195,227,61,74,116,180,181,109,227,47,183,176,242,73]},"name":"Cathi Hanauer - The Bitch Is Back 2016 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}