{"title":"Sonder. Episode ONE","magnet":"magnet:?xt=urn:btih:3a5a5b888870ff68e299c5bae438d9674401cd1a&dn=Sonder.+Episode+ONE&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"499313362","seeders":"0","leechers":"0","description":"Sonder. is a SciFi third-person Mystery Adventure game unlike anything you have ever played before. It is an interactive nonlinear time loop where you are in total control of space, time and the lives of everyone in it.You are given a section of time to analyze - you can observe from the sidelines as the same mistakes are being made over and over again, or you can take control of any character, at any time and experience events from that character&apos;s unique perspective. Then you may guide them to the choices that will ultimately lead them to salvation - or bring them to their doom. Time marches forward mercilessly for the characters, but for you it is merely a resource. You can restart the time loop at any time, as many times as you wish. You can rewind to any past point within the loop and attempt to change what happens from that point onward. The only place where information can survive from one loop to the next - is in your head!The characters in the story have no recollection of events in previous loops. Each time you restart the loop, or rewind time - they have to re-learn what they previously knew. It will be up to you to make them find the information (that only you know is out there) quicker and do something with it.As you get more and more familiar with the story and","last_updated":"2017-05-09T19:36:28.182Z","parsed":{"xt":"urn:btih:3a5a5b888870ff68e299c5bae438d9674401cd1a","dn":"Sonder. Episode ONE","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3a5a5b888870ff68e299c5bae438d9674401cd1a","infoHashBuffer":{"type":"Buffer","data":[58,90,91,136,136,112,255,104,226,153,197,186,228,56,217,103,68,1,205,26]},"name":"Sonder. Episode ONE","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}