{"title":"\nLincoln in the Bardo_ A Novel by George Saunders ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:3a82d95558b8057e3d9d8b0f3abea481578a9f0d&dn=Lincoln+in+the+Bardo_+A+Novel+by+George+Saunders+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2937594","seeders":"9","leechers":"11","description":"xx\r\n\r\nLincoln in the Bardo_ A Novel by George Saunders ePUB eBOOK-ZAK\r\n\r\nThe long-awaited first novel from the author of Tenth of December: a moving and original father-son story featuring none other than Abraham Lincoln, as well as an unforgettable cast of supporting characters, living and dead, historical and invented.\r\n\r\nFebruary 1862. The Civil War is less than one year old. The fighting has begun in earnest, and the nation has begun to realize it is in for a long, bloody struggle. Meanwhile, President Lincoln&apos;s beloved eleven-year-old son, Willie, lies upstairs in the White House, gravely ill. In a matter of days, despite predictions of a recovery, Willie dies and is laid to rest in a Georgetown cemetery. &quot;My poor boy, he was too good for this earth,&quot; the president says at the time. &quot;God has called him home.&quot; Newspapers report that a grief-stricken Lincoln returns, alone, to the crypt several times to hold his boy&apos;s body.\r\n\r\nFrom that seed of historical truth, George Saunders spins an unforgettable story of familial love and loss that breaks free of its realistic, historical framework into a supernatural realm both hilarious and terrifying. Willie Lincoln finds himself in a strange purgatory where ghosts mingle, gripe, commiserate, quarrel, and enact bizarre acts of penance. Within this transitional state&#x2014;called, in the Tibetan tradition, the bardo&#x2014;a monumental struggle erupts over young Willie&apos;s soul.\r\n\r\nLincoln in the Bardo is an astonishing feat of imagination and a bold step forward from one of the most important and influential writers of his generation. Formally daring, generous in spirit, deeply concerned with matters of the heart, it is a testament to fiction&apos;s ability to speak honestly and powerfully to the things that really matter to us. Saunders has invented a thrilling new form that deploys a kaleidoscopic, theatrical panorama of voices to ask a timeless, profound question: How do we live and love when we know that everything we love must end?\r\n\r\nxx","last_updated":"2017-10-05T12:02:20.354Z","parsed":{"xt":"urn:btih:3a82d95558b8057e3d9d8b0f3abea481578a9f0d","dn":"Lincoln in the Bardo_ A Novel by George Saunders ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3a82d95558b8057e3d9d8b0f3abea481578a9f0d","infoHashBuffer":{"type":"Buffer","data":[58,130,217,85,88,184,5,126,61,157,139,15,58,190,164,129,87,138,159,13]},"name":"Lincoln in the Bardo_ A Novel by George Saunders ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}