{"title":"Unbelievable_ My Front-Row Seat to the Craziest Campaign in Amer","magnet":"magnet:?xt=urn:btih:3aed855c1b31f3e137943ee2019ec95d62ea9590&dn=Unbelievable_+My+Front-Row+Seat+to+the+Craziest+Campaign+in+Amer&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3020109","seeders":"0","leechers":"0","description":"xx\r\n\r\nUnbelievable_ My Front-Row Seat to the Craziest Campaign in American History by Katy Tur ePUB eBOOK-ZAK\r\n\r\nThe NBC journalist who covered - and took fire from - Donald Trump on the campaign trail offers an inside look at the most shocking presidential election in American history.\r\n\r\nKaty Tur was one of a select cadre of NBC reporters on the road during the grueling 2016 presidential campaign, reporting from small towns and venues across America for more than 16 months. At the beginning of the primaries, Tur was assigned the Trump campaign - a campaign widely considered a long shot by politicos and the media. But primary after primary, the novice outsider trumped his rivals and won the hearts and votes of many Republicans. His appeal to working-class whites, the GOP&apos;s traditional middle and upper middle class base, and conservative evangelicals took him all the way to the White House, astonishing the nation and the world.\r\n\r\nUnbelievable is Tur&apos;s inside account of being embedded with the campaign, revealing what it was like to report on the most combative and volatile major party candidate ever to run for office and win. At first, Trump tried to charm Tur into providing fawning coverage. When that didn&apos;t work, he stooped to berating and shaming her, stoking the rage of his legion of supporters - many who threatened Tur and other penned-in reporters at his events. The vitriol reached such a fever pitch that following one rally, during which Trump launched a personal attack against her, the Secret Service had to accompany Tur to her car. But Katy was not alone. Millions of Americans watched in disbelief as Trump ordered Tur to &quot;be quiet&quot; during one of his many press conferences and called her &quot;disgraceful&quot;, &quot;third-rate&quot;, &quot;not nice&quot;, and &quot;Little Katy&quot;. In response, thousands of people across the country rushed to her defense, tweeting #imwithtur.\r\n\r\nIntriguing, disturbing, and powerful, Unbelievable is an unprecedented eyewitness account of the 2016 election from an intelligent, dedicated journalist at the center of it - a thoughtful historical record that offers eye-opening insights and details on our political process, the media, and the mercurial 45th president of the United States.\r\n\r\nxx","last_updated":"2017-09-13T12:00:27.712Z","parsed":{"xt":"urn:btih:3aed855c1b31f3e137943ee2019ec95d62ea9590","dn":"Unbelievable_ My Front-Row Seat to the Craziest Campaign in Amer","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3aed855c1b31f3e137943ee2019ec95d62ea9590","infoHashBuffer":{"type":"Buffer","data":[58,237,133,92,27,49,243,225,55,148,62,226,1,158,201,93,98,234,149,144]},"name":"Unbelievable_ My Front-Row Seat to the Craziest Campaign in Amer","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}