{"title":"Super Brain by Rudolph E. Tanzi, Deepak Chopra EPUB","magnet":"magnet:?xt=urn:btih:3af9ccadfb32d81432faf1b0b56556cebb571700&dn=Super+Brain+by+Rudolph+E.+Tanzi%2C+Deepak+Chopra+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2740115","seeders":"0","leechers":"0","description":"xx\r\n\r\nSuper Brain by Rudolph E. Tanzi, Deepak Chopra EPUB\r\n\r\nA manual for relating to the brain in a revolutionary new way, Super Brain explains how to use your brain as a gateway for achieving health, happiness, and spiritual growth. The authors are two pioneers: best-selling author and physician Deepak Chopra and Harvard Medical School professor Rudolph E. Tanzi, one of the world&apos;s foremost experts on the causes of Alzheimer&#x2019;s. They have merged their wisdom and expertise for a bold new understanding of the &#x201C;three-pound universe&#x201D; and its untapped potential.\r\n\r\nIn contrast to the &#x201C;baseline brain&#x201D; that fulfills the tasks of everyday life, Chopra and Tanzi propose that, through a person&#x2019;s increased self-awareness and conscious intention, the brain can be taught to reach far beyond its present limitations. &#x201C;We are living in a golden age for brain research, but is this a golden age for your brain?&#x201D; they ask.\r\n\r\nSuper Brain explains how it can be, by combining cutting-edge research and spiritual insights, demolishing the five most widespread myths about the brain that limit your potential, and then showing you methods to:\r\n\r\nUse your brain instead of letting it use you\r\n\r\nCreate the ideal lifestyle for a healthy brain\r\n\r\nReduce the risks of aging\r\n\r\nPromote happiness and well-being through the mind-body connection\r\n\r\nAccess the enlightened brain, the gateway to freedom and bliss\r\n\r\nOvercome the most common challenges, such as memory loss, depression, anxiety, and obesity\r\n\r\nYour brain is capable of incredible healing and constant reshaping. Through a new relationship with your brain you can transform your life. In Super Brain, Chopra and Tanzi guide you on a fascinating journey that envisions a leap in human evolution. The brain is not just the greatest gift that Nature has given us. It&#x2019;s the gateway to an unlimited future that you can begin to live today.\r\n\r\nxx","last_updated":"2018-01-05T12:01:19.168Z","parsed":{"xt":"urn:btih:3af9ccadfb32d81432faf1b0b56556cebb571700","dn":"Super Brain by Rudolph E. Tanzi, Deepak Chopra EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3af9ccadfb32d81432faf1b0b56556cebb571700","infoHashBuffer":{"type":"Buffer","data":[58,249,204,173,251,50,216,20,50,250,241,176,181,101,86,206,187,87,23,0]},"name":"Super Brain by Rudolph E. Tanzi, Deepak Chopra EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}