{"title":"Planet Earth II S01 1080p BluRay HEVC tlacatlc6","magnet":"magnet:?xt=urn:btih:3b06f7c68d6862150ed90074d8e9e33d7bff112c&dn=Planet+Earth+II+S01+1080p+BluRay+HEVC+tlacatlc6&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Bodycount9","categoryP":"video","categoryS":"hd___tv_shows","size":"17527338819","seeders":"0","leechers":"0","description":"Thanks to tlacatlc6 for providing and ripping the Bluray\r\n\r\nPlanet Earth II is a 2016 British nature documentary series produced by the BBC as a sequel to Planet Earth, which was broadcast in 2006. The series is presented and narrated by Sir David Attenborough with the main theme music composed by Hans Zimmer.\r\n\r\nIslands S1, Ep1\r\n\r\nWildlife documentary series with David Attenborough, beginning with a look at the remote islands which offer sanctuary to some of the planet&apos;s rarest creatures.\r\n \r\nMountains S1, Ep2\r\nThe wildlife documentary series with David Attenborough continues with a unique and intimate glimpse into secretive lives of mountain-dwelling animals.\r\n \r\nJungles S1, Ep3\r\nJungles provide the richest habitats on the planet - mysterious worlds of high drama where extraordinary animals attempt to survive in the most competitive place on earth.\r\n \r\nDeserts S1, Ep4\r\nThe world&apos;s deserts force animals to come up with ingenious ways of coping with hostile conditions, giving rise to the most incredible survival stories on earth.\r\n \r\nGrasslands S1, Ep5\r\nGrasslands cover one quarter of all land and support the vast gatherings of wildlife, but to survive here animals must endure the most hostile seasonal changes on the planet. From Asia&apos;s bizarre-looking saiga antelope to the giant anteaters of Brazil, grassland animals have adapted in extraordinary ways to cope with these extremes. In the flooded Okavango, lions take on formidable buffalo in epic battles, on the savannah bee-eaters take advantage of elephants to help catch insects and, on the freezing northern tundra, caribou embark on great migrations shadowed by ...\r\n \r\nCities S1, Ep6\r\nCities are the newest habitat on Planet Earth. The series documents the wildlife in our cities","last_updated":"2017-11-05T12:11:33.662Z","parsed":{"xt":"urn:btih:3b06f7c68d6862150ed90074d8e9e33d7bff112c","dn":"Planet Earth II S01 1080p BluRay HEVC tlacatlc6","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3b06f7c68d6862150ed90074d8e9e33d7bff112c","infoHashBuffer":{"type":"Buffer","data":[59,6,247,198,141,104,98,21,14,217,0,116,216,233,227,61,123,255,17,44]},"name":"Planet Earth II S01 1080p BluRay HEVC tlacatlc6","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}