{"title":"Smart Materials for Tissue Engineering (gnv64)","magnet":"magnet:?xt=urn:btih:3b4b404361bbe851aecaac1db9ad43dff3377e6f&dn=Smart+Materials+for+Tissue+Engineering+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"67915114","seeders":"2","leechers":"31","description":"Smart Materials for Tissue Engineering - Fundamental Principles\r\nby Wang Qun (Ed)\r\nRoyal Society of Chemistry | December 2016 | ISBN-10: 1782624643 | True PDF | 658 Pages | 27.4 mb\r\n\r\nIn recent years there has been tremendous progress in the area of tissue engineering research. This book focusses on the fundamental principles underpinning these recent advances in the materials science developed for tissue engineering purposes. Smart materials for tissue engineering are produced by modifying the physicochemical and biological properties of the scaffolds with response to external stimuli to enhance the tissue regeneration. The functions of living cells can be regulated by smart materials which respond to changes in the surrounding microenvironment. This book comprehensively documents the recent advancements in smart materials for tissue engineering and will provide an essential text for those working in materials science and materials engineering, in academia and industry\r\n\r\n-----------------------------------------------------\r\n\r\nSmart Materials for Tissue Engineering - Applications\r\nby Wang Qun (Ed) \r\nRoyal Society of Chemistry | April 2017 | ISBN-10: 1782624848 | True PDF | 698 pages | 37.3 mb\r\n\r\nIn the last couple of decades, research in the area of tissue engineering has witnessed tremendous progress. The focus has been on replacing or facilitating the regeneration of damaged or diseased cell, tissue or organs by applying a biomaterial support system, and a combination of cells and bioactive molecules. In addition new smart materials have been developed which provide opportunities to fabricate, characterize and utilize materials systematically to control cell behaviours and tissue formation by biomimetic topography that closely replicate the natural extracellular matrix. Following on from Smart Materials for Tissue Engineering: Fundamental Principles, this book comprehensively covers the different uses of smart materials in tissues engineering, providing a valuable resource for biochemists, materials scientists and biomedical engineers working in industry and academia.\r\n\r\n------------------------------------------------------\r\n\r\nAbout the Editor <a href=\"\nhttps://s17.postimg.org/429c3wbpr/Wang_Qun.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s17.postimg.org/429c3wbpr/Wang_Qun.jpg</a> <a href=\"\nhttps://qunwanglab.com\" rel=\"nofollow\" target=\"_NEW\">\nhttps://qunwanglab.com</a>\r\nDr. Wang currently serves as adjunct assistant professor in the Department of Chemical and Biological Engineering, as well as associate scientist at the Ames National Laboratory at Iowa State University. He got his Ph.D. in Chemical and Petroleum Engineering from University of Kansas in 2010. He obtained another Ph.D. in Environmental Science and Engineering from Wuhan University in 2007. Before he joined Iowa State University in 2012, he has worked as Jorge Heller Postdoctoral Fellow in Professor Robert Langer&#x2019;s Lab at Harvard-MIT Division of Health Sciences and Technology of MIT and Harvard Medical School. Dr. Wang has worked as engineer in a chemical company and a pharmaceutical company before.\r\n <a href=\"\nhttps://s18.postimg.org/vd0w3a24p/Smart_Materials_for_Tissue_Engineering.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s18.postimg.org/vd0w3a24p/Smart_Materials_for_Tissue_Engineering.jpg</a>","last_updated":"2017-12-11T12:02:02.150Z","parsed":{"xt":"urn:btih:3b4b404361bbe851aecaac1db9ad43dff3377e6f","dn":"Smart Materials for Tissue Engineering (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3b4b404361bbe851aecaac1db9ad43dff3377e6f","infoHashBuffer":{"type":"Buffer","data":[59,75,64,67,97,187,232,81,174,202,172,29,185,173,67,223,243,55,126,111]},"name":"Smart Materials for Tissue Engineering (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}