{"title":"mIRC v7.49 Portable","magnet":"magnet:?xt=urn:btih:3b83f89551afa020a2cccd494ce9b4b09348ba5f&dn=mIRC+v7.49+Portable&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"2520506","seeders":"11","leechers":"1","description":"mIRC v7.49 Portable\r\n\r\nThis is a small update that addresses a number of issues reported by users since the last release. It includes improvements, changes and fixes to a number of features, including:\r\n\r\nChanged CAP invite-notify so that invite notifications are now displayed.\r\nAdded CAP 3.2 support so mIRC now sends LS CAP 302 when logging on.\r\nAdded CAP cap-notify support.\r\nChanged Add/Edit server dialog to allow use of seperate server and logon method passwords.\r\nChanged /server -w and -l switches to support separate passwords.\r\nFixed window treebar/switchbar focus bug.\r\nFixed $regmlex() bug.\r\nFixed CAP SASL external bug.\r\nAdded CTCP DCC resume error message when file is smaller than the existing file.\r\nAdded support for evaluation of highlight tip messages.\r\nAdded /sockopen -n switch to disable Nagle algorithm on socket.\r\nFixed IAL gpf bug when IAL was turned off and channel was joined.\r\n\r\nmIRC is a full featured Internet Relay Chat client for Windows that can be used to communicate, share, play or work with others on IRC networks around the world, either in multi-user group conferences or in one-to-one private discussions.\r\n\r\nIt has a clean, practical interface that is highly configurable and supports features such as buddy lists, file transfers, multi-server connections, IPv6, SSL encryption, proxy support, UTF-8 display, UPnP, customizable sounds, spoken messages, tray notifications, message logging, and more.\r\n\r\nmIRC also has a powerful scripting language that can be used both to automate mIRC and to create applications that perform a wide range of functions from network communications to playing games.\r\n\r\nmIRC has been in development for over two decades and is constantly being improved and updated with new technologies. The most recent changes can be found on the latest news page\r\n\r\nOfficial Website: http://www.mirc.com/","last_updated":"2017-05-27T09:05:35.370Z","parsed":{"xt":"urn:btih:3b83f89551afa020a2cccd494ce9b4b09348ba5f","dn":"mIRC v7.49 Portable","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3b83f89551afa020a2cccd494ce9b4b09348ba5f","infoHashBuffer":{"type":"Buffer","data":[59,131,248,149,81,175,160,32,162,204,205,73,76,233,180,176,147,72,186,95]},"name":"mIRC v7.49 Portable","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}