{"title":"Paula Byrne - Kick 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:3c0e31ef620a337366abff3c3b7496d77d05640c&dn=Paula+Byrne+-+Kick+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7969716","seeders":"17","leechers":"6","description":"Paula Byrne - Kick 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFilled with a wealth of revealing new material and insight, the biography of the vivacious, unconventional - and nearly forgotten - young Kennedy sister who charmed American society and the English aristocracy and would break with her family for love.\r\n\r\nEncouraged to be &quot;winners&quot; from a young age, Rose and Joe Kennedy&apos;s children were the embodiment of ambitious, wholesome Americanism. Yet even within this ebullient group of overachievers, the fourth Kennedy child, the irrepressible Kathleen, stood out. Lively, charismatic, extremely clever, and blessed with graceful athleticism and a sunny disposition, the alluring socialite fondly known as Kick was a firecracker who effortlessly made friends and stole hearts.\r\n\r\nMoving across the Atlantic when her father was appointed as the ambassador to Great Britain in 1938, Kick - the &quot;nicest Kennedy&quot; - quickly became the family&apos;s star. Despite making little effort to fit in to British high society, she charmed everyone from the beau monde to Fleet Street with her unconventional attitude and easygoing humor. Growing increasingly independent, Kick would also shock and alienate her devout family by falling in love and marrying the scion of a virulently anti-Catholic family - William Cavendish, the heir apparent of the Duke of Devonshire and Chatsworth. But the marriage would last only a few months; Billy was killed in combat in 1944, just four years before Kick&apos;s own unexpected death in an airplane crash at 28.\r\n\r\nPaula Byrne recounts this remarkable young woman&apos;s life in detail as never before, from her work at the Washington Times-Herald and volunteerism for the Red Cross in wartime England to her love of politics and astute, opinionated observations to her decision to renounce her faith for the man she loved. Sympathetic and compelling, Kick shines a spotlight on this feisty and unique Kennedy long relegated to the shadows of her legendary family&apos;s history","last_updated":"2017-05-23T18:54:37.414Z","parsed":{"xt":"urn:btih:3c0e31ef620a337366abff3c3b7496d77d05640c","dn":"Paula Byrne - Kick 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3c0e31ef620a337366abff3c3b7496d77d05640c","infoHashBuffer":{"type":"Buffer","data":[60,14,49,239,98,10,51,115,102,171,255,60,59,116,150,215,125,5,100,12]},"name":"Paula Byrne - Kick 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}