{"title":"Robert Wagner - I Loved Her in the Movies 2016 RETAiL ePUB eBOOK","magnet":"magnet:?xt=urn:btih:3c0fce16b1fde9da12c0e97c4768ea79096a4fac&dn=Robert+Wagner+-+I+Loved+Her+in+the+Movies+2016+RETAiL+ePUB+eBOOK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"34544229","seeders":"39","leechers":"9","description":"Robert Wagner - I Loved Her in the Movies 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn a career that has spanned more than 60 years, Robert Wagner has witnessed the twilight of the Golden Age of Hollywood and the rise of television, becoming a beloved star in both media. During that time he became acquainted, both professionally and socially, with the remarkable women who were the greatest screen personalities of their day. I Loved Her in the Movies is his intimate and revealing account of the charisma of these women on film, why they became stars, and how their specific emotional and dramatic chemistries affected the choices they made as actresses as well as the choices they made as women.\r\n\r\nAmong Wagner&apos;s subjects are Joan Crawford, Bette Davis, Marilyn Monroe, Gloria Swanson, Norma Shearer, Loretta Young, Joan Blondell, Irene Dunne, Rosalind Russell, Dorothy Lamour, Debra Paget, Jean Peters, Linda Darnell, Betty Hutton, Raquel Welch, Glenn Close, and the two actresses whom he ultimately married, Natalie Wood and Jill St. John. In addition to offering perceptive commentary on these women, Wagner also examines topics such as the strange alchemy of the camera - how it can transform the attractive into the stunning and vice versa - and how the introduction of color brought a new erotic charge to movies, one that enabled these actresses to become aggressively sexual beings in a way that that black and white films had only hinted at.\r\n\r\nLike Wagner&apos;s two previous best sellers, I Loved Her in the Movies is a privileged look behind the scenes at some of the most well-known women in show business as well as an insightful look at the sexual and romantic attraction that created their magic","last_updated":"2017-06-06T12:05:09.926Z","parsed":{"xt":"urn:btih:3c0fce16b1fde9da12c0e97c4768ea79096a4fac","dn":"Robert Wagner - I Loved Her in the Movies 2016 RETAiL ePUB eBOOK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3c0fce16b1fde9da12c0e97c4768ea79096a4fac","infoHashBuffer":{"type":"Buffer","data":[60,15,206,22,177,253,233,218,18,192,233,124,71,104,234,121,9,106,79,172]},"name":"Robert Wagner - I Loved Her in the Movies 2016 RETAiL ePUB eBOOK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}