{"title":"Paul Starobin - Madness Rules the Hour 2017 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:3c33acfb43b8344a6ec5139ae7f36e0f92e70d69&dn=Paul+Starobin+-+Madness+Rules+the+Hour+2017+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"anders","categoryS":"e_books","size":"27790086","seeders":"17","leechers":"5","description":"xx\r\n\r\nPaul Starobin - Madness Rules the Hour 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\n&quot;The tea has been thrown overboard - the revolution of 1860 has been initiated.&quot; (Charleston Mercury, November 8, 1860)\r\n\r\nIn 1860, Charleston, South Carolina, embodied the combustible spirit of the South. No city was more fervently attached to slavery, and no city was seen by the North as a greater threat to the bonds barely holding together the Union. And so, with Abraham Lincoln&apos;s election looming, Charleston&apos;s leaders faced a climactic decision: They could submit to abolition - or they could drive South Carolina out of the Union and hope that the rest of the South would follow.\r\n\r\nIn Madness Rules the Hour, Paul Starobin tells the story of how Charleston succumbed to a fever for war and charts the contagion&apos;s relentless progress and bizarre turns. In doing so he examines the wily propagandists, the ambitious politicians, the gentlemen merchants and their wives and daughters, the compliant pastors, and the white workingmen who waged a violent and exuberant revolution in the name of slavery and Southern independence. They devoured the Mercury, the incendiary newspaper run by a fanatical father and son; made holy the deceased John C. Calhoun; and adopted &quot;Le Marseillaise&quot; as a rebellious anthem. Madness Rules the Hour is a portrait of a culture in crisis and an insightful investigation into the folly that fractured the Union and started the Civil War.\r\n\r\nxx","last_updated":"2017-07-05T12:01:23.787Z","parsed":{"xt":"urn:btih:3c33acfb43b8344a6ec5139ae7f36e0f92e70d69","dn":"Paul Starobin - Madness Rules the Hour 2017 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3c33acfb43b8344a6ec5139ae7f36e0f92e70d69","infoHashBuffer":{"type":"Buffer","data":[60,51,172,251,67,184,52,74,110,197,19,154,231,243,110,15,146,231,13,105]},"name":"Paul Starobin - Madness Rules the Hour 2017 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}