{"title":"RiffTrax Shorts - The Night Dracula Saved the World (highTV)","magnet":"magnet:?xt=urn:btih:3cd2e99705b78a8b93599d850459f64874b54b2e&dn=RiffTrax+Shorts+-+The+Night+Dracula+Saved+the+World+%28highTV%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"nasty_llama","categoryP":"video","categoryS":"other","size":"497705442","seeders":"5","leechers":"4","description":"\r\n\r\nWhen you review the list of reasons that the Star Wars Holiday Special was such a colossal failure, very rarely does &#x201C;Not enough Judd Hirsch&#x201D; come up. &#x201C;Contains no Judd Hirsch&#x201D; was actually one of the few things critics cited as a positive for the SWHS. In fact, rumor has it that George Lucas got the entire special green-lit solely by pitching an hour of television that Judd Hirsch would not appear in.\r\n\r\nSo while The Night that Dracula Saved the World does not have Harvey Korman, or crappy animation, or an elderly wookie pleasuring itself, it does have Judd Hirsch. Please do not go into this special expecting not to see Judd Hirsch. You have been given fair warning. Judd Hirsch plays Dracula, who is facing a major dilemma: he&#x2019;s played by Judd Hirsch. Also, The Witch is refusing to fly over the moon, something that is totally a thing that everyone associates with Halloween. If she doesn&#x2019;t fly over the moon, Halloween will be cancelled (it was already on thin ice after a Halloween special starring Judd Hirsch aired.)\r\n\r\nFortunately for Dracula, he&#x2019;s got a lineup of monsters to help him, none of whom are played by Judd Hirsch. If you&#x2019;re on a box of seasonally available General Mills marshmallow cereal, you&#x2019;re in this special: Frankenstein&apos;s monster, The Wolfman, The Mummy, even MST3K&apos;s own Brain Guy makes an inexplicable appearance. Together they must stop The Witch from doing the unthinkable and ruining Halloween, (though everyone probably would have blamed it on Judd Hirsch anyway.)\r\n\r\nThrill and chill at how low the standards were for winning an Emmy in the 70s! (Seriously. It won one.) The Night that Dracula Saved the World is probably the second worst holiday special of all time, but then again, see it and decide for yourself. At least the Star Wars Holiday Special had those funny old commercials. Happy Halloween!\r\n-------------------------------------------------------------------------------\r\n\r\nIf you like this, visit rifftrax .com - they need about tree-fitty","last_updated":"2017-07-10T12:06:19.916Z","parsed":{"xt":"urn:btih:3cd2e99705b78a8b93599d850459f64874b54b2e","dn":"RiffTrax Shorts - The Night Dracula Saved the World (highTV)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3cd2e99705b78a8b93599d850459f64874b54b2e","infoHashBuffer":{"type":"Buffer","data":[60,210,233,151,5,183,138,139,147,89,157,133,4,89,246,72,116,181,75,46]},"name":"RiffTrax Shorts - The Night Dracula Saved the World (highTV)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}