{"title":"Britain's Great War S01 complete (720p HD, soft Eng subs)","magnet":"magnet:?xt=urn:btih:3cd5d6d4780001c9e96f0544af729a3fb430357d&dn=Britain%27s+Great+War+S01+complete+%28720p+HD%2C+soft+Eng+subs%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"RoaElson","categoryP":"video","categoryS":"anders","size":"4212818012","seeders":"0","leechers":"0","description":"Britain&apos;s Great War S01 complete (720p HD, soft Eng subs)\r\n\r\nE01 War Comes to Britain\r\nJeremy Paxman traces the story of the dramatic early stages of the war, from stunned disbelief to the mass recruitment of volunteer soldiers.\r\n\r\nFear of invasion grips the country, Boy Scouts guard bridges, and spies are suspected everywhere. For the first time, British civilians are fired on by enemy ships and bombed from the air. Paxman meets a 105-year-old eyewitness to the shelling of Hartlepool, who describes how she thought the Germans had landed.\r\n\r\nTotal war has come to Britain.\r\n\r\nE02 The War Machine\r\nIn the second part of his landmark series on how the First World War affected the lives of the British people, Jeremy Paxman describes the crisis facing the country as it becomes clear it is fatally unprepared to fight a modern industrial war.\r\n\r\nNow the whole population is enlisted to turn the country into a war machine: women fill the factories to make bombs and bullets, men are forced to fight at the Front, conscientious objectors are threatened with the firing squad, and striking shipbuilders with jail. Even the beer is watered down on government orders.\r\n\r\nBritain is having to learn to do as it is told.\r\n\r\nE03 The Darkest Hour\r\nJeremy Paxman tells the story of how Britain edged close to defeat in the worst conflict it had ever known. Unearthing the wreck of a German U-boat in the Medway, he describes Germany&apos;s attempt to starve the country into submission - could the Win the War Cookbook save the day?\r\n\r\nHoarders are put on trial as newspapers expose how the rich dine out on lobsters in Mayfair. Fear of moral corruption prompts the government to police the nation&apos;s bedrooms. A full-length documentary film of fighting in the trenches breaks all box office records - but will it push a shocked British public into demanding peace at any price?\r\n\r\nE04 At The Eleventh Hour\r\nJeremy Paxman describes how the country came to the very brink of defeat in the last year of the war. Grieving parents held seances to contact their dead sons, surgeons battled to rebuild the faces of the wounded, and a maverick MP tried to pin the blame for the crisis on a conspiracy of sexual deviants in government.\r\n\r\nAnd then, dramatically, the tide of battle turned, and exhausted Britons found themselves weeping for joy as the armistice was signed. The nation began to count the cost of four years of war, revealing some surprising winners as well as losers.\r\n\r\n(with soft subtitles) \r\n\r\nFirst broadcast: January-February 2014\r\nDuration:  1 hour per episode","last_updated":"2017-08-05T12:05:43.077Z","parsed":{"xt":"urn:btih:3cd5d6d4780001c9e96f0544af729a3fb430357d","dn":"Britain's Great War S01 complete (720p HD, soft Eng subs)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3cd5d6d4780001c9e96f0544af729a3fb430357d","infoHashBuffer":{"type":"Buffer","data":[60,213,214,212,120,0,1,201,233,111,5,68,175,114,154,63,180,48,53,125]},"name":"Britain's Great War S01 complete (720p HD, soft Eng subs)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}