{"title":"Charles Campisi - Blue on Blue 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","magnet":"magnet:?xt=urn:btih:3d592fdd46e0a879e8dff367a6eae763d7d00ee3&dn=Charles+Campisi+-+Blue+on+Blue+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5047997","seeders":"0","leechers":"0","description":"xx\r\n\r\nCharles Campisi - Blue on Blue 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nOne of the most authentic and consistently illuminating portraits of police work ever, Blue on Blue describes the fascinating inner workings of the world&apos;s largest police force and Chief Charles Campisi&apos;s unprecedented two decades putting bad cops behind bars.\r\n\r\nFrom 1996 through 2014, Charles Campisi headed NYPD&apos;s Internal Affairs Bureau, working under four police commissioners and gaining a reputation as hard-nosed and incorruptible. When he retired, only one man on the 36,000-member force had served longer. During Campisi&apos;s IAB tenure, the number of New Yorkers shot, wounded, or killed by cops every year declined by 90 percent, and the number of cops failing integrity tests shrank to an equally startling low.\r\n\r\nBut to achieve those exemplary results, Campisi had to triple IAB&apos;s staff, hire the very best detectives, and put the word out that bad apples wouldn&apos;t be tolerated.\r\n\r\nWhile the early minutes of Campisi&apos;s absorbing account bring us into the real world of cops, showing, for example, the agony that every cop suffers when he fires his gun, later chapters spotlight a harrowing series of investigations that tested IAB&apos;s capacities, forcing detectives to go undercover against cops who were themselves undercover, to hunt down criminals posing as cops, and to break through the &quot;blue wall of silence&quot; to verify rare - but sometimes very real - cases of police brutality.\r\n\r\nTold in an edge-of-the-seat way by a born storyteller, Blue on Blue puts us in the scene, allowing us to listen in on wiretaps and feel the adrenaline rush of drawing in the net. It also reveals new threats to the force, such as the possibility of infiltration by terrorists. Ultimately, the book inspires awe for the man who, for almost two decades, was entrusted with the job of making sure the words &quot;New York&apos;s Finest&quot; never rang hollow.\r\n\r\nA truly revelatory account, Blue on Blue will forever change the way you view police work.\r\n\r\nxx","last_updated":"2017-07-27T12:00:30.021Z","parsed":{"xt":"urn:btih:3d592fdd46e0a879e8dff367a6eae763d7d00ee3","dn":"Charles Campisi - Blue on Blue 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3d592fdd46e0a879e8dff367a6eae763d7d00ee3","infoHashBuffer":{"type":"Buffer","data":[61,89,47,221,70,224,168,121,232,223,243,103,166,234,231,99,215,208,14,227]},"name":"Charles Campisi - Blue on Blue 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}