{"title":"In a Different Key: The Story of Autism","magnet":"magnet:?xt=urn:btih:3e43e79028fc783f57ed998fbf4af0ab0db0ac14&dn=In+a+Different+Key%3A+The+Story+of+Autism&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1032639","seeders":"0","leechers":"0","description":"In a Different Key: The Story of Autism - John Donvan, Caren Zucker [epub]\r\n\r\nNearly seventy-five years ago, Donald Triplett of Forest, Mississippi, became the first child diagnosed with autism. Beginning with his family&#x2019;s odyssey, In a Different Key tells the extraordinary story of this often misunderstood condition, and of the civil rights battles waged by the families of those who have it. Unfolding over decades, it is a beautifully rendered history of ordinary people determined to secure a place in the world for those with autism&#x2014;by liberating children from dank institutions, campaigning for their right to go to school, challenging expert opinion on what it means to have autism, and persuading society to accept those who are different.  \r\n\r\nIt is the story of women like Ruth Sullivan, who rebelled against a medical establishment that blamed cold and rejecting &#x201C;refrigerator mothers&#x201D; for causing autism; and of fathers who pushed scientists to dig harder for treatments. Many others played starring roles too: doctors like Leo Kanner, who pioneered our understanding of autism; lawyers like Tom Gilhool, who took the families&#x2019; battle for education to the courtroom; scientists who sparred over how to treat autism; and those with autism, like Temple Grandin, Alex Plank, and Ari Ne&#x2019;eman, who explained their inner worlds and championed the philosophy of neurodiversity. \r\n\r\nThis is also a story of fierce controversies&#x2014;from the question of whether there is truly an autism &#x201C;epidemic,&#x201D; and whether vaccines played a part in it; to scandals involving &#x201C;facilitated communication,&#x201D; one of many treatments that have proved to be blind alleys; to stark disagreements about whether scientists should pursue a cure for autism. There are dark turns too: we learn about experimenters feeding LSD to children with autism, or shocking them with electricity to change their behavior; and the authors reveal compelling evidence that Hans Asperger, discoverer of the syndrome named after him, participated in the Nazi program that consigned disabled children to death.\r\n\r\nHardcover: 688 pages\r\nPublisher: Crown; 1st edition (January 19, 2016)","last_updated":"2017-12-30T12:00:20.780Z","parsed":{"xt":"urn:btih:3e43e79028fc783f57ed998fbf4af0ab0db0ac14","dn":"In a Different Key: The Story of Autism","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3e43e79028fc783f57ed998fbf4af0ab0db0ac14","infoHashBuffer":{"type":"Buffer","data":[62,67,231,144,40,252,120,63,87,237,153,143,191,74,240,171,13,176,172,20]},"name":"In a Different Key: The Story of Autism","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}