{"title":"Murder In Matera by Helene Stapinski 2017 RETAiL ePUB eBOOK-DiST","magnet":"magnet:?xt=urn:btih:3e778bff988d458bb8a81c9d9273224deb1c9110&dn=Murder+In+Matera+by+Helene+Stapinski+2017+RETAiL+ePUB+eBOOK-DiST&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3300599","seeders":"0","leechers":"0","description":"xx\r\n\r\nMurder In Matera by Helene Stapinski 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA writer goes deep into the heart of Italy to unravel a century-old family mystery in this spellbinding memoir that blends the suspenseful twists of Making a Murderer and the emotional insight of Elena Ferrante&apos;s Neapolitan Novels.\r\n\r\nSince childhood Helene Stapinski heard lurid tales about her great-great-grandmother, Vita. In Southern Italy she was a loose woman who had murdered someone. Immigrating to America with three children, she lost one along the way. Helene&apos;s youthful obsession with Vita deepened as she grew up, eventually propelling the journalist to Italy, where, with her own children in tow, she pursued the story, determined to set the record straight.\r\n\r\nFinding answers would take Helene 10 years and numerous trips to Basilicata, the rural &quot;instep&quot; of Italy&apos;s boot - a mountainous land rife with criminals, superstitions, old-world customs, and desperate poverty. Though false leads sent her down blind alleys, Helene&apos;s dogged search, aided by a few lucky - even miraculous - breaks and a group of colorful local characters, led her to the truth.\r\n\r\nYes, the family tales she&apos;d heard were true. There had been a murder in Helene&apos;s family, a killing that roiled 1870s Italy. But the identities of the killer and victim weren&apos;t who she thought they were. In revisiting events that happened more than a century before, Helene came to another stunning realization - she wasn&apos;t who she thought she was, either.\r\n\r\nWeaving Helene&apos;s own story of discovery with the tragic tale of Vita&apos;s life, Murder in Matera is a literary whodunit and a moving tale of self-discovery that brings into focus a long ago tragedy in a little-known region remarkable for its stunning sunny beauty and dark buried secrets.\r\n\r\nxx","last_updated":"2017-09-02T12:01:09.348Z","parsed":{"xt":"urn:btih:3e778bff988d458bb8a81c9d9273224deb1c9110","dn":"Murder In Matera by Helene Stapinski 2017 RETAiL ePUB eBOOK-DiST","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3e778bff988d458bb8a81c9d9273224deb1c9110","infoHashBuffer":{"type":"Buffer","data":[62,119,139,255,152,141,69,139,184,168,28,157,146,115,34,77,235,28,145,16]},"name":"Murder In Matera by Helene Stapinski 2017 RETAiL ePUB eBOOK-DiST","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}