{"title":"Jason Diamond - Searching for John Hughes 2016 RETAiL ePUB eBOOK","magnet":"magnet:?xt=urn:btih:3ea2e1dae9e6d8fc40fca3fd8296f924821dae2e&dn=Jason+Diamond+-+Searching+for+John+Hughes+2016+RETAiL+ePUB+eBOOK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3037938","seeders":"1","leechers":"0","description":"xx\r\n\r\nJason Diamond - Searching for John Hughes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFor all fans of John Hughes and his hit films, such as National Lampoon&apos;s Vacation, Sixteen Candles, and Home Alone, comes Jason Diamond&apos;s hilarious memoir of growing up obsessed with the iconic filmmaker&apos;s movies - a preoccupation that eventually convinces Diamond he should write Hughes&apos; biography and travel to New York City on a quest that is as funny as it is hopeless.\r\n\r\nFor as long as Jason Diamond can remember, he&apos;s been infatuated with John Hughes&apos; movies. From the outrageous, raunchy antics in National Lampoon&apos;s Vacation to the teenage angst in The Breakfast Club and Pretty in Pink to the insanely clever and unforgettable Home Alone, Jason could not get enough of Hughes&apos; films. And so the seed was planted in his mind that it should fall to him to write a biography of his favorite filmmaker. It didn&apos;t matter to Jason that he had no qualifications, training, background, platform, or direction. Thus went the years-long delusional, earnest, and assiduous quest to reach his goal. But no book came out of these years, and no book will. What he did get was a story that fills the minutes of this unconventional, hilarious memoir.\r\n\r\nIn Searching for John Hughes, Jason tells how a Jewish kid from a broken home in a Chicago suburb - sometimes homeless, always restless - found comfort and connection in the likewise broken lives in the suburban Chicago of John Hughes&apos; oeuvre. He moved to New York to become a writer. He started to write a book he had no business writing. In the meantime he brewed coffee and guarded cupcake cafes. All the while he watched John Hughes movies religiously.\r\n\r\nThough his original biography of Hughes has long since been abandoned, Jason has discovered he is a writer through and through. And the adversity of going for broke has now been transformed into wisdom. Or, at least, a really, really good story.\r\n\r\nIn other words this is a memoir of growing up. One part big dream, one part big failure, one part John Hughes movies, one part Chicago, and one part New York. It&apos;s a story of what comes after the &quot;go for it!&quot; part of the command to young creatives to pursue their dreams - no matter how absurd they might seem at first.\r\n\r\nxx","last_updated":"2017-08-08T12:01:16.758Z","parsed":{"xt":"urn:btih:3ea2e1dae9e6d8fc40fca3fd8296f924821dae2e","dn":"Jason Diamond - Searching for John Hughes 2016 RETAiL ePUB eBOOK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3ea2e1dae9e6d8fc40fca3fd8296f924821dae2e","infoHashBuffer":{"type":"Buffer","data":[62,162,225,218,233,230,216,252,64,252,163,253,130,150,249,36,130,29,174,46]},"name":"Jason Diamond - Searching for John Hughes 2016 RETAiL ePUB eBOOK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}