{"title":"\nThe Rise and Fall of Adam and Eve by Stephen Greenblatt EPUB","magnet":"magnet:?xt=urn:btih:3eccf9c0967037108030fc8793fa45914ad16e44&dn=The+Rise+and+Fall+of+Adam+and+Eve+by+Stephen+Greenblatt+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"45574415","seeders":"2","leechers":"9","description":"xx\r\n\r\nThe Rise and Fall of Adam and Eve by Stephen Greenblatt EPUB\r\n\r\nStephen Greenblatt - Pulitzer Prize- and National Book Award- winning author of The Swerve and Will in the World - investigates the life of one of humankind&apos;s greatest stories.\r\n\r\nBolder even than the ambitious books for which Stephen Greenblatt is already renowned, The Rise and Fall of Adam and Eve explores the enduring story of humanity&apos;s first parents. Comprising only a few ancient verses, the story of Adam and Eve has served as a mirror in which we seem to glimpse the whole long history of our fears and desires, as both a hymn to human responsibility and a dark fable about human wretchedness.\r\n\r\nTracking the tale into the deep past, Greenblatt uncovers the tremendous theological, artistic, and cultural investment over centuries that made these fictional figures so profoundly resonant in the Jewish, Christian, and Muslim worlds and, finally, so very &quot;real&quot; to millions of people even in the present. With the uncanny brilliance he previously brought to his depictions of William Shakespeare and Poggio Bracciolini (the humanist monk who is the protagonist of The Swerve), Greenblatt explores the intensely personal engagement of Augustine, D&#xFC;rer, and Milton in this mammoth project of collective creation while he also limns the diversity of the story&apos;s offspring: rich allegory, vicious misogyny, deep moral insight, and some of the greatest triumphs of art and literature.\r\n\r\nThe biblical origin story, Greenblatt argues, is a model for what the humanities still have to offer: not the scientific nature of things but rather a deep encounter with problems that have gripped our species for as long as we can recall and that continue to fascinate and trouble us today.\r\n\r\nxx","last_updated":"2017-10-09T12:02:25.249Z","parsed":{"xt":"urn:btih:3eccf9c0967037108030fc8793fa45914ad16e44","dn":"The Rise and Fall of Adam and Eve by Stephen Greenblatt EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3eccf9c0967037108030fc8793fa45914ad16e44","infoHashBuffer":{"type":"Buffer","data":[62,204,249,192,150,112,55,16,128,48,252,135,147,250,69,145,74,209,110,68]},"name":"The Rise and Fall of Adam and Eve by Stephen Greenblatt EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}