{"title":"Sorcim Technologies Clone Files Checker 5.1 RePack","magnet":"magnet:?xt=urn:btih:3ee39f1e80f88de04f5ba50ddbeecebe2bdab506&dn=Sorcim+Technologies+Clone+Files+Checker+5.1+RePack&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"reginapoloz","categoryP":"applications","categoryS":"windows","size":"4203576","seeders":"0","leechers":"0","description":"System requirements:\r\n&#x2022; Windows XP / Vista / 7/8/10 (32-bit &amp; 64-bit)\r\n\r\nDescription:\r\nSorcim Technologies Clone Files Checker - a program to search for computer duplicate files and the ability to easily free space with this utility. One of the few programs that boasts the support of the scanning function in the cloud. The duplicate files eat up space, no one finds the time to take care of them. However, there are software solutions that offer to do this for you, and Clone Files Checker is one of them. The program can scan your computer based on a series of filters, which means that you can generate only relevant results.\r\nTo be more specific, you can scan all files or strictly documents, archives, music, videos and images, with the ability to ignore files whose size falls within user-defined intervals. All these parameters can also be used for scanning in the cloud. In the music search mode, you can distinguish the files by artist, album, track, duration, bit rate and the contents of the file.\r\nIn the program settings you can specify one of three search options, namely: CRC32, MD5 and SHA1, with the ability to specify which types of items you want to skip or protect. The application has an intuitive graphical interface that will not cause any difficulties for users, regardless of their level of knowledge.\r\nFeatures of the program:\r\n&#x2022; One click to delete duplicate files with 100% accuracy and speed.\r\n&#x2022; Customizable scanner for scanning certain drives and duplicate folders.\r\n&#x2022; Integration into the context menu for detecting and removing duplicate files.\r\n&#x2022; Quick-Fix will allow you to delete unneeded files instantly.\r\n&#x2022; Recover deleted copies that are stored in a compressed format in the program.\r\n&#x2022; Preview images, songs, videos.\r\n&#x2022; Move identical files to another folder.\r\n&#x2022; Deleting files to the Recycle Bin","last_updated":"2017-05-06T18:01:09.861Z","parsed":{"xt":"urn:btih:3ee39f1e80f88de04f5ba50ddbeecebe2bdab506","dn":"Sorcim Technologies Clone Files Checker 5.1 RePack","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3ee39f1e80f88de04f5ba50ddbeecebe2bdab506","infoHashBuffer":{"type":"Buffer","data":[62,227,159,30,128,248,141,224,79,91,165,13,219,238,206,190,43,218,181,6]},"name":"Sorcim Technologies Clone Files Checker 5.1 RePack","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}