{"title":"The Genius of Being by Peter Ralston EPUB","magnet":"magnet:?xt=urn:btih:3efee4f8401ffd6dcda546edf367d185dc1b4f25&dn=The+Genius+of+Being+by+Peter+Ralston+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"660656","seeders":"57","leechers":"6","description":"xx\r\n\r\nThe Genius of Being by Peter Ralston EPUB\r\n\r\nPeter Ralston&apos;s exceptionally lucid trilogy on the nature of human consciousness culminates here in The Genius of Being, a book of deep contemplations on the unseen elements that create our world. The first volume, The Book of Not Knowing, garnered much praise as a comprehensive exploration of the depths of self and consciousness. The second volume, Pursuing Consciousness, clarifies the difference between enlightenment and self-transformation, and then pairs these two goals in a strikingly effective way. This third book is both shorter and more complex, taking us straight to the heart of the origins of our experience.\r\n\r\nIn a progression of illuminating assertions, Ralston shows us how human consciousness carves out distinctions from whatever is absolutely true. This dynamic not only generates both self and reality from nothing, it imbues them with the quality of objective truth. From the time we first distinguish between self and not-self as infants, we begin making a sequence of existential assumptions that result in the illusion that a self is some ethereal &quot;object&quot; within. This universally accepted assumption persists despite the failure of exhaustive investigations to locate this inner self.\r\n\r\nThis book is not for the faint of heart or the casual seeker, but contemplating the assertions here empowers you to personally and experientially grasp what is rarely even glimpsed: a profound consciousness of the genesis of human experience.\r\n\r\nxx","last_updated":"2017-12-10T12:08:15.008Z","parsed":{"xt":"urn:btih:3efee4f8401ffd6dcda546edf367d185dc1b4f25","dn":"The Genius of Being by Peter Ralston EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3efee4f8401ffd6dcda546edf367d185dc1b4f25","infoHashBuffer":{"type":"Buffer","data":[62,254,228,248,64,31,253,109,205,165,70,237,243,103,209,133,220,27,79,37]},"name":"The Genius of Being by Peter Ralston EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}