{"title":"Crea v1.4.7","magnet":"magnet:?xt=urn:btih:3f6e0aeb0c0d1e15094c8647ed277cae8ade1122&dn=Crea+v1.4.7&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"110442935","seeders":"14","leechers":"1","description":"Embark on an adventure with what little you have and discover what the world of Crea has to offer. Through each action, improve your talents and master many skills. Through each victory, grow in strength and shape yourself. Through each inquiry, unlock new items to craft and build. Through each expedition, explore new realms and uncover Crea&#x2019;s lore.Level up by defeating enemiesLearn over 80 skills through the talent systemLoot and craft powerful gear with unique attributesDiscover the world&#x2019;s expansive mythos and historyDefeat challenging original monsters each with their own attacksSurvive by timing shield blocks and dodge rollingVanquish by your weapon of choice: Sword, Spear, Bow, or MagicChallenge massive bosses and prepare to dieResearch materials to discover their crafting capabilitiesFind old recipe scrolls scattered throughout the worldUpgrade equipment to carry over their statsUse chaos crafting (minigame) to create even more powerful itemsExplore massive procedurally generated worldsQuickly teleport through the use of Way Crystals, Way Shards and RiftsDelve into dungeons that not only look different but play different every timeTravel to completely new Realms beyond the bounds of the main worldBuilt from the ground up with modding in mindAll gameplay","last_updated":"2017-07-01T12:03:05.447Z","parsed":{"xt":"urn:btih:3f6e0aeb0c0d1e15094c8647ed277cae8ade1122","dn":"Crea v1.4.7","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3f6e0aeb0c0d1e15094c8647ed277cae8ade1122","infoHashBuffer":{"type":"Buffer","data":[63,110,10,235,12,13,30,21,9,76,134,71,237,39,124,174,138,222,17,34]},"name":"Crea v1.4.7","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}