{"title":"The Life and Work of George Boole: A Prelude to the Digital Age","magnet":"magnet:?xt=urn:btih:3f96ff7756f41b8f913c14bb0327247426d0d3f9&dn=The+Life+and+Work+of+George+Boole%3A+A+Prelude+to+the+Digital+Age&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"6100777","seeders":"74","leechers":"11","description":"The Life and Work of George Boole: A Prelude to the Digital Age - Desmond MacHale, Ian Stewart [epub]\r\n\r\nThis book is the first full-length biography of George Boole (1815&#x2013;1864), who has been variously described as the founder of pure mathematics, father of computer science and discoverer of symbolic logic. Boole is mostly remembered as a mathematician and logician whose work found application in computer science long after his death, but this biography reveals Boole as much more than a mathematical genius; he was a child prodigy, self-taught linguist and practical scientist, turbulent academic and devoted teacher, social reformer and poet, psychologist and humanitarian, religious thinker and good family man &#x2013; truly a nineteenth-century polymath.\r\n\r\nBoole was deeply interested in the idea of expressing the workings of the human mind in symbolic form, and his two books on this subject, The Mathematical Analysis of Logic (1847) and An Investigation of the Laws of Thought (1854) form the basis of today&#x2019;s computer science and electronic circuitry. He also made important contributions to areas of mathematics such as invariant theory (of which he was the founder), differential and difference equations and probability. Much of the &quot;new mathematics&quot; now studied by children in school &#x2013; set theory, binary numbers and Boolean algebra, has its origins in Boole&#x2019;s work.\r\n\r\nIn 1849, Boole was appointed first professor of mathematics in Ireland&#x2019;s new Queen&#x2019;s College (now University College) Cork and taught and worked there until his tragic and premature death in 1864. In 1855, he had married Mary Everest, a niece of the man after whom the world&#x2019;s highest mountain is named. The Booles had five remarkable daughters including Alicia, a mathematician, Lucy, a professor of chemistry, and Ethel (Voynich), a novelist and author of The Gadfly.\r\n\r\nHardcover: 360 pages\r\nPublisher: Cork University Press; New edition (November 18, 2014)","last_updated":"2018-01-01T12:04:26.288Z","parsed":{"xt":"urn:btih:3f96ff7756f41b8f913c14bb0327247426d0d3f9","dn":"The Life and Work of George Boole: A Prelude to the Digital Age","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"3f96ff7756f41b8f913c14bb0327247426d0d3f9","infoHashBuffer":{"type":"Buffer","data":[63,150,255,119,86,244,27,143,145,60,20,187,3,39,36,116,38,208,211,249]},"name":"The Life and Work of George Boole: A Prelude to the Digital Age","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}