{"title":"\nBeing and Being Bought: Prostitution, Surrogacy and the Split Se","magnet":"magnet:?xt=urn:btih:400f5f5091dd2d992b68d6e0b436e968444729b0&dn=Being+and+Being+Bought%3A+Prostitution%2C+Surrogacy+and+the+Split+Se&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"1741830","seeders":"0","leechers":"0","description":"Being and Being Bought: Prostitution, Surrogacy and the Split Self/ /Kajsa Ekis Ekman/2014/PDF\r\n\r\nEnglish|Non-Fiction|ISBN-13: 978-1742198767|223pg|1.6Mb|Spinifex \r\n\r\nIn 1998, Sweden passed ground-breaking legislation criminalizing the purchase of sexual services which sought to curb demand and support women exiting the sex industry. \r\n\r\nGrounded in the reality of the violence and abuse inherent in prostitution and reeling from the death of a friend to prostitution in Spain, Kajsa Ekis Ekman exposes the many lies in the sex work&#x2019; scenario. Trade unions aren&#x2019;t trade unions. Groups for prostituted women are simultaneously groups for brothel owners. \r\n\r\nDrawing on Marxist and feminist analyses, Ekis Ekman argues that the Self must be split from the body to make it possible to sell your body without selling yourself. The body becomes sex. Sex becomes a service. The story of the sex worker says: the Split Self is not only possible, it is the ideal. \r\n\r\nThe body becomes sex. Sex becomes a service. The story of the sex worker says: the Split Self is not only possible, it is the ideal. Turning to the practice of surrogate motherhood, Kajsa Ekis Ekman identifies the same components.\r\n\r\nThe woman is neither connected to her own body nor to the child she grows in her body and gives birth to. \r\n\r\nSurrogacy becomes an extended form of prostitution. In this capitalist creation story, the parent is the one who pays. The product sold is not sex but a baby. Ekis Ekman asks: why should this not be called baby trade?\r\n\r\nKajsa Ekis Ekman is a Swedish author and journalist, born 1980. She works as a critic at the Swedish major daily Dagens Nyheter and is an op-ed writer at the newspaper ETC. She lectures over the world on capitalism, economic crisis and trade in women","last_updated":"2017-09-28T12:01:24.925Z","parsed":{"xt":"urn:btih:400f5f5091dd2d992b68d6e0b436e968444729b0","dn":"Being and Being Bought: Prostitution, Surrogacy and the Split Se","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"400f5f5091dd2d992b68d6e0b436e968444729b0","infoHashBuffer":{"type":"Buffer","data":[64,15,95,80,145,221,45,153,43,104,214,224,180,54,233,104,68,71,41,176]},"name":"Being and Being Bought: Prostitution, Surrogacy and the Split Se","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}