{"title":"Miss D and Me_ Life With the Invincible Bette Davis by Kathryn S","magnet":"magnet:?xt=urn:btih:4078712cec18645200059db085f2620596f141a0&dn=Miss+D+and+Me_+Life+With+the+Invincible+Bette+Davis+by+Kathryn+S&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"24654745","seeders":"0","leechers":"0","description":"xx\r\n\r\nMiss D &amp; Me_ Life With the Invincible Bette Davis by Kathryn Sermak ePUB eBOOK-ZAK\r\n\r\nFor 10 years, Kathryn Sermak was at Bette Davis&apos;s side - first as an employee, and then as her closest friend - and in Miss D and Me she tells the story of the great star&apos;s harrowing but inspiring final years, a story fans have been waiting decades to hear.\r\n\r\nMiss D and Me is a story of two powerful women, one at the end of her life and the other at the beginning. As Bette Davis aged, she was looking for an assistant, but she found something more than that in Kathryn: a loyal and loving buddy, a co-conspirator in her jokes and schemes, and a competent assistant whom she trained never to miss a detail. But Miss D had strict rules for Kathryn about everything from how to eat a salad to how to wear her hair...even the spelling of Kathryn&apos;s name was changed (adding the &quot;y&quot;) per Miss D&apos;s request. Throughout their time together, the two grew incredibly close, and Kathryn had a front-row seat to the larger-than-life Davis&apos;s career renaissance in her later years, as well as to the humiliating public betrayal that nearly killed Miss D.\r\n\r\nThe frame of this story is a four-day road trip Kathryn and Davis took from Biarritz to Paris, during which they disentangled their ferocious dependency. Miss D and Me is a window into the world of the unique and formidable Bette Davis, told by the person who perhaps knew her best of all.\r\n\r\nxx","last_updated":"2017-09-19T12:43:01.394Z","parsed":{"xt":"urn:btih:4078712cec18645200059db085f2620596f141a0","dn":"Miss D and Me_ Life With the Invincible Bette Davis by Kathryn S","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4078712cec18645200059db085f2620596f141a0","infoHashBuffer":{"type":"Buffer","data":[64,120,113,44,236,24,100,82,0,5,157,176,133,242,98,5,150,241,65,160]},"name":"Miss D and Me_ Life With the Invincible Bette Davis by Kathryn S","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}