{"title":"Hue 1968: A Turning Point of the American War in Vietnam By Mark","magnet":"magnet:?xt=urn:btih:4112d05d102543afbb5e3333aaf6adc8f390f1f5&dn=Hue+1968%3A+A+Turning+Point+of+the+American+War+in+Vietnam+By+Mark&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"6840988","seeders":"18","leechers":"3","description":"\nHue 1968: A Turning Point of the American War in Vietnam By Mark Bowden(2017) - EPUB - zeke23\r\n\r\nISBN: 0802127002 | 2017 | EPUB | 608 Pages | 7 MB\r\nNot since his #1 New York Times bestseller Black Hawk Down has Mark Bowden written a book about a battle. His most ambitious work yet, Hue 1968 is the story of the centerpiece of the Tet Offensive and a turning point in the American War in Vietnam.\r\n\r\nBy January 1968, despite an influx of half a million American troops, the fighting in Vietnam seemed to be at a stalemate. Yet General William Westmoreland, commander of American forces, announced a new phase of the war in which &quot;the end begins to come into view.&quot; The North Vietnamese had different ideas. In mid-1967, the leadership in Hanoi had started planning an offensive intended to win the war in a single stroke. Part military action and part popular uprising, the Tet Offensive included attacks across South Vietnam, but the most dramatic and successful would be the capture of Hue, the country&apos;s cultural capital. At 2:30 a.m. on January 31, 10,000 National Liberation Front troops descended from hidden camps and surged across the city of 140,000. By morning, all of Hue was in Front hands save for two small military outposts.\r\n\r\nThe commanders in country and politicians in Washington refused to believe the size and scope of the Front&apos;s presence. Captain Chuck Meadows was ordered to lead his 160-marine Golf Company against thousands of enemy troops in the first attempt to re-enter Hue later that day. After several futile and deadly days, Lieutenant Colonel Ernie Cheatham would finally come up with a strategy to retake the city, block by block and building by building, in some of the most intense urban combat since World War II.\r\nWith unprecedented access to war archives in the U.S. and Vietnam and interviews with participants from both sides, Bowden narrates each stage of this crucial battle through multiple points of view. Played out over twenty-four days of terrible fighting and ultimately costing 10,000 combatant and civilian lives, the Battle of Hue was by far the bloodiest of the entire war. When it ended, the American debate was never again about winning, only about how to leave. In Hue 1968, Bowden masterfully reconstructs this pivotal moment in the American War in Vietnam","last_updated":"2017-06-12T12:01:20.340Z","parsed":{"xt":"urn:btih:4112d05d102543afbb5e3333aaf6adc8f390f1f5","dn":"Hue 1968: A Turning Point of the American War in Vietnam By Mark","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4112d05d102543afbb5e3333aaf6adc8f390f1f5","infoHashBuffer":{"type":"Buffer","data":[65,18,208,93,16,37,67,175,187,94,51,51,170,246,173,200,243,144,241,245]},"name":"Hue 1968: A Turning Point of the American War in Vietnam By Mark","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}