{"title":"Chemistry and Molecular Aspects of Drug Design and Action","magnet":"magnet:?xt=urn:btih:41839a0f02a9b98180e2f14c57ea2081a71e2e2a&dn=Chemistry+and+Molecular+Aspects+of+Drug+Design+and+Action&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"7479081","seeders":"0","leechers":"0","description":"Chemistry and Molecular Aspects of Drug Design and Action - E.A. Rekka, P.N. Kourounakis (CRC, 2008).pdf\r\n\r\nAn ever-increasing demand for better drugs, elevated safety standards, and economic considerations have all led to a dramatic paradigm shift in the way that drugs are being discovered and developed. Known as rational drug design, this contemporary process is defined by three main steps: the discovery of lead compounds, surgical manipulation to develop pharmacophores, and further optimization to produce the best compounds.\r\n\r\nChemistry and Molecular Aspects of Drug Design and Action brings together an impressive collection of world-renowned pharmacochemistry scientists who are currently defining the emergence of rational drug design. Offering insight from their own specialized research, these pioneers highlight the variety of approaches being employed in this field, including those that start by considering either molecular mechanisms of drug action, or the metabolizing enzyme action occurring in the structure of a drug molecule. Another approach they explore is one that starts from the pathobiochemistry and pathophysiology of target diseases. Furthermore, the book also considers drug development that makes use of already developed compounds stored in data banks.\r\n\r\nDivided into five parts, each dedicated to various aspects of the classical medicinal chemistry approach, the text makes it easy for readers to focus on a field of specific interest.\r\n\r\nChemical, Biochemical, and Biological Aspects of Pathophysiological Conditions\r\nClassical Medicinal Chemistry\r\nDrug Design, Chemical and Molecular Aspects of Drug Action\r\nDrug Xenobiotic Metabolism\r\nPhysical Organic and Theoretical Medicinal Chemistry\r\nWhile each section can be studied independently, the combined material in this volume provides the most comprehensive overview available on rational drug design. This work is an invaluable resource both for those entering the field, as well as those researchers looking to build on current progress","last_updated":"2017-08-06T12:00:17.748Z","parsed":{"xt":"urn:btih:41839a0f02a9b98180e2f14c57ea2081a71e2e2a","dn":"Chemistry and Molecular Aspects of Drug Design and Action","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"41839a0f02a9b98180e2f14c57ea2081a71e2e2a","infoHashBuffer":{"type":"Buffer","data":[65,131,154,15,2,169,185,129,128,226,241,76,87,234,32,129,167,30,46,42]},"name":"Chemistry and Molecular Aspects of Drug Design and Action","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}