{"title":"Henry Roth - Mercy of a Rude Stream and other works (4 books)","magnet":"magnet:?xt=urn:btih:41a5d362ace718bec42dda721c6b11fd33ea2678&dn=Henry+Roth+-+Mercy+of+a+Rude+Stream+and+other+works+%284+books%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"workerbee","categoryP":"other","categoryS":"e_books","size":"7603690","seeders":"21","leechers":"6","description":"\r\nHENRY ROTH (1906-1995) was an American novelist and short story writer whose work centers on immigrant experience, particularly the Jewish-American experience in Depression-era America.  The novels reveal an obsession with cultural depravity: the internal dislocation of the intellectual and of society at large that features so prominently in the work of the greatest Modernist writers.  While Roth&apos;s books are generally tragic, and often relentlessly so, his later work holds out for the possibility of redemption, or of mercy in a rude stream.\r\n\r\nCALL IT SLEEP (1934), Roth&apos;s first novel, centers on the turbulent experiences of a young boy, David Schearl, growing up in the Jewish immigrant slum of New York&apos;s Lower East Side in the early twentieth century.\r\n\r\nMERCY OF A RUDE STREAM (1994-1998) is a monumental epic published in four volumes.  It follows protagonist Ira Stigman from his family&apos;s arrival in Jewish-Irish Harlem in 1914 to the night before Thanksgiving in 1927, when Ira decides to leave the family tenement and move in with Edith Welles.  According to critic David Mehegan, Roth&apos;s Mercy represents a &quot;landmark of the American literary century.&quot;\r\n\r\nRoth&apos;s final novel, AN AMERICAN TYPE (2010), begins where MERCY left off and continues through 1990.  With echoes of Nathanael West and John Steinbeck, this autobiographical work is a heartrending statement about American identity and the universal transcendence of love.\r\n\r\nSHIFTING LANDSCAPE (1987) collects all of Roth&apos;s published writings, other than the above novels, into one major body of work, spanning a period that beings in 1925 and ends in 1987.  The thirty-one pieces include all of Roth&apos;s short stories, the only remaining chapter of the unfinished second novel that he wrote for Maxwell Perkins (and later burned), and other articles and memoir materials.\r\n\r\n\r\nThe following books are in ePUB format unless otherwise noted:\r\n\r\n* An American Type (Norton, 2010)\r\n\r\n* Call It Sleep (Picador, 2013)\r\n\r\n* Mercy of a Rude Stream: The Complete Novels (Liveright, 2014)\r\n\r\n* Shifting Landscape: A Composite, 1925-1987 (Jewish Publication Society, 1987).  Edited Mario Materassi. -- PDF\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at the TPB forum (you will need to register an account): https://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","last_updated":"2017-05-27T08:57:22.336Z","parsed":{"xt":"urn:btih:41a5d362ace718bec42dda721c6b11fd33ea2678","dn":"Henry Roth - Mercy of a Rude Stream and other works (4 books)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"41a5d362ace718bec42dda721c6b11fd33ea2678","infoHashBuffer":{"type":"Buffer","data":[65,165,211,98,172,231,24,190,196,45,218,114,28,107,17,253,51,234,38,120]},"name":"Henry Roth - Mercy of a Rude Stream and other works (4 books)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}