{"title":"The Steven Page Love Album - BUMSCAGS","magnet":"magnet:?xt=urn:btih:42a5ba3fda44af1d271b2a868a10afac58cb4c8a&dn=The+Steven+Page+Love+Album+-+BUMSCAGS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BUMSCAGS","categoryP":"audio","categoryS":"music","size":"112206733","seeders":"7","leechers":"3","description":"This is a tribute to former Barenaked Ladies singer Steven Page. I know Steven has a humorous side and a dark side. I know he loves singing about food and parody/satire. Knowing this, I thought I&apos;d rework some tunes of mine as a tribute to him.\r\nBACKGROUND:\r\nA FEW DAYS AGO, ABOUT MARCH 27, 2017, I HAD A DREAM THAT STEVEN PAGE WAS MAKING FUN OF ME AND THEN HE TURNED INTO A REALLY MEAN GUY. THEN HE WENT ON A TRIP BACK TO TORONTO AND NO ONE EVER HEARD FROM HIM AGAIN. SO I THOUGHT WHY NOT MAKE A TRIBUTE USING MY DREAM OF HIS UNKINDNESS MIXED WITH WHAT LITTLE I KNOW ABOUT THE ACTUAL GUY. I&apos;VE HAD IDENTICAL DREAMS ABOUT LOU REED (FOR WHOM I WROTE A TRIBUTE), DAVID BOWIE AND MICHAEL STIPE. I&apos;D SAY HE&apos;S IN GOOD COMPANY. SO BASICALLY, THIS IS NOT THE GUY. I&apos;VE NEVER MET THE GUY. ALL I KNOW IS THAT I WAS A HUGE FAN FOR YEARS AND ATTENDED MY ALL-TIME BEST CONCERT IN 1995 (BRANDON, MANITOBA, CANADA). CAN YOU BELIEVE THEY HAD A GUY BBQ HOTDOGS AND THROW THEM TO THE CROWD? I HAD A GREAT TIME. I WAS ALSO SAD BECAUSE I KNEW EVEN THOUGH I EMOTIONALLY BONDED TO THE MUSIC, I WAS JUST A NOBODY IN THE CROWD AND LITTLE HAS CHANGED. MUST BE HARD BEING A PUBLIC FIGURE. ALSO, I AM BIPOLAR. RUMOUR IS THAT STEVEN IS TOO. SO? I GUESS I WILL START MAKING ORIGINALS AGAIN AS AN ARMCHAIR CHICKENSHIT MUSICIAN WHO WILL NEVER PERFORM? WELL, IT&apos;S A LONG ROAD AHEAD. ENJOY THIS FICTION ABOUT A HERO FROM MY PAST, STEVEN PAGE. HE&apos;S VERY HUMAN AND I RECOMMEND CHECKING HIM OUT IF YOU DON&apos;T KNOW WHO HE IS. THANK YOU STEVEN. THANK YOU ALL.\r\n\r\n\r\n\r\nTRACK LISTING:\r\n\r\nTHE FANS NEVER LOVED ME\r\nSINGING LIKE KERMIT THE FROG DID\r\nSTEVEN PAGE, BIPOLAR AGAIN\r\nDAMN THOSE DAYS, THOSE GOD FORSAKEN DAYS\r\nI WAS STEVEN PAGE\r\nWHENEVER, WHEREVER, WHATEVER STEVEN PAGE\r\nSTEVEN WILL SHUT YOU OUT\r\nBRIAN WILSON, SECRET AGENT MAN\r\nODE TO STEVEN PAGE (WHEN THE BAND IS DONE)\r\nBARENAKED LADIES REUNION\r\nBALLAD OF A BROKEN MAN\r\nBONUS TRACK: STEVEN PAGE WIKIPEDIA PAGE\r\nBONUS TRACK: FAST BASKETBALL (PEE-WEE HERMAN VS. STEVEN PAGE)\r\nEXPLANATION FOR THE STEVEN PAGE LOVE ALBUM\r\n\r\nCOMPOSED AND PERFORMED BY DAVID BRAWNER/CHAIRMAN MEOW EXCEPT BRIAN WILSON, SECRET AGENT MAN WRITTEN BY STEVEN PAGE WITH THE BARENAKED LADIES AS BRIAN WILSON","last_updated":"2017-12-22T12:07:25.550Z","parsed":{"xt":"urn:btih:42a5ba3fda44af1d271b2a868a10afac58cb4c8a","dn":"The Steven Page Love Album - BUMSCAGS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"42a5ba3fda44af1d271b2a868a10afac58cb4c8a","infoHashBuffer":{"type":"Buffer","data":[66,165,186,63,218,68,175,29,39,27,42,134,138,16,175,172,88,203,76,138]},"name":"The Steven Page Love Album - BUMSCAGS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}