{"title":"PearlMATE-5.1_03-01-2017_i386.iso","magnet":"magnet:?xt=urn:btih:436247d78f26717aaea4e45dec02e8a6e2c609ad&dn=PearlMATE-5.1_03-01-2017_i386.iso&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"apple2torrent","categoryP":"applications","categoryS":"windows","size":"1843396608","seeders":"1","leechers":"0","description":" <a href=\"http://www.pearllinux.com/111.png\" rel=\"nofollow\" target=\"_NEW\">http://www.pearllinux.com/111.png</a>\r\n <a href=\"\nhttp://www.pearllinux.com/555.png\" rel=\"nofollow\" target=\"_NEW\">\nhttp://www.pearllinux.com/555.png</a>\r\n\r\nPearl releases in that many desktop utilities including the updating of software and new software installations plus many other features that are similar to Linux Mint.  What makes Pearl different however are some added features found with the Ubuntu MATE distribution such as MATE Tweak.  Tho Pearl is in no way associated with either Linux Mint or Ubuntu MATE,  with some minor code changes we were able to enjoy the best from both these fine distributions as well as incorporate it into the basic Pearl system. \r\nOn every Pearl Linux release what you can always expect is the overall default themeto be as close to the Snow Leopard OSX system as possible according to the  desktop environment which release was built on the appearance and feel may vary slightly.  Compiz Effects is also something you can expect from Pearl on all releases.  We also provide PinguyBuilder which is software used to make an image of your live system that you have customized, and make your own  LIVE Linux USB installer. Just as in the past with Remastersys, PinguyBuilder has stopped support for their software. Under most conditions PinguyBuilder still works on Ubuntu 16.04 and most distros modeled after that release however we changed some code to make it work with 5.0 which due to running the Linux Mint style utilities were needed to not have installer issues. Also with all Pearl releases we use Thunar file manager with our standard extra right click customized command pre installed. This is a feature aimed torward the advanced user as well a newbees.\r\n\r\nburn to dvd using ultraiso or poweriso or use rufus to create bootable usb and boot from it\r\n\r\nthis is for intel processors","last_updated":"2017-06-01T12:05:01.740Z","parsed":{"xt":"urn:btih:436247d78f26717aaea4e45dec02e8a6e2c609ad","dn":"PearlMATE-5.1_03-01-2017_i386.iso","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"436247d78f26717aaea4e45dec02e8a6e2c609ad","infoHashBuffer":{"type":"Buffer","data":[67,98,71,215,143,38,113,122,174,164,228,93,236,2,232,166,226,198,9,173]},"name":"PearlMATE-5.1_03-01-2017_i386.iso","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}