{"title":"WinRAR 5.50 Incl. License Key (32 + 64 Bit)","magnet":"magnet:?xt=urn:btih:442dfbd92fb95321a225d3f01bc1e5eb724c530d&dn=WinRAR+5.50+Incl.+License+Key+%2832+%2B+64+Bit%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"davidz76","categoryP":"applications","categoryS":"windows","size":"5824325","seeders":"0","leechers":"0","description":"Final release of WinRAR 5.50 is the result of continuous development and it is a multifunctional, user-friendly software with an intuitive interface featuring state-of-the-art options for downsizing, extracting, securing, restoring, fixing, sharing and managing files. \r\n\r\nIn the new version additional features - especially for the password manager - and usability improvements have been added.\r\n\r\nRAR5 Default Archive format\r\n\r\nWhen users archive or share files, they will benefit from an outstanding compression ratio along with a fast compression rate to save you space and bandwidth. From version 5.50 on WinRAR and command line RAR use RAR 5.0 archive format by default. The user can change it to RAR 4.x compatible format with &quot;RAR4&quot; option in archiving dialog or -ma4 command line switch. This change affects only new, clean installs. If RAR format has been saved in the default compression profile in previous versions, WinRAR respects these stored settings.\r\n\r\nPassword Manager Improvements\r\n\r\nIn passwords we trust. And with WinRAR&#x2019;s 256-bit password protection the user won&#x2019;t be having any trust issues. In the latest release the password dialog has been updated, and from now on there is the possibility to use a master password. The &quot;Set master password&quot; button in &quot;Organize passwords&quot; dialog can be used to encrypt saved password records and protect them from unauthorized access. If the entered password does not match the master password, it is treated as a usual password for archive operations. To permanently save the master password WinRAR has to be closed.\r\n\r\nThe latest version uses a new data format for the password organizer, so passwords stored in the &quot;Organize passwords&quot; dialog are not readable by older versions. It does not affect archive encryption formats and encrypted archives are compatible with previous WinRAR versions. Organizer data is converted to a new format only when users save it, but not immediately after installing WinRAR.\r\n\r\nIn addition the usability of decompression dialog of password protected archives has been improved. If a wrong password has been entered when unpacking an encrypted RAR5 archive, WinRAR now proposes to enter a valid password for the same file instead of aborting extraction.\r\n\r\nPassword Manager Improvements\r\n\r\nThe security of other compression file formats has also been improved further. From version 5.50 on WinRAR uses AES-256 by default in CTR mode to encrypt ZIP archives as it is significantly more secure than the ZIP 2.0 legacy encryption algorithm. An extraction support was added for .LZ archives created by Lzip compressor and LZ and ZIPX have also been added to the list of associations in Settings/Integration dialog","last_updated":"2017-11-02T12:03:51.808Z","parsed":{"xt":"urn:btih:442dfbd92fb95321a225d3f01bc1e5eb724c530d","dn":"WinRAR 5.50 Incl. License Key (32   64 Bit)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"442dfbd92fb95321a225d3f01bc1e5eb724c530d","infoHashBuffer":{"type":"Buffer","data":[68,45,251,217,47,185,83,33,162,37,211,240,27,193,229,235,114,76,83,13]},"name":"WinRAR 5.50 Incl. License Key (32   64 Bit)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}