{"title":"\nOriginal Gangstas by Ben Westhoff EPUB","magnet":"magnet:?xt=urn:btih:448e67dd5c516fc5bad9c848e38573e3d1181ffc&dn=Original+Gangstas+by+Ben+Westhoff+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17984593","seeders":"0","leechers":"0","description":"xx\r\n\r\nOriginal Gangstas by Ben Westhoff EPUB\r\n\r\nA monumental, revealing narrative history about the legendary group of artists at the forefront of West Coast hip-hop: Eazy-E, Dr. Dre, Ice Cube, Snoop Dogg, and Tupac Shakur.\r\n\r\nAmid rising gang violence, the crack epidemic, and police brutality, a group of unlikely voices cut through the chaos of late 1980s Los Angeles: N.W.A. Led by a drug dealer, a glammed-up producer, and a high school kid, N.W.A. gave voice to disenfranchised African Americans across the country. And they quickly redefined pop culture across the world.\r\n\r\nTheir names remain as popular as ever: Eazy-E, Dr. Dre, and Ice Cube. Dre soon joined forces with Suge Knight to create the combustible Death Row Records, which in turn transformed Snoop Dogg and Tupac Shakur into superstars.\r\n\r\nBen Westhoff explores how this group of artists shifted the balance of hip-hop from New York to Los Angeles. He shows how N.W.A.&apos;s shocking success led to rivalries between members and record labels and eventually a war between East Coast and West Coast factions. In the process hip-hop burst into mainstream America at a time of immense social change and became the most dominant musical movement of the last 30 years. At gangsta rap&apos;s peak, two of its biggest names - Tupac and Biggie Smalls - were murdered, leaving the surviving artists to forge peace before the genre annihilated itself.\r\n\r\nFeaturing extensive investigative reporting, interviews with the principal players, and dozens of never-before-told stories, Original Gangstas is a groundbreaking addition to the history of popular music.\r\n\r\nxx","last_updated":"2017-10-10T12:01:39.636Z","parsed":{"xt":"urn:btih:448e67dd5c516fc5bad9c848e38573e3d1181ffc","dn":"Original Gangstas by Ben Westhoff EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"448e67dd5c516fc5bad9c848e38573e3d1181ffc","infoHashBuffer":{"type":"Buffer","data":[68,142,103,221,92,81,111,197,186,217,200,72,227,133,115,227,209,24,31,252]},"name":"Original Gangstas by Ben Westhoff EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}