{"title":"Corridors of the Night by Anne Perry (William Monk series) epub ","magnet":"magnet:?xt=urn:btih:44c65b4f17f40531cc7c46bd671e88ac422a77bb&dn=Corridors+of+the+Night+by+Anne+Perry+%28William+Monk+series%29+epub+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4485567","seeders":"28","leechers":"6","description":"Corridors of the Night by Anne Perry (William Monk series) epub RtR\r\n\r\nAnne Perry, that incomparable novelist of life in Victorian England, has once again surpassed herself with this 21st installment of her New York Times best-selling William Monk series. In Corridors of the Night, nurse Hester Monk and her husband, William, commander of the Thames River Police, do desperate battle with two obsessed scientists who, in the name of healing, have turned to homicide. The monomaniacal Rand brothers - Magnus, a cunning doctor, and Hamilton, a genius chemist - are utterly ruthless in their pursuit of a cure for the fatal &quot;white-blood disease&quot;. In London&apos;s Royal Naval Hospital annex, Hester is tending one of the brothers&apos; dying patients - wealthy Bryson Radnor - when she stumbles upon three weak, terrified young children and learns, to her horror, that they&apos;ve been secretly purchased and imprisoned by the Rands for experimental purposes. But the Rand brothers are too close to a miracle cure to allow their experiments to be exposed. Before Hester can reveal the truth, she, too, becomes a prisoner. As Monk and his faithful friends - distinguished lawyer Oliver Rathbone and reformed brothel keeper Squeaky Robinson among them - scour London&apos;s grimy streets and the beautiful English countryside searching for her, Hester&apos;s time, as well as the children&apos;s, is quickly draining away. Taut with intrigue and laced with white-knuckled terror, Corridors of the Night is Anne Perry at her magnificent, unforgettable best","last_updated":"2017-05-27T09:03:41.618Z","parsed":{"xt":"urn:btih:44c65b4f17f40531cc7c46bd671e88ac422a77bb","dn":"Corridors of the Night by Anne Perry (William Monk series) epub ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"44c65b4f17f40531cc7c46bd671e88ac422a77bb","infoHashBuffer":{"type":"Buffer","data":[68,198,91,79,23,244,5,49,204,124,70,189,103,30,136,172,66,42,119,187]},"name":"Corridors of the Night by Anne Perry (William Monk series) epub ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}