{"title":"The Idealist - Justin Peters","magnet":"magnet:?xt=urn:btih:44fd4c62ba650f42ba675fff978873f1cdcc29f9&dn=The+Idealist+-+Justin+Peters&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Spud17","categoryP":"other","categoryS":"e_books","size":"5628432","seeders":"21","leechers":"8","description":"The Idealist: Aaron Swartz and the Rise of Free Culture on the Internet -Justin Peters\r\n\r\nA smart, lively history of the Internet free culture movement and its larger effects on society&#x2014;and the life and shocking suicide of Aaron Swartz, a founding developer of Reddit and Creative Commons&#x2014;from Slate correspondent Justin Peters.\r\n\r\nAaron Swartz was a zealous young advocate for the free exchange of information and creative content online. He committed suicide in 2013 after being indicted by the government for illegally downloading millions of academic articles from a nonprofit online database. From the age of fifteen, when Swartz, a computer prodigy, worked with Lawrence Lessig to launch Creative Commons, to his years as a fighter for copyright reform and open information, to his work leading the protests against the Stop Online Piracy Act (SOPA), to his posthumous status as a cultural icon, Swartz&#x2019;s life was inextricably connected to the free culture movement. Now Justin Peters examines Swartz&#x2019;s life in the context of 200 years of struggle over the control of information.\r\n\r\nIn vivid, accessible prose, The Idealist situates Swartz in the context of other &quot;data moralists&quot; past and present, from lexicographer Noah Webster to ebook pioneer Michael Hart to NSA whistleblower Edward Snowden. In the process, the book explores the history of copyright statutes and the public domain; examines archivists&#x2019; ongoing quest to build the &#x201C;library of the future&#x201D;; and charts the rise of open access, copyleft, and other ideologies that have come to challenge protectionist IP policies. Peters also breaks down the government&#x2019;s case against Swartz and explains how we reached the point where federally funded academic research came to be considered private property, and downloading that material in bulk came to be considered a federal crime.\r\n\r\nThe Idealist is an important investigation of the fate of the digital commons in an increasingly corporatized Internet, and an essential look at the impact of the free culture movement on our daily lives and on generations to come.\r\n\r\nCover:\r\n <a href=\"\nhttp://i.imgur.com/tye23mp.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i.imgur.com/tye23mp.jpg</a>\r\n\r\nPublished by Scribner in 2016, 352 pages, English, EPUB\r\n\r\nPlease seed and share with others :)","last_updated":"2017-07-16T12:01:21.342Z","parsed":{"xt":"urn:btih:44fd4c62ba650f42ba675fff978873f1cdcc29f9","dn":"The Idealist - Justin Peters","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"44fd4c62ba650f42ba675fff978873f1cdcc29f9","infoHashBuffer":{"type":"Buffer","data":[68,253,76,98,186,101,15,66,186,103,95,255,151,136,115,241,205,204,41,249]},"name":"The Idealist - Justin Peters","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}