{"title":"The Whispering Room (Jane Hawk #2) by Dean Koontz - EPUB - zeke2","magnet":"magnet:?xt=urn:btih:4509b86cbf9adc77ec933a5337a46b3ac2fc4648&dn=The+Whispering+Room+%28Jane+Hawk+%232%29+by+Dean+Koontz+-+EPUB+-+zeke2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"733126","seeders":"0","leechers":"0","description":"[IMG]https://images.gr-assets.com/books/1505322802l/34962255.jpg[/IMG]\r\nThe Whispering Room (Jane Hawk #2) by Dean Koontz - EPUB - zeke23\r\nPublished November 21st 2017 - ISBN 345546806 (ISBN13: 9780345546807) - EPUB - English\r\nJane Hawk--fiction&apos;s most relentless, resourceful, stunning new heroine--continues her battle against a murderous conspiracy in the riveting sequel to The Silent Corner.\r\n\r\n&quot;No time to delay. Do what you were born to do. Fame will be yours when you do this.&quot;\r\n\r\nThese are the words that ring in the mind of mild-mannered, beloved schoolteacher Cora Gundersun--just before she takes her own life, and many others&apos;, in a shocking act of carnage. When the disturbing contents of her secret journal are discovered, it seems certain that she must have been insane. But Jane Hawk knows better.\r\n\r\nIn the wake of her husband&apos;s inexplicable suicide--and the equally mysterious deaths of scores of other exemplary individuals--Jane picks up the trail of a secret cabal of powerful players who think themselves above the law and beyond punishment. But these ruthless people bent on hijacking America&apos;s future for their own monstrous ends never banked on a highly trained FBI agent willing to go rogue--and become the nation&apos;s most wanted fugitive--in order to derail their insidious plans to gain absolute power with a terrifying technological breakthrough.\r\n\r\nDriven by love for her lost husband and by fear for the five-year-old son she has sent into hiding, Jane Hawk has become an unstoppable predator. Those she is hunting will have nowhere to run when her shadow falls across them.\r\n\r\nAcclaim for Dean Koontz&apos;s The Silent Corner\r\n\r\n&quot;A proven specialist in action scenes, Koontz pulls off some doozies here. . . . The book is full of neat touches. . . . And the prose, as always in a Koontz novel, is first-rate. Perhaps Koontz&apos;s leanest, meanest thriller, this initial entry in a new series introduces a smart, appealing heroine who can outthink as well as outshoot the baddest of bad dudes.&quot;--Kirkus Reviews (starred review)\r\n\r\n&quot;Long an A-list bestseller, Koontz has always delivered the goods, whether he&apos;s tackling science fiction, horror, or thrillers. . . . That varied bibliography now adds a new series and an exciting new heroine. Expect the usual clamor for copies among the faithful, who are certain to embrace Jane Hawk immediately and eagerly await the next installment.&quot;--Booklist\r\n\r\n&quot;Fantastically written (as always by Mr. Koontz) . . . You are riveted on page one. . . . The man who gave us unbelievable characters in the past (Miss you, Odd Thomas) has now given us a brand new one that will, hands-down, become another fan favorite. 5 stars!&quot;--Suspense Magazine","last_updated":"2017-11-22T12:00:28.083Z","parsed":{"xt":"urn:btih:4509b86cbf9adc77ec933a5337a46b3ac2fc4648","dn":"The Whispering Room (Jane Hawk #2) by Dean Koontz - EPUB - zeke2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4509b86cbf9adc77ec933a5337a46b3ac2fc4648","infoHashBuffer":{"type":"Buffer","data":[69,9,184,108,191,154,220,119,236,147,58,83,55,164,107,58,194,252,70,72]},"name":"The Whispering Room (Jane Hawk #2) by Dean Koontz - EPUB - zeke2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}