{"title":"Virt-A-Mate 1.4 (23rd-Dec-2017 Release)-Meshed VR (AdulVR Game)","magnet":"magnet:?xt=urn:btih:45343238cfc8be42fed5df9370402f4783ba77cf&dn=Virt-A-Mate+1.4+%2823rd-Dec-2017+Release%29-Meshed+VR+%28AdulVR+Game%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"FemdomPorn","categoryP":"porn","categoryS":"games","size":"3770191931","seeders":"12","leechers":"11","description":"VR headset with motion controllers is REQUIRED. Currently supported are: HTC Vive and Oculus Rift with Touch controllers \r\n(Windows Mixed Reality should work although isn&apos;t officially supported as yet and cannot say for certain). \r\n\r\n \r\nVirt-A-Mate 1.4 (23rd-Dec-2017 Release) - Meshed VR (Adult VR Game and Simulation- includes Creator/Entertainer/Teaser keys). :w00t: \r\nActivation keys are in the VaM_Release1.4Release1.4VAM 1.4 Activation.txt if you only want the keys.\r\n\r\ninfo\r\n\r\nVirt-A-Mate a virtual reality sex simulator which allows you to view and create sex scenes. You can control the models with motion controls and also supports room-scale.\r\n\r\nNew features and updates:\r\n\r\n1. Clothing customization. Choose from various texture sets unique to each item. Zillions of color options. You will have full access to every shader parameter! You can make a gold metallic thong if you so desire. As you can see below there are a lot of options.\r\n\r\n2. Hair customization. Choose from texture sets and colors, similar to clothing material editor.\r\n\r\n3. Web Browser &amp; Image Panel objects. Open image in web browser, click the copy to clipboard button, and then in Image Panel click copy from clipboard. Instant decoration using any image from the web! Or use the Image Panel to display an image reference to help you build the perfect character. Also works with animated gifs. Make a room with walls covered in jiggly bits.\r\n\r\n4. New environment. Bedroom with windows and web TV. Sit back and relax on the bed and watch some YouTube with your favorite Mate, or spy on them through the window while they are watching something naughty.\r\n\r\n5. 40+ new female morphs. Many new body shapes!\r\n\r\n6. Improved character details. Improved female genitalia soft body physics and morphing. Added male character eye blink, eyelid movement, and micro-expressions (to match what female has now) to get rid of that zombie look","last_updated":"2017-12-31T12:06:03.432Z","parsed":{"xt":"urn:btih:45343238cfc8be42fed5df9370402f4783ba77cf","dn":"Virt-A-Mate 1.4 (23rd-Dec-2017 Release)-Meshed VR (AdulVR Game)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"45343238cfc8be42fed5df9370402f4783ba77cf","infoHashBuffer":{"type":"Buffer","data":[69,52,50,56,207,200,190,66,254,213,223,147,112,64,47,71,131,186,119,207]},"name":"Virt-A-Mate 1.4 (23rd-Dec-2017 Release)-Meshed VR (AdulVR Game)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}