{"title":"\nStanton_ Lincoln's War Secretary by Walter Stahr 2017 RETAiL ePU","magnet":"magnet:?xt=urn:btih:45397f836afc126a0656cf6bb2dc2f11ec17a503&dn=Stanton_+Lincoln%27s+War+Secretary+by+Walter+Stahr+2017+RETAiL+ePU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"129929154","seeders":"0","leechers":"0","description":"xx\r\n\r\nStanton_ Lincoln&apos;s War Secretary by Walter Stahr 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nWalter Stahr, award-winning author of the New York Times best seller Seward, tells the story of Abraham Lincoln&apos;s indispensable secretary of war, Edwin Stanton, the man the president entrusted with raising the army that preserved the Union.\r\n\r\nOf the crucial men close to President Lincoln, Secretary of War Edwin Stanton (1814-1869) was the most powerful and controversial. Stanton raised, armed, and supervised the army of a million men who won the Civil War. He organized the war effort. He directed military movements from his telegraph office, where Lincoln literally hung out with him. He arrested and imprisoned thousands for &quot;war crimes&quot; such as resisting the draft or calling for an armistice. Stanton was so controversial that some accused him at that time of complicity in Lincoln&apos;s assassination. He was a stubborn genius who was both reviled and revered in his time.\r\n\r\nStanton was a Democrat before the war and a prominent trial lawyer. He opposed slavery but only in private. He served briefly as President Buchanan&apos;s attorney general and then as Lincoln&apos;s aggressive secretary of war. On the night of April 14, 1865, Stanton rushed to Lincoln&apos;s deathbed and took over the government since Secretary of State William Seward had been critically wounded the same evening. He informed the nation of the president&apos;s death, summoned General Grant to protect the Capitol, and started collecting the evidence from those who had been with the Lincolns at the theater in order to prepare a murder trial.\r\n\r\nNow, with this worthy complement to the enduring library of biographical accounts of those who helped Lincoln preserve the Union, Stanton honors the indispensable partner of the 16th president. Walter Stahr&apos;s essential book is the first major biography of Stanton in 50 years, restoring this underexplored figure to his proper place in American history.\r\n\r\nxx","last_updated":"2017-09-24T12:00:57.515Z","parsed":{"xt":"urn:btih:45397f836afc126a0656cf6bb2dc2f11ec17a503","dn":"Stanton_ Lincoln's War Secretary by Walter Stahr 2017 RETAiL ePU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"45397f836afc126a0656cf6bb2dc2f11ec17a503","infoHashBuffer":{"type":"Buffer","data":[69,57,127,131,106,252,18,106,6,86,207,107,178,220,47,17,236,23,165,3]},"name":"Stanton_ Lincoln's War Secretary by Walter Stahr 2017 RETAiL ePU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}