{"title":"Alias Grace by Margaret Atwood epub RtR","magnet":"magnet:?xt=urn:btih:4577a28893295b1ddb3b6bc80eecbc357fdd196b&dn=Alias+Grace+by+Margaret+Atwood+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6299031","seeders":"2","leechers":"16","description":"xx\r\n\r\nAlias Grace by Margaret Atwood epub RtR\r\n\r\nIn the astonishing new work by the author of the best sellers The Robber Bride and The Handmaid&apos;s Tale, Margaret Atwood takes readers back in time and into the life and mind of one of the most enigmatic and notorious women of the 19th century. Grace Marks had been convicted for her involvement in the vicious murders of her employer, the wealthy Thomas Kinnear, and of his housekeeper and mistress, Nancy Montgomery. Some believe Grace is innocent others think her evil or insane. After a stint in Toronto&apos;s Lunatic Asylum and now serving a life term, Grace herself claims to have no memory of the murders.\r\n\r\nDr. Simon Jordan, an up-and-coming expert in the burgeoning field of mental illness, is engaged by a group of reformers and spiritualists seeking a pardon for Grace. He listens to Grace&apos;s story, from her family&apos;s difficult passage from Ireland to Canada, to her time as a maid in Thomas Kinnear&apos;s household. And as he brings Grace closer to the day she cannot remember, he hears of the turbulent relationship between Kinnear and Nancy, and of the alarming behavior of Grace&apos;s fellow-servant, James McDermott. Jordan is drawn to Grace, but he is also baffled by her. What will he find in attempting to unlock her memories? Is Grace a female fiend, a bloodthirsty femme fatale, or is she a victim of circumstances?\r\n\r\nxx","last_updated":"2017-07-24T12:02:39.547Z","parsed":{"xt":"urn:btih:4577a28893295b1ddb3b6bc80eecbc357fdd196b","dn":"Alias Grace by Margaret Atwood epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4577a28893295b1ddb3b6bc80eecbc357fdd196b","infoHashBuffer":{"type":"Buffer","data":[69,119,162,136,147,41,91,29,219,59,107,200,14,236,188,53,127,221,25,107]},"name":"Alias Grace by Margaret Atwood epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}