{"title":"Locking Up Our Own - Crime and Punishment in Black.(2017) Gooner","magnet":"magnet:?xt=urn:btih:459c9cfe015e7cc89b025ccd8abe6640de359d54&dn=Locking+Up+Our+Own+-+Crime+and+Punishment+in+Black.%282017%29+Gooner&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"21725679","seeders":"1","leechers":"1","description":"Locking Up Our Own - Crime and Punishment in Black America (2017) (Epub) Gooner\r\n\r\nPublisher: Farrar, Straus and Giroux (18 April 2017)\r\nAuthor: James Forman\r\nLanguage: English\r\nISBN-10: 0374189978\r\nISBN-13: 9780374189976\r\n\r\nIn recent years, America&apos;s criminal justice system has become the subject of an increasingly urgent debate. Critics have assailed the rise of mass incarceration, emphasizing its disproportionate impact on people of color. As James Forman, Jr., points out, however, the war on crime that began in the 1970s was supported by many African American leaders in the nation&apos;s urban centers. In Locking Up Our Own, he seeks to understand why.\r\n\r\nForman shows us that the first substantial cohort of black mayors, judges, and police chiefs took office amid a surge in crime and drug addiction. Many prominent black officials, including Washington, D.C. mayor Marion Barry and federal prosecutor Eric Holder, feared that the gains of the civil rights movement were being undermined by lawlessness--and thus embraced tough-on-crime measures, including longer sentences and aggressive police tactics. In the face of skyrocketing murder rates and the proliferation of open-air drug markets, they believed they had no choice. But the policies they adopted would have devastating consequences for residents of poor black neighborhoods.\r\n\r\nA former D.C. public defender, Forman tells riveting stories of politicians, community activists, police officers, defendants, and crime victims. He writes with compassion about individuals trapped in terrible dilemmas--from the men and women he represented in court to officials struggling to respond to a public safety emergency. Locking Up Our Own enriches our understanding of why our society became so punitive and offers important lessons to anyone concerned about the future of race and the criminal justice system in this country","last_updated":"2017-05-10T10:57:21.619Z","parsed":{"xt":"urn:btih:459c9cfe015e7cc89b025ccd8abe6640de359d54","dn":"Locking Up Our Own - Crime and Punishment in Black.(2017) Gooner","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"459c9cfe015e7cc89b025ccd8abe6640de359d54","infoHashBuffer":{"type":"Buffer","data":[69,156,156,254,1,94,124,200,155,2,92,205,138,190,102,64,222,53,157,84]},"name":"Locking Up Our Own - Crime and Punishment in Black.(2017) Gooner","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}