{"title":"Mashinky-v24.10.2017.rar","magnet":"magnet:?xt=urn:btih:45c64510d4ec37895f683ce806317d3c1ae53209&dn=Mashinky-v24.10.2017.rar&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"luck140","categoryP":"games","categoryS":"pc","size":"525228971","seeders":"1","leechers":"0","description":"Title: Mashinky \r\nGenre: Indie, Simulation, Strategy, Early Access \r\nDeveloper: Jan Zelenu00fd \r\nPublisher: Jan Zelenu00fd \r\nRelease Date: Oct 6, 2017 \r\n\r\nAbout This Game \r\nMashinky is a brand new transport strategy game from Czech developer Jan Zeleny. Zooming through gorgeous landscapes, utilising a traditional isometric construction mode and mastering a unique board game-like gameplay, you&apos;ll find yourself immersed in the task of building your own transport empire.The goal is to create your own transport empire on a procedurally generated map.The game is a unique blend of realistic graphics combined with an isometric construction mode and boardgame-like rules.Players start the game in control of a transport company. They must lay tracks on difficult terrain, research and buy new vehicles, manage routes and compete against economic rules to make as much profit as possible by transporting passengers and various cargos. This makes for a challenging simulation game requiring the player to consider all elements of business to be successful.Players can switch to an isometric construction mode inspired by the very best strategy classics. This is a grid based map where every change of traffic layout is a rewarding puzzle. You can build simple tracks connecting just two stations, or design sophisticated networks using junctions and signals to maximize efficiency and performance.As the game progresses, youl need to extend and customize your transport empire. You can upgrade industry buildings, stations and depots in various ways, and improve your trains using new engines and special wagons. Each upgrade offers a unique bonus; greater capacity, new processing rules and even new cargo types. Players can develop their own strategy to suit best the network they&apos;re building.With the innovative viewing modes, you can ride one of your trains or watch the operation of the network you have built. You can exit construction mode at any time to dive back into the beautiful landscapes and detailing of the 3D world. You can see your track network from a different perspective, or even jump into one of your train and enjoy the ride. For the Early Access release, we&apos;ve prepared first 2 eras out of 7. As EA progresses, we will introduce more eras so in the future, youl progress from the Age of Steam through the modern world and into the future. Youl encounter new industries and vehicles in each era. Villages will grow to become cities, new infrastructure and upgrades will become available. It is up to you how you use these new features to build your transport empire. From humble beginnings, youl build a vast transport network using everything from steam power while moving cargo like coal and wood to - will be introduced to the game in the future - maglev supertrains delivering futuristic electronics","last_updated":"2017-10-30T12:04:00.002Z","parsed":{"xt":"urn:btih:45c64510d4ec37895f683ce806317d3c1ae53209","dn":"Mashinky-v24.10.2017.rar","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"45c64510d4ec37895f683ce806317d3c1ae53209","infoHashBuffer":{"type":"Buffer","data":[69,198,69,16,212,236,55,137,95,104,60,232,6,49,125,60,26,229,50,9]},"name":"Mashinky-v24.10.2017.rar","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}