{"title":"East West Street by Philippe Sands EPUB","magnet":"magnet:?xt=urn:btih:45d19aeb112b173ba6c1c47c5a6d49e107a6c882&dn=East+West+Street+by+Philippe+Sands+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"65560640","seeders":"0","leechers":"0","description":"xx\r\n\r\nEast West Street by Philippe Sands EPUB\r\n\r\nWhen human rights lawyer Philippe Sands received an invitation to deliver a lecture in the Western Ukrainian city of Lviv, he began to uncover a series of extraordinary historical coincidences. It set him on a quest that would take him halfway around the world in an exploration of the origins of international law and the pursuit of his own secret family history, beginning and ending with the last day of the Nuremberg Trials.\r\n\r\nPart historical detective story, part family history, part legal thriller, Philippe Sands guides us between past and present as several interconnected stories unfold in parallel. The first is the hidden story of two Nuremberg prosecutors who discover, only at the end of the trials, that the man they are prosecuting, once Hitler&apos;s personal lawyer, may be responsible for the murder of their entire families in Nazi-occupied Poland, in and around Lviv. The two prosecutors, Hersch Lauterpacht and Rafael Lemkin, were remarkable men whose efforts led to the inclusion of the terms crimes against humanity and genocide in the judgement at Nuremberg, with their different emphasis on the protection of individuals and groups. The defendant was no less compelling a character: Hans Frank, Hitler&apos;s personal lawyer, friend of Richard Strauss, collector of paintings by Leonardo da Vinci, and governor-general of Nazi-occupied Poland.\r\n\r\nA second strand to the book is more personal, as Sands traces the events that overwhelmed his mother&apos;s family in Lviv and Vienna during the Second World War and led his grandfather to leave his wife and daughter behind as war came to Europe. At the heart of this book is an equally personal quest to understand the roots of international law and the concepts that have dominated Sands&apos; work as a lawyer. Eventually he finds unexpected answers to his questions about his family in this powerful meditation on the way memory, crime, and guilt leave scars across generations.\r\n\r\nxx","last_updated":"2017-11-02T12:01:06.602Z","parsed":{"xt":"urn:btih:45d19aeb112b173ba6c1c47c5a6d49e107a6c882","dn":"East West Street by Philippe Sands EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"45d19aeb112b173ba6c1c47c5a6d49e107a6c882","infoHashBuffer":{"type":"Buffer","data":[69,209,154,235,17,43,23,59,166,193,196,124,90,109,73,225,7,166,200,130]},"name":"East West Street by Philippe Sands EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}