{"title":"Peter Ames Carlin - Homeward Bound 2016 RETAiL ePUB eBOOK-DiSTRi","magnet":"magnet:?xt=urn:btih:45f54807068e6933fa5a598f7b4a38a140235d41&dn=Peter+Ames+Carlin+-+Homeward+Bound+2016+RETAiL+ePUB+eBOOK-DiSTRi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7150544","seeders":"12","leechers":"6","description":"Peter Ames Carlin - Homeward Bound 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA revelatory account of the life of beloved American music icon Paul Simon by best-selling rock biographer Peter Ames Carlin.\r\n\r\nTo have been alive during the last 60 years is to have lived with the music of Paul Simon. The boy from Queens scored his first hit record in 1957, just months after Elvis Presley ignited the rock era. As the songwriting half of Simon &amp; Garfunkel, his work helped define the youth movement of the &apos;60s. On his own in the &apos;70s, Simon made radio-dominating hits. He kicked off the &apos;80s by reuniting with Garfunkel to perform for half a million New Yorkers in Central Park. Five years later Simon&apos;s album Graceland sold millions and spurred an international political controversy. And it doesn&apos;t stop there.\r\n\r\nThe grandchild of Jewish immigrants from Hungary, the nearly 75-year-old singer-songwriter has not only sold more than 100 million records, won 15 Grammy Awards, and been installed into the Rock &apos;n&apos; Roll Hall of Fame twice, but he has also animated the meaning - and flexibility - of personal and cultural identity in a rapidly shrinking world.\r\n\r\nSimon has also lived one of the most vibrant lives of modern times, making for a book replete with tales of Carrie Fisher, Leonard Bernstein, Bob Dylan, Woody Allen, Shelley Duvall, Nelson Mandela, the Grateful Dead, drugs, depression, marriage, divorce, and more. A life story with the scope and power of an epic novel, Carlin&apos;s Homeward Bound is the first major biography of one of the most influential popular artists in American history","last_updated":"2017-06-15T12:01:38.346Z","parsed":{"xt":"urn:btih:45f54807068e6933fa5a598f7b4a38a140235d41","dn":"Peter Ames Carlin - Homeward Bound 2016 RETAiL ePUB eBOOK-DiSTRi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"45f54807068e6933fa5a598f7b4a38a140235d41","infoHashBuffer":{"type":"Buffer","data":[69,245,72,7,6,142,105,51,250,90,89,143,123,74,56,161,64,35,93,65]},"name":"Peter Ames Carlin - Homeward Bound 2016 RETAiL ePUB eBOOK-DiSTRi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}