{"title":"Braving the Wilderness_ The Quest for True Belonging and the Cou","magnet":"magnet:?xt=urn:btih:46b993c444123783935f7681dc45f32beb5f9ef9&dn=Braving+the+Wilderness_+The+Quest+for+True+Belonging+and+the+Cou&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2828304","seeders":"0","leechers":"0","description":"xx\r\n\r\nBraving the Wilderness_ The Quest for True Belonging and the Courage to Stand Alone by Brene Brown ePUB eBOOK-ZAK\r\n\r\nA timely and important new book that challenges everything we think we know about cultivating true belonging in our communities, organizations, and culture, from the number one best-selling author of Rising Strong, Daring Greatly, and The Gifts of Imperfection.\r\n\r\n&quot;True belonging doesn&apos;t require us to change who we are. It requires us to be who we are.&quot; Social scientist Bren&#xE9; Brown, PhD, LMSW, has sparked a global conversation about the experiences that bring meaning to our lives - experiences of courage, vulnerability, love, belonging, shame, and empathy. In Braving the Wilderness, Brown redefines what it means to truly belong in an age of increased polarization. With her trademark mix of research, storytelling, and honesty, Brown will again change the cultural conversation while mapping a clear path to true belonging.\r\n\r\nBrown argues that we&apos;re experiencing a spiritual crisis of disconnection and introduces four practices of true belonging that challenge everything we believe about ourselves and each other. She writes, &quot;True belonging requires us to believe in and belong to ourselves so fully that we can find sacredness both in being a part of something and in standing alone when necessary. But in a culture that&apos;s rife with perfectionism and pleasing, and with the erosion of civility, it&apos;s easy to stay quiet, hide in our ideological bunkers, or fit in rather than show up as our true selves and brave the wilderness of uncertainty and criticism. But true belonging is not something we negotiate or accomplish with others; it&apos;s a daily practice that demands integrity and authenticity. It&apos;s a personal commitment that we carry in our hearts.&quot;\r\n\r\nBrown offers us the clarity and courage we need to find our way back to ourselves and to each other. And that path cuts right through the wilderness. Brown writes, &quot;The wilderness is an untamed, unpredictable place of solitude and searching. It is a place as dangerous as it is breathtaking, a place as sought after as it is feared. But it turns out to be the place of true belonging, and it&apos;s the bravest and most sacred place you will ever stand.&quot;\r\n\r\nxx","last_updated":"2017-09-13T12:00:27.452Z","parsed":{"xt":"urn:btih:46b993c444123783935f7681dc45f32beb5f9ef9","dn":"Braving the Wilderness_ The Quest for True Belonging and the Cou","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"46b993c444123783935f7681dc45f32beb5f9ef9","infoHashBuffer":{"type":"Buffer","data":[70,185,147,196,68,18,55,131,147,95,118,129,220,69,243,43,235,95,158,249]},"name":"Braving the Wilderness_ The Quest for True Belonging and the Cou","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}