{"title":"The Brain Defense_ Murder in Manhattan and the Dawn of Neuroscie","magnet":"magnet:?xt=urn:btih:46d2ddd8bde2ee203fa34b48ae56e9dcd3a5d725&dn=The+Brain+Defense_+Murder+in+Manhattan+and+the+Dawn+of+Neuroscie&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3212866","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Brain Defense_ Murder in Manhattan and the Dawn of Neuroscience in America&apos;s Courtrooms by Kevin Davis ePUB eBOOK-ZAK\r\n\r\nCalled &quot;the best kind of nonfiction&quot; by Michael Connelly, this riveting new book combines true crime, brain science, and courtroom drama.\r\n\r\nIn 1991 the police were called to East 72nd St. in Manhattan, where a woman&apos;s body had fallen from a 12th-story window. The woman&apos;s husband, Herbert Weinstein, soon confessed to having hit and strangled his wife after an argument, then dropping her body out of their apartment window to make it look like a suicide. The 65-year-old Weinstein, a quiet, unassuming retired advertising executive, had no criminal record, no history of violent behavior - not even a short temper. How, then, to explain this horrific act?\r\n\r\nJournalist Kevin Davis uses the perplexing story of the Weinstein murder to present a riveting, deeply researched exploration of the intersection of neuroscience and criminal justice. Shortly after Weinstein was arrested, an MRI revealed a cyst the size of an orange on his brain&apos;s frontal lobe, the part of the brain that governs judgment and impulse control. Weinstein&apos;s lawyer seized on that discovery, arguing that the cyst had impaired Weinstein&apos;s judgment and that he should not be held criminally responsible for the murder. It was the first case in the United States in which a judge allowed a scan showing a defendant&apos;s brain activity to be admitted as evidence to support a claim of innocence.\r\n\r\nThe Weinstein case marked the dawn of a new era in America&apos;s courtrooms, raising complex and often troubling questions about how we define responsibility and free will, how we view the purpose of punishment, and how strongly we are willing to bring scientific evidence to bear on moral questions. Davis brings to light not only the intricacies of the Weinstein case but also the broader history linking brain injuries and aberrant behavior, from the bizarre stories of Phineas Gage and Charles Whitman, perpetrator of the 1966 Texas Tower massacre, to the role that brain damage may play in violence carried out by football players and troubled veterans of America&apos;s 21st century wars. The Weinstein case opened the door for a novel defense that continues to transform the legal system: Criminal lawyers are increasingly turning to neuroscience and introducing the effects of brain injuries - whether caused by trauma or by tumors, cancer, or drug or alcohol abuse - and arguing that such damage should be considered in determining guilt or innocence, the death penalty or years behind bars. As he takes stock of the past, present and future of neuroscience in the courts, Davis offers a powerful account of its potential and its hazards.\r\n\r\nThought-provoking and brilliantly crafted, The Brain Defense marries a murder mystery complete with colorful characters and courtroom drama with a sophisticated discussion of how our legal system has changed - and must continue to change - as we broaden our understanding of the human mind.\r\n\r\nxx","last_updated":"2017-08-20T12:00:22.977Z","parsed":{"xt":"urn:btih:46d2ddd8bde2ee203fa34b48ae56e9dcd3a5d725","dn":"The Brain Defense_ Murder in Manhattan and the Dawn of Neuroscie","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"46d2ddd8bde2ee203fa34b48ae56e9dcd3a5d725","infoHashBuffer":{"type":"Buffer","data":[70,210,221,216,189,226,238,32,63,163,75,72,174,86,233,220,211,165,215,37]},"name":"The Brain Defense_ Murder in Manhattan and the Dawn of Neuroscie","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}