{"title":"Predator Nation_ Corporate Criminals, Political Corruption, and ","magnet":"magnet:?xt=urn:btih:4945c6c261c190af111cbeb82d03df585e216640&dn=Predator+Nation_+Corporate+Criminals%2C+Political+Corruption%2C+and+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10253579","seeders":"1","leechers":"3","description":"xx\r\n\r\nPredator Nation_ Corporate Criminals, Political Corruption, and the Hijacking of America by Charles H Ferguson ePUB MOBI PDF eBOOK-ZAK\r\n\r\nCharles H. Ferguson, who electrified the world with his Oscar-winning documentary Inside Job, now explains how a predator elite took over the country, step by step, and he exposes the networks of academic, financial, and political influence, in all recent administrations, that prepared the predators&apos; path to conquest.\r\n\r\nIf you&apos;re smart and a hard worker, but your parents aren&apos;t rich, you&apos;re now better off being born in Munich, Germany, or in Singapore than in Cleveland, Ohio, or New York. This radical shift did not happen by accident. Ferguson shows how, since the Reagan administration in the 1980s, both major political parties have become captives of the moneyed elite. It was the Clinton administration that dismantled the regulatory controls that protected the average citizen from avaricious financiers. It was the Bush team that destroyed the federal revenue base with its grotesquely skewed tax cuts for the rich. And it is the Obama White House that has allowed financial criminals to continue to operate unchecked, even after supposed &quot;reforms&quot; installed after the collapse of 2008.\r\n\r\nPredator Nation reveals how once-revered figures like Alan Greenspan and Larry Summers became mere courtiers to the elite. Based on many newly released court filings, it details the extent of the crimes - there is no other word for them - committed in the frenzied chase for wealth that caused the financial crisis. And, finally, it lays out a plan of action for how we might take back our country and the American dream.\r\n\r\nxx","last_updated":"2017-07-26T12:01:33.358Z","parsed":{"xt":"urn:btih:4945c6c261c190af111cbeb82d03df585e216640","dn":"Predator Nation_ Corporate Criminals, Political Corruption, and ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4945c6c261c190af111cbeb82d03df585e216640","infoHashBuffer":{"type":"Buffer","data":[73,69,198,194,97,193,144,175,17,28,190,184,45,3,223,88,94,33,102,64]},"name":"Predator Nation_ Corporate Criminals, Political Corruption, and ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}