{"title":"Dan Slater - Wolf Boys 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:49f67f4633adc91474c0933e6ca1b405582138c4&dn=Dan+Slater+-+Wolf+Boys+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6580260","seeders":"1","leechers":"0","description":"Dan Slater - Wolf Boys 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe story of two American teens recruited as killers for a Mexican cartel and their pursuit by a Mexican American detective who realizes the War on Drugs is unwinnable.\r\n\r\nWhat&apos;s it like to be an employee of a global drug-trafficking organization? And how does a 15-year-old American boy go from star quarterback to trained assassin, surging up the cartel corporate ladder?\r\n\r\nAt first glance Gabriel Cardona is the poster-boy American teenager: great athlete, bright, handsome, and charismatic. But the streets of his border town of Laredo, Texas, are poor and dangerous, and it isn&apos;t long before Gabriel abandons his promising future for the allure of the Zetas, a drug cartel with roots in the Mexican military. His younger friend. Bart, as well as others from Gabriel&apos;s childhood join him in working for the Zetas, boosting cars and smuggling drugs, eventually catching the eye of the cartel&apos;s leadership.\r\n\r\nMeanwhile, Mexican-born detective Robert Garcia has worked hard all his life and is now struggling to raise his family in America. As violence spills over the border, Detective Garcia&apos;s pursuit of the boys and their cartel leaders puts him face to face with the urgent consequences of a war he sees as unwinnable.\r\n\r\nIn Wolf Boys Dan Slater shares their stories, taking us from the Sierra Madre mountaintops to the dusty, dark alleys of Laredo, Texas, on a harrowing, often brutal journey into the heart of the Mexican drug trade. Gabriel&apos;s evolution from good-natured teenager into a feared assassin is as inevitable as Garcia&apos;s slow realization of the futile nature of his work.\r\n\r\nA nonfiction thriller, Wolf Boys depicts more than just Gabriel, Bart, and the officers who took them down. It shows, through vivid detail and rich, often moving narrative, the way in which the border itself is changing, disappearing, and posing new terrifying and yet largely unseen threats to American security. Ultimately, though, Wolf Boys is the intimate story of the &quot;lobos&quot; themselves: boys turned into pawns for cartels. Their stories show how poverty, ideas about identity, and government ignorance have warped the definition of the American dream","last_updated":"2017-06-14T12:00:24.810Z","parsed":{"xt":"urn:btih:49f67f4633adc91474c0933e6ca1b405582138c4","dn":"Dan Slater - Wolf Boys 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"49f67f4633adc91474c0933e6ca1b405582138c4","infoHashBuffer":{"type":"Buffer","data":[73,246,127,70,51,173,201,20,116,192,147,62,108,161,180,5,88,33,56,196]},"name":"Dan Slater - Wolf Boys 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}