{"title":"\nSing for Your Life by Daniel Bergner 2016 RETAiL ePUB eBOOK-DiST","magnet":"magnet:?xt=urn:btih:4ac32a2bdf68814eb6acf57dc68098c55be11656&dn=Sing+for+Your+Life+by+Daniel+Bergner+2016+RETAiL+ePUB+eBOOK-DiST&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3401348","seeders":"0","leechers":"0","description":"xx\r\n\r\nSing for Your Life by Daniel Bergner 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\n\r\nThe touching, triumphant story of a young black man&apos;s journey from violence and despair to one of the world&apos;s most elite artistic institutions, as if The Blind Side were set in the world of opera.\r\n\r\nRyan Speedo Green had a tough upbringing in Southeastern Virginia: His family lived in a trailer park and later a bullet-riddled house across the street from drug dealers. His father was absent; his mother was volatile and abusive.\r\n\r\nAt the age of 12, Ryan was sent to Virginia&apos;s juvenile facility of last resort. He was placed in solitary confinement. He was uncontrollable, uncontainable, with little hope for the future.\r\n\r\nIn 2011, at the age of 24, Ryan won a nationwide competition hosted by New York&apos;s Metropolitan Opera, beating out 1,200 other talented singers. Today he is a rising star performing major roles at the Met and Europe&apos;s most prestigious opera houses.\r\n\r\nSing for Your Life chronicles Ryan&apos;s suspenseful, racially charged, and artistically intricate journey from solitary confinement to stardom. Daniel Bergner takes readers on Ryan&apos;s path toward redemption, introducing us to a cast of memorable characters - including the two teachers from his childhood who redirected his rage into music and his long-lost father, who finally reappeared to hear Ryan sing. Bergner illuminates all that it takes - technically, creatively - to find and foster the beauty of the human voice. And Sing for Your Life sheds unique light on the enduring and complex realities of race in America.\r\n\r\nxx","last_updated":"2017-09-23T12:01:52.440Z","parsed":{"xt":"urn:btih:4ac32a2bdf68814eb6acf57dc68098c55be11656","dn":"Sing for Your Life by Daniel Bergner 2016 RETAiL ePUB eBOOK-DiST","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4ac32a2bdf68814eb6acf57dc68098c55be11656","infoHashBuffer":{"type":"Buffer","data":[74,195,42,43,223,104,129,78,182,172,245,125,198,128,152,197,91,225,22,86]},"name":"Sing for Your Life by Daniel Bergner 2016 RETAiL ePUB eBOOK-DiST","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}