{"title":"China Mieville - October_ The Story of the Russian Revolution 20","magnet":"magnet:?xt=urn:btih:4ae8f7ec9b44f6b03f7b2dcbd6fd11465d4bc3da&dn=China+Mieville+-+October_+The+Story+of+the+Russian+Revolution+20&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5409113","seeders":"25","leechers":"12","description":"xx\r\n\r\nChina Mieville - October_ The Story of the Russian Revolution 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe renowned fantasy and science fiction writer China Mieville has long been inspired by the ideals of the Russian Revolution, and here, on the centenary of the revolution, he provides his own distinctive take on its history.\r\n\r\nIn February 1917, in the midst of bloody war, Russia was still an autocratic monarchy: nine months later it became the first socialist state in world history. How did this unimaginable transformation take place? How was a ravaged and backward country, swept up in a desperately unpopular war, rocked by not one but two revolutions?\r\n\r\nThis is the story of the extraordinary months between those upheavals, in February and October, of the forces and individuals who made 1917 so epochal a year, of their intrigues, negotiations, conflicts and catastrophes. From familiar names like Lenin and Trotsky to their opponents Kornilov and Kerensky; from the byzantine squabbles of urban activists to the remotest villages of a sprawling empire; from the revolutionary railroad Sublime to the ciphers and static of coup by telegram; from grand sweep to forgotten detail.\r\n\r\nHistorians have debated the revolution for 100 years, its portents and possibilities: the mass of literature can be daunting. But here is a book for those new to the events, told not only in their historical import but in all their passion and drama and strangeness. Because as well as a political event of profound and ongoing consequence, Mieville reveals the Russian Revolution as a breathtaking story.\r\n\r\nxx","last_updated":"2017-08-09T12:01:34.710Z","parsed":{"xt":"urn:btih:4ae8f7ec9b44f6b03f7b2dcbd6fd11465d4bc3da","dn":"China Mieville - October_ The Story of the Russian Revolution 20","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4ae8f7ec9b44f6b03f7b2dcbd6fd11465d4bc3da","infoHashBuffer":{"type":"Buffer","data":[74,232,247,236,155,68,246,176,63,123,45,203,214,253,17,70,93,75,195,218]},"name":"China Mieville - October_ The Story of the Russian Revolution 20","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}