{"title":"The Last Days of Night by Graham Moore EPUB","magnet":"magnet:?xt=urn:btih:4b70f2e0172124ea713424645a50dbcae7cd415c&dn=The+Last+Days+of+Night+by+Graham+Moore+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1231138","seeders":"37","leechers":"4","description":"xx\r\n\r\nThe Last Days of Night by Graham Moore EPUB\r\n\r\nFrom Graham Moore, the Oscar-winning screenwriter of The Imitation Game and New York Times best-selling author of The Sherlockian, comes a thrilling novel - based on actual events - about the nature of genius, the cost of ambition, and the battle to electrify America.\r\n\r\nNew York, 1888. Gas lamps still flicker in the city streets, but the miracle of electric light is in its infancy. The person who controls the means to turn night into day will make history - and a vast fortune.\r\n\r\nA young untested lawyer named Paul Cravath, fresh out of Columbia Law School, takes a case that seems impossible to win. Paul&apos;s client, George Westinghouse, has been sued by Thomas Edison over a billion-dollar question: Who invented the lightbulb and holds the right to power the country?\r\n\r\nThe case affords Paul entry to the heady world of high society - the glittering parties in Gramercy Park mansions and the more insidious dealings done behind closed doors. The task facing him is beyond daunting. Edison is a wily, dangerous opponent with vast resources at his disposal - private spies, newspapers in his pocket, and the backing of J. P. Morgan himself. Yet this unknown lawyer shares with his famous adversary a compulsion to win at all costs. How will he do it?\r\n\r\nIn obsessive pursuit of victory, Paul crosses paths with Nikola Tesla, an eccentric, brilliant inventor who may hold the key to defeating Edison, and with Agnes Huntington, a beautiful opera singer who proves to be a flawless performer onstage and off. As Paul takes greater and greater risks, he&apos;ll find that all in his path are playing their own games, and none are quite who they seem.\r\n\r\nxx","last_updated":"2017-12-10T12:06:47.468Z","parsed":{"xt":"urn:btih:4b70f2e0172124ea713424645a50dbcae7cd415c","dn":"The Last Days of Night by Graham Moore EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4b70f2e0172124ea713424645a50dbcae7cd415c","infoHashBuffer":{"type":"Buffer","data":[75,112,242,224,23,33,36,234,113,52,36,100,90,80,219,202,231,205,65,92]},"name":"The Last Days of Night by Graham Moore EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}