{"title":"Python Programming with Raspberry Pi - EPUB - zeke23","magnet":"magnet:?xt=urn:btih:4b9c4b2c471b5597c18939bc7d91376af3e3a15b&dn=Python+Programming+with+Raspberry+Pi+-+EPUB+-+zeke23&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"61745209","seeders":"0","leechers":"0","description":"[IMG]https://d1ldz4te4covpm.cloudfront.net/sites/default/files/imagecache/ppv4_main_book_cover/9781786467577.png[/IMG]\r\nPython Programming with Raspberry Pi - EPUB - zeke23\r\nEnglish | April 28th, 2017 | ASIN: B01FI3CCT0, ISBN: 1786467577 | 363 Pages | EPUB | 58.88 MB\r\nBecome a master of Python programming using the small yet powerful Raspberry Pi Zero!\r\n\r\nAbout This Book\r\nThis is the first book on the market that teaches Python programming with Raspberry Pi Zero\r\nDevelop exciting applications such as a mobile robot and home automation controller using Python\r\nThis step-by-step guide helps you make the most out of Raspberry Pi Zero using Python programming\r\n\r\nWho This Book Is For\r\nThis book is aimed at hobbyists and programmers who want to learn Python programming and develop applications using the Pi Zero. They should have basic familiarity with electronics.\r\n\r\nWhat You Will Learn\r\nConfigure Raspberry Pi using Python\r\nControl loops to blink an LED using simple arithmetic operations\r\nUnderstand how interface sensors, actuators, and LED displays work\r\nGet to grips with every aspect of Python programming using practical examples\r\nExplore machine vision, data visualization, and scientific computations\r\nBuild a mobile robot using the Raspberry Pi as the controller\r\nBuild a voice-activated home automation controller\r\n\r\nIn Detail\r\nRaspberry Pi Zero is a super-small and super-affordable product from Raspberry Pi that is packed with a plethora of features and has grabbed the notice of programmers, especially those who use Python.\r\n\r\nThis step-by-step guide will get you developing practical applications in Python using a Raspberry Pi Zero. It will become a valuable resource as you learn the essential details of interfacing sensors and actuators to a Raspberry Pi, as well as acquiring and displaying data.\r\n\r\nYou will get started by writing a Python program that blinks an LED at 1-second intervals. Then you will learn to write simple logic to execute tasks based upon sensor data (for example, to control a motor) and retrieve data from the web (such as to check e-mails to provide a visual alert). Finally, you will learn to build a home automation system with Python where different appliances are controlled using the Raspberry Pi.\r\n\r\nThe examples discussed in each chapter of this book culminate in a project that help improve the quality of people&apos;s lives","last_updated":"2017-11-24T12:00:27.498Z","parsed":{"xt":"urn:btih:4b9c4b2c471b5597c18939bc7d91376af3e3a15b","dn":"Python Programming with Raspberry Pi - EPUB - zeke23","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4b9c4b2c471b5597c18939bc7d91376af3e3a15b","infoHashBuffer":{"type":"Buffer","data":[75,156,75,44,71,27,85,151,193,137,57,188,125,145,55,106,243,227,161,91]},"name":"Python Programming with Raspberry Pi - EPUB - zeke23","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}