{"title":"The Marsh King's Daughter by Karen Dionne ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:4cc890ba177a28244ef59c09baa283327b7258d2&dn=The+Marsh+King%27s+Daughter+by+Karen+Dionne+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3656194","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Marsh King&apos;s Daughter by Karen Dionne ePUB eBOOK-ZAK\r\n\r\nPraised by Lee Child and Karin Slaughter, and sure to thrill fans of The Girl on the Train and The Widow, The Marsh King&apos;s Daughter is mesmerizing psychological suspense, the story of a woman who must risk everything to hunt down the dangerous man who shaped her past and threatens to steal her future: her father.\r\n\r\nAt last, Helena Pelletier has the life she deserves. A loving husband, two beautiful daughters, a business that fills her days. Then she catches an emergency news announcement and realizes she was a fool to think she could ever leave her worst days behind her.\r\n\r\nHelena has a secret: she is the product of an abduction. Her mother was kidnapped as a teenager by her father and kept in a remote cabin in the marshlands of Michigan&apos;s Upper Peninsula. No electricity, no heat, no running water, not a single human beyond the three of them. Helena, born two years after the abduction, loved her home in nature - fishing, tracking, hunting. And despite her father&apos;s odd temperament and sometimes brutal behavior, she loved him, too...until she learned precisely how savage a person he could be.\r\n\r\nMore than 20 years later, she has buried her past so soundly that even her husband doesn&apos;t know the truth. But now her father has killed two guards, escaped from prison, and disappeared into the marshland he knows better than anyone else in the world. The police commence a manhunt, but Helena knows they don&apos;t stand a chance. Knows that only one person has the skills to find the survivalist the world calls the Marsh King - because only one person was ever trained by him: his daughter.\r\n\r\nxx","last_updated":"2017-08-27T12:03:35.260Z","parsed":{"xt":"urn:btih:4cc890ba177a28244ef59c09baa283327b7258d2","dn":"The Marsh King's Daughter by Karen Dionne ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4cc890ba177a28244ef59c09baa283327b7258d2","infoHashBuffer":{"type":"Buffer","data":[76,200,144,186,23,122,40,36,78,245,156,9,186,162,131,50,123,114,88,210]},"name":"The Marsh King's Daughter by Karen Dionne ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}