{"title":"The Underground Girls of Kabul_ In Search of a Hidden Resistance","magnet":"magnet:?xt=urn:btih:4cd3459cbbbcf86b75f9d12aefe75f6cfaa72b97&dn=The+Underground+Girls+of+Kabul_+In+Search+of+a+Hidden+Resistance&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3216870","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Underground Girls of Kabul_ In Search of a Hidden Resistance in Afghanistan by Jenny Nordberg MOBI eBOOK-ZAK\r\n\r\nAn investigative journalist uncovers a hidden custom that will transform your understanding of what it means to grow up as a girl.\r\n\r\nIn Afghanistan, a culture ruled almost entirely by men, the birth of a son is cause for celebration and the arrival of a daughter is often mourned as misfortune. A bacha posh (literally translated from Dari as dressed up like a boy) is a third kind of child - a girl temporarily raised as a boy and presented as such to the outside world. Jenny Nordberg, the reporter who broke the story of this phenomenon for the New York Times, constructs a powerful and moving account of those secretly living on the other side of a deeply segregated society where women have almost no rights and little freedom.\r\n\r\nThe Underground Girls of Kabul is anchored by vivid characters who bring this remarkable story to life: Azita, a female parliamentarian who sees no other choice but to turn her fourth daughter Mehran into a boy; Zahra, the tomboy teenager who struggles with puberty and refuses her parents&#x2019; attempts to turn her back into a girl; Shukria, now a married mother of three after living for 20 years as a man; and Nader, who prays with Shahed, the undercover female police officer, as they both remain in male disguise as adults.\r\n\r\nAt the heart of this emotional narrative is a new perspective on the extreme sacrifices of Afghan women and girls against the violent backdrop of America&#x2019;s longest war. Divided into four parts, the book follows those born as the unwanted sex in Afghanistan, but who live as the socially favored gender through childhood and puberty, only to later be forced into marriage and childbirth. The Underground Girls of Kabul charts their dramatic life cycles, while examining our own history and the parallels to subversive actions of people who live under oppression everywhere.\r\n\r\nxx","last_updated":"2017-09-11T12:00:32.523Z","parsed":{"xt":"urn:btih:4cd3459cbbbcf86b75f9d12aefe75f6cfaa72b97","dn":"The Underground Girls of Kabul_ In Search of a Hidden Resistance","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4cd3459cbbbcf86b75f9d12aefe75f6cfaa72b97","infoHashBuffer":{"type":"Buffer","data":[76,211,69,156,187,188,248,107,117,249,209,42,239,231,95,108,250,167,43,151]},"name":"The Underground Girls of Kabul_ In Search of a Hidden Resistance","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}