{"title":"The Girl_ A Life in the Shadow of Roman Polanski by Samantha Gei","magnet":"magnet:?xt=urn:btih:4dfa8e55b5f7ca226fcf65ad27d391b1a6cfb73f&dn=The+Girl_+A+Life+in+the+Shadow+of+Roman+Polanski+by+Samantha+Gei&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3031927","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Girl_ A Life in the Shadow of Roman Polanski by Samantha Geimer MOBI eBOOK-ZAK\r\n\r\nIn this searing and surprising memoir, Samantha Geimer, &quot;the girl&quot; at the center of the infamous Roman Polanski sexual assault case, breaks a virtual 35-year silence to tell her story and reflect on the events of that day and their lifelong repercussions.\r\n\r\nMarch 1977, Southern California. Roman Polanski drives a rented Mercedes along Mulholland Drive to Jack Nicholson&apos;s house. Sitting next to him is an aspiring actress, Samantha Geimer, recently arrived from York, Pennsylvania. She is 13 years old.\r\n\r\nThe undisputed facts of what happened in the following hours appear in the court record: Polanski spent hours taking pictures of Samantha on a deck overlooking the Hollywood Hills, on a kitchen counter, topless in a Jacuzzi. Wine and Quaaludes were consumed, balance and innocence were lost, and a young girl&apos;s life was altered forever - eternally cast as a background player in her own story.\r\n\r\nFor months on end, the Polanski case dominated the media in the US and abroad. But even with the extensive coverage, much about that day and the girl at the center of it all remains a mystery. Just about everyone had an opinion about the renowned director and the girl he was accused of drugging and raping. Who was the predator? Who was the prey? Was the girl an innocent victim or a cunning Lolita artfully directed by her ambitious stage mother? How could the criminal justice system have failed all the parties concerned in such a spectacular fashion? Once Polanski fled the country, what became of Samantha, the young girl forever associated with one of Hollywood&apos;s most notorious episodes? Samantha, as much as Polanski, has been a fugitive since the events of that night more than thirty years ago.\r\n\r\nTaking us far beyond the headlines, The Girl reveals a 13-year-old who was simultaneously wise beyond her years and yet terribly vulnerable. By telling her story in full for the first time, Samantha reclaims her identity, and indelibly proves that it is possible to move forward from victim to survivor, from confusion to certainty, from shame to strength.\r\n\r\nxx","last_updated":"2017-09-06T12:00:42.885Z","parsed":{"xt":"urn:btih:4dfa8e55b5f7ca226fcf65ad27d391b1a6cfb73f","dn":"The Girl_ A Life in the Shadow of Roman Polanski by Samantha Gei","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4dfa8e55b5f7ca226fcf65ad27d391b1a6cfb73f","infoHashBuffer":{"type":"Buffer","data":[77,250,142,85,181,247,202,34,111,207,101,173,39,211,145,177,166,207,183,63]},"name":"The Girl_ A Life in the Shadow of Roman Polanski by Samantha Gei","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}