{"title":"How to Behave in a Crowd_ A Novel by Camille Bordas ePUB eBOOK-Z","magnet":"magnet:?xt=urn:btih:4f17b878890950bb8e2557f117829cb72f61d381&dn=How+to+Behave+in+a+Crowd_+A+Novel+by+Camille+Bordas+ePUB+eBOOK-Z&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3156296","seeders":"10","leechers":"6","description":"xx\r\n\r\nHow to Behave in a Crowd_ A Novel by Camille Bordas ePUB eBOOK-ZAK\r\n\r\nAn absorbing, darkly comedic novel that brilliantly evokes the confusions of adolescence and marks the arrival of an extraordinary young talent.\r\n\r\nIsidore Mazal is 11 years old, the youngest of six siblings living in a small French town. He doesn&apos;t quite fit in. Berenice, Aurore, and Leonard are on track to have doctorates by age 24. Jeremie performs with a symphony, and Simone, older than Isidore by 18 months, expects a great career as a novelist - she&apos;s already put Isidore to work on her biography. The only time they leave their rooms is to gather on the old, stained couch and dissect prime-time television dramas in light of Aristotle&apos;s Poetics.\r\n\r\nIsidore has never skipped a grade or written a dissertation. But he notices things the others don&apos;t and asks questions they fear to ask. So when tragedy strikes the Mazal family, Isidore is the only one to recognize how everyone is struggling with their grief and perhaps the only one who can help them - if he doesn&apos;t run away from home first.\r\n\r\nIsidore&apos;s unstinting empathy, combined with his simmering anger, makes for a complex character study in which the elegiac and comedic build toward a heartbreaking conclusion. With How to Behave in a Crowd, Camille Bordas immerses readers in the interior life of a boy puzzled by adulthood and beginning to realize that the adults around him are just as lost.\r\n\r\nxx","last_updated":"2017-09-20T12:04:42.409Z","parsed":{"xt":"urn:btih:4f17b878890950bb8e2557f117829cb72f61d381","dn":"How to Behave in a Crowd_ A Novel by Camille Bordas ePUB eBOOK-Z","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4f17b878890950bb8e2557f117829cb72f61d381","infoHashBuffer":{"type":"Buffer","data":[79,23,184,120,137,9,80,187,142,37,87,241,23,130,156,183,47,97,211,129]},"name":"How to Behave in a Crowd_ A Novel by Camille Bordas ePUB eBOOK-Z","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}