{"title":"Freedom from Fear: And Other Writings by Aung San Suu Kyi (epub)","magnet":"magnet:?xt=urn:btih:4f1a07193c08cd499e01a1e6edd58a0ad14ac7a6&dn=Freedom+from+Fear%3A+And+Other+Writings+by+Aung+San+Suu+Kyi+%28epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"SectorVector","categoryP":"other","categoryS":"e_books","size":"2057861","seeders":"4","leechers":"1","description":"\r\nFreedom from Fear - collected writings from the Nobel Peace prize winner Aung San Suu Kyi\r\n\r\nPublished : 1995, reprint 2010.\r\n\r\n416 pages.\r\n\r\n\r\nAung San Suu Kyi&apos;s collected writings - edited by her late husband, whom the ruling military junta prevented from visiting Burma as he was dying of cancer - reflects her greatest hopes and fears for her fellow Burmese people, and her concern about the need for international co-operation in the continuing fight for Burma&apos;s freedom. Bringing together her most powerful speeches, letters and interviews, this remarkable collection gives a voice to Burma&apos;s &apos;woman of destiny&apos;, whose fate remains in the hands of her enemies.\r\n\r\nRecipient of the Nobel Peace Prize and the Sakharov Prize for Freedom of Thought, and leader of Burma&apos;s National League for Democracy, Aung San Suu Kyi is one of the world&apos;s greatest living defenders of freedom and democracy, and an inspiration to millions worldwide. This book sits alongside Nelson Mandela&apos;s memoir Long Walk to Freedom.\r\n\r\n&apos;This book is bound to become a classic for a new generation of Asians who value democracy even more highly than Westerners do, simply because they are deprived of the basic freedoms that Westerners take for granted&apos;The New York Times\r\n\r\n&apos;Aung San Suu Kyi&apos;s extraordinary achievement has been to confront the regime peacefully, reasonably and persuasively... [in] one of the most laudable continuing acts of political courage&apos; Financial Times\r\n\r\n&apos;Such is the depth of passion and learning that she brings to her writings about national identity and its links with culture and language that she has attracted the admiration of intellectuals around the world&apos; Sunday Times\r\n\r\nAung San Suu Kyi is the leader of Burma&apos;s National League for Democracy. She was placed under house arrest in Rangoon in 1989, where she remained for almost 15 of the 21 years until her release in 2010, becoming one of the world&apos;s most prominent political prisoners. She is also the author of Letters from Burma","last_updated":"2017-09-14T12:02:59.831Z","parsed":{"xt":"urn:btih:4f1a07193c08cd499e01a1e6edd58a0ad14ac7a6","dn":"Freedom from Fear: And Other Writings by Aung San Suu Kyi (epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4f1a07193c08cd499e01a1e6edd58a0ad14ac7a6","infoHashBuffer":{"type":"Buffer","data":[79,26,7,25,60,8,205,73,158,1,161,230,237,213,138,10,209,74,199,166]},"name":"Freedom from Fear: And Other Writings by Aung San Suu Kyi (epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}