{"title":"\nNo Go Zones_ How Sharia Law Is Coming to a Neighborhood Near You","magnet":"magnet:?xt=urn:btih:4fb3c050e3cbc5c524039416cb0f09fa3943ba04&dn=No+Go+Zones_+How+Sharia+Law+Is+Coming+to+a+Neighborhood+Near+You&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1880132","seeders":"0","leechers":"0","description":"xx\r\n\r\nNo Go Zones_ How Sharia Law Is Coming to a Neighborhood Near You by Raheem Kassam ePUB eBOOK-ZAK\r\n\r\nNo Go Zones. That&apos;s what they&apos;re called. And while the politically correct try to deny their existence, the shocking reality of these No Go Zones - where Sharia law can prevail and local police stay away - can be attested to by its many victims.\r\n\r\nNow Raheem Kassam, a courageous reporter and editor at Breitbart.com, takes us where few journalists have dared to tread - inside the No Go Zones, revealing areas that Western governments, including the United States, don&apos;t want to admit exist within their own borders.\r\n\r\nWith compelling reporting, Kassam takes you into Islamic areas you might not even know existed - communities, neighborhoods, and whole city districts from San Bernardino, California (a No Go Zone of the mind), to Hamtramck, Michigan (essentially an Islamic colony in the Midwest); from Malm&#xF6;, Sweden, to the heart of London, England - where infidels are unwelcome, Islamic law is king, and extremism grows.\r\n\r\nIn No Go Zones, Kassam reveals:\r\n\r\nHow in No Go Zones a blind eye is being turned to polygamy, female genital mutilation, sexual assault, segregation, and even honor killings\r\nWhy Muslim ghettos in the West aren&apos;t the equivalent of Little Italy or Chinatown but a serious cultural and political threat\r\nHow the welfare state actually funds and supports a Muslim subculture of resentment\r\nHow to identify extremist mosques\r\nA matter of numbers: how mass migration could transform Europe into a Muslim-dominated continent within our own lifetimes\r\nThe alarming speed at which No Go Zones are coming to America\r\n\r\nCompelling in its reporting, shocking in its detail, Raheem Kassam&apos;s No Go Zones is one of the most frightening true stories you will hear this year.\r\n\r\nxx","last_updated":"2017-10-02T12:06:08.888Z","parsed":{"xt":"urn:btih:4fb3c050e3cbc5c524039416cb0f09fa3943ba04","dn":"No Go Zones_ How Sharia Law Is Coming to a Neighborhood Near You","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4fb3c050e3cbc5c524039416cb0f09fa3943ba04","infoHashBuffer":{"type":"Buffer","data":[79,179,192,80,227,203,197,197,36,3,148,22,203,15,9,250,57,67,186,4]},"name":"No Go Zones_ How Sharia Law Is Coming to a Neighborhood Near You","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}