{"title":"\nThe work_ The Wild Story of a Math Genius, a Gang of B","magnet":"magnet:?xt=urn:btih:4fedcbeda4ae8a43b6a1e96b6f637828f85176db&dn=The+work_+The+Wild+Story+of+a+Math+Genius%2C+a+Gang+of+B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4078883","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Spider Network_ The Wild Story of a Math Genius, a Gang of Backstabbing Bankers, and ... by David Enrich ePUB eBOOK-ZAK\r\n\r\nThe Wall Street Journal&apos;s award-winning business reporter unveils the bizarre and sinister story of how a math genius named Tom Hayes, a handful of outrageous confederates, and a deeply corrupt banking system ignited one of the greatest financial scandals in history.\r\n\r\nIn 2006, an oddball group of bankers, traders and brokers from some of the world&apos;s largest financial institutions made a startling realization: Libor - the London interbank offered rate, which determines the interest rates on trillions in loans worldwide - was set daily by a small group of easily manipulated functionaries, and that they could reap huge profits by nudging it to suit their trading portfolios. Tom Hayes, a brilliant but troubled mathematician, became the lynchpin of a wild alliance that among others included a French trader nicknamed &quot;Gollum&quot;; the broker &quot;Abbo&quot;, who liked to publicly strip naked when drinking; a Kazakh chicken farmer turned something short of financial whiz kid; a broker known as &quot;Village&quot; (short for &quot;Village Idiot&quot;) and fascinated with human-animal sex; an executive called &quot;Clumpy&quot; because of his patchwork hair loss; and a broker uncreatively nicknamed &quot;Big Nose&quot;. Eventually known as the &quot;Spider Network&quot;, Hayes&apos;s circle generated untold riches - until it all unraveled in spectacularly vicious, backstabbing fashion.\r\n\r\nThe Spider Network is not only a rollicking account of the scam, but a provocative examination of a financial system that was crooked throughout, designed to promote envelope-pushing behavior while shielding higher-ups from the consequences of their subordinates&apos; rapacious actions.\r\n\r\nxx","last_updated":"2017-09-23T12:01:48.239Z","parsed":{"xt":"urn:btih:4fedcbeda4ae8a43b6a1e96b6f637828f85176db","dn":"The work_ The Wild Story of a Math Genius, a Gang of B","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"4fedcbeda4ae8a43b6a1e96b6f637828f85176db","infoHashBuffer":{"type":"Buffer","data":[79,237,203,237,164,174,138,67,182,161,233,107,111,99,120,40,248,81,118,219]},"name":"The work_ The Wild Story of a Math Genius, a Gang of B","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}