{"title":"A Story Lately Told by Anjelica Huston EPUB","magnet":"magnet:?xt=urn:btih:5095b46d9315da8b4a330900199e84075ecbef4a&dn=A+Story+Lately+Told+by+Anjelica+Huston+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"812981","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Story Lately Told by Anjelica Huston EPUB\r\n\r\nWriting with an exuberant love of language and detail, Anjelica Huston shares her enchanted childhood in Ireland, her teen years in London, and her coming of age as a model and nascent actress in New York.\r\n\r\nJohn Huston was filming The African Queen - in the Belgian Congo - when he received a telegram from his wife announcing the birth of a healthy baby girl. She named her Anjelica, after her mother.\r\n\r\nNow, the magnificent Academy Award-winning actress shares the story of her deeply unconventional life. Living with her glamorous and artistic mother, educated by tutors and nuns, intrepid on a horse, Huston was raised on an Irish estate to which - between movies - her father brought his array of extraordinary friends, from Carson McCullers and John Steinbeck to Peter O&#x2019;Toole and Marlon Brando. Every morning, Anjelica and her brother visited their father while he took his breakfast in bed. &quot;What news?&quot; he&#x2019;d ask. &quot;I&#x2019;d seen him the night before,&quot; Anjelica recalls, &quot;There wasn&#x2019;t much to report.&quot; So she became a storyteller.\r\n\r\nIn London, where she lives with her mother and brother in the early Sixties when her parents separate, Huston encounters the Rolling Stones and Fleetwood Mac. She understudies Marianne Faithful in Hamlet. Seventeen, striking, precocious, but still young and vulnerable, she is devastated when her mother dies in a car crash.\r\n\r\nMonths later she moves to New York, falls in love with the much older, brilliant but disturbed photographer, Bob Richardson, and becomes a model. Living in the Chelsea Hotel, working with Richard Avedon and other photographers, she navigates a volatile relationship and the dynamic cultural epicenter of New York in the Seventies.\r\n\r\nxx","last_updated":"2017-11-06T12:03:09.867Z","parsed":{"xt":"urn:btih:5095b46d9315da8b4a330900199e84075ecbef4a","dn":"A Story Lately Told by Anjelica Huston EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5095b46d9315da8b4a330900199e84075ecbef4a","infoHashBuffer":{"type":"Buffer","data":[80,149,180,109,147,21,218,139,74,51,9,0,25,158,132,7,94,203,239,74]},"name":"A Story Lately Told by Anjelica Huston EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}