{"title":"The Bob Newhart Show (COMPLETE SERIES)","magnet":"magnet:?xt=urn:btih:50ec5bd847ad212a42704fb98122e7e79b848995&dn=The+Bob+Newhart+Show+%28COMPLETE+SERIES%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"7436746","categoryP":"video","categoryS":"tv_shows","size":"26147588765","seeders":"0","leechers":"14","description":" <a href=\"http://www.imdb.com/title/tt0068049/\" rel=\"nofollow\" target=\"_NEW\">http://www.imdb.com/title/tt0068049/</a>\r\n <a href=\"\nhttps://www.wikiwand.com/en/The_Bob_Newhart_Show\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.wikiwand.com/en/The_Bob_Newhart_Show</a>\r\n\r\nThe Bob Newhart Show is an American sitcom produced by MTM Enterprises that aired on CBS from September 16, 1972, to April 1, 1978, with a total of 142 half-hour episodes spanning over six seasons. Comedian Bob Newhart portrays a psychologist having to deal with his patients and fellow office workers. The show was filmed before a live audience.\r\n\r\nPremise\r\nStanding, from left: Howard Borden, Carol Kester, Jerry Robinson; seated: Bob and Emily Hartley\r\nStanding, from left: Howard Borden, Carol Kester, Jerry Robinson; seated: Bob and Emily Hartley\r\nThe show centers on Robert Hartley, Ph.D. (Newhart), a Chicago psychologist. It divides most of its action between the character&apos;s work and his home life, with Hartley&apos;s supportive, although occasionally sarcastic, wife Emily (Suzanne Pleshette), and their friendly but inept neighbor, airline navigator Howard Borden (Bill Daily). At the medical office where Hartley had his psychology practice are Jerry Robinson, D.D.S. (Peter Bonerz), an orthodontist who also has a practice on the floor, and their receptionist, Carol Kester (Marcia Wallace), as well as a number of other doctors who appear occasionally.\r\n\r\nHartley&apos;s three most frequently seen regular patients are the cynical and neurotic Elliot Carlin (Jack Riley), the milquetoast Marine veteran Emile Peterson (John Fiedler), and shy, reserved Lillian Bakerman (Florida Friebus), an elderly lady who spends most of her sessions knitting. Carlin was ranked 49th in TV Guide&apos;s List of the 50 Greatest TV Characters of All Time, and Riley reprised the character in guest appearances on both St. Elsewhere and Newhart.\r\n\r\nMost of the situations involve Newhart&apos;s character playing straight man to his wife, colleagues, friends, and patients. A frequent running gag on the show is an extension of Newhart&apos;s stand-up comedy routines, where Newhart played one side of a telephone conversation, the other side of which is not heard. In a nod to this, for the first two seasons, the episodes opened with Bob answering the telephone by saying &quot;Hello?&quot;. Emily routinely acts as straight woman to slow-witted Howard, and on occasion to Bob","last_updated":"2017-12-22T12:06:43.025Z","parsed":{"xt":"urn:btih:50ec5bd847ad212a42704fb98122e7e79b848995","dn":"The Bob Newhart Show (COMPLETE SERIES)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"50ec5bd847ad212a42704fb98122e7e79b848995","infoHashBuffer":{"type":"Buffer","data":[80,236,91,216,71,173,33,42,66,112,79,185,129,34,231,231,155,132,137,149]},"name":"The Bob Newhart Show (COMPLETE SERIES)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}