{"title":"Great Fortune: The Epic of Rockefeller Center","magnet":"magnet:?xt=urn:btih:51c0f12c5491b07ed1ea91e0d24bf929e44ac267&dn=Great+Fortune%3A+The+Epic+of+Rockefeller+Center&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4656043","seeders":"16","leechers":"1","description":"Great Fortune: The Epic of Rockefeller Center - Daniel Okrent [epub]\r\n\r\nIn this hugely appealing book, a finalist for the Pulitzer Prize, acclaimed author and journalist Daniel Okrent weaves together themes of money, politics, art, architecture, business, and society to tell the story of the majestic suite of buildings that came to dominate the heart of midtown Manhattan and with it, for a time, the heart of the world.\r\n\r\nAt the center of Okrent&apos;s riveting story are four remarkable individuals: tycoon John D. Rockefeller, his ambitious son Nelson Rockefeller, real estate genius John R. Todd, and visionary skyscraper architect Raymond Hood. In the tradition of David McCullough&apos;s The Great Bridge, Ron Chernow&apos;s Titan, and Robert Caro&apos;s The Power Broker, Great Fortune is a stunning tribute to an American landmark that captures the heart and spirit of New York at its apotheosis.\r\n\r\nDaniel Okrent was the first public editor of The New York Times, editor-at-large of Time, Inc., and managing editor of Life magazine. He worked in book publishing as an editor at Knopf and Viking, and was editor-in-chief of general books at Harcourt Brace. He was also a featured commentator on Ken Burns&#x2019;s PBS series, Baseball, and is author of four books, one of which, Great Fortune, was a finalist for the 2004 Pulitzer Prize in history. Okrent was also a fellow at the Shorenstein Center at the Kennedy School of Government at Harvard, where he remains an Associate.\r\n\r\nPaperback: 560 pages\r\nPublisher: Penguin Books; Reprint edition (November 30, 2004)","last_updated":"2017-08-30T12:01:21.899Z","parsed":{"xt":"urn:btih:51c0f12c5491b07ed1ea91e0d24bf929e44ac267","dn":"Great Fortune: The Epic of Rockefeller Center","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"51c0f12c5491b07ed1ea91e0d24bf929e44ac267","infoHashBuffer":{"type":"Buffer","data":[81,192,241,44,84,145,176,126,209,234,145,224,210,75,249,41,228,74,194,103]},"name":"Great Fortune: The Epic of Rockefeller Center","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}