{"title":"The Sunken Gold: The Greatest Treasure Salvage in History","magnet":"magnet:?xt=urn:btih:51fbb43949f27a48a9f7933dee0deed899ee040c&dn=The+Sunken+Gold%3A+The+Greatest+Treasure+Salvage+in+History&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"10060542","seeders":"70","leechers":"4","description":"The Sunken Gold: A Story of World War I Espionage and the Greatest Treasure Salvage in History - Joseph A. Williams [epub]\r\n\r\nOn January 25, 1917, HMS Laurentic struck two German mines off the coast of Ireland and sank. The ship was carrying 44 tons of gold bullion to the still-neutral United States via Canada in order to finance the war effort for Britain and its allies. Britain desperately needed that sunken treasure, but any salvage had to be secret since the British government dared not alert the Germans to the presence of the gold.\r\n \r\nLieutenant Commander Guybon Damant was the most qualified officer to head the risky mission. Wild gales battered the wreck into the shape of an accordion, turning the operation into a multiyear struggle of man versus nature. As the war raged on, Damant was called off the salvage to lead a team of covert divers to investigate and search through the contents of recently sunk U-boats for ciphers, minefield schematics, and other secrets. The information they obtained, once in the hands of British intelligence, proved critical toward Allied efforts to defeat the U-boats and win the war.\r\n\r\nBut Damant had become obsessed with completing his long-deferred mission. His team struggled for five more years as it became apparent that the work could only be accomplished by muscle, grit, and persistence. Using newly discovered sources, author Joseph A. Williams provides the first full-length account of the quest for the Laurentic&#x2019;s gold. More than an incredible story about undersea diving adventure, The Sunken Gold is a story of human persistence, bravery, and patriotism.\r\n\r\nJoseph A. Williams is the deputy director of the Greenwich (CT) Library and the author of Seventeen Fathoms Deep: The Saga of the Submarine S-4 Disaster and Four Years Before the Mast: A History of New York&#x2019;s Maritime College.\r\n\r\nHardcover: 352 pages\r\nPublisher: Chicago Review Press (September 1, 2017)","last_updated":"2017-09-05T12:07:18.681Z","parsed":{"xt":"urn:btih:51fbb43949f27a48a9f7933dee0deed899ee040c","dn":"The Sunken Gold: The Greatest Treasure Salvage in History","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"51fbb43949f27a48a9f7933dee0deed899ee040c","infoHashBuffer":{"type":"Buffer","data":[81,251,180,57,73,242,122,72,169,247,147,61,238,13,238,216,153,238,4,12]},"name":"The Sunken Gold: The Greatest Treasure Salvage in History","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}