{"title":"Finding Fibonacci - The Quest to Rediscover...(2017) Gooner","magnet":"magnet:?xt=urn:btih:52607da03602155dd7c39bf15e92aa786a58c2b0&dn=Finding+Fibonacci+-+The+Quest+to+Rediscover...%282017%29+Gooner&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"9345519","seeders":"47","leechers":"17","description":"Finding Fibonacci - The Quest to Rediscover the Forgotten Mathematical Genius (2017) (Epub) Gooner\r\n\r\nPublisher: Princeton University Press (31 Mar. 2017)\r\nAuthor: Keith Devlin\r\nLanguage: English\r\nISBN-10: 0691174865\r\nISBN-13: 9780691174860\r\nASIN: B01M74LZYP\r\n\r\nA compelling firsthand account of Keith Devlin&apos;s ten-year quest to tell Fibonacci&apos;s story\r\n\r\nIn 2000, Keith Devlin set out to research the life and legacy of the medieval mathematician Leonardo of Pisa, popularly known as Fibonacci, whose book Liber abbaci has quite literally affected the lives of everyone alive today. Although he is most famous for the Fibonacci numbers&#x2014;which, it so happens, he didn&apos;t invent&#x2014;Fibonacci&apos;s greatest contribution was as an expositor of mathematical ideas at a level ordinary people could understand. In 1202, Liber abbaci&#x2014;the &quot;Book of Calculation&quot;&#x2014;introduced modern arithmetic to the Western world. Yet Fibonacci was long forgotten after his death, and it was not until the 1960s that his true achievements were finally recognized.\r\n\r\nFinding Fibonacci is Devlin&apos;s compelling firsthand account of his ten-year quest to tell Fibonacci&apos;s story. Devlin, a math expositor himself, kept a diary of the undertaking, which he draws on here to describe the project&apos;s highs and lows, its false starts and disappointments, the tragedies and unexpected turns, some hilarious episodes, and the occasional lucky breaks. You will also meet the unique individuals Devlin encountered along the way, people who, each for their own reasons, became fascinated by Fibonacci, from the Yale professor who traced modern finance back to Fibonacci to the Italian historian who made the crucial archival discovery that brought together all the threads of Fibonacci&apos;s astonishing story.\r\n\r\nFibonacci helped to revive the West as the cradle of science, technology, and commerce, yet he vanished from the pages of history. This is Devlin&apos;s search to find him","last_updated":"2017-07-09T12:01:16.660Z","parsed":{"xt":"urn:btih:52607da03602155dd7c39bf15e92aa786a58c2b0","dn":"Finding Fibonacci - The Quest to Rediscover...(2017) Gooner","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"52607da03602155dd7c39bf15e92aa786a58c2b0","infoHashBuffer":{"type":"Buffer","data":[82,96,125,160,54,2,21,93,215,195,155,241,94,146,170,120,106,88,194,176]},"name":"Finding Fibonacci - The Quest to Rediscover...(2017) Gooner","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}