{"title":"Dark Matter of the Mind by Daniel L. Everett PDF","magnet":"magnet:?xt=urn:btih:526485fb02238466a0ac6315c49ad76483471213&dn=Dark+Matter+of+the+Mind+by+Daniel+L.+Everett+PDF&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17954573","seeders":"5","leechers":"45","description":"xx\r\n\r\nDark Matter of the Mind by Daniel L. Everett PDF\r\n\r\nIs it in our nature to be altruistic, or evil, to make art, use tools, or create language? Is it in our nature to think in any particular way? For Daniel L. Everett, the answer is a resounding no: it isn&#x2019;t in our nature to do any of these things because human nature does not exist&#x2014;at least not as we usually think of it. Flying in the face of major trends in Evolutionary Psychology and related fields, he offers a provocative and compelling argument in this book that the only thing humans are hardwired for is freedom: freedom from evolutionary instinct and freedom to adapt to a variety of environmental and cultural contexts.\r\n           \r\nEverett sketches a blank-slate picture of human cognition that focuses not on what is in the mind but, rather, what the mind is in&#x2014;namely, culture. He draws on years of field research among the Amazonian people of the Pirah&#xE3; in order to carefully scrutinize various theories of cognitive instinct, including Noam Chomsky&#x2019;s foundational concept of universal grammar, Freud&#x2019;s notions of unconscious forces, Adolf Bastian&#x2019;s psychic unity of mankind, and works on massive modularity by evolutionary psychologists such as Leda Cosmides, John Tooby, Jerry Fodor, and Steven Pinker. Illuminating unique characteristics of the Pirah&#xE3; language, he demonstrates just how differently various cultures can make us think and how vital culture is to our cognitive flexibility. Outlining the ways culture and individual psychology operate symbiotically, he posits a Buddhist-like conception of the cultural self as a set of experiences united by various apperceptions, episodic memories, ranked values, knowledge structures, and social roles&#x2014;and not, in any shape or form, biological instinct.\r\n\r\nThe result is fascinating portrait of the &#x201C;dark matter of the mind,&#x201D; one that shows that our greatest evolutionary adaptation is adaptability itself.\r\n\r\nxx","last_updated":"2017-12-18T12:01:34.556Z","parsed":{"xt":"urn:btih:526485fb02238466a0ac6315c49ad76483471213","dn":"Dark Matter of the Mind by Daniel L. Everett PDF","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"526485fb02238466a0ac6315c49ad76483471213","infoHashBuffer":{"type":"Buffer","data":[82,100,133,251,2,35,132,102,160,172,99,21,196,154,215,100,131,71,18,19]},"name":"Dark Matter of the Mind by Daniel L. Everett PDF","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}