{"title":"David France - How to Survive a Plague 2016 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:527773daa8cb8996fd2dd23f5720bb9ae57bbc7d&dn=David+France+-+How+to+Survive+a+Plague+2016+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"59760696","seeders":"45","leechers":"8","description":"David France - How to Survive a Plague 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA riveting, powerful telling of the story of the grassroots movement of activists, many of them in a life-or-death struggle, who seized upon scientific research to help develop the drugs that turned HIV from a mostly fatal infection to a manageable disease. Ignored by public officials, religious leaders, and the nation at large, and confronted with shame and hatred, this small group of men and women chose to fight for their right to live by educating themselves and demanding to become full partners in the race for effective treatments. Around the globe, 16 million people are alive today thanks to their efforts.\r\n\r\nNot since the publication of Randy Shilts&apos; classic And the Band Played On has a book measured the AIDS plague in such brutally human, intimate, and soaring terms.\r\n\r\nIn dramatic fashion, we witness the founding of ACT UP and TAG (Treatment Action Group) and the rise of an underground drug market in opposition to the prohibitively expensive (and sometimes toxic) AZT. We watch as these activists learn to become their own researchers, lobbyists, drug smugglers, and clinicians, establishing their own newspapers, research journals, and laboratories, and as they go on to force reform in the nation&apos;s disease-fighting agencies.\r\n\r\nWith his unparalleled access to this community, David France illuminates the lives of extraordinary characters, including the closeted Wall Street trader turned activist, the high school dropout who found purpose battling pharmaceutical giants in New York, the South African physician who helped establish the first officially recognized buyers&apos; club at the height of the epidemic, and the public relations executive fighting to save his own life for the sake of his young daughter.\r\n\r\nExpansive yet richly detailed, this is an insider&apos;s account of a pivotal moment in the history of American civil rights. Powerful, heart-wrenching, and finally exhilarating, How to Survive a Plague is destined to become an essential part of the literature of AIDS","last_updated":"2017-06-06T12:05:11.204Z","parsed":{"xt":"urn:btih:527773daa8cb8996fd2dd23f5720bb9ae57bbc7d","dn":"David France - How to Survive a Plague 2016 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"527773daa8cb8996fd2dd23f5720bb9ae57bbc7d","infoHashBuffer":{"type":"Buffer","data":[82,119,115,218,168,203,137,150,253,45,210,63,87,32,187,154,229,123,188,125]},"name":"David France - How to Survive a Plague 2016 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}