{"title":"Coretta Scott King - My Life My Love My Legacy 2017 RETAiL ePUB ","magnet":"magnet:?xt=urn:btih:52913ac4cce4f210f98b5a4d1bba1805da63fc52&dn=Coretta+Scott+King+-+My+Life+My+Love+My+Legacy+2017+RETAiL+ePUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3133098","seeders":"0","leechers":"4","description":"xx\r\n\r\nCoretta Scott King - My Life My Love My Legacy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe life story of Coretta Scott King - wife of Martin Luther King Jr., founder of the King Center for Nonviolent Social Change, and singular 20th-century American civil rights activist - as told fully for the first time, toward the end of her life, to one of her closest friends.\r\n\r\nBorn in 1927 to daringly enterprising black parents in the Deep South, Coretta Scott had always felt called to a special purpose. One of the first black scholarship students recruited to Antioch College, a committed pacifist, and a civil rights activist, she was an avowed feminist - a graduate student determined to pursue her own career - when she met Martin Luther King Jr., a Baptist minister insistent that his wife stay home with the children. But in love and devoted to shared Christian beliefs and racial justice goals, she married King, and events promptly thrust her into a maelstrom of history throughout which she was a strategic partner, a standard bearer, a marcher, a negotiator, and a crucial fund-raiser in support of world-changing achievements.\r\n\r\nAs a widow and single mother of four, while butting heads with the all-male African American leadership of the times, she championed gay rights and AIDS awareness, founded the King Center for Nonviolent Social Change, lobbied for 15 years to help pass a bill establishing the US national holiday in honor of her slain husband, and was a powerful international presence, serving as a UN ambassador and playing a key role in Nelson Mandela&apos;s election.\r\n\r\nCoretta&apos;s is a love story, a family saga, and the memoir of an independent-minded black woman in 20th-century America, a brave leader who stood committed, proud, forgiving, nonviolent, and hopeful in the face of terrorism and violent hatred every single day of her life. \r\n\r\nPhylicia Rashad is an actress, singer, and stage director. She is known for roles in television shows such as Empire and Psych and as Clair Huxtable on The Cosby Show. Her voice-over credits include spots in The Cleveland Show, Little Bill, and Sofia the First. Rashad has also appeared in such films as For Colored Girls, Good Deeds, and Creed.\r\n\r\nxx","last_updated":"2017-07-28T12:00:30.492Z","parsed":{"xt":"urn:btih:52913ac4cce4f210f98b5a4d1bba1805da63fc52","dn":"Coretta Scott King - My Life My Love My Legacy 2017 RETAiL ePUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"52913ac4cce4f210f98b5a4d1bba1805da63fc52","infoHashBuffer":{"type":"Buffer","data":[82,145,58,196,204,228,242,16,249,139,90,77,27,186,24,5,218,99,252,82]},"name":"Coretta Scott King - My Life My Love My Legacy 2017 RETAiL ePUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}