{"title":"Into the Fire_ A Firsthand Account of the Most Extraordinary Bat","magnet":"magnet:?xt=urn:btih:5319bda9ce15b75c1fe4b33162b70fbf5d87cdfc&dn=Into+the+Fire_+A+Firsthand+Account+of+the+Most+Extraordinary+Bat&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5144305","seeders":"0","leechers":"0","description":"xx\r\n\r\nInto the Fire_ A Firsthand Account of the Most Extraordinary Battle in the Afghan War by Dakota Meyer and Bing West ePUB eBOOK-ZAK\r\n\r\n&quot;The story of what Dakota did . . . will be told for generations.&quot; (President Barack Obama, from remarks given at Meyer&apos;s Medal of Honor ceremony)\r\n\r\nIn the fall of 2009, Taliban insurgents ambushed a patrol of Afghan soldiers and Marine advisors in a mountain village called Ganjigal. Firing from entrenched positions, the enemy was positioned to wipe out 100 men who were pinned down and were repeatedly refused artillery support. Ordered to remain behind with the vehicles, 21 year-old Marine corporal Dakota Meyer disobeyed orders and attacked to rescue his comrades.\r\n\r\nWith a brave driver at the wheel, Meyer stood in the gun turret exposed to withering fire, rallying Afghan troops to follow. Over the course of the five hours, he charged into the valley time and again. Employing a variety of machine guns, rifles, grenade launchers, and even a rock, Meyer repeatedly repulsed enemy attackers, carried wounded Afghan soldiers to safety, and provided cover for dozens of others to escape - supreme acts of valor and determination. In the end, Meyer and four stalwart comrades - an Army captain, an Afghan sergeant major, and two Marines - cleared the battlefield and came to grips with a tragedy they knew could have been avoided. For his actions on that day, Meyer became the first living Marine in three decades to be awarded the Medal of Honor.\r\n\r\nInto the Fire tells the full story of the chaotic battle of Ganjigal for the first time, in a compelling, human way that reveals it as a microcosm of our recent wars. Meyer takes us from his upbringing on a farm in Kentucky, through his Marine and sniper training, onto the battlefield, and into the vexed aftermath of his harrowing exploits in a battle that has become the stuff of legend.\r\n\r\nInvestigations ensued, even as he was pitched back into battle alongside U.S. Army soldiers who embraced him as a fellow grunt. When it was over, he returned to the States to confront living with the loss of his closest friends. This is a tale of American values and upbringing, of stunning heroism, and of adjusting to loss and to civilian life.\r\n\r\nWe see it all through Meyer&apos;s eyes, bullet by bullet, with raw honesty in telling of both the errors that resulted in tragedy and the resolve of American soldiers, U.S.Marines, and Afghan soldiers who&apos;d been abandoned and faced certain death.\r\n\r\nMeticulously researched and thrillingly told, with nonstop pace and vivid detail, Into the Fire is the true story of a modern American hero.\r\n\r\n&quot;Sergeant Meyer embodies all that is good about our nation&apos;s Corps of Marines. . . . [His] heroic actions . . . will forever be etched in our Corps&apos; rich legacy of courage and valor.&quot; (General James F. Amos, Commandant of the Marine Corps)\r\n\r\nxx","last_updated":"2017-09-16T12:00:35.838Z","parsed":{"xt":"urn:btih:5319bda9ce15b75c1fe4b33162b70fbf5d87cdfc","dn":"Into the Fire_ A Firsthand Account of the Most Extraordinary Bat","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5319bda9ce15b75c1fe4b33162b70fbf5d87cdfc","infoHashBuffer":{"type":"Buffer","data":[83,25,189,169,206,21,183,92,31,228,179,49,98,183,15,191,93,135,205,252]},"name":"Into the Fire_ A Firsthand Account of the Most Extraordinary Bat","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}