{"title":"Bonobo Handshake_ A Memoir of Love and Adventure in the Congo by","magnet":"magnet:?xt=urn:btih:538c91f2644e8094ca145113ac1c040b51bf8c36&dn=Bonobo+Handshake_+A+Memoir+of+Love+and+Adventure+in+the+Congo+by&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2289619","seeders":"15","leechers":"7","description":"xx\r\n\r\nBonobo Handshake_ A Memoir of Love and Adventure in the Congo by Vanessa Woods ePUB eBOOK-ZAK\r\n\r\nIn 2005, Vanessa Woods accepted a marriage proposal from a man she barely knew and agreed to join him on a research trip to the Democratic Republic of Congo, a country reeling from a brutal decade-long war that had claimed the lives of millions. Settling in at a bonobo sanctuary in Congo&apos;s capital, Vanessa and her fiancee entered the world of a rare ape with whom we share 98.7 percent of our DNA. She soon discovered that many of the inhabitants of the sanctuary---ape and human alike---are refugees from unspeakable violence, yet bonobos live in a peaceful society in which females are in charge, war is nonexistent, and sex is as common and friendly as a handshake.\r\n\r\nA fascinating memoir of hope and adventure, Bonobo Handshake traces Woods&apos; self-discovery as she finds herself falling deeply in love with her husband, the apes, and her new surroundings while probing life&apos;s greatest question: What ultimately makes us human?\r\n\r\nCourageous and extraordinary, this true story of revelation and transformation in a fragile corner of Africa is about looking past the differences between animals and ourselves, and finding in them the same extraordinary courage and will to survive. For Vanessa, it is about finding her own path as a writer and scientist, falling in love, and finding a home.\r\n\r\nxx","last_updated":"2017-09-15T12:02:12.927Z","parsed":{"xt":"urn:btih:538c91f2644e8094ca145113ac1c040b51bf8c36","dn":"Bonobo Handshake_ A Memoir of Love and Adventure in the Congo by","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"538c91f2644e8094ca145113ac1c040b51bf8c36","infoHashBuffer":{"type":"Buffer","data":[83,140,145,242,100,78,128,148,202,20,81,19,172,28,4,11,81,191,140,54]},"name":"Bonobo Handshake_ A Memoir of Love and Adventure in the Congo by","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}