{"title":"Her Again_ Becoming Meryl Streep by Michael Schulman EPUB","magnet":"magnet:?xt=urn:btih:53eb7ce4328d6ce8ae66cf6c695a131b66d2579d&dn=Her+Again_+Becoming+Meryl+Streep+by+Michael+Schulman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2390730","seeders":"8","leechers":"8","description":"xx\r\n\r\nHer Again_ Becoming Meryl Streep by Michael Schulman EPUB\r\n\r\nA portrait of a woman, an era, and a profession: the first thoroughly researched biography of Meryl Streep - the &quot;Iron Lady&quot; of acting, nominated for 19 Oscars and winner of three - that explores her beginnings as a young woman of the 1970s grappling with love, feminism, and her astonishing talent.\r\n\r\nIn 1975, Meryl Streep, a promising young graduate of the Yale School of Drama, was finding her place in the New York theater scene. Burning with talent and ambition, she was like dozens of aspiring actors of the time - a 20-something beauty who rode her bike everywhere, kept a diary, napped before performances, and stayed out late &quot;talking about acting with actors in actors&apos; bars&quot;. Yet Meryl stood apart from her peers. In her first season in New York, she won attention-getting parts in back-to-back Broadway plays, a Tony Award nomination, and two roles in Shakespeare in the Park productions. Even then, people said, &quot;Her. Again.&quot;\r\n\r\nHer Again is an intimate look at the artistic coming of age of the greatest actress of her generation, from the homecoming float at her suburban New Jersey high school through her early days on the stage at Vassar College and the Yale School of Drama during its golden years to her star-making roles in The Deer Hunter, Manhattan, and Kramer vs. Kramer. New Yorker contributor Michael Schulman brings into focus Meryl&apos;s heady rise to stardom on the New York stage; her passionate, tragically short-lived love affair with fellow actor John Cazale; her marriage to sculptor Don Gummer; and her evolution as a young woman of the 1970s wrestling with changing ideas of feminism, marriage, love, and sacrifice.\r\n\r\nThis captivating story of the making of one of the most revered artistic careers of our time reveals a gifted young woman coming into her extraordinary talents at a time of immense transformation, offering a rare glimpse into the life of the actress long before she became an icon.\r\n\r\nxx","last_updated":"2017-11-06T12:04:48.291Z","parsed":{"xt":"urn:btih:53eb7ce4328d6ce8ae66cf6c695a131b66d2579d","dn":"Her Again_ Becoming Meryl Streep by Michael Schulman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"53eb7ce4328d6ce8ae66cf6c695a131b66d2579d","infoHashBuffer":{"type":"Buffer","data":[83,235,124,228,50,141,108,232,174,102,207,108,105,90,19,27,102,210,87,157]},"name":"Her Again_ Becoming Meryl Streep by Michael Schulman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}