{"title":"Powerhouse by James Andrew Miller 2016 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:545c96a706c4fbd535a139f0958aeeb893a6f884&dn=Powerhouse+by+James+Andrew+Miller+2016+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8441258","seeders":"0","leechers":"0","description":"xx\r\n\r\nPowerhouse by James Andrew Miller 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn astonishing - and astonishingly entertaining - behind-the-curtain history of Hollywood&apos;s transformation over the past five decades as seen through the agency at the heart of it all, from the number-one best-selling author of Live from New York and Those Guys Have All the Fun.\r\n\r\nIn 1975, five young employees of a sclerotic William Morris agency left to start their own strikingly innovative talent agency. In the years to come, Creative Artists Agency would vault from its origins in a tiny office on the last block of Beverly Hills to become the largest and most imperial, groundbreaking, and star-studded agency Hollywood has ever seen - a company whose tentacles now spread throughout the world of movies, music, television, technology, advertising, sports, and investment banking far more than previously imagined.\r\n\r\nPowerhouse is the fascinating, no-holds-barred saga of that hot-blooded ascent. Drawing on unprecedented and exclusive access to the men and women who built and battled CAA as well as financial information never before made public, acclaimed author James Andrew Miller spins a tale of boundless ambition, ruthless egomania, ceaseless empire building, drugs, sex, greed, and personal betrayal. Powerhouse is also a story of prophetic brilliance, magnificent artistry, singular genius, entrepreneurial courage, strategic daring, foxhole brotherhood, and how one firm utterly transformed the entertainment business. Here are the real Star Wars - complete with a Death Star - told through the voices of those who were actually there. Packed with scores of stars from movies, television, music, and sports as well as a tremendously compelling cast of agents, studio executives, network chiefs, league commissioners, hedge fund managers, tech CEOs, and media tycoons, Powerhouse is itself a Hollywood blockbuster of the most spectacular sort.\r\n\r\nxx","last_updated":"2017-08-28T12:30:49.621Z","parsed":{"xt":"urn:btih:545c96a706c4fbd535a139f0958aeeb893a6f884","dn":"Powerhouse by James Andrew Miller 2016 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"545c96a706c4fbd535a139f0958aeeb893a6f884","infoHashBuffer":{"type":"Buffer","data":[84,92,150,167,6,196,251,213,53,161,57,240,149,138,238,184,147,166,248,132]},"name":"Powerhouse by James Andrew Miller 2016 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}