{"title":"Mechanochemical Organic Synthesis","magnet":"magnet:?xt=urn:btih:54ba02947bf43d722a5816eb692675dc4d554af3&dn=Mechanochemical+Organic+Synthesis&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"19130188","seeders":"22","leechers":"3","description":"Mechanochemical Organic Synthesis - Davor Margetic, Vjekoslav Strukil (Elsevier, 2016).pdf\r\n\r\nMechanochemical Organic Synthesis is a comprehensive reference that not only synthesizes the current literature but also offers practical protocols that industrial and academic scientists can immediately put to use in their daily work. Increasing interest in green chemistry has led to the development of numerous environmentally-friendly methodologies for the synthesis of organic molecules of interest. Amongst the green methodologies drawing attention, mechanochemistry is emerging as a promising method to circumvent the use of toxic solvents and reagents as well as to increase energy efficiency.\r\n\r\nThe development of synthetic strategies that require less, or the minimal, amount of energy to carry out a specific reaction with optimum productivity is of vital importance for large-scale industrial production. Experimental procedures at room temperature are the mildest reaction conditions (essentially required for many temperature-sensitive organic substrates as a key step in multi-step sequence reactions) and are the core of mechanochemical organic synthesis. This green synthetic method is now emerging in a very progressive manner and until now, there is no book that reviews the recent developments in this area.\r\n\r\n\r\n\r\nFeatures cutting-edge research in the field of mechanochemical organic synthesis for more sustainable reactions\r\nIntegrates advances in green chemistry research into industrial applications and process development\r\nFocuses on designing techniques in organic synthesis directed toward mild reaction conditions\r\nIncludes global coverage of mechanochemical synthetic protocols for the generation of organic compounds","last_updated":"2017-06-08T12:03:43.800Z","parsed":{"xt":"urn:btih:54ba02947bf43d722a5816eb692675dc4d554af3","dn":"Mechanochemical Organic Synthesis","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54ba02947bf43d722a5816eb692675dc4d554af3","infoHashBuffer":{"type":"Buffer","data":[84,186,2,148,123,244,61,114,42,88,22,235,105,38,117,220,77,85,74,243]},"name":"Mechanochemical Organic Synthesis","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}