{"title":"Trace Metals in Aquatic Systems - Robert P. Mason","magnet":"magnet:?xt=urn:btih:54bd64754a08355df6152c31adad5c435c61b8a7&dn=Trace+Metals+in+Aquatic+Systems+-+Robert+P.+Mason&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"20510790","seeders":"19","leechers":"9","description":"Trace Metals in Aquatic Systems - Robert P. Mason (Wiley-Blackwell, 2013).pdf\r\n\r\nThis book provides a detailed examination of the concentration, form and cycling of trace metals and metalloids through the aquatic biosphere, and has sections dealing with the atmosphere, the ocean, lakes and rivers. It discusses exchanges at the water interface (air/water and sediment/water) and the major drivers of the cycling, concentration and form of trace metals in aquatic systems. The initial chapters focus on the fundamental principles and modelling approaches needed to understand metal concentration, speciation and fate in the aquatic environment, while the later chapters focus on specific environments, with case studies and research highlights.\r\n\r\nSpecific examples deal with metals that are of particular scientific interest, such as mercury, iron, arsenic and zinc, and the book deals with both pollutant and required (nutrient) metals and metalloids. The underlying chemical principles controlling toxicity and bioavailability of these elements to microorganisms and to the aquatic food chain are also discussed. \r\n\r\nReadership: Graduate students studying environmental chemistry and related topics, as well as scientists and managers interested in the cycling of trace substances in aqueous systems","last_updated":"2017-05-09T19:43:12.722Z","parsed":{"xt":"urn:btih:54bd64754a08355df6152c31adad5c435c61b8a7","dn":"Trace Metals in Aquatic Systems - Robert P. Mason","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54bd64754a08355df6152c31adad5c435c61b8a7","infoHashBuffer":{"type":"Buffer","data":[84,189,100,117,74,8,53,93,246,21,44,49,173,173,92,67,92,97,184,167]},"name":"Trace Metals in Aquatic Systems - Robert P. Mason","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}