{"title":"Ballad of the Anarchist Bandits by John Merriman EPUB","magnet":"magnet:?xt=urn:btih:54dce9391ddf1817bffbb96fe055e5b463c3f677&dn=Ballad+of+the+Anarchist+Bandits+by+John+Merriman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2285458","seeders":"9","leechers":"2","description":"xx\r\n\r\nBallad of the Anarchist Bandits by John Merriman EPUB\r\n\r\nFor six terrifying months in 1911-1912, the citizens of Paris were gripped by a violent crime streak. A group of bandits went on a rampage throughout the city and its suburbs, robbing banks and wealthy Parisians, killing anyone who got in their way, and always managing to stay one step ahead of the police. But Jules Bonnot and the Bonnot Gang weren&apos;t just ordinary criminals; they were anarchists, motivated by the rampant inequality and poverty in Paris.\r\n\r\nJohn Merriman tells this story through the eyes of two young, idealistic lovers: Victor Kibaltchiche (later the famed Russian revolutionary and writer Victor Serge) and Rirette Ma&#xEE;trejean, who chronicled the Bonnot crime spree in the radical newspaper L&apos;Anarchie. While wealthy Parisians frequented restaurants on the Champs-&#xC9;lys&#xE9;es, attended performances at the magnificent new opera house, and enjoyed the decadence of the so-called Belle &#xC9;poque, Victor, Rirette, and their friends occupied a vast sprawl of dank apartments, bleak canals, and smoky factories. Victor and Rirette rejected the violence of Bonnot and his cronies, but to the police it made no difference. Victor was imprisoned for years for his anarchist beliefs, Bonnot was hunted down and shot dead, and his fellow bandits were sentenced to death by guillotine or lifelong imprisonment.\r\n\r\nFast-paced and gripping, Ballad of the Anarchist Bandits is a tale of idealists and lost causes - and a vivid evocation of Paris in the dizzying years before the horrors of World War I were unleashed.\r\n\r\nxx","last_updated":"2017-10-28T12:03:31.553Z","parsed":{"xt":"urn:btih:54dce9391ddf1817bffbb96fe055e5b463c3f677","dn":"Ballad of the Anarchist Bandits by John Merriman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54dce9391ddf1817bffbb96fe055e5b463c3f677","infoHashBuffer":{"type":"Buffer","data":[84,220,233,57,29,223,24,23,191,251,185,111,224,85,229,180,99,195,246,119]},"name":"Ballad of the Anarchist Bandits by John Merriman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}