{"title":"Folder Lock 7.7.2 + Crack [CracksNow]","magnet":"magnet:?xt=urn:btih:54fa594ba71461983e2e4077e1c0c4b84f74a9d8&dn=Folder+Lock+7.7.2+%2B+Crack+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"10481255","seeders":"21","leechers":"6","description":"Folder Lock 7 is a full suite solution for all your data security needs. It lets you keep your personal files protected in a variety of ways, in both PC and portable drives and offers optional backup of protected files to an online storage.Folder Lock comes with a perfect combination of seven (7) security tools, letting you encrypt your important files using 256-bit on-the-fly encryption; back them up in real-time to an online storage, and store them to any portable device. The program also lets you lock files, folders and drives; save your personal information in Wallets; shred files and clean your Windows History. \r\n\r\nFolder Lock 7 Features and Benefits: \r\n\r\nEncrypt Files. Encrypt your personal files using 256-bit on-the-fly encryption technology totally dynamic and fool-proof. \r\nBackup Online. Backup all your encrypted files automatically to an online storage and easily restore it back. \r\nProtect USB / CD. Convert your encrypted storages into executables and take your portable drives anywhere. \r\nLock Files. Protect important files from unwanted access by blocking visibility or accessto files, folders and drives. \r\nMake Wallets. Store sensitive information in encrypted form. A safe haven for private info like Credit Cards and Bank Accounts. \r\nShred Files. Shred and permanently delete restorable files, folders and drives and even empty hard drive space. \r\nStealth Mode. Run Application in complete Stealth. Don&#x2019;t let anyone know you ever installed Folder Lock on your PC. \r\nHack Security. Don&#x2019;t let hackers use dictionary attacks. Monitor, control and perform actions on incorrect password attempts. \r\nPassword Security. Restrict access to various parts of the application with use of admin level master password. \r\nAuto Protection. Set inactivity based security policy in order to secure everything when you&#x2019;re away from your PC. \r\nFolder Lock works under all flavors of 32-bit and 64-bit versions of Windows XP, Vista, Windows 7, Windows 8/8.1 and Windows 10","last_updated":"2017-11-18T12:08:29.322Z","parsed":{"xt":"urn:btih:54fa594ba71461983e2e4077e1c0c4b84f74a9d8","dn":"Folder Lock 7.7.2   Crack [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"54fa594ba71461983e2e4077e1c0c4b84f74a9d8","infoHashBuffer":{"type":"Buffer","data":[84,250,89,75,167,20,97,152,62,46,64,119,225,192,196,184,79,116,169,216]},"name":"Folder Lock 7.7.2   Crack [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}