{"title":"\nThe Stolen Marriage_ A Novel by Diane Chamberlain ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:5519b5de81a54f87b7520154be61061b13e066d1&dn=The+Stolen+Marriage_+A+Novel+by+Diane+Chamberlain+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6848813","seeders":"14","leechers":"7","description":"xx\r\n\r\nThe Stolen Marriage_ A Novel by Diane Chamberlain ePUB eBOOK-ZAK\r\n\r\nFrom New York Times, USA Today, and Sunday Times best-selling author Diane Chamberlain comes The Stolen Marriage - a thrilling new book of secrets, heartbreak, and small-town alienation.\r\n\r\nIn 1944, 23-year-old Tess DeMello abruptly ends her engagement to the love of her life when she marries a mysterious stranger and moves to Hickory, North Carolina, a small town struggling with racial tension and the hardships imposed by World War II. Tess&apos; new husband, Henry Kraft, is a secretive man who often stays out all night, hides money from his new wife, and shows no interest in making love. Tess quickly realizes she&apos;s trapped in a strange and loveless marriage with no way out.\r\n\r\nThe people of Hickory love and respect Henry and see Tess as an outsider, treating her with suspicion and disdain, especially after one of the town&apos;s prominent citizens dies in a terrible accident and Tess is blamed. Tess suspects people are talking about her, plotting behind her back, and following her as she walks around town. What does everyone know about Henry that she does not? Feeling alone and adrift, Tess turns to the one person who seems to understand her, a local medium who gives her hope but seems to know more than he&apos;s letting on.\r\n\r\nWhen a sudden polio epidemic strikes the town, the townspeople band together to build a polio hospital. Tess, who has a nursing degree, bucks Henry&apos;s wishes and begins to work at the hospital, finding meaning in nursing the young victims. Yet at home, Henry&apos;s actions grow more alarming by the day. As Tess works to save the lives of her patients, can she untangle her husband&apos;s mysterious behavior and save her own life?\r\n\r\nxx","last_updated":"2017-10-05T12:03:43.679Z","parsed":{"xt":"urn:btih:5519b5de81a54f87b7520154be61061b13e066d1","dn":"The Stolen Marriage_ A Novel by Diane Chamberlain ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5519b5de81a54f87b7520154be61061b13e066d1","infoHashBuffer":{"type":"Buffer","data":[85,25,181,222,129,165,79,135,183,82,1,84,190,97,6,27,19,224,102,209]},"name":"The Stolen Marriage_ A Novel by Diane Chamberlain ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}