{"title":"The Best of Times, The Worst of Times by Michael Burleigh EPUB","magnet":"magnet:?xt=urn:btih:55206526ac74014ba1c9e6d326a2c32292254167&dn=The+Best+of+Times%2C+The+Worst+of+Times+by+Michael+Burleigh+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3616345","seeders":"17","leechers":"14","description":"xx\r\n\r\nThe Best of Times, The Worst of Times by Michael Burleigh EPUB\r\n\r\nA gripping tour d&apos;horizon of the state of the world as it is in 2017 from an acclaimed historian.\r\n\r\nIn the decades since the end of World War II, it has been widely assumed that the western model of liberal democracy and free trade is the way the world should be governed. However, events in the early years of the 21st century&#x2014;first, the 2003 war with Iraq and its chaotic aftermath and, second, the financial crash of 2008&#x2014;have threatened the general acceptance that continued progress under the benign (or sometimes not-so-benign) gaze of the western powers is the only way forwards. And as America turns inwards and Europe is beset by austerity politics and populist nationalism, the post-war consensus looks less and less secure. But is this really the worst of times?\r\n\r\nIn a forensic examination of the world we now live in, acclaimed historian Michael Burleigh sets out to answer that question. Who could have imagined that China would champion globalization and lead the battle on climate change? Or that post-Soviet Russia might present a greater threat to the world&apos;s stability than ISIS? And while we may be on the cusp of still more dramatic change, perhaps the risks will&#x2014;in time&#x2014;bring not only change but a wholly positive transformation.\r\n\r\nIncisive, robust, and always insightful, The Best of Times, The Worst of Times is both a dazzling tour d&apos;horizon of the world as it is today and a surprisingly optimistic vision of the world as it might become.\r\n\r\nxx","last_updated":"2017-12-18T12:01:32.682Z","parsed":{"xt":"urn:btih:55206526ac74014ba1c9e6d326a2c32292254167","dn":"The Best of Times, The Worst of Times by Michael Burleigh EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"55206526ac74014ba1c9e6d326a2c32292254167","infoHashBuffer":{"type":"Buffer","data":[85,32,101,38,172,116,1,75,161,201,230,211,38,162,195,34,146,37,65,103]},"name":"The Best of Times, The Worst of Times by Michael Burleigh EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}