{"title":"The Old Ways_ A Journey on Foot by Robert Macfarlane EPUB","magnet":"magnet:?xt=urn:btih:55b88c31d6fbd6439452cbaeddf071a30f7a26ec&dn=The+Old+Ways_+A+Journey+on+Foot+by+Robert+Macfarlane+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11741107","seeders":"1","leechers":"5","description":"xx\r\n\r\nThe Old Ways_ A Journey on Foot by Robert Macfarlane EPUB\r\n\r\nFrom the acclaimed author of The Wild Places comes an engrossing exploration of walking and thinking.\r\n\r\nIn this exquisitely written book, Robert Macfarlane sets off from his Cambridge, England, home to follow the ancient tracks, holloways, drove roads, and sea paths that crisscross both the British landscape and its waters and territories beyond. The result is an immersive, enthralling exploration of the ghosts and voices that haunt old paths, of the stories our tracks keep and tell, and of pilgrimage and ritual.\r\n\r\nTold in Macfarlane&#x2019;s distinctive voice, The Old Ways folds together natural history, cartography, geology, archaeology, and literature. His walks take him from the chalk downs of England to the bird islands of the Scottish northwest, from Palestine to the sacred landscapes of Spain and the Himalayas. Along the way he crosses paths with walkers of many kinds - wanderers, pilgrims, guides, and artists. Above all this is a book about walking as a journey inward and the subtle ways we are shaped by the landscapes through which we move. Macfarlane discovers that paths offer not just a means of traversing space but of feeling, knowing, and thinking.\r\n\r\nRobert Macfarlane is the author of the prize-winning Mountains of the Mind and The Wild Places, both of which were New York Times Notable Books. He has contributed to Harper&#x2019;s, Granta, the Observer, Times Literary Supplement, and London Review of Books. He is a fellow of Emmanuel College, Cambridge.\r\n\r\nxx","last_updated":"2017-10-23T12:01:21.276Z","parsed":{"xt":"urn:btih:55b88c31d6fbd6439452cbaeddf071a30f7a26ec","dn":"The Old Ways_ A Journey on Foot by Robert Macfarlane EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"55b88c31d6fbd6439452cbaeddf071a30f7a26ec","infoHashBuffer":{"type":"Buffer","data":[85,184,140,49,214,251,214,67,148,82,203,174,221,240,113,163,15,122,38,236]},"name":"The Old Ways_ A Journey on Foot by Robert Macfarlane EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}