{"title":"David Wilcox-2 CD's (acoustic fingerpick guitar/vocals)","magnet":"magnet:?xt=urn:btih:568f72f54574f6628dc6286e1fa3465c81efbc2f&dn=David+Wilcox-2+CD%27s+%28acoustic+fingerpick+guitar%2Fvocals%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"htttx","categoryP":"audio","categoryS":"flac","size":"666898626","seeders":"12","leechers":"14","description":" First inspired to play guitar after hearing a fellow college student playing in a stairwell, Wilcox is now 18 records into a career marked by personal revelation and wildly loyal fans. His lyrical insight is matched by a smooth baritone voice, virtuosic guitar chops, and creative open tunings, giving him a range and tenderness rare in folk music. \r\n\r\nWilcox released an independent album in 1987, was a winner of the prestigious Kerrville Folk Festival New Folk award in 1988, and by 1989 he had signed with A&amp;M Records. His first release on the label, How Did You Find Me Here, sold over 100,000 copies the first year largely by word of mouth. \r\n\r\nConsidered a &apos;songwriter&apos;s songwriter&apos;, his songs have been covered by artists such as k.d. lang and many others.  In addition to his writing prowess, his skills as a performer and storyteller are unmatched.  He holds audiences rapt with nothing more than a single guitar, thoroughly written songs, a fearless ability to mine the depths of human emotions of joy, sorrow and everything in between, and all tempered by a quick and wry wit.[/i] \r\nAmazing writer by what I consider to be one of America&apos;s finest songwriters, and this song, which would probably be better titled &apos;My Old Addiction&apos;, is a tour de force. Wilcox&apos;s use of imagery and metaphor is powerful, emotionally wrenching, in describing the sad tragedy of jazz legend Chet Baker, who died in Amsterdam after falling out of a two-story window, probably after a drug overdose. It is rare to find excellent lyrics in any song today, and I think Wilcox sets the bar high for songwriters everywhere. The song was covered, incompetently, by K.D. Lang, who forgot a key syllable in her rendition of this song (but she chose the better title &apos;My Old Addiction&apos;). The slow pace of the song, the background trumpet playing, are perfect. Highly recommended!!!","last_updated":"2017-05-27T08:55:35.921Z","parsed":{"xt":"urn:btih:568f72f54574f6628dc6286e1fa3465c81efbc2f","dn":"David Wilcox-2 CD's (acoustic fingerpick guitar/vocals)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"568f72f54574f6628dc6286e1fa3465c81efbc2f","infoHashBuffer":{"type":"Buffer","data":[86,143,114,245,69,116,246,98,141,198,40,110,31,163,70,92,129,239,188,47]},"name":"David Wilcox-2 CD's (acoustic fingerpick guitar/vocals)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}