{"title":"The Internationalists_ How a Radical Plan to Outlaw War Remade t","magnet":"magnet:?xt=urn:btih:56a09153f85c0e7eb61f9b3fe8a34ab749f60dc5&dn=The+Internationalists_+How+a+Radical+Plan+to+Outlaw+War+Remade+t&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"67485343","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Internationalists_ How a Radical Plan to Outlaw War Remade the World by Oona A Hathaway and Scott J Shapiro ePUB eBOOK-ZAK\r\n\r\nA bold and provocative history of the men who fought to outlaw war and how an often overlooked treaty signed in 1928 was among the most transformative events in modern history.\r\n\r\nOn a hot summer afternoon in 1928, the leaders of the world assembled in Paris to outlaw war. Within the year, the treaty signed that day, known as the Peace Pact, had been ratified by nearly every state in the world. War, for the first time in history, had become illegal the world over. But the promise of that summer day was fleeting. Within a decade of its signing, each state that had gathered in Paris to renounce war was at war. And in the century that followed, the Peace Pact was dismissed as an act of folly and an unmistakable failure. This book argues that that understanding is inaccurate and that the Peace Pact ushered in a sustained march toward peace that lasts to this day.\r\n\r\nThe Internationalists tells the story of the Peace Pact by placing it in the long history of international law from the 17th century through the present, tracing this rich history through a fascinating and diverse array of lawyers, politicians, and intellectuals - Hugo Grotius, Nishi Amane, Salmon Levinson, James Shotwell, Sumner Welles, Carl Schmitt, Hersch Lauterpacht, and Sayyid Qutb. It tells of a centuries-long struggle of ideas over the role of war in a just world order. It details the brutal world of conflict the Peace Pact helped extinguish and the subsequent era where tariffs and sanctions take the place of tanks and gunships.\r\n\r\nThe Internationalists examines with renewed appreciation an international system that has outlawed wars of aggression and brought unprecedented stability to the world map. Accessible and gripping, this book will change the way we view the history of the 20th century - and how we must work together to protect the global order the internationalists fought to make possible.\r\n\r\nxx","last_updated":"2017-09-20T12:00:43.073Z","parsed":{"xt":"urn:btih:56a09153f85c0e7eb61f9b3fe8a34ab749f60dc5","dn":"The Internationalists_ How a Radical Plan to Outlaw War Remade t","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"56a09153f85c0e7eb61f9b3fe8a34ab749f60dc5","infoHashBuffer":{"type":"Buffer","data":[86,160,145,83,248,92,14,126,182,31,155,63,232,163,74,183,73,246,13,197]},"name":"The Internationalists_ How a Radical Plan to Outlaw War Remade t","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}