{"title":"Stephen Kinzer - The True Flag 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","magnet":"magnet:?xt=urn:btih:56afbe047cdd5c096bfdd51763ed0ec3909546ff&dn=Stephen+Kinzer+-+The+True+Flag+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6507625","seeders":"0","leechers":"0","description":"xx\r\n\r\nStephen Kinzer - The True Flag 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe best-selling author of Overthrow and The Brothers brings to life the forgotten political debate that set America&apos;s interventionist course in the world for the 20th century and beyond.\r\n\r\nHow should the United States act in the world? Americans cannot decide. Sometimes we burn with righteous anger, launching foreign wars and deposing governments. Then we retreat - until the cycle begins again.\r\n\r\nNo matter how often we debate this question, none of what we say is original. Every argument is a pale shadow of the first and greatest debate, which erupted more than a century ago. Its themes resurface every time Americans argue whether to intervene in a foreign country.\r\n\r\nRevealing a piece of forgotten history in The True Flag, Stephen Kinzer transports us to the dawn of the 20th century, when the United States first found itself with the chance to dominate faraway lands. That prospect thrilled some Americans. It horrified others. Their debate gripped the nation.\r\n\r\nThe country&apos;s best-known political and intellectual leaders took sides. Theodore Roosevelt, Henry Cabot Lodge, and William Randolph Hearst pushed for imperial expansion; Mark Twain, Booker T. Washington, and Andrew Carnegie preached restraint. Only once before - in the period when the United States was founded - have so many brilliant Americans so eloquently debated a question so fraught with meaning for all humanity.\r\n\r\nAll Americans, regardless of political perspective, can take inspiration from the titans who faced off in this epic confrontation. Their words are amazingly current. Every argument over America&apos;s role in the world grows from this one. It all starts here.\r\n\r\nxx","last_updated":"2017-07-05T12:00:14.766Z","parsed":{"xt":"urn:btih:56afbe047cdd5c096bfdd51763ed0ec3909546ff","dn":"Stephen Kinzer - The True Flag 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"56afbe047cdd5c096bfdd51763ed0ec3909546ff","infoHashBuffer":{"type":"Buffer","data":[86,175,190,4,124,221,92,9,107,253,213,23,99,237,14,195,144,149,70,255]},"name":"Stephen Kinzer - The True Flag 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}