{"title":"Assassination Generation by Dave Grossman 2016 RETAiL ePUB eBOOK","magnet":"magnet:?xt=urn:btih:56cafad513018650cde98a2502c60ecbcc3b09c0&dn=Assassination+Generation+by+Dave+Grossman+2016+RETAiL+ePUB+eBOOK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4497372","seeders":"0","leechers":"0","description":"xx\r\n\r\nAssassination Generation by Dave Grossman 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe author of the 400,000-copy best seller On Killing reveals how violent video games have ushered in a new era of mass homicide - and what we must do about it.\r\n\r\nPaducah, Kentucky, 1997: a 14-year-old boy shoots eight students in a prayer circle at his school. Littleton, Colorado, 1999: two high school seniors kill a teacher, 12 other students, and then themselves. Utoya, Norway, 2011: a political extremist shoots and kills 69 participants in a youth summer camp. Newtown, Connecticut, 2012: a troubled 20-year-old man kills 20 children and six adults at the elementary school he once attended.\r\n\r\nWhat links these and other horrific acts of mass murder? A young person&apos;s obsession with video games that teach to kill.\r\n\r\nLt. Col. Dave Grossman, who in his perennial best seller On Killing revealed that most of us are not &quot;natural born killers&quot; - and who has spent decades training soldiers, police, and others who keep us secure to overcome the intrinsic human resistance to harming others and to use firearms responsibly when necessary - turns a laser focus on the threat posed to our society by violent video games.\r\n\r\nDrawing on crime statistics, cutting-edge social research, and scientific studies of the teenage brain, Col. Grossman shows how video games that depict antisocial, misanthropic, casually savage behavior can warp the mind - with potentially deadly results. His book will become the focus of a new national conversation about video games and the epidemic of mass murders that they have unleashed.\r\n\r\nxx","last_updated":"2017-08-19T12:00:31.296Z","parsed":{"xt":"urn:btih:56cafad513018650cde98a2502c60ecbcc3b09c0","dn":"Assassination Generation by Dave Grossman 2016 RETAiL ePUB eBOOK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"56cafad513018650cde98a2502c60ecbcc3b09c0","infoHashBuffer":{"type":"Buffer","data":[86,202,250,213,19,1,134,80,205,233,138,37,2,198,14,203,204,59,9,192]},"name":"Assassination Generation by Dave Grossman 2016 RETAiL ePUB eBOOK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}