{"title":"Michael DAntonio - A Consequential President 2017 RETAiL ePUB eB","magnet":"magnet:?xt=urn:btih:57b6b953e265f56238db87249398994489064a42&dn=Michael+DAntonio+-+A+Consequential+President+2017+RETAiL+ePUB+eB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5470135","seeders":"18","leechers":"4","description":"Michael DAntonio - A Consequential President 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nOnce a most unlikely candidate, Barack Obama&apos;s successful campaign for the White House made him a worldwide sensation and a transformative figure even before he was inaugurated. Elected as the Iraq War and Great Recession discouraged millions of Americans, Obama&apos;s promise of hope revived the national spirit.\r\n\r\nHad he only saved the economy, Obama would be considered a truly successful president. However he has achieved so much more, against ferocious opposition, that he can be counted as one of the most consequential presidents in history. With health-care reform, he ended a crisis of escalating costs and inadequate access that threatened 50 million people. His energy policies drove down the cost of power generated by the sun, wind, and even fossil fuels. His climate change efforts produced the first treaty to address global warming in a meaningful way, and his diplomacy produced a dramatic reduction in the nuclear threat posed by Iran. Add the withdrawal of troops from Iraq, the normalization of relations with Cuba, and the &quot;pivot&quot; toward Asia, and his successes abroad match those at home.\r\n\r\nIn A Consequential President, Michael D&apos;Antonio tallies Obama&apos;s long record of achievement, both his major successes and less noticed ones that nevertheless contribute to his legacy. Obama&apos;s greatest achievement came as he restored dignity and ethics to the office of the president, proof that he delivered the hope and change he promised","last_updated":"2017-05-29T13:18:50.875Z","parsed":{"xt":"urn:btih:57b6b953e265f56238db87249398994489064a42","dn":"Michael DAntonio - A Consequential President 2017 RETAiL ePUB eB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"57b6b953e265f56238db87249398994489064a42","infoHashBuffer":{"type":"Buffer","data":[87,182,185,83,226,101,245,98,56,219,135,36,147,152,153,68,137,6,74,66]},"name":"Michael DAntonio - A Consequential President 2017 RETAiL ePUB eB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}