{"title":"Wesley Lowery - They Cant Kill Us All 2016 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:57eb0e6fed3f36fd8b25ae1d8d6c38c9cd452c74&dn=Wesley+Lowery+-+They+Cant+Kill+Us+All+2016+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4691433","seeders":"1","leechers":"1","description":"Wesley Lowery - They Cant Kill Us All 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA deeply reported book that brings alive the quest for justice in the deaths of Michael Brown, Tamir Rice, and Freddie Gray, offering both unparalleled insight into the reality of police violence in America and an intimate, moving portrait of those working to end it.\r\n\r\nConducting hundreds of interviews during the course of over one year reporting on the ground, Washington Post writer Wesley Lowery traveled from Ferguson, Missouri, to Cleveland, Ohio; Charleston, South Carolina; and Baltimore, Maryland; and then back to Ferguson to uncover life inside the most heavily policed, if otherwise neglected, corners of America today.\r\n\r\nIn an effort to grasp the magnitude of the response to Michael Brown&apos;s death and understand the scale of the problem police violence represents, Lowery speaks to Brown&apos;s family and the families of other victims as well as local activists. By posing the question &quot;what does the loss of any one life mean to the rest of the nation?&quot;, Lowery examines the cumulative effect of decades of racially biased policing in segregated neighborhoods with failing schools, crumbling infrastructure, and too few jobs.\r\n\r\nStudded with moments of joy and tragedy, They Can&apos;t Kill Us All offers a historically informed look at the standoff between the police and those they are sworn to protect, showing that civil unrest is just one tool of resistance in the broader struggle for justice. As Lowery brings vividly to life, the protests against police killings are also about the black community&apos;s long history of being on the receiving end of perceived and actual acts of injustice and discrimination. They Can&apos;t Kill Us All grapples with a persistent if also largely unexamined aspect of the otherwise transformative presidency of Barack Obama: the failure to deliver tangible security and opportunity to those Americans most in need of both","last_updated":"2017-06-10T12:00:54.246Z","parsed":{"xt":"urn:btih:57eb0e6fed3f36fd8b25ae1d8d6c38c9cd452c74","dn":"Wesley Lowery - They Cant Kill Us All 2016 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"57eb0e6fed3f36fd8b25ae1d8d6c38c9cd452c74","infoHashBuffer":{"type":"Buffer","data":[87,235,14,111,237,63,54,253,139,37,174,29,141,108,56,201,205,69,44,116]},"name":"Wesley Lowery - They Cant Kill Us All 2016 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}