{"title":"Chasing S p a c e  by Leland Melvin 2017 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:5846c16852b0c7c8a30125d41e51620b50aded54&dn=Chasing+S+p+a+c+e++by+Leland+Melvin+2017+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12584567","seeders":"0","leechers":"0","description":"xx\r\n\r\nChasing Space by Leland Melvin 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn this moving, inspirational memoir, a former NASA astronaut and NFL wide receiver shares his personal journey from the gridiron to the stars, examining the intersecting roles of community, perseverance, and grace that align to create the opportunities for success.\r\n\r\nLeland Melvin is the only person in human history to catch a pass in the National Football League and in space. Though his path from the gridiron to the heavens was riddled with setbacks and injury, Leland persevered to reach the stars.\r\n\r\nWhile training with NASA, Melvin suffered a severe injury that left him deaf. Leland was relegated to earthbound assignments but chose to remain and support his astronaut family. His loyalty paid off. Recovering partial hearing, he earned his eligibility for space travel. He served as mission specialist for two flights aboard the shuttle Atlantis, working on the International Space Station.\r\n\r\nIn this inspirational memoir, the former NASA astronaut and professional athlete offers an examination of the intersecting role of community, perseverance, and grace that align to shape our opportunities and outcomes. Chasing Space is not the story of one man but the story of many men, women, scientists, and mentors who helped him defy the odds and live out an uncommon destiny.\r\n\r\nAs a chemist, athlete, engineer, and space traveler, Leland&apos;s life story is a study in the science of achievement. His personal insights illuminate how grit and grace are the keys to overcoming adversity and rising to success.\r\n\r\nxx","last_updated":"2017-08-23T12:00:23.876Z","parsed":{"xt":"urn:btih:5846c16852b0c7c8a30125d41e51620b50aded54","dn":"Chasing S p a c e  by Leland Melvin 2017 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5846c16852b0c7c8a30125d41e51620b50aded54","infoHashBuffer":{"type":"Buffer","data":[88,70,193,104,82,176,199,200,163,1,37,212,30,81,98,11,80,173,237,84]},"name":"Chasing S p a c e  by Leland Melvin 2017 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}