{"title":"The Fortune Teller by Gwendolyn Womack ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:58bb16086e87e3b7f8c39168b13d93f4410e6e07&dn=The+Fortune+Teller+by+Gwendolyn+Womack+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"浏览 zakareya","categoryP":"其它","categoryS":"电子书","size":"3488105","seeders":"26","leechers":"6","description":"xx\r\n\r\nThe Fortune Teller by Gwendolyn Womack ePUB eBOOK-ZAK\r\n\r\nFrom the award-winning author of The Memory Painter comes a sweeping and suspenseful tale of fate and fortune.\r\n\r\nSemele Cavnow appraises antiquities for an exclusive Manhattan auction house, specializing in deciphering ancient texts. And when she discovers a manuscript written in the time of Cleopatra, she knows it will be the find of her career. Its author tells the story of a priceless tarot deck, now lost to history.\r\n\r\nBut as Semele delves further, she realizes the manuscript is more than it seems. Both a memoir and a prophecy, it appears to be the work of a powerful seer, describing devastating wars and natural disasters in detail thousands of years before they occurred. The more she reads, the more the manuscript begins to affect Semele&apos;s entire life. But what happened to the cards?\r\n\r\nAs the mystery of her connection to it deepens, Semele can&apos;t shake the feeling that she&apos;s being followed. Only one person can help her make sense of it all: her client, Theo Brossard. Yet Theo is arrogant and elusive, concealing secrets of his own, and there&apos;s more to Semele&apos;s desire to speak with him than she would like to admit. Can Semele even trust him?\r\n\r\nThe auction date is swiftly approaching, and someone wants to interfere - someone who knows the cards exist, and that the Brossard manuscript is tied to her. Semele realizes it&apos;s up to her to stop them: the manuscript holds the key to a 2000-year-old secret, a secret someone will do anything to possess.\r\n\r\nxx","last_updated":"2017-09-02T12:06:06.876Z","parsed":{"xt":"urn:btih:58bb16086e87e3b7f8c39168b13d93f4410e6e07","dn":"The Fortune Teller by Gwendolyn Womack ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"58bb16086e87e3b7f8c39168b13d93f4410e6e07","infoHashBuffer":{"type":"Buffer","data":[88,187,22,8,110,135,227,183,248,195,145,104,177,61,147,244,65,14,110,7]},"name":"The Fortune Teller by Gwendolyn Womack ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}