{"title":"Humility Is the New Smart_ Rethinking Human Excellence in the Sm","magnet":"magnet:?xt=urn:btih:5937111e6a2c2432e67e3d43030ac6a28ebd4e9e&dn=Humility+Is+the+New+Smart_+Rethinking+Human+Excellence+in+the+Sm&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5365388","seeders":"0","leechers":"0","description":"xx\r\n\r\nHumility Is the New Smart_ Rethinking Human Excellence in the Smart Machine Age by Edward D Hess and Katherine Ludwig ePUB eBOOK-ZAK\r\n\r\nIn nearly every industry, smart machines are replacing human labor. It&apos;s not just factory jobs - automated technologies are handling people&apos;s investments, diagnosing illnesses, and analyzing written documents. If we humans are going to endure, Edward Hess and Katherine Ludwig say we&apos;re going to need a dose of humility.\r\n\r\nWe need to be humble enough to let go of the idea that &quot;smart&quot; means knowing the most, using that information quickest, and making the fewest mistakes. Smart machines will always be better than we are at those things. Instead, we need to cultivate important abilities that smart machines don&apos;t have (yet): thinking critically, creatively, and innovatively, and building close relationships with others so we can collaborate effectively. Hess and Ludwig call this being NewSmart.\r\n\r\nTo develop these abilities, we need to practice four specific behaviors: keeping our egos out of our way, managing our thoughts and emotions to curb any biases or defensiveness, listening to others with an open mind, and connecting with others socially and emotionally. What all these behaviors have in common is, again, humility - avoiding self-centeredness so we can learn from and work with other humans. Hess and Ludwig offer a guide to developing these NewSmart abilities and to creating organizations where these qualities are encouraged and rewarded.\r\n\r\nxx","last_updated":"2017-08-17T12:03:13.218Z","parsed":{"xt":"urn:btih:5937111e6a2c2432e67e3d43030ac6a28ebd4e9e","dn":"Humility Is the New Smart_ Rethinking Human Excellence in the Sm","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5937111e6a2c2432e67e3d43030ac6a28ebd4e9e","infoHashBuffer":{"type":"Buffer","data":[89,55,17,30,106,44,36,50,230,126,61,67,3,10,198,162,142,189,78,158]},"name":"Humility Is the New Smart_ Rethinking Human Excellence in the Sm","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}