{"title":"Another Day in the Death of America by Gary Younge 2016 RETAiL e","magnet":"magnet:?xt=urn:btih:59d0424ab106b4787a297d8685ae84ca8a7efff9&dn=Another+Day+in+the+Death+of+America+by+Gary+Younge+2016+RETAiL+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3351931","seeders":"0","leechers":"0","description":"xx\r\n\r\nAnother Day in the Death of America by Gary Younge 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nOn an average day in America, seven young people aged 19 or under will be shot dead. In Another Day in the Death of America, award-winning Guardian journalist Gary Younge tells the stories of the lives lost during the course of a single day in the United States. It could have been any day, but Younge has chosen November 23, 2013. From Jaiden Dixon (age nine), shot point-blank by his mother&apos;s ex-boyfriend on his doorstep in Ohio, to Pedro Dado Cortez (age 16), shot by an enemy gang on a street corner in California, the narrative crisscrosses the country over a period of 24 hours to reveal the powerful human stories behind the statistics.\r\n\r\nFar from a dry account of gun policy in the United States or a polemic about the dangers of gun violence, the book is a gripping chronicle of an ordinary but deadly day in American life, and a series of character portraits of young people taken from us far too soon and those they left behind. Whether it&apos;s a father&apos;s unspeakable grief over his son who was at the wrong place at the wrong time, a mentor who tries to channel his rage by organizing, or a friend and neighbor who finds strength in faith, the lives lost on that day and the lives left behind become, in Younge&apos;s hands, impossible to ignore, or to forget. What emerges in these minutes is a searing portrait of youth, family, and the way that lives can be shattered in an instant on any day in America.\r\n\r\nAt a time when it has become indisputable that Americans need to rethink their position on guns, this moving narrative work puts a human face - a child&apos;s face - on the &quot;collateral damage&quot; of gun deaths across the country. In his journalism, Younge is committed to challenging conventional wisdom and looking twice where others might look away. There are some things, he argues, that we have come to see as normal, even when they are unacceptable. And gun violence is one of them. A clear-eyed and iconoclastic approach to this contentious issue, this book helps answer the questions so many of us are grappling with, and makes it even harder to just look away.\r\n\r\nxx","last_updated":"2017-08-31T12:00:38.649Z","parsed":{"xt":"urn:btih:59d0424ab106b4787a297d8685ae84ca8a7efff9","dn":"Another Day in the Death of America by Gary Younge 2016 RETAiL e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"59d0424ab106b4787a297d8685ae84ca8a7efff9","infoHashBuffer":{"type":"Buffer","data":[89,208,66,74,177,6,180,120,122,41,125,134,133,174,132,202,138,126,255,249]},"name":"Another Day in the Death of America by Gary Younge 2016 RETAiL e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}