{"title":"\nHow to Fall in Love with Anyone_ A Memoir in Essays by Mandy Len","magnet":"magnet:?xt=urn:btih:5a8c7f7a1e5f3e1f9e1b36e8c0987c7fc28921d8&dn=How+to+Fall+in+Love+with+Anyone_+A+Memoir+in+Essays+by+Mandy+Len&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4617798","seeders":"21","leechers":"6","description":"xx\r\n\r\nHow to Fall in Love with Anyone_ A Memoir in Essays by Mandy Len Catron ePUB eBOOK-ZAK\r\n\r\nAn insightful, charming, and absolutely fascinating memoir from the author of the popular New York Times essay &quot;To Fall in Love with Anyone, Do This&quot; (one of the top five most popular New York Times pieces of 2015) explores the romantic myths we create and explains how they limit our ability to achieve and sustain intimacy.\r\n\r\nWhat really makes love last? Does love ever work the way we say it does in movies and books andposts? Or does obsessing over those love stories hurt our real-life relationships? When her parents divorced after a 28-year marriage and her own 10-year relationship ended, those were the questions that Mandy Len Catron wanted to answer.\r\n\r\nIn a series of candid, vulnerable, and wise essays that takes a closer look at what it means to love someone and be loved and how we present our love to the world, Catron deconstructs her own personal canon of love stories. She delves all the way back to 1944, when her grandparents first met in a coal mining town in Appalachia, to her own dating life as a professor in Vancouver, drawing insights from her fascinating research into the universal psychology, biology, history, and literature of love. She uses biologists&apos; research into dopamine triggers to ask whether the need to love is an innate human drive. She uses literary theory to show why we prefer certain kinds of love stories. She urges us to question the unwritten scripts we follow in relationships and looks into where those scripts come from in the first place. And she tells the story of how she decided to test a psychology experiment that she&apos;d read about - where the goal was to create intimacy between strangers using a list of 36 questions - and ended up in the surreal situation of having millions of people following her brand-new relationship.\r\n\r\nIn How to Fall in Love with Anyone, Catron flips the script on love and offers a deeply personal and universal investigation.\r\n\r\nxx","last_updated":"2017-10-01T12:06:53.188Z","parsed":{"xt":"urn:btih:5a8c7f7a1e5f3e1f9e1b36e8c0987c7fc28921d8","dn":"How to Fall in Love with Anyone_ A Memoir in Essays by Mandy Len","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5a8c7f7a1e5f3e1f9e1b36e8c0987c7fc28921d8","infoHashBuffer":{"type":"Buffer","data":[90,140,127,122,30,95,62,31,158,27,54,232,192,152,124,127,194,137,33,216]},"name":"How to Fall in Love with Anyone_ A Memoir in Essays by Mandy Len","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}