{"title":"\nEscape from Freedom by Erich Fromm ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:5b09cdc89f7417684b4952a34a4cfcf068c5e573&dn=Escape+from+Freedom+by+Erich+Fromm+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2587571","seeders":"0","leechers":"0","description":"xx\r\n\r\nEscape from Freedom by Erich Fromm ePUB eBOOK-ZAK\r\n\r\nlf a man cannot stand freedom, he will probably turn fascist. This, in the fewest possible words, is the essential argument in this modem classic, Escape from Freedom. The author, Erich Fromm, is a distinguished psychologist, late of Berlin and Heidelberg, now of New York City.\r\n\r\nHe applies the psychoanalytical method to the illness of our civilization which expresses itself in an abject submission to dictatorship. It is true that the rise of democracy set men free and brought to an end the authority of the medieval state and the medieval church. But it brought into existence a society where a man feels isolated from his fellows, where relationships in an industrial age are impersonal, where insecurity replaces a sense of belonging.\r\n\r\nThis sense of isolation may drive an individual to one of various forms of escape. lt may drive a people to seek escape in blind devotion to a leader, in utter submission to an all-powerful state, into a barbarous and sadistic program of aggression against minority groups or neighbor nations.\r\n\r\nFew books since the rise of the dictators have thrown such light upon our times. Few books have penetrated so clearly into the causes of fascism and Nazism - and into the inherent qualities of a democracy. In his psychoanalysis of the social scene, the author makes a new contribution to psychology by modifying the basic concepts of Freud in placing a purely biological orientation by a cultural one.\r\n\r\nTo all who see that democracy today faces its gravest hour, Dr. Fromm illustrates the essential character of the danger and the nature of democracy&apos;s responsibility. By its brilliant exposition of the modern social scene Escape from Freedom will help clarify many of today&apos;s most perplexing problems.\r\n\r\nxx","last_updated":"2017-10-01T12:02:30.220Z","parsed":{"xt":"urn:btih:5b09cdc89f7417684b4952a34a4cfcf068c5e573","dn":"Escape from Freedom by Erich Fromm ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5b09cdc89f7417684b4952a34a4cfcf068c5e573","infoHashBuffer":{"type":"Buffer","data":[91,9,205,200,159,116,23,104,75,73,82,163,74,76,252,240,104,197,229,115]},"name":"Escape from Freedom by Erich Fromm ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}