{"title":"The Last Girl by Nadia Murad EPUB","magnet":"magnet:?xt=urn:btih:5b7458231eae396e2d818a1aa2299d80a3c3f419&dn=The+Last+Girl+by+Nadia+Murad+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6003911","seeders":"1","leechers":"1","description":"xx\r\n\r\nThe Last Girl by Nadia Murad EPUB\r\n\r\nIn this intimate memoir of survival, a former captive of the Islamic State tells her harrowing and ultimately inspiring story.\r\n\r\nNadia Murad was born and raised in Kocho, a small village of farmers and shepherds in Northern Iraq. A member of the Yazidi community, she and her brothers and sisters lived a quiet life. Nadia had dreams of becoming a history teacher or opening her own beauty salon.\r\n\r\nOn August 15, 2014, when Nadia was just 21 years old, this life ended. Islamic State militants massacred the people of her village, executing men who refused to convert to Islam and women too old to become sex slaves. Six of Nadia&apos;s brothers were killed, and her mother soon after, their bodies swept into mass graves. Nadia was taken to Mosul and forced, along with thousands of other Yazidi girls, into the IS slave trade.\r\n\r\nNadia would be held captive by several militants and repeatedly raped and beaten. Finally, she managed a narrow escape through the streets of Mosul, finding shelter in the home of a Sunni Muslim family whose eldest son risked his life to smuggle her to safety.\r\n\r\nToday, Nadia&apos;s story - as a witness to the Islamic State&apos;s brutality, a survivor of rape, a refugee, a Yazidi - has forced the world to pay attention to the ongoing genocide in Iraq. It is a call to action, a testament to the human will to survive, and a love letter to a lost country, a fragile community, and a family torn apart by war.\r\n\r\nxx","last_updated":"2017-12-03T12:00:53.113Z","parsed":{"xt":"urn:btih:5b7458231eae396e2d818a1aa2299d80a3c3f419","dn":"The Last Girl by Nadia Murad EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5b7458231eae396e2d818a1aa2299d80a3c3f419","infoHashBuffer":{"type":"Buffer","data":[91,116,88,35,30,174,57,110,45,129,138,26,162,41,157,128,163,195,244,25]},"name":"The Last Girl by Nadia Murad EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}