{"title":"You Can Do Anything_ The Surprising Power of a'Useless' Liberal ","magnet":"magnet:?xt=urn:btih:5b801b690a398a52ee1d06c18f7368ce9639ceb7&dn=You+Can+Do+Anything_+The+Surprising+Power+of+a%27Useless%27+Liberal+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4231701","seeders":"0","leechers":"0","description":"xx\r\n\r\nYou Can Do Anything_ The Surprising Power of a&apos;Useless&apos; Liberal Arts Education by George Anders ePUB eBOOK-ZAK\r\n\r\nIn a tech-dominated world, the most needed degrees are the most surprising: the liberal arts.\r\n\r\nDid you take the right classes in college? Will your major help you get the right job offers? For more than a decade, the national spotlight has focused on science and engineering as the only reliable choice for finding a successful postgrad career. Our destinies have been reduced to a caricature: learn to write computer code or end up behind a counter, pouring coffee. Quietly, though, a different path to success has been taking shape. In You Can Do Anything, George Anders explains the remarkable power of a liberal arts education - and the ways it can open the door to thousands of cutting-edge jobs every week.\r\n\r\nThe key insight: curiosity, creativity, and empathy aren&apos;t unruly traits that must be reined in. You can be yourself as an English major and thrive in sales. You can segue from anthropology into the booming new field of user research, from classics into management consulting, and from philosophy into high-stakes investing. At any stage of your career, you can bring a humanist&apos;s grace to our rapidly evolving high-tech future. And if you know how to attack the job market, your opportunities will be vast.\r\n\r\nIn this book you will learn why resume writing is fading in importance and why &quot;telling your story&quot; is taking its place. You will learn how to create jobs that don&apos;t exist yet and to translate your campus achievements into a new style of expression that will make employers&apos; eyes light up. You will discover why people who start in eccentric first jobs - and then make their own luck - so often race ahead of peers whose postcollege hunts focus only on security and starting pay. You will be ready for anything.\r\n\r\nxx","last_updated":"2017-09-03T12:00:18.322Z","parsed":{"xt":"urn:btih:5b801b690a398a52ee1d06c18f7368ce9639ceb7","dn":"You Can Do Anything_ The Surprising Power of a'Useless' Liberal ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5b801b690a398a52ee1d06c18f7368ce9639ceb7","infoHashBuffer":{"type":"Buffer","data":[91,128,27,105,10,57,138,82,238,29,6,193,143,115,104,206,150,57,206,183]},"name":"You Can Do Anything_ The Surprising Power of a'Useless' Liberal ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}