{"title":"Dead Cells v30.06.2017","magnet":"magnet:?xt=urn:btih:5ba035f7296acd47bc3a5f907ebf0cd4fd74a2e8&dn=Dead+Cells+v30.06.2017&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"402004332","seeders":"18","leechers":"5","description":"Features :RogueVania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.Souls-lite combat: Pattern-based bosses and minions, weapons and spells with unique gameplay. Make do with what you have and don&#x2019;t forget to roll.Nonlinear progression: Unlock new levels with every death and explore undiscovered parts of the castle as you prepare for the inevitable bosses.Exploration: Secret rooms, hidden passages, charming landscapes. Death is the new backtracking.Roguelike, Rogue-lite, roguelike-like, rogueschmike! No matter what you call them, the world could always use another! As such, we&apos;d like to present for your consideration, the illegitimate child of the roguelike and the metroidvania, the RogueVANIA. Anywho, enough with the sales pitch, let&#x2019;s take a closer look.By metroidVania, we&#x2019;re really talking about a fixed, hand designed, interconnected world. The game takes place on an immense island that never changes. All of the biomes, bosses and the paths between them are present right from the start. Getting to them is another story...However, in Dead Cells, death replaces the traditional backtracking mechanic of a metroidvania. At first, seemingly unreachable areas will be strewn across your path, but answers to these riddles will appear as you explore the island. Be it a key","last_updated":"2017-07-02T12:06:33.627Z","parsed":{"xt":"urn:btih:5ba035f7296acd47bc3a5f907ebf0cd4fd74a2e8","dn":"Dead Cells v30.06.2017","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5ba035f7296acd47bc3a5f907ebf0cd4fd74a2e8","infoHashBuffer":{"type":"Buffer","data":[91,160,53,247,41,106,205,71,188,58,95,144,126,191,12,212,253,116,162,232]},"name":"Dead Cells v30.06.2017","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}