{"title":"Need For Speed: Shift *2009* - V1 02 [+DLC] [MULTi10-ENG] [ISO] ","magnet":"magnet:?xt=urn:btih:5bb22ffe4fad74d7cad6781c6a93107d1235eba4&dn=Need+For+Speed%3A+Shift+%2A2009%2A+-+V1+02+%5B%2BDLC%5D+%5BMULTi10-ENG%5D+%5BISO%5D+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rfghos","categoryP":"games","categoryS":"pc","size":"3373748224","seeders":"2","leechers":"0","description":"Another installment in the Need for Speed racing game series. This time, the game brings an unexpected twist, for a typically arcade series turns towards realism. The new developer, by the name of Slightly Mad Studios, created new driving physics that focus on simulation rather than arcade gameplay. Similar to 2007&apos;s ProStreet, races take place on closed racing circuits. The player can participate in the entire season of races, taking place both on fictional and real circuits. The game offers a wide set of licensed cars, bringing the interior view back to the series. As a result, the experience is intensified and the realism is felt. The visuals were improved as usual, but apart from that, new collision and damages models were implemented and the AI algorithms were improved. Opponents behave more aggressively behind the wheel - they experiment with different methods of passing other drivers.\r\n\r\nNeed for Speed Shift for PC / Windows is the next installment in the famous racing series. It was developed by Slightly Mad Studios (GT Legends and GTR 2), Michael Mann (Black Box studio), and Patrick Soderlund (EA Games).\r\n\r\nThe creators of Shift decided to accurately reproduce the experience of driving extremely fast cars. They developed a very realistic driving model and a spectacular system of collision and destruction. At the same time, a special emphasis was put on balancing the game and providing players with satisfaction even if they prefer the arcade style of driving.\r\n\r\nIn this installment of the series Need for Speed, however, the driver is the most important with which we can identify thanks to the view from the inside of the car (with a realistic rendition of the cockpit and the camera attached to the helmet). Numerous shocks and cracking of the windshield are just some of the effects to experience. With the FPP camera, the feeling of speed becomes more authentic and easier to imagine.\r\n\r\nOn the way to victory on 18 tracks - both real (Willow Springs, Laguna Seca) and fictional - there are many opponents. The developers packed enemies with advanced AI algorithms so that they are more active in the fight for the top positions and much more determined when it comes to keeping their position. As a result of these","last_updated":"2017-12-20T12:04:02.484Z","parsed":{"xt":"urn:btih:5bb22ffe4fad74d7cad6781c6a93107d1235eba4","dn":"Need For Speed: Shift *2009* - V1 02 [ DLC] [MULTi10-ENG] [ISO] ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5bb22ffe4fad74d7cad6781c6a93107d1235eba4","infoHashBuffer":{"type":"Buffer","data":[91,178,47,254,79,173,116,215,202,214,120,28,106,147,16,125,18,53,235,164]},"name":"Need For Speed: Shift *2009* - V1 02 [ DLC] [MULTi10-ENG] [ISO] ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}