{"title":"The Fellowship of the Talisman by Clifford Simak EPUB","magnet":"magnet:?xt=urn:btih:5bed66622ff956825dd38e8b0b0f4bbaefa12a95&dn=The+Fellowship+of+the+Talisman+by+Clifford+Simak+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"597254","seeders":"59","leechers":"4","description":"xx\r\n\r\nThe Fellowship of the Talisman by Clifford Simak EPUB\r\n\r\nA strange assortment of humans and otherworldly beings joins a young soldier of God on his perilous quest through an alternate, technology-free reality ruled by an all-powerful Evil.\r\n\r\nIn an alternate world where the Dark Ages never ended, &quot;the Evil&quot; that arises every 500 years has prevented all manner of technological advancement, even well into the 20th century.\r\n\r\nThe son of a powerful English noble, young Duncan Standish has always longed to be a soldier of the Lord, and now he&apos;s been offered a rare opportunity to fulfill his dream. Entrusted with the delivery of an ancient manuscript - purported to be irrefutable evidence of the existence of Jesus Christ - to a noted Oxenford scholar, Duncan must journey many perilous miles in the company of a motley group of fellow travelers, including a goblin, aand other magical and nonmagical companions. But the road they traverse together is fraught with terrible trials that would test even the most devout, for the Evil is strong in this place of dark wonders.\r\n\r\nMultiple Hugo, Nebula, and Locus Award winner and SFWA Grand Master Clifford D. Simak moves easily from science fiction to quest fantasy in this enthralling tale of magic, peril, and discovery on an Earth that never was. Rich in color, thrills, and wild invention, and populated by a highly original and unforgettable cast of characters, Fellowship of the Talisman showcases the author&apos;s peerless storytelling skills, demonstrating once again that the great Simak had few equals in the realm of 20th-century speculative fiction.\r\n\r\nxx","last_updated":"2017-12-25T12:05:57.666Z","parsed":{"xt":"urn:btih:5bed66622ff956825dd38e8b0b0f4bbaefa12a95","dn":"The Fellowship of the Talisman by Clifford Simak EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5bed66622ff956825dd38e8b0b0f4bbaefa12a95","infoHashBuffer":{"type":"Buffer","data":[91,237,102,98,47,249,86,130,93,211,142,139,11,15,75,186,239,161,42,149]},"name":"The Fellowship of the Talisman by Clifford Simak EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}