{"title":"Woolly: Quest to Revive One of History's Most Iconic Creatures","magnet":"magnet:?xt=urn:btih:5c3cd504dad4e04917100b030f3c4f79e043d540&dn=Woolly%3A+Quest+to+Revive+One+of+History%27s+Most+Iconic+Creatures&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4640427","seeders":"63","leechers":"7","description":"Woolly: The True Story of the Quest to Revive One of History&#x2019;s Most Iconic Extinct Creatures - Ben Mezrich [epub]\r\n\r\n&#x201C;With his knack for turning narrative nonfiction into stories worthy of the best thriller fiction&#x201D; (Omnivoracious), Ben Mezrich takes us on an exhilarating true adventure story from the icy terrain of Siberia to the cutting-edge genetic labs of Harvard University. A group of young scientists, under the guidance of Dr. George Church, the most brilliant geneticist of our time, works to make fantasy reality by sequencing the DNA of a frozen woolly mammoth harvested from above the Arctic circle, and splicing elements of that sequence into the DNA of a modern elephant. Will they be able to turn the hybrid cells into a functional embryo and bring the extinct creatures to life in our modern world?\r\n\r\nAlong with Church and his team of Harvard scientists, a world-famous conservationist and a genius Russian scientist plan to turn a tract of the Siberian tundra into Pleistocene Park, populating the permafrost with ancient herbivores as a hedge against an environmental ticking time bomb. More than a story of genetics, this is a thriller illuminating the race against global warming, the incredible power of modern technology, the brave fossil hunters who battle polar bears and extreme weather conditions, and the ethical quandary of cloning extinct animals. Can we right the wrongs of our ancestors who hunted the woolly mammoth to extinction&#x2014;and at what cost?\r\n\r\nBen Mezrich graduated magna cum laude from Harvard. He has published eighteen books, including the New York Times bestsellers The Accidental Billionaires, which was adapted into the Academy Award&#x2013;winning film The Social Network, and Bringing Down the House, which has sold more than 1.5 million copies in twelve languages and was the basis for the hit movie 21, and most recently the national bestseller Once Upon a Time in Russia.\r\n\r\nHardcover: 304 pages\r\nPublisher: Atria Books (July 4, 2017)","last_updated":"2017-09-03T12:01:58.371Z","parsed":{"xt":"urn:btih:5c3cd504dad4e04917100b030f3c4f79e043d540","dn":"Woolly: Quest to Revive One of History's Most Iconic Creatures","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c3cd504dad4e04917100b030f3c4f79e043d540","infoHashBuffer":{"type":"Buffer","data":[92,60,213,4,218,212,224,73,23,16,11,3,15,60,79,121,224,67,213,64]},"name":"Woolly: Quest to Revive One of History's Most Iconic Creatures","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}