{"title":"The Poverty Industry: The Exploitation of America's Most Vulnera","magnet":"magnet:?xt=urn:btih:5c5cfd6c8adb5ff270fefc533b840abea87b3965&dn=The+Poverty+Industry%3A+The+Exploitation+of+America%27s+Most+Vulnera&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roxanne278","categoryP":"other","categoryS":"e_books","size":"22605304","seeders":"2","leechers":"1","description":"The Poverty Industry: The Exploitation of America&apos;s Most Vulnerable Citizens/Daniel L. Hatcher/2016/PDF/ \r\n\r\nEnglish|Non-Fiction|ASIN: B0171WAF5Y|288pg|21.5MB|NYU Press\r\n\r\nGovernment aid doesn&#x2019;t always go where it&#x2019;s supposed to. Foster care agencies team up with companies to take disability and survivor benefits from abused and neglected children.\r\n\r\n States and their revenue consultants use illusory schemes to siphon Medicaid funds intended for children and the poor into general state coffers. Child support payments for foster children and families on public assistance are converted into government revenue.\r\n\r\n And the poverty industry keeps expanding, leaving us with nursing homes and juvenile detention centers that sedate residents to reduce costs and maximize profit, local governments buying nursing homes to take the facilities&#x2019; federal aid while the elderly languish with poor care, and counties hiring companies to mine the poor for additional funds in modern day debtor&#x2019;s prisons.\r\n \r\nIn The Poverty Industry, Daniel L. Hatcher shows us how state governments and their private industry partners are profiting from the social safety net, turning America&#x2019;s most vulnerable populations into sources of revenue.\r\n\r\n The poverty industry is stealing billions in federal aid and other funds from impoverished families, abused and neglected children, and the disabled and elderly poor. \r\n\r\nIn the face of these abuses of power, Hatcher offers a road map for reforms to realign the practices of human service agencies with their intended purpose, to prevent the misuse of public taxpayer dollars, and to ensure that government aid truly gets to those in need.  \r\n\r\nDaniel L. Hatcher is Professor of Law at the University of Baltimore","last_updated":"2017-09-15T12:01:13.754Z","parsed":{"xt":"urn:btih:5c5cfd6c8adb5ff270fefc533b840abea87b3965","dn":"The Poverty Industry: The Exploitation of America's Most Vulnera","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c5cfd6c8adb5ff270fefc533b840abea87b3965","infoHashBuffer":{"type":"Buffer","data":[92,92,253,108,138,219,95,242,112,254,252,83,59,132,10,190,168,123,57,101]},"name":"The Poverty Industry: The Exploitation of America's Most Vulnera","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}