{"title":"Life in Year One_ What the World Was Like in First Century Pales","magnet":"magnet:?xt=urn:btih:5c7e95664f37ff17716c746ee5add2e20d80c894&dn=Life+in+Year+One_+What+the+World+Was+Like+in+First+Century+Pales&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2651401","seeders":"41","leechers":"4","description":"xx\r\n\r\nLife in Year One_ What the World Was Like in First Century Palestine by Scott Korb ePUB eBOOK-ZAK\r\n\r\nWhat was it like to live during the time of Jesus? Where did people live? Who did they marry? What was family life like? And how did people survive? These are just some of the questions that Scott Korb answers in this engaging new book, which explores what everyday life entailed 2,000 years ago in first-century Palestine, that tumultuous era when the Roman Empire was at its zenith and a new religion - Christianity - was born.\r\n\r\nCulling information from primary sources, scholarly research, and his own travels and observations, Korb explores the nitty-gritty of real life back then - from how people fed, housed, and groomed themselves to how they kept themselves healthy. He guides the contemporary reader through the maze of customs and traditions that dictated life under the numerous groups, tribes, and peoples in the eastern Mediterranean that Rome governed two thousand years ago, and he illuminates the intriguing details of marriage, family life, health, and a host of other aspects of first-century life.\r\n\r\nThe result is a book for everyone, from the armchair traveler to the amateur historian. With surprising revelations about politics and medicine, crime and personal hygiene, this book is smart and accessible popular history at its very best.\r\n\r\nxx","last_updated":"2017-08-30T12:03:13.243Z","parsed":{"xt":"urn:btih:5c7e95664f37ff17716c746ee5add2e20d80c894","dn":"Life in Year One_ What the World Was Like in First Century Pales","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c7e95664f37ff17716c746ee5add2e20d80c894","infoHashBuffer":{"type":"Buffer","data":[92,126,149,102,79,55,255,23,113,108,116,110,229,173,210,226,13,128,200,148]},"name":"Life in Year One_ What the World Was Like in First Century Pales","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}