{"title":"Twin Ambitions_ My Autobiography by Mo Farah ePUB MOBI eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:5c967ae2a733080e10b493fce03d2627a80c2fef&dn=Twin+Ambitions_+My+Autobiography+by+Mo+Farah+ePUB+MOBI+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11788293","seeders":"7","leechers":"4","description":"xx\r\n\r\nTwin Ambitions_ My Autobiography by Mo Farah ePUB MOBI eBOOK-ZAK\r\n\r\n4 August, 2012. Super Saturday. On the most electric night in the history of British sport, Mo Farah braved the pain and punishment to seize Olympic gold in the 10,000m - and in the process went from being a talented athlete to a national treasure. Seven days later, Mo seized his second gold at the 5000m to go where no British distance runner has gone before.\r\n\r\nRecords have tumbled before him: European track records at 1500m, 5000m indoors, and 10,000m; British track records at 5000m, 3000m indoors and 10k on the road have all fallen to Mohamed &apos;Mo&apos; Farah: the boy from Somalia who came to Britain at the age of eight, leaving behind his twin brother, and with just a few words of English, and a natural talent for running. His secondary school PE teacher Alan Watkinson spotted his potential and began easing this human gazelle towards the racetrack.\r\n\r\nIn 2001 Mo showed his promise by winning the 5000m at the European Junior Championships. Soon he was smashing a string of British and European records. He began living with a group of elite Kenyan runners, following their strict regime of run, sleep, eat and rest. Mo was determined to leave no stone uncovered in his bid for distance-running glory.\r\n\r\nAfter a disappointing Olympics in Beijing Mo took the bold decision to relocate to Portland, Oregon to work under legendary coach Alberto Salazar. The results were emphatic as Mo took silver at the 10,000m and then raced to gold in the 5000m at the 2011 World Championships in Daegu. Even better would soon follow at London 2012.\r\n\r\nTwin Ambitions is much more than an autobiography by a great Olympic champion. It&apos;s a moving human story of a man who grew up in difficult circumstances, separated from his family at an early age, who struggled to overcome seemingly insurmountable obstacles and realise his dream.\r\n\r\nxx","last_updated":"2017-08-29T12:05:12.770Z","parsed":{"xt":"urn:btih:5c967ae2a733080e10b493fce03d2627a80c2fef","dn":"Twin Ambitions_ My Autobiography by Mo Farah ePUB MOBI eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5c967ae2a733080e10b493fce03d2627a80c2fef","infoHashBuffer":{"type":"Buffer","data":[92,150,122,226,167,51,8,14,16,180,147,252,224,61,38,39,168,12,47,239]},"name":"Twin Ambitions_ My Autobiography by Mo Farah ePUB MOBI eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}