{"title":"\nUniversal Harvester_ A Novel by John Darnielle ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:5d9830118871dc309e56d53c66686f9c4f29b836&dn=Universal+Harvester_+A+Novel+by+John+Darnielle+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2891030","seeders":"0","leechers":"0","description":"xx\r\n\r\nUniversal Harvester_ A Novel by John Darnielle ePUB eBOOK-ZAK\r\n\r\nJeremy works at the Video Hut in Nevada, Iowa. It&apos;s a small town in the center of the state - the first a in Nevada pronounced ay. This is the late 1990s, and even if the Hollywood Video in Ames poses an existential threat to Video Hut, there are still regular customers, a rush in the late afternoon. It&apos;s good enough for Jeremy: It&apos;s a job, quiet and predictable, and it gets him out of the house, where he lives with his dad and where they both try to avoid missing Mom, who died six years ago in a car wreck.\r\n\r\nBut when a local schoolteacher comes in to return her copy of Targets - an old movie, starring Boris Karloff, one Jeremy himself had ordered for the store - she has an odd complaint: &quot;There&apos;s something on it,&quot; she says, but doesn&apos;t elaborate. Two days later a different customer returns a different tape, a new release, and says it&apos;s not defective, exactly, but altered: &quot;There&apos;s another movie on this tape.&quot;\r\n\r\nJeremy doesn&apos;t want to be curious, but he brings the movies home to take a look. And indeed, in the middle of each movie, the screen blinks dark for a moment, and the movie is replaced by a few minutes of jagged, poorly lit home video. The scenes are odd and sometimes violent, dark, and deeply disquieting. There are no identifiable faces, no dialogue or explanation - the first video has just the faint sound of someone breathing - but there are some recognizable landmarks. These have been shot just outside of town.\r\n\r\nSo begins John Darnielle&apos;s haunting and masterfully unsettling Universal Harvester: the once placid Iowa fields and farmhouses now sinister and imbued with loss and instability and profound foreboding. The book will take Jeremy and those around him deeper into this landscape than they have ever expected to go. They will become part of a story that unfolds years into the past and years into the future, part of an impossible search for something someone once lost that they would do anything to regain.\r\n\r\nxx","last_updated":"2017-10-05T12:01:10.950Z","parsed":{"xt":"urn:btih:5d9830118871dc309e56d53c66686f9c4f29b836","dn":"Universal Harvester_ A Novel by John Darnielle ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5d9830118871dc309e56d53c66686f9c4f29b836","infoHashBuffer":{"type":"Buffer","data":[93,152,48,17,136,113,220,48,158,86,213,60,102,104,111,156,79,41,184,54]},"name":"Universal Harvester_ A Novel by John Darnielle ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}