{"title":"Autumn of the Black Snake: The Creation of the U.S. Army and...","magnet":"magnet:?xt=urn:btih:5dbf4efd68e8c2bd20574c3235fb31bc2c7da763&dn=Autumn+of+the+Black+Snake%3A+The+Creation+of+the+U.S.+Army+and...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"beau42m","categoryP":"other","categoryS":"e_books","size":"26900229","seeders":"59","leechers":"7","description":"Autumn of the Black Snake: The Creation of the US Army and the Invasion That Opened the West - William Hogeland [epub]\r\n\r\nWhen the Revolutionary War ended in 1783, the newly independent United States savored its victory and hoped for a great future. And yet the republic soon found itself losing an escalating military conflict on its borderlands. In 1791, years of skirmishes, raids, and quagmire climaxed in the grisly defeat of American militiamen by a brilliantly organized confederation of Shawnee, Miami, and Delaware Indians. With nearly one thousand U.S. casualties, this was the worst defeat the nation would ever suffer at native hands. Americans were shocked, perhaps none more so than their commander in chief, George Washington, who saw in the debacle an urgent lesson: the United States needed an army.\r\n\r\nAutumn of the Black Snake tells the overlooked story of how Washington achieved his aim. In evocative and absorbing prose, William Hogeland conjures up the woodland battles and the hardball politics that formed the Legion of the United States, our first true standing army. His memorable portraits of leaders on both sides &#x2015; from the daring war chiefs Blue Jacket and Little Turtle to the doomed commander Richard Butler and a steely, even ruthless Washington &#x2015; drive a tale of horrific violence, brilliant strategizing, stupendous blunders, and valorous deeds.\r\n\r\nThis sweeping account, at once exciting and dark, builds to a crescendo as Washington and Alexander Hamilton, at enormous risk, outmaneuver Thomas Jefferson, James Madison, and other skeptics of standing armies &#x2015; and Washington appoints the seemingly disreputable Anthony Wayne, known as Mad Anthony, to lead the legion. Wayne marches into the forests of the Old Northwest, where the very Indians he is charged with defeating will bestow on him, with grudging admiration, a new name: the Black Snake.\r\n\r\nAutumn of the Black Snake is a dramatic work of military and political history, told in a colorful, sometimes startling blow-by-blow narrative. It is also an original interpretation of how greed, honor, political beliefs, and vivid personalities converged on the killing fields of the Ohio valley, where the United States Army would win its first victory, and in so doing destroy the coalition of Indians who came closer than any, before or since, to halting the nation&#x2019;s westward expansion","last_updated":"2017-05-24T11:47:27.283Z","parsed":{"xt":"urn:btih:5dbf4efd68e8c2bd20574c3235fb31bc2c7da763","dn":"Autumn of the Black Snake: The Creation of the U.S. Army and...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5dbf4efd68e8c2bd20574c3235fb31bc2c7da763","infoHashBuffer":{"type":"Buffer","data":[93,191,78,253,104,232,194,189,32,87,76,50,53,251,49,188,44,125,167,99]},"name":"Autumn of the Black Snake: The Creation of the U.S. Army and...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}