{"title":"We're Going to Need More Wine by Gabrielle Union EPUB","magnet":"magnet:?xt=urn:btih:5e91f6875c2bd20df52e53e7e97d5dabd1222791&dn=We%27re+Going+to+Need+More+Wine+by+Gabrielle+Union+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"652323","seeders":"0","leechers":"0","description":"xx\r\n\r\nWe&apos;re Going to Need More Wine by Gabrielle Union EPUB\r\n\r\nIn the spirit of Amy Poehler&apos;s Yes Please, Lena Dunham&apos;s Not That Kind of Girl, and Roxane Gay&apos;s Bad Feminist, a powerful collection of essays about gender, sexuality, race, beauty, Hollywood, and what it means to be a modern woman.\r\n\r\nOne month before the release of the highly anticipated film The Birth of a Nation, actress Gabrielle Union shook the world with a vulnerable and impassioned editorial in which she urged our society to have compassion for victims of sexual violence. In the wake of rape allegations made against director and actor Nate Parker, Union - a 44-year-old actress who launched her career with roles in iconic &apos;90s movies - instantly became the insightful, outspoken actress that Hollywood has been desperately awaiting. With honesty and heartbreaking wisdom, she revealed her own trauma as a victim of sexual assault: &quot;It is for you that I am speaking. This is real. We are real.&quot;\r\n\r\nIn this moving collection of thought-provoking essays infused with her unique wisdom and deep humor, Union uses that same fearlessness to tell astonishingly personal and true stories about power, color, gender, feminism, and fame. Union tackles a range of experiences, including bullying, beauty standards and competition between women in Hollywood, growing up in white California suburbia and then spending summers with her black relatives in Nebraska, coping with crushes, puberty, and the divorce of her parents. Genuine and perceptive, Union bravely lays herself bare, uncovering a complex and courageous life of self-doubt and self-discovery with incredible poise and brutal honesty. Throughout, she compels us to be ethical and empathetic and reminds us of the importance of confidence, self-awareness, and the power of sharing truth, laughter, and support.\r\n\r\nxx","last_updated":"2017-10-25T12:00:44.298Z","parsed":{"xt":"urn:btih:5e91f6875c2bd20df52e53e7e97d5dabd1222791","dn":"We're Going to Need More Wine by Gabrielle Union EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5e91f6875c2bd20df52e53e7e97d5dabd1222791","infoHashBuffer":{"type":"Buffer","data":[94,145,246,135,92,43,210,13,245,46,83,231,233,125,93,171,209,34,39,145]},"name":"We're Going to Need More Wine by Gabrielle Union EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}