{"title":"BadMilfs - Lexi Lovell, Nina Elle (A Mother Daughter Arrangement","magnet":"magnet:?xt=urn:btih:5ed1ab1d88f85c2ecdde20f2164d42db496e1af4&dn=BadMilfs+-+Lexi+Lovell%2C+Nina+Elle+%28A+Mother+Daughter+Arrangement&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"636398103","seeders":"31","leechers":"25","description":"The hot mommy Nina Elle had just gotten home from a tiring day at work. The house was empty, so she decided to play with her mature pussy for a bit. It was well deserved and well needed. Just as she started to get wet, she heard a noise from her daughter Lexi Lovell&#x2019;s room. She went to go investigate and found her sucking a boys cock! It was quite hot so before busting them Nina made sure to get off a little more first. Lexi was bummed after getting caught, and hoped with all her heart Nina would not tell her father. The next day, Nina ran into the boy Lexi was sucking in the restroom. She stopped him in his tracks and demanded he whip out his cock. She wanted to see if it was as big as she had thought. Sure enough it was even larger, so Nina decided to suck it and fuck it right then and there! Lexi wondered where her boy was, and went to go find him. Mom sneakily poked her head out the door and explained she had no idea where he was. The next day, Lexi&#x2019;s boy could not bare to keep this a secret. As he was explaining what happened with her mom, Lexi seemed unphased. She then spoke of the arrangement that her and her mother have. Any boy that gets to fuck Lexi, Nina also get to fuck! Once this was known, both girls ravaged that cock of his and made sure to share his cum equally and respectfully. Now that&#x2019;s what we call mother daughter relationship goals!\r\nTags: 2 Girl BJ, Big Dick, Big Tits, Blonde, Blowjob, Brunette, Deepthroat, Doggystyle, Long Hair, Milf, Straight, Teen, Threesome, Titty Fuck\r\n <a href=\"\nhttp://img.imgdone.com/image/d0Pr3\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/d0Pr3</a>\r\n <a href=\"\nhttp://img.imgdone.com/image/d0umN\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/d0umN</a>","last_updated":"2017-07-25T12:03:21.053Z","parsed":{"xt":"urn:btih:5ed1ab1d88f85c2ecdde20f2164d42db496e1af4","dn":"BadMilfs - Lexi Lovell, Nina Elle (A Mother Daughter Arrangement","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5ed1ab1d88f85c2ecdde20f2164d42db496e1af4","infoHashBuffer":{"type":"Buffer","data":[94,209,171,29,136,248,92,46,205,222,32,242,22,77,66,219,73,110,26,244]},"name":"BadMilfs - Lexi Lovell, Nina Elle (A Mother Daughter Arrangement","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}