{"title":"DJSoft RadioBOSS Advanced v5.6.0.5","magnet":"magnet:?xt=urn:btih:5f086da854c92ab06af37cc0c5ec452ad7b6f5a7&dn=DJSoft+RadioBOSS+Advanced+v5.6.0.5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"35307157","seeders":"10","leechers":"1","description":"DJSoft RadioBOSS Advanced v5.6.0.5\n\nWhat&apos;s new:\nAutomatic Teaser: allows you to create teasers using track &quot;hook points&quot; (set manually or automatic) with custom start/transition/end jingles\nCustom tag fields: allows to define up to 5 custom fields that can be used in Music Library, Track Tool, and Report Generator\nVoiceovers: mark voiceover location in Track Tool and voiceover will be inserted; random voiceover selection from folder, configurable probability\nTrack List improved &quot;In order&quot; selection when source folder was modified: now track selection follows the order based on previously selected track\nAdditional info storage location: database can be used instead of saving information in tags (prevents music files modification)\n&quot;Trigger Mix At&quot; can be used for custom file types as well\n&quot;Turn off after Next track&quot; option for &quot;Repeat track&quot; option (right-click menu on Repeat Track button)\nGrid in playlist - can be turned on in settings\nAdded Date column to the log\nUse default audio device option instead of selecting a specific device\nUser account management: block direct access to .exe files in the installation folder\nSearch: improved sorting - sort field sunchronizes with search field\nPlayed track history in Last Played hint and API to retrieve last played tracks\n\nScheduler\nNew commands to disable and enable event groups: enablegroup, disablegroup\nCommand to stop all overlay playback events: stopoverlays\nEdit Action button to edit event action: allows convenient way to edit some special items like network streams, Track Lists etc.\nFade in and fade out for overlay events\nImproved event list sorting, live sorting updates when sorted by &quot;Run In&quot;\n\nMusic Library\nScan tracks: set mix points based on level\nImproved bulk tag edit: added progress window with percentage and Cancel button\n\nPlaylist Generator\nCalculations in playlist generator priority rules (ex. &quot;Current-1&quot; for previous year)\nImproved repeat protection rules UI: predefined intervals (1 hour, 4 hours, 1 day etc.)\nImproved repeat protection rules UI for category\nOption added: filter non-playable tracks\n\nAds Scheduler\n&quot;Create event to update ads&quot; option to automatically update ads\n&quot;Shuffle playlist&quot; option for created events\n\nReport Generator\nAdded new field: total playback time\n\nFixes and minor improvements\nAdded hot key (Ins) to add tracks from file explorer\nCtrl+Tab hot key to switch between playlist tabs\nConfig file options: nowplaying text when nothing is playing; playlist titles for special items (Track List, announcements etc)\nStream archive: sometimes the microphone recording was distorted\nPlaylist stats calculation sometimes never finished\nAPEv2 tag is not saved for FLAC files (uses alternative data stream instead)\nCrash when playing some corrupted APE or FLAC tracks\nTrack Tool - preview playback volume level was not saved\n&quot;getfile&quot; command reworked to allow more reliable track selection and deletion\nSometimes the incorrect track was selected in the playlist after stop command was executed\nAccessibility issue with &quot;Multuple actions&quot; window in event properties\nMenu button did not work in scheuduler list\n&quot;clr repeat_track&quot; command did not work in the playlist\nstreamarchive FN command did not change stream archive button state\nPlaylist Generator: &quot;advanced position&quot; sometimes did not work correctly\n&quot;Prevent multiple instances&quot; option removed, now it&apos;s always on\nadsupdate command did not work when Ads Scheduler was open\nEmpty file type identifiers are not allowed\nID2v2 tag version is preserved when tag is edited (previous versions always converted to ID3v2.4)\nError message in the log when inline playlist can&apos;t be opened\nFixed &quot;now playing&quot; for network streams when stream deleted from the playlist\nTrack List: playlist title was sometimes incorrect\nPeriodic metadata updates were not sent when nothing was playing\nMany other minor improvements\n\nTraditional professional radio programming applications are designed for traditional radio stations that can and expect to pay thousands of dollars for extremely sophisticated and complex software. But what if that&apos;s not you?\n\nIf you need a simple, affordable, reliable solution to automating your broadcasting needs, RadioBOSS radio automation software is the solution you&apos;ve been looking for.\n\nWhether it&apos;s building and scheduling crossfaded programming for your terrestrial or Internet radio station, creating the right audio atmosphere in your restaurant or store, or broadcasting from live events, RadioBOSS has been the choice of thousands of broadcasters just like you for the past eleven years.\n\nRadioBOSS makes it easy and fast to convert and manage audio assets, build playlists with advertising support, hourly blocks, rotations, crossfading, automatic leveling and other professional-level features and play your playlists to your local, terrestrial or Internet broadcasting system.\n\nBenefits:\nProduce professional, sophisticated audio programming for a fraction of the cost of other radio programming applications. Robust support for Internet broadcasters. Built-in support for Internet streaming (Shoutcast v1, v2, Icecast, Windows Media Services), automatically sending metadata (upload to FTP, HTTP request, text or XML file) and using streamed Internet audio in playlists.\nWork the way you want. RadioBOSS lets you grab, use and work with your preferred audio formats, Winamp and VST plugins, multichannel cards (4.0, 5.1, 7.1 etc), individualized RadioBOSS profiles.\nCreate sophisticated professional playlists with crossfade support, automatic volume leveling, timed announcements, block rotations, advertising volume enhancement and more.\nRadioBOSS&apos;s eleven years of continuous improvement and enhancement means you can trust RadioBOSS to play unattended for days, weeks and months.\n      \nOfficial Website: https://www.djsoft.net/enu/description_radioboss.htm","last_updated":"2017-06-12T12:07:13.302Z","parsed":{"xt":"urn:btih:5f086da854c92ab06af37cc0c5ec452ad7b6f5a7","dn":"DJSoft RadioBOSS Advanced v5.6.0.5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5f086da854c92ab06af37cc0c5ec452ad7b6f5a7","infoHashBuffer":{"type":"Buffer","data":[95,8,109,168,84,201,42,176,106,243,124,192,197,236,69,42,215,182,245,167]},"name":"DJSoft RadioBOSS Advanced v5.6.0.5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}