{"title":"Winter of the World (Century Trilogy, 2) by Ken Follett EPUB","magnet":"magnet:?xt=urn:btih:5f3a7632884315b7b3b875bd9cc12d611ae88d76&dn=Winter+of+the+World+%28Century+Trilogy%2C+2%29+by+Ken+Follett+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1803505","seeders":"3","leechers":"8","description":"xx\r\n\r\nWinter of the World (Century Trilogy, 2) by Ken Follett EPUB\r\n\r\nKen Follett here follows up his number-one New York Times best-seller Fall of Giants with a brilliant, pause-resistant epic about the heroism and honor of World War II and the dawn of the atomic age.\r\n\r\nFall of Giants, the first novel in his extraordinary new historical epic, The Century Trilogy, was an international sensation, acclaimed as &quot;sweeping and fascinating, a book that will consume you for days or weeks&quot; (USA Today) and &quot;grippingly told and readable to the end&quot; (The New York Times Book Review). &quot;If the next two volumes are as lively and entertaining as Fall of Giants,&quot; said The Washington Post, &quot;they should be well worth waiting for.&quot;\r\n\r\nWinter of the World picks up right where the first book left off, as its five interrelated families - American, German, Russian, English, Welsh - enter a time of enormous social, political, and economic turmoil, beginning with the rise of the Third Reich, through the Spanish Civil War and the great dramas of World War II, up to the explosions of the American and Soviet atomic bombs.\r\n\r\nCarla von Ulrich, born of German and English parents, finds her life engulfed by the Nazi tide until she commits a deed of great courage and heartbreak.... American brothers Woody and Chuck Dewar, each with a secret, take separate paths to momentous events, one in Washington, the other in the bloody jungles of the Pacific.... English student Lloyd Williams discovers in the crucible of the Spanish Civil War that he must fight Communism just as hard as Fascism.... Daisy Peshkov, a driven American social climber, cares only for popularity and the fast set, until the war transforms her life, not just once but twice, while her cousin Volodya carves out a position in Soviet intelligence that will affect not only this war - but the war to come.\r\n\r\nThese characters and many others find their lives inextricably entangled as their experiences illuminate the cataclysms that marked the century. From the drawing rooms of the rich to the blood and smoke of battle, their lives intertwine, propelling the reader into dramas of ever-increasing complexity.\r\n\r\nAs always with Ken Follett, the historical background is brilliantly researched and rendered, the action fast-moving, the characters rich in nuance and emotion. With passion and the hand of a master, he brings us into a world we thought we knew, but now will never seem the same again.\r\n\r\nxx","last_updated":"2017-12-22T12:03:42.207Z","parsed":{"xt":"urn:btih:5f3a7632884315b7b3b875bd9cc12d611ae88d76","dn":"Winter of the World (Century Trilogy, 2) by Ken Follett EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5f3a7632884315b7b3b875bd9cc12d611ae88d76","infoHashBuffer":{"type":"Buffer","data":[95,58,118,50,136,67,21,183,179,184,117,189,156,193,45,97,26,232,141,118]},"name":"Winter of the World (Century Trilogy, 2) by Ken Follett EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}