{"title":"Passengers - Mystery 2008 Eng Subs 1080p [H264-mp4]","magnet":"magnet:?xt=urn:btih:5f5074047af9724536e513bf611480a64dc0b81c&dn=Passengers+-+Mystery+2008+Eng+Subs+1080p+%5BH264-mp4%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"eyezin","categoryP":"video","categoryS":"hd___movies","size":"2556063378","seeders":"8","leechers":"14","description":"Plot.\r\nDr. Claire Summers, a therapist, has lived her life within a small comfort \r\nzone without taking any risks. It is because of that life that her mentor \r\nPerry, to get her out of that comfort zone, assigns her to act as the group \r\ntherapist for a handful of airplane crash survivors, that handful out of just \r\nover one hundred passengers who did not survive the crash. Perry warns her \r\nespecially about one survivor, Eric Clark, who, instead of grief, feels \r\necstatic about life. Indeed, Eric does not want to attend group sessions along \r\nwith the others, but he does encourage Claire to come see him anytime as a \r\nfriend in his personal interest in her. On the caveat that he no longer hit on \r\nher, Claire decides to do so in her effort to help him. As such, she has to \r\ntread that fine line of acting but not acting as his therapist while he still \r\nhas that attraction to her. Her ulterior motive in seeing Eric is that he, \r\nwithout coming right out and saying so or why, seems to know small details of \r\nher personal life. In the group sessions, Claire finds that there are \r\nconflicting details from some of the surviving passengers against the official \r\nstatement of the airline, which is that it was pilot error that caused the \r\ncrash, the pilot who is among the deceased and thus cannot defend himself. \r\nClaire wants to discover the truth behind the crash if only to help the \r\nsurvivors heal properly. In trying to discover the truth, Claire begins to \r\nbutt heads with Mr. Arkin, the airline representative who she does not trust, \r\nespecially as he seems to be following her. Also following her and the other \r\nsurvivors is an unknown man. As such, Claire also begins to believe the \r\nconspiracy theory of one of the survivors that the airline is trying to get to \r\nthem to shut them up, permanently if need be, that unknown man suspected to \r\nwork for Arkin. That theory is strengthened in Claire&apos;s mind as one by one, \r\nthose surviving passengers stop attending the group therapy sessions, she not \r\nknowing where they are. Through it all, a kindly neighbor seems to be able to \r\nprovide Claire with extra comfort during this time, like Eric she who seems to \r\nknow what she needs without her asking","last_updated":"2017-10-23T12:02:57.245Z","parsed":{"xt":"urn:btih:5f5074047af9724536e513bf611480a64dc0b81c","dn":"Passengers - Mystery 2008 Eng Subs 1080p [H264-mp4]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5f5074047af9724536e513bf611480a64dc0b81c","infoHashBuffer":{"type":"Buffer","data":[95,80,116,4,122,249,114,69,54,229,19,191,97,20,128,166,77,192,184,28]},"name":"Passengers - Mystery 2008 Eng Subs 1080p [H264-mp4]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}