{"title":"Caveblazers v1.0.3e","magnet":"magnet:?xt=urn:btih:5fd7decb4c4d3cdd86f8ad54e9c589e59b50db64&dn=Caveblazers+v1.0.3e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"oyunlar","categoryS":"pc","size":"34064241","seeders":"4","leechers":"0","description":"Caveblazers is an action focused platformer roguelike set in a fantasy world. Each game is unique with procedurally generated levels to explore and a massive amount of items, weapons and equipment to discover.The game takes place in a recently discovered cave, said to hold &quot;unimaginable power&quot;. You play as an adventurer setting out to explore the cave and find out what riches it holds. However, you are not the only one...As you delve deeper in to the cave, you&apos;ll discover new areas to explore, new weapons and new monsters to try them out on.Smart Characters!Throughout your journey you will encounter AI characters. Some friendly, some hostile. We&apos;re using an advanced pathfinding system which means friendly characters will be able to follow you wherever you go, and hostile characters will be able to track you down wherever you hide. There is no escape. Be afraid!Platformer Roguelike! Caveblazers is a modern platformer which incorporates some Roguelike and RPG elements such as permanent death, randomized potion identities, an RPG-style inventory system and tons of items, equipment and upgrades!Daily Challenge Runs!Each day a new adventure will be generated! It will be the same for everyone and you&apos;ll only get one chance at it! These challenge runs give you a starting loadout, and feature a set of different traits.Epic Boss Battles!Between each area you&apos;ll encounter a boss. Each boss is very unique, requiring a different strategy to defeat. Bosses are","last_updated":"2017-07-01T12:03:10.608Z","parsed":{"xt":"urn:btih:5fd7decb4c4d3cdd86f8ad54e9c589e59b50db64","dn":"Caveblazers v1.0.3e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"5fd7decb4c4d3cdd86f8ad54e9c589e59b50db64","infoHashBuffer":{"type":"Buffer","data":[95,215,222,203,76,77,60,221,134,248,173,84,233,197,137,229,155,80,219,100]},"name":"Caveblazers v1.0.3e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}