{"title":"The Simpsons Season 5","magnet":"magnet:?xt=urn:btih:60e6e74228951fc0f240c8631c713725928f8505&dn=The+Simpsons+Season+5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"SpicyRibs","categoryP":"video","categoryS":"tv_shows","size":"4275425770","seeders":"0","leechers":"0","description":"The Simpsons is an American animated sitcom created by Matt Groening for the Fox Broadcasting Company.[1][2][3] The series is a satirical depiction of working-class life epitomized by the Simpson family, which consists of Homer, Marge, Bart, Lisa, and Maggie. The show is set in the fictional town of Springfield and parodies American culture, society, television, and the human condition.\r\n\r\nThe family was conceived by Groening shortly before a solicitation for a series of animated shorts with producer James L. Brooks. Groening created a dysfunctional family and named the characters after members of his own family, substituting Bart for his own name. The shorts became a part of The Tracey Ullman Show on April 19, 1987. After a three-season run, the sketch was developed into a half-hour prime time show and became an early hit for Fox, becoming the network&apos;s first series to land in the Top 30 ratings in a season (1989&#x2013;90).\r\n\r\nSince its debut on December 17, 1989, 618 episodes of The Simpsons have been broadcast. Its 28th season began on September 25, 2016. It is the longest-running American sitcom and the longest-running American animated program, and, in 2009, it surpassed Gunsmoke as the longest-running American scripted primetime television series. The Simpsons Movie, a feature-length film, was released in theaters worldwide on July 27, 2007, and grossed over $527 million. On November 4, 2016, the series was renewed for a twenty-ninth and thirtieth season of 22 episodes each, extending the show to 2019.[4]\r\n\r\nThe Simpsons received widespread critical acclaim throughout its first nine[5][6] or ten[7][8] seasons, which are generally considered its &quot;Golden Age&quot;. Time named it the 20th century&apos;s best television series,[9] and Erik Adams of The A.V. Club named it &quot;television&apos;s crowning achievement regardless of format&quot;.[10] On January 14, 2000, the Simpson family was awarded a star on the Hollywood Walk of Fame. It has won dozens of awards since it debuted as a series, including 31 Primetime Emmy Awards, 30 Annie Awards, and a Peabody Award. Homer&apos;s exclamatory catchphrase &quot;D&apos;oh!&quot; has been adopted into the English language, while The Simpsons has influenced many adult-oriented animated sitcoms. Despite this, the show has also been criticized for what many perceive as a decline in quality over the years","last_updated":"2017-07-28T12:00:51.274Z","parsed":{"xt":"urn:btih:60e6e74228951fc0f240c8631c713725928f8505","dn":"The Simpsons Season 5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"60e6e74228951fc0f240c8631c713725928f8505","infoHashBuffer":{"type":"Buffer","data":[96,230,231,66,40,149,31,192,242,64,200,99,28,113,55,37,146,143,133,5]},"name":"The Simpsons Season 5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}