{"title":"Monty Python Live at the Hollywood Bowl (1982)","magnet":"magnet:?xt=urn:btih:6145ec47805b7dbecc9c44b8dfeae9e5cc4f1b34&dn=Monty+Python+Live+at+the+Hollywood+Bowl+%281982%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Invader97","categoryP":"video","categoryS":"movies","size":"1157895060","seeders":"1","leechers":"16","description":"Of all the torrents for this film on the internet, this is the best version that I could find. The ones with a similar or higher resolution were missing approximately the last five minutes, while one even had part of the video&apos;s top and side chopped off!\r\n\r\nMonty Python Live at the Hollywood Bowl is a 1982 British concert comedy film directed by Terry Hughes (with the film segments by Ian MacNaughton) and starring the Monty Python comedy troupe (Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, and Michael Palin) as they perform many of their greatest sketches at the Hollywood Bowl. The film also features Carol Cleveland in numerous supporting roles and Neil Innes performing songs. Also present for the shows and participating as an &apos;extra&apos; was Python super fan Kim &quot;Howard&quot; Johnson.\r\n\r\nThe show also included filmed inserts which were mostly taken from two Monty Python specials, Monty Python&apos;s Fliegender Zirkus, which had been broadcast on German television in 1972. The performance was recorded on videotape in September 1980 and transferred to film. In the wake of Life of Brian&apos;s worldwide success, the Pythons originally planned to release a film consisting of the two German shows redubbed and re-edited, but this proved impractical, and so Hollywood Bowl was released instead.\r\n\r\nAlthough it mostly contains sketches from the television series, the scripts and performers are not identical to those seen on television. The line-up also includes some sketches that predated Monty Python&apos;s Flying Circus, including the &quot;Four Yorkshiremen sketch&quot;, which dated from 1967&apos;s &quot;At Last the 1948 Show&quot;. Enjoy!","last_updated":"2017-05-31T11:06:10.704Z","parsed":{"xt":"urn:btih:6145ec47805b7dbecc9c44b8dfeae9e5cc4f1b34","dn":"Monty Python Live at the Hollywood Bowl (1982)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6145ec47805b7dbecc9c44b8dfeae9e5cc4f1b34","infoHashBuffer":{"type":"Buffer","data":[97,69,236,71,128,91,125,190,204,156,68,184,223,234,233,229,204,79,27,52]},"name":"Monty Python Live at the Hollywood Bowl (1982)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}