{"title":"Dear Cyborgs by Eugene Lim ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:615762c2641b8973c823ef02be8be0a2a0d75a94&dn=Dear+Cyborgs+by+Eugene+Lim+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8379530","seeders":"5","leechers":"3","description":"xx\r\n\r\nDear Cyborgs by Eugene Lim ePUB eBOOK-ZAK\r\n\r\nA fractal fable about the possibility and power of protest as told by three superheroes on their lunch break.\r\n\r\nIn a small Midwestern town, two Asian American boys bond over their outcast status and a mutual love of comic books. Meanwhile, in an alternative or perhaps future universe, a team of superheroes ponders modern society during their time off. Between black-ops missions and rescuing hostages, they swap stories of artistic malaise and muse on the seemingly inescapable grip of market economics.\r\n\r\nGleefully toying with the conventions of the novel, Dear Cyborgs weaves together the story of a friendship&apos;s dissolution with a provocative and lively meditation on protest. Through a series of linked monologues, a surprising cast of characters explores narratives of resistance - protest art, ecoterrorists, occupy squatters, pyromaniacal militants - and the extent to which any of these can truly withstand the pragmatic demands of contemporary capitalism. All the while, a mysterious cybernetic book of clairvoyance beckons, and trusted allies start to disappear.\r\n\r\nPlayfully blending comic-book villains with cultural critiques, Eugene Lim&apos;s Dear Cyborgs is a fleet-footed literary exploration of power, friendship, and creativity that recalls authors like Tom McCarthy and Valeria Luiselli. Ambitious and knowing, it braids together hard-boiled detective pulps, subversive philosophy, and Hollywood chase scenes, unfolding like the composites and revelations of a dream.\r\n\r\nxx","last_updated":"2017-08-29T12:04:37.186Z","parsed":{"xt":"urn:btih:615762c2641b8973c823ef02be8be0a2a0d75a94","dn":"Dear Cyborgs by Eugene Lim ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"615762c2641b8973c823ef02be8be0a2a0d75a94","infoHashBuffer":{"type":"Buffer","data":[97,87,98,194,100,27,137,115,200,35,239,2,190,139,224,162,160,215,90,148]},"name":"Dear Cyborgs by Eugene Lim ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}