{"title":"\nTao of Charlie Munger by David Clark ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:61df9254ef7c9b3c9db740434338a956c7be8515&dn=Tao+of+Charlie+Munger+by+David+Clark+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1319267","seeders":"0","leechers":"0","description":"xx\r\n\r\nTao of Charlie Munger by David Clark ePUB eBOOK-ZAK\r\n\r\nWords of wisdom from Charlie Munger - Warren Buffett&apos;s longtime business partner and the visionary Vice Chairman of Berkshire Hathaway - collected and interpreted with an eye towards investing by David Clark, coauthor of the best-selling Buffettology series.\r\n\r\nBorn in Omaha, Nebraska in 1924 Charlie Munger studied mathematics at the University of Michigan, trained as a meteorologist at Cal Tech Pasadena while in the Army, and graduated magna cum laude from Harvard Law School without ever earning an undergraduate degree. Today, Munger is one of America&apos;s most successful investors, the Vice Chairman of Berkshire Hathaway, and Warren Buffett&apos;s business partner for almost 40 years. Buffett says &quot;Berkshire has been built to Charlie&apos;s blueprint. My role has been that of general contractor.&quot; Munger is an intelligent, opinionated business man whose ideas can teach professional and amateur investors how to be successful in finance and life.\r\n\r\nLike The Tao of Warren Buffett and The Tao of Te Ching, The Tao of Charlie Munger is a compendium of pithy quotes including, &quot;Knowing what you don&apos;t know is more useful than being brilliant&quot; and &quot;In my whole life, I have known no wise people who didn&apos;t read all the time - none, zero.&quot; This collection, culled from interviews, speeches, and questions and answers at the Berkshire Hathaway and Wesco annual meetings, offers insights into Munger&apos;s amazing financial success and life philosophies. Described by Business Insider as &quot;sharp in his wit and investing wisdom,&quot; Charlie Munger&apos;s investment tips, business philosophy, and rules for living are as unique as his life story; intelligent as he clearly is; and as successful as he has been.\r\n\r\nxx","last_updated":"2017-09-28T12:01:12.301Z","parsed":{"xt":"urn:btih:61df9254ef7c9b3c9db740434338a956c7be8515","dn":"Tao of Charlie Munger by David Clark ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"61df9254ef7c9b3c9db740434338a956c7be8515","infoHashBuffer":{"type":"Buffer","data":[97,223,146,84,239,124,155,60,157,183,64,67,67,56,169,86,199,190,133,21]},"name":"Tao of Charlie Munger by David Clark ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}