{"title":"Diagnostic Pathology - Kidney Diseases, 2e","magnet":"magnet:?xt=urn:btih:6289fea9578c78fa3f08618e1f636718151c2cbd&dn=Diagnostic+Pathology+-+Kidney+Diseases%2C+2e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"486504595","seeders":"3","leechers":"77","description":"Part of the highly regarded Diagnostic Pathology series, this updated volume is a visually stunning, easy-to-use reference covering all aspects of common and rare renal diseases and their variants. Outstanding images-including gross and microscopic pathology, a wide range of stains, and detailed medical illustrations-make this an invaluable diagnostic aid for every practicing pathologist, resident, or fellow. Written by leading pathologists, this second edition presents an up-to-date, concise presentation of major pathological, clinical, pathophysiological, and genetic information for over 240 diagnoses.\r\n\r\nHigh-quality, carefully annotated images highlight critical information, including difficult issues of grading and staging and diagnostic dilemmas not covered in depth in other texts\r\nTime-saving reference features include bulleted text, a variety of test data tables, key facts in each chapter, annotated images, and an extensive index\r\nThoroughly updated content throughout with a particular emphasis on practical information that directly assists in making and supporting a diagnosis\r\nOver 25 new chapters with information on major advances in nephropathology/nephrology that have occurred since the first edition, especially in the classification of MPGN/complement-related diseases, lupus nephritis, transplant pathology, and newly recognized immunologic and genetic diseases such as ciliopathies, tubulointerstitial nephritis, and glomerulopathies\r\nExpert Consult eBook version included with purchase allows you to search all of the text, figures, and references from the book on a variety of devices","last_updated":"2017-07-09T12:03:20.871Z","parsed":{"xt":"urn:btih:6289fea9578c78fa3f08618e1f636718151c2cbd","dn":"Diagnostic Pathology - Kidney Diseases, 2e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6289fea9578c78fa3f08618e1f636718151c2cbd","infoHashBuffer":{"type":"Buffer","data":[98,137,254,169,87,140,120,250,63,8,97,142,31,99,103,24,21,28,44,189]},"name":"Diagnostic Pathology - Kidney Diseases, 2e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}