{"title":"KeepVid Pro 7.0.1.2 Multilingual_Activator","magnet":"magnet:?xt=urn:btih:63202dd6e9834af65be98bfa09965a7afe3c4fdc&dn=KeepVid+Pro+7.0.1.2+Multilingual_Activator&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"joshPA","categoryP":"applications","categoryS":"windows","size":"83932654","seeders":"0","leechers":"0","description":"Ultimate Video Downloader to Download Videos from YouTube and 10,000 Other Sites Quickly and Easily. Download videos from YouTube and more than 10,000 other video sharing sites, including Dailymotion, Hulu, Break, Metacafe, BlipTV, Vimeo, AOL, Lynda, MegaVideo, Veoh, VideoBash, LiveLeak, MyVideo, FunnyOrDie, Nico Video, TV.com, Veevr, Adobe TV and more.\t\r\n\r\n\r\nDownload Videos in Any Format\r\nKeepVid Pro not only downloads videos as-is in MP4, 3GP, FLV, WebM formats, but also downloads videos to any other format with just one click. It supports more than 150 formats, like AVI, MKV, WMV, iPhone, PSP, Android, etc.\r\nDownload YouTube Playlists &amp; Lynda Playlists in Batch\r\nKeepVid Pro enables you to download an entire playlist or channel in just one click from YouTube and Lynda websites. All the videos in the playlist can be downloaded at one time. Adding up to 5000 download tasks for each time is so easy.\r\nUltra-Fast Download Speed with Turbo Mode\r\nWith multi-thread technology, KeepVid Pro enables you to download videos with 3X Faster speed compared with common downloaders.\r\nRecord Videos from Online Sites or Record Desktop Screen\r\nKeepVid Pro is a splendid video recorder to capture videos from any online streaming sites or record the desktop activities on your computer.\r\nCapture videos from any online sites\r\nCapture streaming videos, online videos &amp; TV shows from any sites, like Netflix, Hulu, BBC etc. You can also record live videos simultaneously.\r\nCapture videos from computer screen\r\nCapture the program window, specific part of the screen, or the full screen by adjusting the capture area. So you can record Skype calls for playback, create tutorial videos, capture and share your splendid game moments.\r\nCapture videos with no more waiting\r\nSet the end time for capturing at any time duration automatically. You can free yourself from waiting for the whole recording process.\r\nConvert Local/Downloaded/Recorded Videos to Any Format\r\nKeepVid Pro converts online videos or local videos to 150+ different formats and various multimedia devices, including MP4, AVI, MPG, MKV, WMV, M4V, MOV, iPhone, iPad, and more","last_updated":"2017-11-30T12:02:49.449Z","parsed":{"xt":"urn:btih:63202dd6e9834af65be98bfa09965a7afe3c4fdc","dn":"KeepVid Pro 7.0.1.2 Multilingual_Activator","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"63202dd6e9834af65be98bfa09965a7afe3c4fdc","infoHashBuffer":{"type":"Buffer","data":[99,32,45,214,233,131,74,246,91,233,139,250,9,150,90,122,254,60,79,220]},"name":"KeepVid Pro 7.0.1.2 Multilingual_Activator","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}