{"title":"The Booles and the Hintons: Two Dynasties That Helped Shape...","magnet":"magnet:?xt=urn:btih:6386cf64b7ba3516ea0e8814b0a3d9e960a20cd6&dn=The+Booles+and+the+Hintons%3A+Two+Dynasties+That+Helped+Shape...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"13752552","seeders":"57","leechers":"8","description":"The Booles and the Hintons: Two Dynasties That Helped Shape the Modern World - Gerry Kennedy [epub]\r\n\r\nIn 1983 Gerry Kennedy set off on a tour through Russia, China, Japan and the USA to visit others involved in the global anti-war movement. Only dimly aware of his Victorian ancestors: George Boole, forefather of the digital revolution and James Hinton, eccentric philosopher and advocate of polygamy, he had directly followed in the footsteps of two dynasties of radical thinkers and doers.\r\n\r\nTheir notable achievements, in which the women were particularly prominent, involved many spheres. Boole&#x2019;s wife, Mary Everest, niece of George Everest, surveyor of the eponymous mountain, was an early advocate of hands-on education. Of the five talented Boole daughters, Ethel Voynich, wife of the discoverer of the enigmatic, still unexplained Voynich Manuscript, campaigned with Russian anarchists to overthrow the Tsar. She was rumoured to have had an affair with the notorious &#x2018;Ace of Spies&#x2019;, Sidney Reilly.\r\n\r\nOne of Ethel&#x2019;s sisters married Charles Howard Hinton: a leading exponent of the esoteric realm of the fourth dimension and inventor of the gunpowder baseball-pitcher. Of their descendants, Carmelita Hinton also pioneered progressive education in the USA at her school in Putney, Vermont. Her children dedicated their lives to Mao&#x2019;s China.\r\n\r\nAppalled by the dropping on Japan of the atomic bomb that she had helped design, Joan Hinton defected to China and actively engaged in the Cultural Revolution. William Hinton wrote the influential documentary Fanshen based on his experience in 1948 of revolutionary change in a Shanxi village.\r\n\r\nOther members of the clan became renowned in their fields of physics, entomology and botany. Their combined legacy of independent and constructive thinking is perhaps typified by the invention of the Jungle Gym: the climbing-frame now used by children the world over. In The Booles and the Hintons the author embarks on a quest to reveal the stories behind their remarkable lives.\r\n\r\nHardcover: 448 pages\r\nPublisher: Atrium (6 July 2016)","last_updated":"2018-01-01T12:04:46.434Z","parsed":{"xt":"urn:btih:6386cf64b7ba3516ea0e8814b0a3d9e960a20cd6","dn":"The Booles and the Hintons: Two Dynasties That Helped Shape...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6386cf64b7ba3516ea0e8814b0a3d9e960a20cd6","infoHashBuffer":{"type":"Buffer","data":[99,134,207,100,183,186,53,22,234,14,136,20,176,163,217,233,96,162,12,214]},"name":"The Booles and the Hintons: Two Dynasties That Helped Shape...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}