{"title":"Tinker Dabble Doodle Try_ Unlock the Power of the Unfocused Mind","magnet":"magnet:?xt=urn:btih:647dc2c9b582b1f4a94384d6c8abd7ae40aafa91&dn=Tinker+Dabble+Doodle+Try_+Unlock+the+Power+of+the+Unfocused+Mind&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1930073","seeders":"74","leechers":"16","description":"xx\r\n\r\nTinker Dabble Doodle Try_ Unlock the Power of the Unfocused Mind by Srini Pillay ePUB eBOOK-ZAK\r\n\r\nHarness your mind&apos;s innate tendency to wander, stall, rest, and unfocus and become more productive - in the boardroom, living room, or classroom.\r\n\r\nTo finish tasks and achieve goals, most people believe that more focus is the solution. We rely on to-do lists, calendar reminders, noise-blocking headphones, and sometimes medication to help us concentrate - even though these tactics often fail to substantially improve productivity. Drawing on the latest brain research, compelling stories from his psychological practice, and colorful examples of counterintuitive success from sports, business, education, and the arts, neuroscientist Srini Pillay, MD, challenges traditional ideas about productivity, revealing the lasting, positive benefits of adding deliberate and regular unfocus to your repertoire. A fascinating tour through brain wavelengths and rhythm, mind-sets, and mental relaxation, Tinker Dabble Doodle Try demonstrates how specific kinds of planned unfocus stimulate cognitive calmness, jumpstart productivity, enhance innovation, inspire creativity, improve long-term memory, and, of course, help you stay on target.\r\n\r\nTinkering with ideas and with things releases your mind to wander from a state of stuckness into a possibility frame of mind, triggering neural connections and new insights.\r\n\r\nDabbling in a new endeavor - whether a hobby or fantasy - disrupts your habitual and reactive thinking, helping you find new solutions to old problems.\r\n\r\nDoodling can help you tap in to another brain frequency to remove obstacles and create opportunities and inspiration.\r\n\r\nWith techniques for training the brain to unfocus, concepts for scheduling busy lives, and ideas for controlling this new cognitive-toggling capability, Tinker Dabble Doodle Try will change how you think about daydreaming, relaxing, leaving work unfinished, and even multitasking. What you&apos;ll discover is a greater freedom, a deeper intelligence, and a more profound joy in your life.\r\n\r\nxx","last_updated":"2017-09-02T12:06:21.146Z","parsed":{"xt":"urn:btih:647dc2c9b582b1f4a94384d6c8abd7ae40aafa91","dn":"Tinker Dabble Doodle Try_ Unlock the Power of the Unfocused Mind","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"647dc2c9b582b1f4a94384d6c8abd7ae40aafa91","infoHashBuffer":{"type":"Buffer","data":[100,125,194,201,181,130,177,244,169,67,132,214,200,171,215,174,64,170,250,145]},"name":"Tinker Dabble Doodle Try_ Unlock the Power of the Unfocused Mind","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}