{"title":"The Ghost Ship of Brooklyn_ An Untold Story of the American Revo","magnet":"magnet:?xt=urn:btih:64927767369da71998bc0685497249dbb5130339&dn=The+Ghost+Ship+of+Brooklyn_+An+Untold+Story+of+the+American+Revo&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3737989","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Ghost Ship of Brooklyn_ An Untold Story of the American Revolution by Robert P Watson ePUB eBOOK-ZAK\r\n\r\nThe most horrific struggle of the American Revolution occurred just 100 yards off New York, where more men died aboard a rotting prison ship than were lost to combat during the entirety of the war.\r\n\r\nMoored off the coast of Brooklyn until the end of the war, the derelict ship, the HMS Jersey, was a living hell for thousands of Americans either captured by the British or accused of disloyalty. Crammed belowdecks - a shocking 1,000 at a time - without light or fresh air, the prisoners were scarcely fed food and water. Disease ran rampant, and human waste fouled the air as prisoners suffered mightily at the hands of brutal British and Hessian guards. Throughout the colonies, the mere mention of the ship sparked fear and loathing of British troops. It also sparked a backlash of outrage as newspapers everywhere described the horrors onboard the ghostly ship. This shocking event, much like the better-known Boston Massacre before it, ended up rallying public support for the war.\r\n\r\nRevealing for the first time hundreds of accounts culled from old newspapers, diaries, and military reports, award-winning historian Robert P. Watson follows the lives and ordeals of the ship&apos;s few survivors to tell the astonishing story of the cursed ship that killed thousands of Americans and yet helped secure victory in the fight for independence.\r\n\r\nxx","last_updated":"2017-08-20T12:00:42.375Z","parsed":{"xt":"urn:btih:64927767369da71998bc0685497249dbb5130339","dn":"The Ghost Ship of Brooklyn_ An Untold Story of the American Revo","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"64927767369da71998bc0685497249dbb5130339","infoHashBuffer":{"type":"Buffer","data":[100,146,119,103,54,157,167,25,152,188,6,133,73,114,73,219,181,19,3,57]},"name":"The Ghost Ship of Brooklyn_ An Untold Story of the American Revo","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}