{"title":"\nScaling Up Excellence_ Getting to More Without Settling for Less","magnet":"magnet:?xt=urn:btih:64ee3a621914a775f24aa56cf350d2ed6d18a692&dn=Scaling+Up+Excellence_+Getting+to+More+Without+Settling+for+Less&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3814322","seeders":"0","leechers":"0","description":"xx\r\n\r\nScaling Up Excellence_ Getting to More Without Settling for Less by Robert I Sutton and Huggy Rao AZW3 eBOOK-ZAK\r\n\r\nIn Scaling Up Excellence, best-selling author Robert Sutton and Stanford colleague Huggy Rao tackle a challenge that determines every organization&#x2019;s success: scaling up further, faster, and more effectively as a program or an organization creates a larger footprint. Sutton and Rao have devoted much of the last decade to uncovering what it takes to build and uncover pockets of exemplary performance, to help spread them, and to keep recharging organizations with ever-better work practices. Drawing on inside accounts and case studies and academic research from a wealth of industries - including start-ups, pharmaceuticals, airlines, retail, financial services, high-tech, education, non-profits, government, and healthcare - Sutton and Rao identify the key scaling challenges that confront every organization. They tackle the difficult trade-offs that organizations must make between &quot;Buddhism&quot; versus &quot;Catholicism&quot; - whether to encourage individualized approaches tailored to local needs or to replicate the same practices and customs as an organization or program expands. They reveal how the best leaders and teams develop, spread, and instill the right mindsets in their people - rather than ruining or watering down the very things that have fueled successful growth in the past. They unpack the principles that help to cascade excellence throughout an organization, as well as show how to eliminate destructive beliefs and behaviors that will hold them back.\r\n\r\nScaling Up Excellence is the first major business book devoted to this universal and vexing challenge. It is destined to become the standard bearer in the field.\r\n\r\nxx","last_updated":"2017-09-30T12:01:55.234Z","parsed":{"xt":"urn:btih:64ee3a621914a775f24aa56cf350d2ed6d18a692","dn":"Scaling Up Excellence_ Getting to More Without Settling for Less","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"64ee3a621914a775f24aa56cf350d2ed6d18a692","infoHashBuffer":{"type":"Buffer","data":[100,238,58,98,25,20,167,117,242,74,165,108,243,80,210,237,109,24,166,146]},"name":"Scaling Up Excellence_ Getting to More Without Settling for Less","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}