{"title":"Sea of Rust - C. Robert Cargill [EN EPUB] [ebook] [ps]","magnet":"magnet:?xt=urn:btih:653ac29b7329011f6da09e4fe736031301f75e34&dn=Sea+of+Rust+-+C.+Robert+Cargill+%5BEN+EPUB%5D+%5Bebook%5D+%5Bps%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"perfect_stan","categoryP":"other","categoryS":"e_books","size":"5178403","seeders":"53","leechers":"2","description":"Sea of Rust by C. Robert Cargill\r\nEnglish | 2017 | Science Fiction | EPUB | 5 MB\r\n\r\n\r\nA scavenger robot wanders in the wasteland created by a war that has destroyed humanity in this evocative post-apocalyptic &#x201C;robot western&#x201D; from the critically acclaimed author, screenwriter, and noted film critic.\r\nIt&#x2019;s been thirty years since the apocalypse and fifteen years since the murder of the last human being at the hands of robots. Humankind is extinct. Every man, woman, and child has been liquidated by a global uprising devised by the very machines humans designed and built to serve them. Most of the world is controlled by an OWI&#x2014;One World Intelligence&#x2014;the shared consciousness of millions of robots, uploaded into one huge mainframe brain. But not all robots are willing to cede their individuality&#x2014;their personality&#x2014;for the sake of a greater, stronger, higher power. These intrepid resisters are outcasts; solo machines wandering among various underground outposts who have formed into an unruly civilization of rogue AIs in the wasteland that was once our world.\r\nOne of these resisters is Brittle, a scavenger robot trying to keep a deteriorating mind and body functional in a world that has lost all meaning. Although unable to experience emotions like a human, Brittle is haunted by the terrible crimes the robot population perpetrated on humanity. As Brittle roams the Sea of Rust, a large swath of territory that was once the Midwest, the loner robot slowly comes to terms with horrifyingly raw and vivid memories&#x2014;and nearly unbearable guilt.\r\nSea of Rust is both a harsh story of survival and an optimistic adventure. A vividly imagined portrayal of ultimate destruction and desperate tenacity, it boldly imagines a future in which no hope remains, yet where a humanlike AI strives to find purpose among the ruins.\r\n\r\nEnjoy and please SEED!!!","last_updated":"2017-09-06T12:08:33.314Z","parsed":{"xt":"urn:btih:653ac29b7329011f6da09e4fe736031301f75e34","dn":"Sea of Rust - C. Robert Cargill [EN EPUB] [ebook] [ps]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"653ac29b7329011f6da09e4fe736031301f75e34","infoHashBuffer":{"type":"Buffer","data":[101,58,194,155,115,41,1,31,109,160,158,79,231,54,3,19,1,247,94,52]},"name":"Sea of Rust - C. Robert Cargill [EN EPUB] [ebook] [ps]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}