{"title":"Friends Divided by Gordon S. Wood EPUB","magnet":"magnet:?xt=urn:btih:656c76a2fb4e03609b3248bd0b4261d6d167ce06&dn=Friends+Divided+by+Gordon+S.+Wood+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2991648","seeders":"7","leechers":"2","description":"xx\r\n\r\nFriends Divided by Gordon S. Wood EPUB\r\n\r\nFrom the great historian of the American Revolution, New York Times best-selling and Pulitzer-winning Gordon Wood, comes a majestic dual biography of two of America&apos;s most enduringly fascinating figures, whose partnership helped birth a nation and whose subsequent falling out did much to fix its course.\r\n\r\nThomas Jefferson and John Adams could scarcely have come from more different worlds or been more different in temperament. Jefferson, the optimist with enough faith in the innate goodness of his fellow man to be democracy&apos;s champion, was an aristocratic Southern slave owner while Adams, the overachiever from New England&apos;s rising middling classes, painfully aware he was no aristocrat, was a skeptic about popular rule and a defender of a more elitist view of government. They worked closely in the crucible of revolution, crafting the Declaration of Independence and leading, with Franklin, the diplomatic effort that brought France into the fight. But ultimately their profound differences would lead to a fundamental crisis in their friendship and in the nation writ large as they became the figureheads of two entirely new forces, the first American political parties. It was a bitter breach, lasting through the presidential administrations of both men and beyond.\r\n\r\nBut late in life, something remarkable happened: These two men were nudged into reconciliation. What started as a grudging trickle of correspondence became a great flood, and a friendship was rekindled over the course of hundreds of letters. In their final years, they were the last surviving founding fathers and cherished their role in this mighty young republic as it approached the half-century mark in 1826. At last, on the afternoon of July 4, 50 years to the day after the signing of the Declaration, Adams let out a sigh and said, &quot;At least Jefferson still lives.&quot; He died soon thereafter. In fact, a few hours earlier on that same day, far to the south in his home in Monticello, Jefferson died as well.\r\n\r\nArguably, no relationship in this country&apos;s history carries as much freight as that of John Adams of Massachusetts and Thomas Jefferson of Virginia. Gordon Wood has more than done justice to these entwined lives and their meaning; he has written a magnificent new addition to America&apos;s collective story.\r\n\r\nxx","last_updated":"2017-10-28T12:03:09.600Z","parsed":{"xt":"urn:btih:656c76a2fb4e03609b3248bd0b4261d6d167ce06","dn":"Friends Divided by Gordon S. Wood EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"656c76a2fb4e03609b3248bd0b4261d6d167ce06","infoHashBuffer":{"type":"Buffer","data":[101,108,118,162,251,78,3,96,155,50,72,189,11,66,97,214,209,103,206,6]},"name":"Friends Divided by Gordon S. Wood EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}