{"title":"Moses and Akhenaten: The Secret History of Egypt","magnet":"magnet:?xt=urn:btih:66a8d0d94a4de4f57dae1b0b4b181c5dc5efb231&dn=Moses+and+Akhenaten%3A+The+Secret+History+of+Egypt&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"2990733","seeders":"0","leechers":"0","description":"Moses and Akhenaten: The Secret History of Egypt at the Time of the Exodus - Ahmed Osman [epub]\r\n\r\nDuring his reign, the Pharaoh Akhenaten was able to abolish the complex pantheon of the ancient Egyptian religion and replace it with a single god, the Aten, who had no image or form. Seizing on the striking similarities between the religious vision of this &#x201C;heretic&#x201D; pharaoh and the teachings of Moses, Sigmund Freud was the first to argue that Moses was in fact an Egyptian. Now Ahmed Osman, using recent archaeological discoveries and historical documents, contends that Akhenaten and Moses were one and the same man. \r\n\r\nIn a stunning retelling of the Exodus story, Osman details the events of Moses/Akhenaten&apos;s life: how he was brought up by Israelite relatives, ruled Egypt for seventeen years, angered many of his subjects by replacing the traditional Egyptian pantheon with worship of the Aten, and was forced to abdicate the throne. Retreating to the Sinai with his Egyptian and Israelite supporters, he died out of the sight of his followers, presumably at the hands of Seti I, after an unsuccessful attempt to regain his throne. \r\n\r\nOsman reveals the Egyptian components in the monotheism preached by Moses as well as his use of Egyptian royal ritual and Egyptian religious expression. He shows that even the Ten Commandments betray the direct influence of Spell 125 in the Egyptian Book of the Dead. Moses and Akhenaten provides a radical challenge to long-standing beliefs concerning the origin of Semitic religion and the puzzle of Akhenaten&apos;s deviation from ancient Egyptian tradition. In fact, if Osman&apos;s contentions are correct, many major Old Testament figures would be of Egyptian origin.\r\n\r\nPaperback: 280 pages\r\nPublisher: Bear &amp; Company; 2nd edition (December 30, 2002)","last_updated":"2017-12-13T12:00:34.242Z","parsed":{"xt":"urn:btih:66a8d0d94a4de4f57dae1b0b4b181c5dc5efb231","dn":"Moses and Akhenaten: The Secret History of Egypt","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"66a8d0d94a4de4f57dae1b0b4b181c5dc5efb231","infoHashBuffer":{"type":"Buffer","data":[102,168,208,217,74,77,228,245,125,174,27,11,75,24,28,93,197,239,178,49]},"name":"Moses and Akhenaten: The Secret History of Egypt","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}