{"title":"GTA San Andreas-HOODLUM with new mods + CRACK","magnet":"magnet:?xt=urn:btih:66f2c619761ea28ebf3eb8ddce82407b3ad383d1&dn=GTA+San+Andreas-HOODLUM+with+new+mods+%2B+CRACK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"spinner12","categoryP":"games","categoryS":"pc","size":"4232099840","seeders":"0","leechers":"0","description":"Game Description\r\n    \r\n   Grand Theft Auto: San Andreas is a 2004 open world action-adventure video game developed by games developer Rockstar North in the United Kingdom and published by Rockstar Games. It is the third 3D game in the Grand Theft Auto video game franchise, the fifth original console release and eighth game overall. Originally released for the PlayStation 2 in October 2004, the game has since been released for the Xbox and Microsoft Windows (PC) in June 2005, and has received wide acclaim and high sales figures on all three platforms. It is the best-selling game of all time on PlayStation 2. It was made available on Steam on January 4, 2008, and on Intel-based Macs running a minimum of Mac OS X 10.6.6 in September 2011. Grand Theft Auto: San Andreas was succeeded by Grand Theft Auto: Liberty City Stories and was preceded by Grand Theft Auto: Vice City.\r\n    \r\n   Gameplay\r\n    \r\n   San Andreas is structured similarly to the previous two games in the series. The core gameplay consists of elements of a third-person shooter and a driving game, affording the player a large, open world environment in which to move around. On foot, the player&apos;s character is capable of walking, eating, running, sprinting, swimming, climbing (the first GTA game in which swimming and climbing are possible) and jumping as well as using weapons and various forms of hand to hand combat. Players can drive a variety of vehicles, including automobiles, buses, semis, boats, fixed wing aircraft, helicopters, trains, tanks, motorcycles and bikes. Players may also import vehicles rather than steal them.\r\n    \r\n   The open, non-linear environment allows players to explore and choose how they wish to play the game. Although storyline missions are necessary to progress through the game and unlock certain cities and content, they are not required as players can complete them at their own leisure. When not taking on a storyline mission, players can free-roam and look around the cities, eat from the restaurant, or cause havoc by attacking people and causing destruction. Creating havoc can attract unwanted and potentially fatal attention from the authorities. The more chaos caused, the stronger the response: police will handle &quot;minor&quot; infractions (attacking people, pointing guns at people, stealing cars, killing a few people, etc.), whereas SWAT teams, the FBI, and the military respond to higher wanted levels.\r\n    \r\n     Minimum System Requirements\r\n   &#x2022;  System: 1GHz Intel Pentium III or AMD Athlon or equivalent\r\n   &#x2022;  RAM: 256 MB\r\n   &#x2022;  Video Memory: 64 MB\r\n   &#x2022;  Hard Drive Space: 3600 MB\r\n\r\n   Recommended System Requirements\r\n   &#x2022;  System: Intel Pentium 4 or AMD Athlon XP or equivalent\r\n   &#x2022;  RAM: 384 MB\r\n   &#x2022;  Video Memory: 128 MB\r\n   &#x2022;  Hard Drive Space: 4700 MB\r\n   &#x2022;  Other: Gamepad with twin axis analog\r\n    \r\n   Install Notes\r\n   &#x2022;  Mount image or burn it\r\n   &#x2022;  Install\r\n   &#x2022;  Copy Crack over original files\r\n   &#x2022;  Play","last_updated":"2017-08-09T12:01:21.614Z","parsed":{"xt":"urn:btih:66f2c619761ea28ebf3eb8ddce82407b3ad383d1","dn":"GTA San Andreas-HOODLUM with new mods   CRACK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"66f2c619761ea28ebf3eb8ddce82407b3ad383d1","infoHashBuffer":{"type":"Buffer","data":[102,242,198,25,118,30,162,142,191,62,184,221,206,130,64,123,58,211,131,209]},"name":"GTA San Andreas-HOODLUM with new mods   CRACK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}