{"title":"This Fight is Our Fight by Elizabeth Warren epub RtR","magnet":"magnet:?xt=urn:btih:6704545fe7743c4de66ed60f2d51b4d9c22dbb69&dn=This+Fight+is+Our+Fight+by+Elizabeth+Warren+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"24774481","seeders":"4","leechers":"14","description":"This Fight is Our Fight by Elizabeth Warren epub RtR\r\n\r\nThe fiery U.S. Senator from Massachusetts and bestselling author offers a passionate, inspiring audiobook about why our middle class is under siege and how we can win the fight to save it.\r\n\r\nSenator Elizabeth Warren has long been an outspoken champion of America&#x2019;s middle class, and by the time the people of Massachusetts elected her in 2012, she had become one of the country&#x2019;s leading progressive voices. Now, at a perilous moment for our nation, she has written an illuminating account of how we built the strongest middle class in history, a scathing indictment of those who have spent the past thirty-five years undermining working families, and a rousing call to action.\r\n\r\nWarren grew up in Oklahoma, and she&#x2019;s never forgotten how difficult it was for her mother and father to hold on at the ragged edge of the middle class. An educational system that offered opportunities for all made it possible for her to achieve her dream of going to college, becoming a teacher, and, later, attending law school. But now, for many, these kinds of opportunities are gone, and a government that once looked out for working families is instead captive to the rich and powerful. Seventy-five years ago, President Franklin Roosevelt and his New Deal ushered in an age of widespread prosperity; in the 1980s, President Ronald Reagan reversed course and sold the country on the disastrous fiction called trickle-down economics. Now, with the election of Donald Trump--a con artist who promised to drain the swamp of special interests and then surrounded himself with billionaires and lobbyists--the middle class is being pushed ever closer to collapse.\r\n\r\nWritten in the candid, high-spirited voice that is Warren&#x2019;s trademark, This Fight Is Our Fight tells eye-opening stories about her battles in the Senate and vividly describes the experiences of hard-working Americans who have too often been given the short end of the stick. Elizabeth Warren has had enough of phony promises and a government that no longer serves its people--she won&#x2019;t sit down, she won&#x2019;t be silenced, and she will fight back","last_updated":"2017-05-24T11:20:06.865Z","parsed":{"xt":"urn:btih:6704545fe7743c4de66ed60f2d51b4d9c22dbb69","dn":"This Fight is Our Fight by Elizabeth Warren epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6704545fe7743c4de66ed60f2d51b4d9c22dbb69","infoHashBuffer":{"type":"Buffer","data":[103,4,84,95,231,116,60,77,230,110,214,15,45,81,180,217,194,45,187,105]},"name":"This Fight is Our Fight by Elizabeth Warren epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}