{"title":"Drew Philp - A $500 House in Detroit 2017 RETAiL ePUB eBOOK-DiST","magnet":"magnet:?xt=urn:btih:674b92979be58593179f7eb6650aebd733bd214d&dn=Drew+Philp+-+A+%24500+House+in+Detroit+2017+RETAiL+ePUB+eBOOK-DiST&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10672302","seeders":"1","leechers":"0","description":"xx\r\n\r\nDrew Philp - A $500 House in Detroit 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nDrew Philp, an idealistic college student from a working-class Michigan family, withdraws from the comforts of life on a university campus in search of a place to live where he can make a difference. He sets his sights on Detroit, the failed metropolis of abandoned buildings, widespread poverty, and rampant crime - a complicated source of national fascination, often stereotyped and little understood. Arriving with no job, no friends, and no money, Philp is na&#xEF;vely determined to fix the huge, broken city with his own hands and on his own terms. A year later, he saves up and buys a ramshackle house for $500 in the east side neighborhood known as Poletown and moves in.\r\n\r\nPhilp gets what he pays for. The roomy Queen Anne he now owns has been abandoned for a decade and is little more than a clapboard shell on a crumbling brick foundation, filled with heaping piles of trash (including most of a chopped-up minivan), and missing windows, heat, water, electricity, and a functional roof. The landscape of the surrounding neighborhood resembles an urban prairie: overgrown fields dotted with houses that haven&apos;t been demolished or burned to the ground - some of them well-maintained by Detroiters who have chosen to remain in the city, but many, like the Queen Anne, left vacant and in complete disrepair.\r\n\r\nBased on a BuzzFeed essay that resonated with millions of readers, A $500 House in Detroit is Philp&apos;s raw and earnest account of rebuilding everything but the frame of his house, nail by nail and room by room. It&apos;s also the story of a young man finding his footing in the city, the country, and his own generation. As he assimilates into the community of Detroiters around him, Philp guides readers through the city&apos;s vibrant history and engages in urgent conversations about gentrification, racial tensions, and class warfare.\r\n\r\nWe witness his concept of Detroit shift, expand, and evolve as his plan to save the city gives way to a life forged from political meaning, personal connection, and collective purpose.\r\n\r\nPart social history, part brash generational statement, part comeback story, A $500 House in Detroit is an intimate account of the tentative revival of an American city - home by home and person by person - and a glimpse at a new way forward for generations to come.\r\n\r\nxx","last_updated":"2017-08-08T12:01:16.630Z","parsed":{"xt":"urn:btih:674b92979be58593179f7eb6650aebd733bd214d","dn":"Drew Philp - A $500 House in Detroit 2017 RETAiL ePUB eBOOK-DiST","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"674b92979be58593179f7eb6650aebd733bd214d","infoHashBuffer":{"type":"Buffer","data":[103,75,146,151,155,229,133,147,23,159,126,182,101,10,235,215,51,189,33,77]},"name":"Drew Philp - A $500 House in Detroit 2017 RETAiL ePUB eBOOK-DiST","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}