{"title":"An Officer and a Spy by Robert Harris epub RtR","magnet":"magnet:?xt=urn:btih:67626c5da42646603ece0e7239f909499e074640&dn=An+Officer+and+a+Spy+by+Robert+Harris+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2887643","seeders":"0","leechers":"0","description":"xx\r\n\r\nAn Officer and a Spy by Robert Harris epub RtR\r\n\r\nRobert Harris returns to the thrilling historical fiction he has so brilliantly made his own. This is the story of the infamous Dreyfus affair told as a chillingly dark, hard-edged novel of conspiracy and espionage.\r\n\r\nParis in 1895: Alfred Dreyfus, a young Jewish officer, has just been convicted of treason, sentenced to life imprisonment at Devil&apos;s Island, and stripped of his rank in front of a baying crowd of 20,000. Among the witnesses to his humiliation is Georges Picquart, the ambitious, intellectual, recently promoted head of the counterespionage agency that Dreyfus had passed secrets to the Germans. At first, Picquart firmly believes in Dreyfus&apos; guilt. But it is not long after Dreyfus is delivered to his desolate prison that Picquart stumbles on information that leads him to suspect that there is still a spy at large in the French military. As evidence of the most malignant deceit mounts and spirals inexorably toward the uppermost levels of government, Picquart is compelled to question not only the case against Dreyfus but also his most deeply held beliefs about his country, and about himself.\r\n\r\nBringing to life the scandal that mesmerized the world at the turn of the 20th century, Robert Harris tells a tale of uncanny timeliness - a witch hunt, secret tribunals, out-of-control intelligence agencies, the fate of a whistle-blower - richly dramatized with the singular storytelling mastery that has marked all of his internationally best-selling novels.\r\n\r\nxx","last_updated":"2017-07-13T12:00:28.803Z","parsed":{"xt":"urn:btih:67626c5da42646603ece0e7239f909499e074640","dn":"An Officer and a Spy by Robert Harris epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67626c5da42646603ece0e7239f909499e074640","infoHashBuffer":{"type":"Buffer","data":[103,98,108,93,164,38,70,96,62,206,14,114,57,249,9,73,158,7,70,64]},"name":"An Officer and a Spy by Robert Harris epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}