{"title":"The Children's Crusade by Ann Packe","magnet":"magnet:?xt=urn:btih:67a6982737d17724ed6ca4e8dd355cd0d9f8515b&dn=The+Children%27s+Crusade+by+Ann+Packe&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"670912","seeders":"17","leechers":"9","description":"xx\r\n\r\nThe Children&apos;s Crusade by Ann Packer MOBI\r\n\r\nFrom the New York Times best-selling, award-winning author of The Dive From Clausen&apos;s Pier, a sweeping, masterful new novel that explores the secrets and desires, the remnant wounds and saving graces of one California family over the course of five decades.\r\n\r\nBill Blair finds the land by accident - three wooded acres in a rustic community south of San Francisco. The year is 1954, long before anyone will call this area Silicon Valley. Struck by a vision of the family he has yet to create, Bill buys the property on a whim. In Penny Greenway he finds a suitable wife, a woman whose yearning attitude toward life seems compelling and answerable, and they marry and have four children. Yet Penny is a mercurial housewife at a time when women chafed at the conventions imposed on them. She finds salvation in art, but the cost is high.\r\n\r\nThirty years later the three oldest Blair children, adults now and still living near the family home, are disrupted by the return of the youngest, whose sudden presence and all-too-familiar troubles force a reckoning with who they are, separately and together, and set off a struggle over the family&apos;s future. One by one the siblings take turns telling the story - Robert, a doctor like their father; Rebecca, a psychiatrist; Ryan, a schoolteacher; and James, the malcontent, the problem child, the only one who hasn&apos;t settled down - their narratives interwoven with portraits of the family at crucial points in their history.\r\n\r\nReviewers have praised Ann Packer&apos;s &quot;brilliant ear for character&quot; (The New York Times Book Review), her &quot;naturalist&apos;s vigilance for detail, so that her characters seem observed rather than invented&quot; (The New Yorker), and the &quot;utterly lifelike quality of her book&apos;s everyday detail&quot; (The New York Times). Her talents are on dazzling display in The Children&apos;s Crusade, an extraordinary study in character, a rare and wise examination of the legacy of early life on adult children attempting to create successful families and identities of their own. This is Ann Packer&apos;s most deeply affecting book yet.\r\n\r\nxx","last_updated":"2017-11-12T12:01:01.352Z","parsed":{"xt":"urn:btih:67a6982737d17724ed6ca4e8dd355cd0d9f8515b","dn":"The Children's Crusade by Ann Packe","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67a6982737d17724ed6ca4e8dd355cd0d9f8515b","infoHashBuffer":{"type":"Buffer","data":[103,166,152,39,55,209,119,36,237,108,164,232,221,53,92,208,217,248,81,91]},"name":"The Children's Crusade by Ann Packe","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}