{"title":"Glider Island","magnet":"magnet:?xt=urn:btih:67b1368625333e49562175dc3157916640ecb39a&dn=Glider+Island&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"299914607","seeders":"4","leechers":"4","description":"Welcome to Glider Island, the ultimate VR flying game! Your objective is to collect all the hoops placed on each of the 3 islands within 10 minutes! Use your rocket booster to gain speed and keep from falling from the sky. You can add rocket booster by collecting the blue spirals placed around each map. You have limited booster so be careful with how much you use and when you choose to collect the blue spirals. There are 3 maps and each map comes with unique scenery, soundtrack and surprise event. You much complete each map sequentially to unlock the next map. The first map is Forest Island with 150 hoops and every two minutes a thunderstorm occurs and you must fight the wind. The second map is Volcano Island with 175 hoops and every two minutes a Volcano Eruption occurs and you must dodge lava bombs! The Last Island is Desert Island with 200 hoops and every two minutes a Dust Storm occurs and you must fly with limited visibility and wind. Plot your course carefully to try and collect all the hoops in the fastest time possible. You will earn Bronze, Silver or Gold depending on how fast you complete each level. Glider Island is designed for Virtual Reality but can be played perfectly fine without it too! There are 4 ways you can choose to control the glider:Vive Hand Controllers: Use your hands to grab the glider and control the glider through your outstretched hands. *Oculus Hand Controllers Coming Soon!VR Head Movement: - Move your head up, down","last_updated":"2017-07-04T12:03:12.057Z","parsed":{"xt":"urn:btih:67b1368625333e49562175dc3157916640ecb39a","dn":"Glider Island","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"67b1368625333e49562175dc3157916640ecb39a","infoHashBuffer":{"type":"Buffer","data":[103,177,54,134,37,51,62,73,86,33,117,220,49,87,145,102,64,236,179,154]},"name":"Glider Island","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}