{"title":"The Smartest Guys in the Room: The Rise and Fall of Enron","magnet":"magnet:?xt=urn:btih:68094548cbb55a5841edafea70bbc0068b3e45f7&dn=The+Smartest+Guys+in+the+Room%3A+The+Rise+and+Fall+of+Enron&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"2128967","seeders":"78","leechers":"4","description":"The Smartest Guys in the Room: The Amazing Rise and Scandalous Fall of Enron - Bethany McLean, Peter Elkind [epub]\r\n\r\nThe tenth-anniversary edition of the definitive account of the Enron scandal, updated with a new chapter.\r\n\r\nMeticulously researched and character driven, Smartest Guys in the Room takes the reader deep into Enron&apos;s past&#x2014;and behind the closed doors of private meetings. Drawing on a wide range of unique sources, the book follows Enron&apos;s rise from obscurity to the top of the business world to its disastrous demise.\r\n\r\nIt reveals as never before major characters such as Ken Lay, Jeff Skilling, and Andy Fastow, as well as lesser known players like Cliff Baxter and Rebecca Mark. Smartest Guys in the Room is a story of greed, arrogance, and deceit&#x2014;a microcosm of all that is wrong with American business today. Above all, it&apos;s a fascinating human drama that will prove to be the authoritative account of the Enron scandal.\r\n \r\nThe Enron scandal brought down one of the most &quot;admired&quot; companies of the 1990s. Countless books and articles were written about it, but only The Smartest Guys in the Room holds up a decade later as the definitive narrative. For this tenth anniversary edition, McLean and Elkind have revisited the fall of Enron and its aftermath, in a new chapter that asks why Enron still matters. They also reveal the fates of the key players in the scandal","last_updated":"2017-06-03T12:05:37.472Z","parsed":{"xt":"urn:btih:68094548cbb55a5841edafea70bbc0068b3e45f7","dn":"The Smartest Guys in the Room: The Rise and Fall of Enron","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"68094548cbb55a5841edafea70bbc0068b3e45f7","infoHashBuffer":{"type":"Buffer","data":[104,9,69,72,203,181,90,88,65,237,175,234,112,187,192,6,139,62,69,247]},"name":"The Smartest Guys in the Room: The Rise and Fall of Enron","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}