{"title":"BBC Two - Curious Creatures Season 1 Complete S01 720p x264","magnet":"magnet:?xt=urn:btih:68bf49f1124aa8ca479fb88af29dd30186bf86e0&dn=BBC+Two+-+Curious+Creatures+Season+1+Complete+S01+720p+x264&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"SectorVector","categoryP":"video","categoryS":"hd___tv_shows","size":"5182602217","seeders":"4","leechers":"16","description":"Kate Humble hosts a quiz show delving into the animal kingdom. Take a walk on the wild side with Kate, team captains Chris Packham and Lucy Cooke and our wildlife experts!\n\n\nThe programme, Curious Creatures, will be an entertaining and enlightening show that celebrates all facets of the fascinating world of the animal kingdom. It will be packed with breath-taking natural history clips, extraordinary animal facts and spirited debate.\n\nIn each show, two competing teams will go head-to-head - captained by wildlife experts Chris Packham and Lucy Cooke. Across a variety of intriguing rounds the experts&#x2019; knowledge of wild beasts will be tested to the limit.\n\nIs the tongue of a blue whale heavier than a black rhino? Can the teams identify the mystery growl? When our captains inspect some animal droppings, can they ascertain the origin of the faeces!?\n\nIn each round a team&#x2019;s correct answer wins a body part from a mysterious animal. So as the show progresses each team will build their very own bespoke beast. To win, the teams must correctly identify the parts of their Curious Creature in the endgame.\n\n...\n\nRef:\nhttp://www.bbc.co.uk/mediacentre/latestnews/2017/curious-creatures <a href=\"\nhttp://www.bbc.co.uk/programmes/b08w9yr7\" rel=\"nofollow\" target=\"_NEW\">\nhttp://www.bbc.co.uk/programmes/b08w9yr7</a>\n\n-----------------------------------------------------------------------------\n\nEpisode 1\n Chris Packham and Lucy Cooke are joined by wildlife wonders Iolo Williams and Lizzie Daly.\n\nEpisode 2\n In this quiz show all about the wonders of the animal world, Kate Humble, Chris Packham and Lucy Cooke take a look at all creatures great and small. Niall Strawson and Ferne Corrigan are the panellists.\n\nEpisode 3\n In this animal quiz show, Kate Humble, Chris Packham and Lucy Cooke take a look at all creatures great and small. Martin Hughes-Games and Lindsey Chapman are today&#x2019;s panellists.\n\nEpisode 4\n In this animal quiz show, Kate Humble, Chris Packham and Lucy Cooke take a look at all creatures great and small. Steve Leonard and Christy Harrison join the team captains.\n\nEpisode 5\n Kate Humble hosts the quiz show which delves into the animal kingdom. Team captains Chris Packham and Lucy Cooke are joined by wildlife wonders Niall Strawson and Simon King.\n\nEpisode 6\n Step into the realm of all things wild and wonderful with the quiz show hosted by Kate Humble. Team captains Lucy Cooke and Chris Packham welcome guest panellists Miranda Krestovnikoff and Simon King.\n\nEpisode 7\n Join Kate Humble as she hosts the quiz show all about the wonderful world of animals. Team captains Chris Packham and Lucy Cooke are joined today by animal specialists Steve Backshall and Ajay Tegala.\n\nEpisode 8\n Get your animal kingdom fix with this fun new quiz show hosted by Kate Humble. Vim Kumaratunga and Lindsey Chapman join team captains Lucy Cooke and Chris Packham.\n\nEpisode 9\n Calling all animal lovers! Kate Humble hosts this entertaining quiz show all about the fascinating world of animals. Wildlife buffs Steve Leonard and Miranda Krestovnikoff team up with team captains Lucy Cooke and Chris Packham in this episode.\n\nEpisode 10\n Brush up on your wildlife knowledge with Kate Humble, Chris Packham and Lucy Cooke in this quiz show. Team captains Lucy and Chris are joined by animal experts Vianet Djenguet and Steve Backshall.\n\n\n&apos; ----------------- &apos;\n\n| Kindly seed back. |\n\n&apos; ----------------- &apos;\n\n-_-","last_updated":"2017-07-04T12:03:35.981Z","parsed":{"xt":"urn:btih:68bf49f1124aa8ca479fb88af29dd30186bf86e0","dn":"BBC Two - Curious Creatures Season 1 Complete S01 720p x264","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"68bf49f1124aa8ca479fb88af29dd30186bf86e0","infoHashBuffer":{"type":"Buffer","data":[104,191,73,241,18,74,168,202,71,159,184,138,242,157,211,1,134,191,134,224]},"name":"BBC Two - Curious Creatures Season 1 Complete S01 720p x264","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}