{"title":"The King Who Had To Go: Edward VIII and the Hidden Politics of..","magnet":"magnet:?xt=urn:btih:6a43b0d1b2298915fd357ac5bda183abfcc1135b&dn=The+King+Who+Had+To+Go%3A+Edward+VIII+and+the+Hidden+Politics+of..&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1746499","seeders":"64","leechers":"5","description":"The King Who Had To Go: Edward VIII, Mrs Simpson and the Hidden Politics of the Abdication Crisis - Adrian Phillips [epub]\r\n\r\nThe previously untold story of the hidden politics that went on behind the scenes during the handling of the Royal abdication crisis of 1936.\r\n\r\nThe King Who Had to Go describes the harsh realities of how the machinery of government responds when even the King steps out of line. It reveals the pitiless and insidious battles in Westminster and Whitehall that settled the fate of the King and Mrs Simpson. Prime Minister Stanley Baldwin had to fight against ministers and civil servants who were determined to pressure the King into giving up Mrs Simpson and, when that failed, into abdicating.\r\n\r\nDubious police reports on Mrs Simpson&apos;s sex life poisoned the government&apos;s view of her and were used to blacken her reputation. Threats to sabotage her divorce were deployed to edge the King towards abdication. Covert intelligence operations convinced the hardliners that the badly coordinated and hopeless attempts of the King&apos;s allies, particularly Winston Churchill, to keep him on the throne amounted to a sinister anti-constitutional conspiracy.\r\n\r\nThe book also shows how the King doomed his chances of keeping the throne by wildly unrealistic goals and ill-thought -out schemes. As each side was overwhelmed by desperation and distrust, Baldwin somehow held the balance and steered the crisis to as smooth a conclusion as possible","last_updated":"2017-05-24T11:46:23.819Z","parsed":{"xt":"urn:btih:6a43b0d1b2298915fd357ac5bda183abfcc1135b","dn":"The King Who Had To Go: Edward VIII and the Hidden Politics of..","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6a43b0d1b2298915fd357ac5bda183abfcc1135b","infoHashBuffer":{"type":"Buffer","data":[106,67,176,209,178,41,137,21,253,53,122,197,189,161,131,171,252,193,19,91]},"name":"The King Who Had To Go: Edward VIII and the Hidden Politics of..","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}