{"title":"Clone Drone in the Danger Zone v0.9.0.25","magnet":"magnet:?xt=urn:btih:6ab2ecb16be2e39e23de779d726b0d4acd7419ca&dn=Clone+Drone+in+the+Danger+Zone+v0.9.0.25&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"159078781","seeders":"12","leechers":"7","description":"CONGRATULATIONS HUMAN! Apologies for the brief agony while we harvested your mind. But now your thought patterns are safely encased in this sleek, shiny robot!With a laser sword.SURVIVE AND PERHAPS YOU WILL EARN UPGRADES.GOOD LUCK IN THE ARENA.We hope you survive longer than the last contestant...Oh, and the one before that...Game Modes1. Story Mode - One part epic tale of human defiance, another part laser swords.2. Endless Mode - Challenge yourself to fight through 86 level variants spread across 5 difficulty tiers. Can you make it to TITANIUM ?3. Twitch Mode - TWITCH PLAYS YOU. Your Twitch stream viewers earn coins, bet on your gameplay and spawn enemies to kill you (or give you s&#x2014;if they really like you). !spawn jetpack2 Kappa Kappa Kappa4. Challenge Mode - Bow-only, hammer-only, can you still survive the arena?5. Level Editor - Make custom levels and challenges and share them with other humans! Explore the rich Workshop library of awesome human-built levels!Features (in the game right now!) Epic Voxel Dismemberment: In addition to looking cool, the ability to cut off body parts is central to the gameplay. Jumping on one leg is a common occurrence. Large enemies need to be cut down to size before a fatal blow can be delivered. Sharp Sword Combat: Combat is fast and intense, putting great emphasis on movement, timing and positioning. You are never safe, as any blow can instantly kill or dismember. Entertaining Commentary","last_updated":"2017-06-28T12:07:11.061Z","parsed":{"xt":"urn:btih:6ab2ecb16be2e39e23de779d726b0d4acd7419ca","dn":"Clone Drone in the Danger Zone v0.9.0.25","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6ab2ecb16be2e39e23de779d726b0d4acd7419ca","infoHashBuffer":{"type":"Buffer","data":[106,178,236,177,107,226,227,158,35,222,119,157,114,107,13,74,205,116,25,202]},"name":"Clone Drone in the Danger Zone v0.9.0.25","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}