{"title":"Death Match by Lincoln Child EPUB","magnet":"magnet:?xt=urn:btih:6b88ac99ac719e21d61769419ef44548d480d1ed&dn=Death+Match+by+Lincoln+Child+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3105446","seeders":"0","leechers":"0","description":"xx\r\n\r\nDeath Match by Lincoln Child EPUB\r\n\r\nLewis and Lindsay Thorpe were the perfect couple: young, attractive, and ideally matched. But the veil of perfection can mask many blemishes. When the Thorpes are found dead in their tasteful Flagstaff living room (having committed double suicide), alarms go off in the towering Manhattan offices of Eden Incorporated, the high-tech matchmaking company whose spectacular success and legendary secrecy have inspired awe around the world. The Thorpes, few people knew, were more than the quintessential happy couple - they were Eden&apos;s first perfect match.\r\n\r\nA short time later, Christopher Lash, a gifted former FBI forensic psychologist, receives an urgent plea from Eden to perform a quick - and quiet - investigation into the deaths. Lash&apos;s psychological autopsy reveals nothing suspicious but inadvertently dredges up the memories of a searing personal tragedy he has kept at bay for years.\r\n\r\nThe situation changes suddenly when a second Eden couple is found dead - by all appearances, another double suicide. Now Eden - particularly Richard Silver, the company&apos;s brilliant and reclusive founder - has no choice but to grant Lash unprecedented access to its most guarded secrets if he is to have any chance of determining what is going wrong. The hidden world he discovers is a stunning labyrinth of artificial intelligence, creative genius, and a melding of technology that does indeed, to Lash&apos;s surprise, deliver on Eden&apos;s promise to its clients: the guarantee of a perfect lifelong mate. But Lash&apos;s involvement in the investigation becomes more personal and dangerous than he could have imagined, nearly as soon as it begins.\r\n\r\nWith tremendous imagination and skill, master thriller writer Lincoln Child renders a setting too frighteningly believable not to be real. Infused with relentless suspense and a riveting pace, Death Match is Child at his best.\r\n\r\nxx","last_updated":"2017-11-02T12:04:22.024Z","parsed":{"xt":"urn:btih:6b88ac99ac719e21d61769419ef44548d480d1ed","dn":"Death Match by Lincoln Child EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6b88ac99ac719e21d61769419ef44548d480d1ed","infoHashBuffer":{"type":"Buffer","data":[107,136,172,153,172,113,158,33,214,23,105,65,158,244,69,72,212,128,209,237]},"name":"Death Match by Lincoln Child EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}