{"title":"So You Think You Can Dance USA - Season 11","magnet":"magnet:?xt=urn:btih:6c39e1ffc87eceb4dba4d656d4e841a8441f8e95&dn=So+You+Think+You+Can+Dance+USA+-+Season+11&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Invader97","categoryP":"video","categoryS":"tv_shows","size":"12207255202","seeders":"1","leechers":"2","description":"So You Think You Can Dance, an American dance competition show, returned for its eleventh season on Wednesday, May 28, 2014. The commission of an eleventh season was first announced by series creator Nigel Lythgoe on the September 10, 2013 telecast of the season 10 finale. Lythgoe, the executive producer, and ballroom expert Mary Murphy, were again the two permanent members of the judges&apos; panel, while Cat Deeley continued in her role as host for a tenth consecutive season.\r\n\r\nIn a change from the procedure of the previous nine seasons, in which post-open-audition callbacks were held in Las Vegas and referenced collectively as &quot;Vegas Week&quot;, season 11&apos;s callbacks were held in Los Angeles, with no special nomenclature. A total of 157 dancers began the week by performing a solo. Those not cut at this point went on to learn and perform various styles of choreography, with cuts being made after every round. At the end of the final round, 44 dancers remained. Finally, at the end of the callbacks week, as in most previous seasons of So You Think You Can Dance, ten female and ten male contestants were selected for the upcoming performance shows.\r\n\r\nThis season saw the show eliminate interactive viewer participation by telephone, with producers preferring to divert weekly voting to the show&apos;s website and the network&apos;s new proprietary smartphone app, a process that reduced the overall number of votes each participating viewer could cast each week. Enjoy!","last_updated":"2017-12-10T12:01:50.610Z","parsed":{"xt":"urn:btih:6c39e1ffc87eceb4dba4d656d4e841a8441f8e95","dn":"So You Think You Can Dance USA - Season 11","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6c39e1ffc87eceb4dba4d656d4e841a8441f8e95","infoHashBuffer":{"type":"Buffer","data":[108,57,225,255,200,126,206,180,219,164,214,86,212,232,65,168,68,31,142,149]},"name":"So You Think You Can Dance USA - Season 11","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}