{"title":"\nManly Palmer Hall - All his lectures in mp3 format","magnet":"magnet:?xt=urn:btih:6c6d9e9ac16b21fca4e3943846d65c69d06d95f2&dn=Manly+Palmer+Hall+-+All+his+lectures+in+mp3+format&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"hawthonn","categoryP":"audio","categoryS":"audio_books","size":"8158981886","seeders":"0","leechers":"0","description":"Manly Palmer Hall audio lectures, in mp3 format, organised into subjects.\r\n\r\nThis torrent contains all the Manly Palmer Hall audio lectures that are currently available on the web. Where several different recordings of the same lecture were found, the ones with the best audio quality were of course selected.\r\n\r\nThe file names have been shortened, because the length of the original file names, coupled with the fact that they contained unusual characters, such as &apos;&amp;&apos; and &apos;&quot;&apos; symbols, meant that problems were sometimes occurring when trying to transfer the mp3&apos;s from one device to another. I.e. they wouldn&apos;t transfer.  But no vital information has been lost, in most cases the name of the folder that the file was located in was simply removed from the file name.\r\n\r\nThe final amendment made, was to add &apos;folder.jpg&apos; images to every folder that didn&apos;t already contain one. This is an image that displays in media players, that&apos;s relevant to the subject of the audio being played. I.e. all the different subjects now have their own unique &apos;album art&apos;, so you can see what subject is playing at a glance.\r\n\r\nThe audio quality of some of these old recordings is quite poor, almost unlistenable in some cases, but these questionable files were left in this collection, because different people have different standards for determining what is and isn&apos;t listenable. Plus, some kindly audio wizard might one day take these files and clean them up, before re-uploading them for the benefit of others. Passing the lantern on, so to speak, with a fresh wick and clean oil.\r\n\r\nMay you enjoy and benefit from these fascinating, amusing and enlightening lectures","last_updated":"2017-10-22T12:01:03.528Z","parsed":{"xt":"urn:btih:6c6d9e9ac16b21fca4e3943846d65c69d06d95f2","dn":"Manly Palmer Hall - All his lectures in mp3 format","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6c6d9e9ac16b21fca4e3943846d65c69d06d95f2","infoHashBuffer":{"type":"Buffer","data":[108,109,158,154,193,107,33,252,164,227,148,56,70,214,92,105,208,109,149,242]},"name":"Manly Palmer Hall - All his lectures in mp3 format","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}