{"title":"The New Superpower for Women (gnv64)","magnet":"magnet:?xt=urn:btih:6ca122b0066bacbb7f16e8935af421eec55a0658&dn=The+New+Superpower+for+Women+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"24682348","seeders":"3","leechers":"43","description":"The New Superpower for Women\r\nBy Steve Kardian\r\nTouchstone | August 2017 | ISBN-10: 1501159240 | ePUB | 22.9 mb\r\n\r\nIt takes only seven seconds for a criminal to pick you as a target. This empowering guide for women to protect themselves and their loved ones, from a self-defense expert and longtime veteran of law enforcement, combines commonsense advice on staying safe with concrete actions on what to do if find yourself in a dangerous situation.\r\nActs of terror. Kidnapping. Cyberstalking. Campus assaults. Getting drugged at a party by a &quot;friend.&quot; One out of four women will be a victim of a crime or assault in her lifetime. Don&apos;t let this be you.\r\nIn The New Superpower for Women, Steve Kardian, a thirty-year veteran of law enforcement, FBI defense tactics instructor, and an expert on the criminal mind, demonstrates how to become a &quot;hard target&quot; and not a &quot;soft target&quot; by simply trusting your gut. Additionally, he shows how the habits of safety can become an integral part of your daily routine.\r\nThis guide is your essential resource to understanding how to stay safe in today&apos;s world, whether you&apos;re experiencing unwelcome attention, feel threatened in a large crowd, or are facing online harassment. Kardian shares proven safety tips, shows how to be proactive in identifying potential trouble, and illustrates defense techniques specially created to enhance the physical strengths of a woman. Real-life stories and examples are included to demonstrate what criminals look for in a victim. You will learn how to avoid being targeted and what to do in a confrontation.\r\nBe prepared. Know the habits of safety to protect yourself and your loved ones.\r\n\r\nAbout the Author\r\nSteve Kardian spent more than thirty years as a career law enforcement officer, including time as an FBI defense tactics instructor. He is a partner at Defend University, a self-defense program created specifically for women that has trained and educated over 100,000 women of all ages.  Kardian has dedicated his career to teaching women about safety, risk reduction, and crime prevention.  He holds a 3rd degree black belt and the title of professor in Gracie Jiu-Jitsu. Kardian has been featured in media outlets such as The New York Times, The Wall Street Journal, USA TODAY, Real Simple, Women&#x2019;s Day, and Cosmopolitan.  He appears regularly as an expert in national media, including Fox News, Fox and Friends, Fox Business, CNN, Inside Edition, Headline News, Nightline, The Meredith Vieira Show, Kathy Lee &amp; Hoda, Dr. Drew, and Dr. Phil.  He lives in Westchester, New York, and is the author of The New Superpower for Women.\r\n <a href=\"\nhttps://s14.postimg.org/avokiqpdd/The_New_Superpower_for_Women.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s14.postimg.org/avokiqpdd/The_New_Superpower_for_Women.jpg</a>","last_updated":"2017-12-29T12:02:08.779Z","parsed":{"xt":"urn:btih:6ca122b0066bacbb7f16e8935af421eec55a0658","dn":"The New Superpower for Women (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6ca122b0066bacbb7f16e8935af421eec55a0658","infoHashBuffer":{"type":"Buffer","data":[108,161,34,176,6,107,172,187,127,22,232,147,90,244,33,238,197,90,6,88]},"name":"The New Superpower for Women (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}