{"title":"\nIt Takes a Tribe_ Building the Tough Mudder Movement by Will Dea","magnet":"magnet:?xt=urn:btih:6cadbd87c080ec34fc2a06b64918a2be856ed6f5&dn=It+Takes+a+Tribe_+Building+the+Tough+Mudder+Movement+by+Will+Dea&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"26110100","seeders":"22","leechers":"5","description":"xx\r\n\r\nIt Takes a Tribe_ Building the Tough Mudder Movement by Will Dean 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe founder of Tough Mudder - the world&apos;s greatest obstacle course races - takes us inside his unconventional company and reveals how tribes form and grow in surprising and powerful ways.\r\n\r\nWith a lot of moxie and mud, Will Dean founded Tough Mudder in 2008. Shunning the advice of his business school professors, who told him he was crazy, Dean was determined not to follow his fellow Harvard Business School classmates to Wall Street or Silicon Valley. Instead, he staged the first Tough Mudder event in Allentown, Pennsylvania, building an obstacle course that included a plunge into ice water and a slide down the side of a mountain, and ended with a sprint through flaming stacks of hay bales.\r\n\r\nIt might sound like torture, but early participants loved it and came back for more - much more. More than 2.5 million people on three continents have now done at least one Tough Mudder event, with new &quot;Mudders&quot; joining the tribe every day.\r\n\r\nThe company&apos;s astoundingly rapid growth might seem inexplicable until you experience the camaraderie, iconoclastic spirit, and pure adrenaline of a Tough Mudder event. Dean has created not only a revolutionary business model but a true phenomenon: a true global tribe. His book reveals, among other things:\r\n\r\nWhy challenge, not competition, is the key to inspiring communities\r\nHow to constantly innovate to stand out in a crowded market\r\nHow to inspire the kind of deep brand loyalty that leads to tattooed logos\r\n\r\nDean&apos;s entrepreneurial story isn&apos;t a typical case study. The book is filled with colorful adventures and counterintuitive advice for every entrepreneur who wants to build a truly unique tribal business.\r\n\r\nxx","last_updated":"2017-09-24T12:02:47.050Z","parsed":{"xt":"urn:btih:6cadbd87c080ec34fc2a06b64918a2be856ed6f5","dn":"It Takes a Tribe_ Building the Tough Mudder Movement by Will Dea","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6cadbd87c080ec34fc2a06b64918a2be856ed6f5","infoHashBuffer":{"type":"Buffer","data":[108,173,189,135,192,128,236,52,252,42,6,182,73,24,162,190,133,110,214,245]},"name":"It Takes a Tribe_ Building the Tough Mudder Movement by Will Dea","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}