{"title":"Great Teams by Don Yaeger EPUB","magnet":"magnet:?xt=urn:btih:6d3343b0276f9e8c80c1be467e0dbcd1862a2ed3&dn=Great+Teams+by+Don+Yaeger+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"796216","seeders":"35","leechers":"6","description":"xx\r\n\r\nGreat Teams by Don Yaeger EPUB\r\n\r\nWhat makes a team great? Not just good. Not just functional. But great?\r\n\r\nOver the last six years, longtime Sports Illustrated associate editor Don Yaeger has been invited by some of the greatest companies in the world to speak about the habits of high-performing individuals. Delivering an average of 80 keynote speeches per year, Don was approached by his most consistent client, Microsoft, to develop a talk on what allowed some teams to play at a championship level year after year. From Microsoft and Starbucks to the New England Patriots and San Antonio Spurs, what do some organizations do seemingly better than most all of their opponents?\r\n\r\nDon took the challenge. He began building into his travel schedule opportunities to interview our generation&apos;s greatest team builders from the sports and business worlds. During this process he has conducted more than 100 interviews with some of the most successful teams and organizations in the country. From those interviews Don has identified 16 habits that drive these high-performing teams.\r\n\r\nBuilding on the stories, examples, and firsthand accounts, each chapter in Great Teams comes with applicable examples of how to apply these characteristics in any organization. Great Teams is the ultimate intersection of the sports and business worlds and a powerful companion for thought leaders, teams, managers, and organizations that seek to perform similarly. The insight shared in this book is sure to enhance any team in its pursuit of excellence.\r\n\r\nxx","last_updated":"2017-12-09T12:08:45.731Z","parsed":{"xt":"urn:btih:6d3343b0276f9e8c80c1be467e0dbcd1862a2ed3","dn":"Great Teams by Don Yaeger EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6d3343b0276f9e8c80c1be467e0dbcd1862a2ed3","infoHashBuffer":{"type":"Buffer","data":[109,51,67,176,39,111,158,140,128,193,190,70,126,13,188,209,134,42,46,211]},"name":"Great Teams by Don Yaeger EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}