{"title":"The Perfect Neighbors by Sarah Pekkanen EPUB","magnet":"magnet:?xt=urn:btih:6d98c39a2818b8d5be27d5d45ea2c61a624ef1ef&dn=The+Perfect+Neighbors+by+Sarah+Pekkanen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1727047","seeders":"41","leechers":"8","description":"xx\r\n\r\nThe Perfect Neighbors by Sarah Pekkanen EPUB\r\n\r\nThe pause-resisting new novel from the internationally best-selling author known for her &quot;conversational writing style and a knack for making readers care about her characters&quot; (The Washington Post) takes us into the homes of an idyllic suburban neighborhood where we discover the burning secrets hiding just below the surface.\r\n\r\nBucolic Newport Cove, where spontaneous block parties occur on balmy nights and all of the streets are named for flowers, is proud of its distinction of being named one the top 20 safest neighborhoods in the US.\r\n\r\nIt&apos;s also one of the most secret-filled.\r\n\r\nKellie Scott has just returned to work after a decade of being a stay-at-home mom. She&apos;s adjusting to high heels, scrambling to cook dinner for her family after a day at the office - and soaking in the dangerous attention of a very handsome, very married male colleague.\r\n\r\nKellie&apos;s neighbor, Susan Barrett, begins every day with fresh resolutions: She won&apos;t eat any carbs, she&apos;ll go to bed at a reasonable hour, and she&apos;ll stop stalking her ex-husband and his new girlfriend.\r\n\r\nGigi Kennedy seems to have it all together - except her teenage daughter has turned into astranger, and her husband is running for Congress, which means her old skeletons are in danger of being brought into the light.\r\n\r\nThen a new family moves to this quiet, tree-lined cul-de-sac. Tessa Campbell seems friendly enough to the other mothers, if a bit reserved. Then the neighbors notice that no one is ever invited to Tessa&apos;s house. And soon it becomes clear that Tessa is hiding the biggest secret of all.\r\n\r\nxx","last_updated":"2017-12-31T12:06:19.351Z","parsed":{"xt":"urn:btih:6d98c39a2818b8d5be27d5d45ea2c61a624ef1ef","dn":"The Perfect Neighbors by Sarah Pekkanen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6d98c39a2818b8d5be27d5d45ea2c61a624ef1ef","infoHashBuffer":{"type":"Buffer","data":[109,152,195,154,40,24,184,213,190,39,213,212,94,162,198,26,98,78,241,239]},"name":"The Perfect Neighbors by Sarah Pekkanen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}