{"title":"\nI'm Dying Up Here_ Heartbreak and High Times in Stand-Up Comedy'","magnet":"magnet:?xt=urn:btih:6da139ee7c00c0990b00a8c3d340a5fe008cb581&dn=I%27m+Dying+Up+Here_+Heartbreak+and+High+Times+in+Stand-Up+Comedy%27&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"3778723","seeders":"0","leechers":"0","description":"xx\r\n\r\nI&apos;m Dying Up Here_ Heartbreak and High Times in Stand-Up Comedy&apos;s Golden Era by William Knoedelseder MOBI eBOOK-ZAK\r\n\r\nI&apos;m Dying Up Here chronicles the collective coming of age of the standup comedians who defined American humor during the past three decades. Born early in the Baby Boom, they grew up watching The Tonight show, went to school during Vietnam and Watergate, migrated en masse to Los Angeles in the mid-1970s, and created an artistic community unlike any before or since.\r\n\r\nThey were arguably the funniest people of their generation, living in a late-night world of sex, drugs, dreams, and laughter. For one brief shining moment, standup comics were as revered as rock stars. It was Comedy Camelot but, of course, it couldn&apos;t last.\r\n\r\nIn the late 1970s, William Knoedelseder was a cub reporter assigned to cover the burgeoning local comedy scene for the Los Angeles Times. He wrote the first major newspaper profiles of Jay Leno, David Letterman, Andy Kaufman, and others. He got to know many of them well. And so he covered the scene too when the comedians--who were not paid for performing at the career-making-or-breaking venue called the Comedy Store---tried to change an exploitative system and incidentally tore apart their own close-knit community.\r\n\r\nNow Knoedelseder has gone back to interview the major participants to tell the whole story of that golden age and of the strike that ended it. Full of revealing portraits of many of the best-known comedic talents of our age, I&apos;m Dying Up Here is also a poignant tale of the price of success and the terrible cost of failure - professional and moral.\r\n\r\nxx","last_updated":"2017-09-30T12:04:31.027Z","parsed":{"xt":"urn:btih:6da139ee7c00c0990b00a8c3d340a5fe008cb581","dn":"I'm Dying Up Here_ Heartbreak and High Times in Stand-Up Comedy'","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6da139ee7c00c0990b00a8c3d340a5fe008cb581","infoHashBuffer":{"type":"Buffer","data":[109,161,57,238,124,0,192,153,11,0,168,195,211,64,165,254,0,140,181,129]},"name":"I'm Dying Up Here_ Heartbreak and High Times in Stand-Up Comedy'","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}