{"title":"Awesome Miner 4.2.7 full Ultimate Plus_KeyGen","magnet":"magnet:?xt=urn:btih:6e0fd30ec6c8b5da80e41655059237b75b670a0a&dn=Awesome+Miner+4.2.7+full+Ultimate+Plus_KeyGen&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ferrantoD","categoryP":"applications","categoryS":"windows","size":"8169756","seeders":"4","leechers":"1","description":"Manage and monitor mining of Bitcoin, Litecoin, Ethereum and more Centralized management for up to 5000 miners. \r\n\r\nProfitability Switching\r\nAwesome Miner Next generation profitability switching uses both real-time multi-pool statistics and coin statistics to automatically switch between multiple pools, algorithms and mining software to always ensure highest possible profitability.\r\nAwesome Miner can also display information, exchange rates and do profitability calculations for Bitcoin, Litecoin and all other popular coins.\r\n\r\nNotifications and Recovery\r\nAwesome Miner can show Desktop Notifications on the Windows desktop to alert about mining issues. Notifications can also be sent by e-mail.\r\nDetection of failing devices, high temperatures, slow mining progress, hanging miners and disconnected miners. Automatic restart miners with problems, with fully customizable triggers and actions. \r\n\r\nMultiple Mining Engines\r\nAwesome Miner has support for multiple mining engines. A total of 11 mining engines are supported, including Cgminer, Bfgminer, Sgminer and several Claymore miners.\r\nAwesome Miner supports all popular mining algorithms. A total of 26 algorithms are supported including SHA-256, Scrypt, X11, Ethereum and Zcash.\r\n\r\nPool Management\r\nAdd, switch and manage mining pools easily. Track the status of each pool and define coin to see profitability.\r\nThe Switch pool operation can be performed for multiple miners in a single operation, making pool switches for large number of miners efficient.\r\n\r\nGPU and Devices\r\nMonitor the status and temperature of GPU, FPGA, ASIC devices. System information available for CPU, GPU, memory and storage.\r\nLarge scale GPU overclocking and configuration settings for remote systems without dependency on mining software having to run.\r\n\r\nWeb and Mobile\r\nAwesome Miner is a Windows application, but also offers a built-in web frontend that can be accessed from any computer, tablet or smart phone. No complicated installations are required, everything is ready to use once Awesome Miner is running.\r\nThe web interface gives an overview of all miners, detailed information about selected miners and provides operations for starting and stopping the miners","last_updated":"2017-12-23T12:06:21.500Z","parsed":{"xt":"urn:btih:6e0fd30ec6c8b5da80e41655059237b75b670a0a","dn":"Awesome Miner 4.2.7 full Ultimate Plus_KeyGen","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6e0fd30ec6c8b5da80e41655059237b75b670a0a","infoHashBuffer":{"type":"Buffer","data":[110,15,211,14,198,200,181,218,128,228,22,85,5,146,55,183,91,103,10,10]},"name":"Awesome Miner 4.2.7 full Ultimate Plus_KeyGen","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}