{"title":"Tom Doyle - Captain Fantastic 2017 RETAiL ePUB eBOOK-DiSTRiBUTiO","magnet":"magnet:?xt=urn:btih:6e58972b9eb112269649d386c5da4f499062b52e&dn=Tom+Doyle+-+Captain+Fantastic+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"22992764","seeders":"13","leechers":"5","description":"\r\nTom Doyle - Captain Fantastic 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nBased on rare one-on-one interviews with the flamboyant rock &apos;n&apos; roll icon, this is the first book to trace Elton John&apos;s meteoric rise from obscurity to worldwide celebrity in the wildest, weirdest decade of the 20th century.\r\n\r\nIn August 1970, Elton John achieved overnight fame with a rousing performance at the Troubadour in Los Angeles. Over the next five years, the artist formerly known as Reginald Dwight went from unheard of to unstoppable, scoring seven consecutive number-one albums and 16 Top Ten singles in America. By the middle of the decade, he was solely responsible for two percent of global record sales. One in 50 albums sold in the world bore his name. Elton John&apos;s live shows became raucous theatrical extravaganzas, attended by all the glitterati of the era.\r\n\r\nBut beneath the spangled bodysuits and oversized eyeglasses, Elton was a desperately shy man, conflicted about his success, his sexuality, and his narcotic indulgences. In 1975, at the height of his fame, he attempted suicide. After coming out as bisexual in a controversial Rolling Stone interview that nearly wrecked his career, and announcing his retirement from live performance in 1977 at the age of 30, he gradually found his way back to the thing he cared about most: the music.\r\n\r\nCaptain Fantastic gives listeners a behind-the-scenes look at the rise, fall, and return to glory of one of the world&apos;s most mercurial performers. Rock journalist Tom Doyle&apos;s insider account of the Rocket Man&apos;s turbulent ascent is based on a series of one-on-one interviews in which Elton laid bare many previously unrevealed details of his early career. Here is an intimate exploration of Elton&apos;s working relationship with songwriting partner Bernie Taupin, whose lyrics often chronicled the ups and downs of their life together in the spotlight. Through this book passes a parade of legends whose paths crossed with Elton&apos;s during the decade - including John Lennon, Bob Dylan, Groucho Marx, Katharine Hepburn, Princess Margaret, Elvis Presley, and an acid-damaged Brian Wilson.\r\n\r\nA fascinating portrait of the artist at the apex of his celebrity, Captain Fantastic takes us on a rollicking fame-and-drug-fueled ride aboard Elton John&apos;s rocket ship to superstardom","last_updated":"2017-05-29T13:18:05.405Z","parsed":{"xt":"urn:btih:6e58972b9eb112269649d386c5da4f499062b52e","dn":"Tom Doyle - Captain Fantastic 2017 RETAiL ePUB eBOOK-DiSTRiBUTiO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6e58972b9eb112269649d386c5da4f499062b52e","infoHashBuffer":{"type":"Buffer","data":[110,88,151,43,158,177,18,38,150,73,211,134,197,218,79,73,144,98,181,46]},"name":"Tom Doyle - Captain Fantastic 2017 RETAiL ePUB eBOOK-DiSTRiBUTiO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}