{"title":"\nThe Upward Spiral_ Using Neuroscience to Reverse the Course of D","magnet":"magnet:?xt=urn:btih:6ebaa5207349a87214abbbacc8d4a7ea93688fbd&dn=The+Upward+Spiral_+Using+Neuroscience+to+Reverse+the+Course+of+D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3301165","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Upward Spiral_ Using Neuroscience to Reverse the Course of Depression, One Small Change at a Time by Alex Korb ePUB eBOOK-ZAK\r\n\r\nDepression can feel like a downward spiral, pulling you down into a vortex of sadness, fatigue, and apathy. Based in the latest research in neuroscience, this book offers dozens of little things you can do every day to rewire your brain and create an upward spiral toward a happier, healthier life.\r\n\r\nDepression doesn&apos;t happen all at once. It starts gradually and builds momentum over time. If you go through a difficult experience, you may stop taking care of yourself. You may stop exercising and eating healthy, which will end up making you feel even worse as time goes on. You are caught in a downward spiral, but you may feel too tired, too overwhelmed, and too scared to try to pull yourself back up. The good news is that just one small step can be a step in the right direction.\r\n\r\nIn The Upward Spiral, neuroscientist Alex Korb demystifies the neurological processes in the brain that cause depression and offers effective ways to get better--one little step at a time. In the book, you&apos;ll discover that there isn&apos;t &quot;one big solution&quot; that will solve your depression. Instead, there are dozens of small, practical things you can do to alleviate your symptoms and start healing. Some are as simple as relaxing certain muscles to reduce feelings of anxiety while others involve making small efforts toward more positive social interactions. Small steps in the right direction can have profound effects--giving you the power literally to &quot;reshape&quot; your brain.\r\n\r\nLike most people, you probably didn&apos;t wake up one day and find yourself completely depressed. Instead, it probably happened over time, as a series of reactions to difficult situations and negative thinking. But if you are ready to reverse the trajectory of your depression and find lasting happiness, this book will show you how.\r\n\r\nxx","last_updated":"2017-09-28T12:01:08.697Z","parsed":{"xt":"urn:btih:6ebaa5207349a87214abbbacc8d4a7ea93688fbd","dn":"The Upward Spiral_ Using Neuroscience to Reverse the Course of D","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6ebaa5207349a87214abbbacc8d4a7ea93688fbd","infoHashBuffer":{"type":"Buffer","data":[110,186,165,32,115,73,168,114,20,171,187,172,200,212,167,234,147,104,143,189]},"name":"The Upward Spiral_ Using Neuroscience to Reverse the Course of D","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}