{"title":"Fear City by Kim Phillips-Fein 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","magnet":"magnet:?xt=urn:btih:6eedbc769e00f529de1eeab9ec62320a031f7c7b&dn=Fear+City+by+Kim+Phillips-Fein+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14676929","seeders":"0","leechers":"0","description":"xx\r\n\r\nFear City by Kim Phillips-Fein 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn epic, riveting history of New York City on the edge of disaster - and an anatomy of the austerity politics that continue to shape the world today.\r\n\r\nWhen the news broke in 1975 that New York City was on the brink of fiscal collapse, few believed it was possible. How could the country&apos;s largest metropolis fail? How could the capital of the financial world go bankrupt? Yet the city was indeed billions of dollars in the red, with no way to pay back its debts. Bankers and politicians alike seized upon the situation as evidence that social liberalism, which New York famously exemplified, was unworkable. The city had to slash services, freeze wages, and fire thousands of workers, they insisted, or financial apocalypse would ensue.\r\n\r\nIn this vivid account, historian Kim Phillips-Fein tells the remarkable story of the crisis that engulfed the city. With unions and ordinary citizens refusing to accept retrenchment, the budget crunch became a struggle over the soul of New York, pitting fundamentally opposing visions of the city against each other. Drawing on never-before-used archival sources and interviews with key players in the crisis, Fear City shows how the brush with bankruptcy permanently transformed New York - and reshaped ideas about government across America.\r\n\r\nxx","last_updated":"2017-09-02T12:05:20.952Z","parsed":{"xt":"urn:btih:6eedbc769e00f529de1eeab9ec62320a031f7c7b","dn":"Fear City by Kim Phillips-Fein 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6eedbc769e00f529de1eeab9ec62320a031f7c7b","infoHashBuffer":{"type":"Buffer","data":[110,237,188,118,158,0,245,41,222,30,234,185,236,98,50,10,3,31,124,123]},"name":"Fear City by Kim Phillips-Fein 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}