{"title":"The Cooking Gene - A Journey Through African..(2017) Gooner","magnet":"magnet:?xt=urn:btih:6f0d5beff8214fca16b7baa952352c5161f5926c&dn=The+Cooking+Gene+-+A+Journey+Through+African..%282017%29+Gooner&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"5876845","seeders":"0","leechers":"0","description":"The Cooking Gene - A Journey Through African American Culinary History in the Old South (2017) (Epub) Gooner\r\n\r\nPublisher: Amistad Press (Aug. 2017)\r\nAuthor: Michael W Twitty\r\nLanguage: English\r\nISBN-10: 0062379291\r\nISBN-13: 9780062379290\r\n\r\nA renowned culinary historian offers a fresh perspective on our most divisive cultural issue, race, in this illuminating memoir of Southern cuisine and food culture that traces his ancestry--both black and white--through food, from Africa to America and slavery to freedom.\r\n\r\nSouthern food is integral to the American culinary tradition, yet the question of who &quot;owns&quot; it is one of the most provocative touch points in our ongoing struggles over race. In this unique memoir, culinary historian Michael W. Twitty takes readers to the white-hot center of this fight, tracing the roots of his own family and the charged politics surrounding the origins of soul food, barbecue, and all Southern cuisine.\r\n\r\nFrom the tobacco and rice farms of colonial times to plantation kitchens and backbreaking cotton fields, Twitty tells his family story through the foods that enabled his ancestors&apos; survival across three centuries. He sifts through stories, recipes, genetic tests, and historical documents, and travels from Civil War battlefields in Virginia to synagogues in Alabama to Black-owned organic farms in Georgia.\r\n\r\nAs he takes us through his ancestral culinary history, Twitty suggests that healing may come from embracing the discomfort of the Southern past. Along the way, he reveals a truth that is more than skin deep--the power that food has to bring the kin of the enslaved and their former slaveholders to the table, where they can discover the real America together","last_updated":"2017-08-06T12:00:30.393Z","parsed":{"xt":"urn:btih:6f0d5beff8214fca16b7baa952352c5161f5926c","dn":"The Cooking Gene - A Journey Through African..(2017) Gooner","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6f0d5beff8214fca16b7baa952352c5161f5926c","infoHashBuffer":{"type":"Buffer","data":[111,13,91,239,248,33,79,202,22,183,186,169,82,53,44,81,97,245,146,108]},"name":"The Cooking Gene - A Journey Through African..(2017) Gooner","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}