{"title":"\nThe Sky Below_ A True Story of Summits, Space, and Speed by Scot","magnet":"magnet:?xt=urn:btih:6f1630c1843a5d07f15a3af3131af76d356ab9ed&dn=The+Sky+Below_+A+True+Story+of+Summits%2C+Space%2C+and+Speed+by+Scot&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5214958","seeders":"10","leechers":"6","description":"xx\r\n\r\nThe Sky Below_ A True Story of Summits, Space, and Speed by Scott Parazynski and Susy Flory ePUB eBOOK-ZAK\r\n\r\nAn epic memoir from a man whose life is defined by exploration and innovation, The Sky Below re-creates some of the most unforgettable adventures of our time. From dramatic, high-risk spacewalks to author Scott Parazynski&apos;s death-defying quest to summit Mount Everest - his body ravaged by a career in space - readers will experience the life of an elite athlete, physician, and explorer.\r\n\r\nThis intimate, compelling account offers a rare portrait of space exploration from the inside. A global nomad raised in the shadow of NASA&apos;s Apollo missions, Parazynski never lost sight of his childhood dream to one day don a spacesuit and float outside the airlock. With deep passion, unbridled creativity, resilience, humility, and self-deprecation, Parazynski chases his dream of the ultimate adventure experience, again and again and again. In an era that transitioned from moon shots to the Space Shuttle, space station, and Mars research, Parazynski flies with John Glenn, tests jet packs, trains in Russia to become a cosmonaut, and flies five missions to outer space (including seven spacewalks) in his seventeen-year NASA career.\r\n\r\nAn unparalleled, visceral opportunity to understand what it&apos;s like to train for - and deploy to - a home in zero gravity, The Sky Below also portrays an astronaut&apos;s engagement with the challenges of his life on Earth, including raising a beautiful autistic daughter and finding true love.\r\n\r\nxx","last_updated":"2017-09-22T12:03:52.089Z","parsed":{"xt":"urn:btih:6f1630c1843a5d07f15a3af3131af76d356ab9ed","dn":"The Sky Below_ A True Story of Summits, Space, and Speed by Scot","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6f1630c1843a5d07f15a3af3131af76d356ab9ed","infoHashBuffer":{"type":"Buffer","data":[111,22,48,193,132,58,93,7,241,90,58,243,19,26,247,109,53,106,185,237]},"name":"The Sky Below_ A True Story of Summits, Space, and Speed by Scot","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}