{"title":"BadTeensPunished - Avi Love (Cute To Be A Slut) NEW 23 October 2","magnet":"magnet:?xt=urn:btih:6f8079ef3f3391d0dc4a0f0e77fad41eafe2fdb3&dn=BadTeensPunished+-+Avi+Love+%28Cute+To+Be+A+Slut%29+NEW+23+October+2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"378290480","seeders":"37","leechers":"36","description":"Teen Avi Love is in bed reading when her stepdad Kyle Mason asks her to leave the door unlocked for a handyman who will be coming by later that day. Knowing that she needs money, Avi dresses in her slutty best to flirt with the handyman in the hope that he will give her money. When he arrives, she wanders downstairs and tries to get his attention by making up housework that allows her to bend over and show off her short shorts with no panties.When the handyman ignores her advances, she pulls her shorts down and turns around so that her ass is in his face. Seeing Avi&apos;s plump pussy is too much for Kyle Mason to bear. He pulls his pants down and slams into her from behind so that he can give her the hard pussy pounding that she craves. After he has brought her off, Avi turns around and realizes that she&apos;s fucking her stepdad. When she tries to call him on it, he bends her over his knee and spanks her to her delight.Now that Avi knows who&apos;s in charge, she gleefully obeys when Kyle tells her to suck his hard cock. Then she rolls onto the couch with her legs spread wide open to welcome him back into her hairy twat. Her moans of ecstasy fill the room as Kyle pulls her on top of him so that she can ride his hardon as he sucks her titties. When she has enjoyed another climax, Kyle pushes her onto her back so that he can pull out and give her a facial of cum to finish their fuck fest.\r\nTags: Small Boobs, Hairy Pussy, Brunette, Black Hair, Hardcore, Camel Toe, Blowjob, Facial, Handjob, Girl Orgasm, POV, Deep Throat, Pussy Licking, Bad Teens Punished\r\n <a href=\"\nhttp://img.imgdone.com/image/p9ylE\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/p9ylE</a>\r\n <a href=\"\nhttp://img.imgdone.com/image/p9kKH\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/p9kKH</a>","last_updated":"2017-10-23T12:04:55.315Z","parsed":{"xt":"urn:btih:6f8079ef3f3391d0dc4a0f0e77fad41eafe2fdb3","dn":"BadTeensPunished - Avi Love (Cute To Be A Slut) NEW 23 October 2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6f8079ef3f3391d0dc4a0f0e77fad41eafe2fdb3","infoHashBuffer":{"type":"Buffer","data":[111,128,121,239,63,51,145,208,220,74,15,14,119,250,212,30,175,226,253,179]},"name":"BadTeensPunished - Avi Love (Cute To Be A Slut) NEW 23 October 2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}