{"title":"Mental Health Care - An Introduction for Health Professionals 2e","magnet":"magnet:?xt=urn:btih:6fd088f9a06584a8c1ae8bf1097a01db655360e1&dn=Mental+Health+Care+-+An+Introduction+for+Health+Professionals+2e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"18471228","seeders":"1","leechers":"15","description":"Mental Health Care - An Introduction for Health Professionals in Australia (2nd Ed)\r\nby Catherine Hungerford, Donna Hodgson, Richard Clancy, Michael Monisse-Redman, Richard Bostwick, Tony Jones\r\nJohn Wiley &amp; Sons | March 2016 | ISBN-10: 1118644808 | True PDF | 608 Pages | 17.6 mb\r\n\r\nMental Health Care: An Introduction for Health Professionals in Australia, 2nd edition is the ideal resource for students who will be future health professionals working in allied health and medical environments in Australia. Set firmly within a wellness framework the text is also useful for health professionals, already working in a health-related field, who need information to support them to effectively assist people who experience mental health problems.\r\nDrawing on the multidisciplinary expertise of Australia&apos;s pre-eminent academics and clinicians, the text offers a user-friendly, jargon-free blend of theory and practice that will enable students to think carefully about the issues involved in mental health care and empower them to develop strategies for working effectively with people across the lifespan and from diverse cultures. Building on the success of the first edition, Mental Health Care: An Introduction for Health Professionals, 2nd edition has been bolstered with an increased focus on coverage of child and adolescent mental health issues.\r\n\r\nCONTENTS\r\nChapter 1 Mental health care in Australia 1\r\nChapter 2 Assessment in the mental health context 51\r\nChapter 3 The legal and ethical context of mental health care 101\r\nChapter 4 Delivering culturally appropriate mental health care 137\r\nChapter 5 Common reactions to stressful situations 193\r\nChapter 6 Caring for a person displaying challenging behaviours 237\r\nChapter 7 Caring for a person with depression, anxiety or perinatal mental health 277\r\nChapter 8 Caring for a person who has self-harmed 331\r\nChapter 9 Caring for a person with a serious mental illness 377\r\nChapter 10 Caring for a person with a substance use disorder 423\r\nChapter 11 Caring for an older person with a mental illness 483\r\nChapter 12 Approaches to mental health service delivery 517\r\n <a href=\"\nhttps://s10.postimg.org/di0afkv49/Mental_Health_Care.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s10.postimg.org/di0afkv49/Mental_Health_Care.jpg</a>","last_updated":"2017-12-30T12:00:52.414Z","parsed":{"xt":"urn:btih:6fd088f9a06584a8c1ae8bf1097a01db655360e1","dn":"Mental Health Care - An Introduction for Health Professionals 2e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6fd088f9a06584a8c1ae8bf1097a01db655360e1","infoHashBuffer":{"type":"Buffer","data":[111,208,136,249,160,101,132,168,193,174,139,241,9,122,1,219,101,83,96,225]},"name":"Mental Health Care - An Introduction for Health Professionals 2e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}