{"title":"The Thin Light of Freedom by Edward L. Ayer","magnet":"magnet:?xt=urn:btih:70adb2d01c9be357e73bb800be47487b6ac27630&dn=The+Thin+Light+of+Freedom+by+Edward+L.+Ayer&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"28757913","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Thin Light of Freedom by Edward L. Ayers MOBI\r\n\r\nA landmark Civil War history told from a fresh, deeply researched ground-level perspective\r\n\r\nAt the crux of America&apos;s history stand two astounding events: the immediate and complete destruction of the most powerful system of slavery in the modern world, followed by a political reconstruction in which new constitutions established the fundamental rights of citizens for formerly enslaved people. Few people living in 1860 would have dared imagine either event, and yet, in retrospect, both seem to have been inevitable.\r\n\r\nIn a beautifully crafted narrative, Edward L. Ayers restores the drama of the unexpected to the history of the Civil War. He does this by setting up at ground level in the Great Valley counties of Augusta, Virginia, and Franklin, Pennsylvania, communities that shared a prosperous landscape but were divided by the Mason-Dixon Line. From the same vantage point occupied by his unforgettable characters, Ayers captures the strategic savvy of Lee and his local lieutenants, and the clear vision of equal rights animating black troops from Pennsylvania. We see the war itself become a scourge to the Valley, its pitched battles punctuating a cycle of vicious attack and reprisal in which armies burned whole towns for retribution. In the weeks and months after emancipation, from the streets of Staunton, Virginia, we see black and white residents testing the limits of freedom as political leaders negotiate the terms of re-admission to the Union.\r\n\r\nAyers deftly shows throughout how the dynamics of political opposition drove these momentous events, transforming once unimaginable outcomes into fact. With analysis as powerful as its narrative, here is a landmark history of the Civil War.\r\n\r\nxx","last_updated":"2017-11-24T12:00:43.224Z","parsed":{"xt":"urn:btih:70adb2d01c9be357e73bb800be47487b6ac27630","dn":"The Thin Light of Freedom by Edward L. Ayer","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"70adb2d01c9be357e73bb800be47487b6ac27630","infoHashBuffer":{"type":"Buffer","data":[112,173,178,208,28,155,227,87,231,59,184,0,190,71,72,123,106,194,118,48]},"name":"The Thin Light of Freedom by Edward L. Ayer","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}