{"title":"The Last Black Unicorn by Tiffany Haddish EPUB","magnet":"magnet:?xt=urn:btih:70d69d97de21ff85995663f4f52f879b6f767f1f&dn=The+Last+Black+Unicorn+by+Tiffany+Haddish+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3074800","seeders":"79","leechers":"3","description":"xx\r\n\r\nThe Last Black Unicorn by Tiffany Haddish EPUB\r\n\r\nFrom stand-up comedian and actress Tiffany Haddish comes The Last Black Unicorn, a hilarious, edgy, and heart-wrenching collection of autobiographical essays that will leave you laughing through tears.\r\n\r\nTiffany Haddish grew up in one of the poorest parts of South Central Los Angeles. Her mother wound up with a debilitating brain injury after surviving a car accident. Tiffany never fit in anywhere: not in the households she rotated through in the foster care system and certainly not at the nearly all white high school she had to ride the bus an hour to attend. As an illiterate ninth grader, Tiffany did everything she could to survive. After a multitude of jobs, she finally realized that she had talent in an area she never would have suspected: comedy. Tiffany faced the &apos;routine&apos; hindrances of climbing the entertainment business ladder - but had the added obstacles of sex, race, and class in her way. But she got there. She&apos;s humble, grateful, down to earth, and funny as hell. She still cleans the toilet the way she was shown by a foster mom who worked as a maid, and she still rolls her joints the way one of her foster dads taught her.\r\n\r\nTiffany can&apos;t avoid being funny: It&apos;s just who she is. But The Last Black Unicorn is so much more than a side-splittingly hilarious collection of essays - it&apos;s a memoir of the struggles of one woman who came from nothing and nowhere. A woman who was able to achieve her dreams by reveling in her pain and awkwardness, showing the world who she really is, and inspiring others through the power of laughter.\r\n\r\nxx","last_updated":"2017-12-10T12:08:43.492Z","parsed":{"xt":"urn:btih:70d69d97de21ff85995663f4f52f879b6f767f1f","dn":"The Last Black Unicorn by Tiffany Haddish EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"70d69d97de21ff85995663f4f52f879b6f767f1f","infoHashBuffer":{"type":"Buffer","data":[112,214,157,151,222,33,255,133,153,86,99,244,245,47,135,155,111,118,127,31]},"name":"The Last Black Unicorn by Tiffany Haddish EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}