{"title":"One Thought Changes Everything - Mara Gleason [Shades]epub","magnet":"magnet:?xt=urn:btih:71246ce0fee08da98fe5d2697c23fbeb1331e7a4&dn=One+Thought+Changes+Everything+-+Mara+Gleason+%5BShades%5Depub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ShadesTPB","categoryP":"other","categoryS":"e_books","size":"450674","seeders":"0","leechers":"0","description":"One Thought Changes Everything by Mara Gleason\r\n\r\nASIN: B073NTN965\r\n\r\n\r\n\r\nThis book is the story of human beings and how we create our experience of reality. But perhaps more importantly, how when any of us truly understands how we create reality, surprising and profound changes occur in our lives and in the world around us. &quot;One Thought Changes Everything&quot; begins with a moment in Mara Gleason&#x2019;s life, at 11-years old, when her father came across an understanding of the mind that dramatically changed him as a father and business leader. Her curiosity in what exactly changed him led her down the path of training and then a career sharing these principles of the mind with people from all walks of life. From the man at an IT company who decided to stop living in his basement and stop hitting his daughter, to the professional athlete who began living out his dreams again after having given up, to the US Marine who realized a deeper love for humanity than he ever knew was possible, she has observed this understanding profoundly influence the lives of her clients, and the lives of those around them. \r\n\r\nGleason weaves together personal, humorous and deeply touching stories of her own new thoughts that have changed the trajectory of her life, as well as those of her clients. We follow her throughout her evolution in life and career to today when Gleason shares perhaps her biggest new thought yet &#x2014; that this understanding of the mind is the one thing that would solve every global issue of our time. She offers the radically hopeful, yet simple message that at the source of all issues, whether personal, organizational, or global is the misunderstanding of the mind that pervades society today. The change we see in her father, in Mara herself, and in her clients when they discover how the mind truly works, are the very same changes that would dissolve the greatest issues of our time from terrorism and war to addictions, inequality, and climate change. There is not a single issue humanity faces that is not fueled by a misunderstanding of the mind, and that could absolutely be solved by a new understanding. \r\n\r\nWhether you want to understand yourself better, your relationships, your business, or the world at large, &quot;One Thought Changes Everything&quot; offers a a quietly simple solution that just may rock your world, and in turn change the world","last_updated":"2017-08-04T12:00:57.968Z","parsed":{"xt":"urn:btih:71246ce0fee08da98fe5d2697c23fbeb1331e7a4","dn":"One Thought Changes Everything - Mara Gleason [Shades]epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"71246ce0fee08da98fe5d2697c23fbeb1331e7a4","infoHashBuffer":{"type":"Buffer","data":[113,36,108,224,254,224,141,169,143,229,210,105,124,35,251,235,19,49,231,164]},"name":"One Thought Changes Everything - Mara Gleason [Shades]epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}