{"title":"Al Jarreau - We Got By (1975) [EAC-FLAC]","magnet":"magnet:?xt=urn:btih:7188992a29ea0429b1fb880510915105cbe4d06d&dn=Al+Jarreau+-+We+Got+By+%281975%29+%5BEAC-FLAC%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"pucholoco","categoryP":"audio","categoryS":"flac","size":"349784660","seeders":"52","leechers":"4","description":"                            Al Jarreau - We Got By (1975)\r\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 212 Mb\r\n                        Full Artwork @ 600 dpi (png) -&gt; 121 Mb\r\n\r\n\r\nThe only vocalist in history to net Grammy Awards in three different categories (jazz, pop, and R&amp;B, respectively), Al Jarreau was born in Milwaukee, Wisconsin, on March 12, 1940. The son of a vicar, he earned his first performing experience singing in the church choir. After receiving his master&apos;s degree in psychology, Jarreau pursued a career as a social worker, but eventually he decided to relocate to Los Angeles and try his hand in show business, playing small clubs throughout the West Coast.\r\n\r\nA singer and songwriter whose vocal range, resonant performances and sheer musicality have earned him an international following, Al Jarreau gave early notice of his extraordinary artistry on his auspicious 1975 debut album We Got By. Produced by Al Schmitt, with an all-star studio supporting cast that includes arranger David Grusin, keyboardist Tom Canning and guitaris Arthur Adams, the nine sparkling cuts of We Got By showcase the dexterous musical magic that has always been a Jarreau trademark.\r\n\r\nBorn and raised in Milwaukee, Wisconsin, Al Jarreau began singing at the tender age of four. He attended in the Midwest, graduating with a Master&apos;s degree in Psychology, and performing with a jazz group called the Indigos during weekends and holidays.\r\n\r\nRelocating to San Francisco to take a job as a rehabilitation counselor, he found himself performing two nights a week with a trio fronted by jazz great Goerge Duke at a Small Bay Area Club, the Half Note.\r\n\r\nBy 1968, Jarreau had settled on a musical direction, and for the next four years, performed extensively in Los Angeles, appearing in such famed nightclubs as Dino&apos;s, the Troubadour, the Bitter End West and a small nitery called the Bla Bla Cafe. It was here that Jarreau began concentrating on writing and performing his own material, with a resulting recording contract with Warner Bros. Record in early 1975.\r\n\r\nWe Got By features such standout Jarreau originals as &quot;Lock All The Gates,&quot; &quot;Sweet Porato Pie,&quot; &quot;Spirit&quot; and &quot;You Don&apos;t See Me.&quot; Highlighting the artist on &quot;voice, vocal percussion, flute and miscellaneous effects,&quot; We Got By was released to unanimous critical and popular acclaim.\r\n\r\n----------------------------------------------------------------------------------\r\nTracklist:\r\n----------------------------------------------------------------------------------\r\n\r\n01. Spirit\r\n02. We Got By\r\n03. Susan&apos;s Song\r\n04. You Don&apos;t See Me\r\n05. Lock All The Gates\r\n06. Raggedy Ann\r\n07. Letter Perfect\r\n08. Sweet Potato Pie\r\n09. Aladdin&apos;s Lamp\r\n\r\n*1975, 1988 Reprise Records 927 222-2\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","last_updated":"2017-09-02T12:02:45.038Z","parsed":{"xt":"urn:btih:7188992a29ea0429b1fb880510915105cbe4d06d","dn":"Al Jarreau - We Got By (1975) [EAC-FLAC]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7188992a29ea0429b1fb880510915105cbe4d06d","infoHashBuffer":{"type":"Buffer","data":[113,136,153,42,41,234,4,41,177,251,136,5,16,145,81,5,203,228,208,109]},"name":"Al Jarreau - We Got By (1975) [EAC-FLAC]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}