{"title":"Crazy Rich Asians by Kevin Kwan EPUB","magnet":"magnet:?xt=urn:btih:71fd6565d2f4ccfebbe6201933404b1b4b7814c1&dn=Crazy+Rich+Asians+by+Kevin+Kwan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2541060","seeders":"42","leechers":"7","description":"xx\r\n\r\nCrazy Rich Asians by Kevin Kwan EPUB\r\n\r\nCrazy Rich Asians is the outrageously funny debut novel about three super-rich, pedigreed Chinese families and the gossip, backbiting, and scheming that occurs when the heir to one of the most massive fortunes in Asia brings home his ABC (American-born Chinese) girlfriend to the wedding of the season.\r\n\r\nWhen Rachel Chu agrees to spend the summer in Singapore with her boyfriend, Nicholas Young, she envisions a humble family home, long drives to explore the island, and quality time with the man she might one day marry. What she doesn&apos;t know is that Nick&apos;s family home happens to look like a palace, that she&apos;ll ride in more private planes than cars, and that with one of Asia&apos;s most eligible bachelors on her arm, Rachel might as well have a target on her back. Initiated into a world of dynastic splendor beyond imagination, Rachel meets Astrid, the It Girl of Singapore society; Eddie, whose family practically lives in the pages of the Hong Kong socialite magazines; and Eleanor, Nick&apos;s formidable mother, a woman who has very strong feelings about who her son should--and should not--marry. Uproarious, addictive, and filled with jaw-dropping opulence, Crazy Rich Asians is an insider&apos;s look at the Asian JetSet; a perfect depiction of the clash between old money and new money; between Overseas Chinese and Mainland Chinese; and a fabulous novel about what it means to be young, in love, and gloriously, crazily rich.\r\n\r\nxx","last_updated":"2017-12-26T12:08:19.730Z","parsed":{"xt":"urn:btih:71fd6565d2f4ccfebbe6201933404b1b4b7814c1","dn":"Crazy Rich Asians by Kevin Kwan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"71fd6565d2f4ccfebbe6201933404b1b4b7814c1","infoHashBuffer":{"type":"Buffer","data":[113,253,101,101,210,244,204,254,187,230,32,25,51,64,75,27,75,120,20,193]},"name":"Crazy Rich Asians by Kevin Kwan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}