{"title":"Human Factors in the Chemical and Process Industries","magnet":"magnet:?xt=urn:btih:72729747e06bfd6339c0126731166262c37a7a28&dn=Human+Factors+in+the+Chemical+and+Process+Industries&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"14246972","seeders":"28","leechers":"1","description":"Human Factors in the Chemical and Process Industries - Janette Edmonds (Elsevier, 2016).pdf\r\n\r\nHuman Factors in the Chemical and Process Industries: Making it Work in Practice is a comprehensive overview of human factors within this sector, focusing on the practical application. It has been written by acknowledged industry experts from the Keil Centre, which is a leading practice of chartered ergonomics and human factors specialists, chartered safety specialists, registered occupational psychologists, and registered clinical psychologists. The book was inspired by the international human factors training course run by the Keil Centre with the IChemE, which has reached four continents across the world. The book is written for those who want a comprehensive overview of the subject, focusing on the practical application of human factors. It has been written for safety professionals, engineers and operational disciplines within industry, and those aspiring to these disciplines, who either deal with human factors issues or any aspect of the &#x2018;human element&#x2019; in their core role.\r\n\r\nThe book explains what &#x2018;human factors&#x2019; is about and how human factors issues are best managed from a practical perspective. It will help readers develop a greater understanding of the area and how to establish more effective solutions for human factors related issues.\r\n\r\nProvides comprehensive coverage of the most relevant human factors within this sector, with succinct overviews of each topic\r\nUses case studies and practical examples to illustrate topics and explains the material in a fully accessible, easy to understand style\r\nWritten by a single team of eleven industry practitioners, drawing on the combined expertise of different human factors specialisms which are rarely comprehensively combined in a single resource","last_updated":"2017-06-07T12:05:49.847Z","parsed":{"xt":"urn:btih:72729747e06bfd6339c0126731166262c37a7a28","dn":"Human Factors in the Chemical and Process Industries","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"72729747e06bfd6339c0126731166262c37a7a28","infoHashBuffer":{"type":"Buffer","data":[114,114,151,71,224,107,253,99,57,192,18,103,49,22,98,98,195,122,122,40]},"name":"Human Factors in the Chemical and Process Industries","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}