{"title":"Michael Tomasky - Bill Clinton 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","magnet":"magnet:?xt=urn:btih:72890333d511487d7eb611330468b5c7766c5978&dn=Michael+Tomasky+-+Bill+Clinton+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3352464","seeders":"1","leechers":"1","description":"Michael Tomasky - Bill Clinton 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nBill Clinton: a president of contradictions. He was a Rhodes Scholar and a Yale Law School graduate, but he was also a fatherless child from rural Arkansas. He was one of the most talented politicians of his age, but he inspired enmity of such intensity that his opponents would stop at nothing to destroy him. He was the first Democrat since Franklin Roosevelt to win two successive presidential elections, but he was also the first president since Andrew Johnson to be impeached.\r\n\r\nIn this incisive biography of America&apos;s 42nd president, Michael Tomasky examines Clinton&apos;s eight years in office, a time often described as one of peace and prosperity, but in reality a time of social and political upheaval, as the culture wars grew ever more intense amid the rise of the Internet (and with it, online journalism and blogging); military actions in Somalia, Iraq, Bosnia, and Kosovo; standoffs at Waco and Ruby Ridge; domestic terrorism in Oklahoma City; and the rise of al-Qaeda. It was a time when Republicans took control of Congress and a land deal gone bad turned into a constitutional crisis, as lurid details of a sitting president&apos;s sexual activities became the focus of public debate.\r\n\r\nTomasky&apos;s clear-eyed assessment of Clinton&apos;s presidency offers a new perspective on what happened, what it all meant, and what aspects continue to define American politics to this day. In many ways, we are still living in the age of Clinton","last_updated":"2017-06-01T12:02:36.896Z","parsed":{"xt":"urn:btih:72890333d511487d7eb611330468b5c7766c5978","dn":"Michael Tomasky - Bill Clinton 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"72890333d511487d7eb611330468b5c7766c5978","infoHashBuffer":{"type":"Buffer","data":[114,137,3,51,213,17,72,125,126,182,17,51,4,104,181,199,118,108,89,120]},"name":"Michael Tomasky - Bill Clinton 2017 RETAiL ePUB eBOOK-DiSTRiBUTi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}