{"title":"The Art of Authenticity by Karissa Thacker EPUB","magnet":"magnet:?xt=urn:btih:728cc3877b7eaaa36e64b073f253f2d390401fe9&dn=The+Art+of+Authenticity+by+Karissa+Thacker+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"586058","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Art of Authenticity by Karissa Thacker EPUB\r\n\r\nLeverage your authentic self into a valuable leadership strategy.\r\n\r\nThe Art of Authenticity is a guide to becoming a better leader by achieving your best self. All people bring different sides of themselves to various situations. This book will show you how to broaden and deepen your effectiveness by presenting the most appropriate side of yourself. Dr. Karissa Thacker is the management psychologist called on by over 200 Fortune 500 companies to work with high-potential leaders. This book provides you with her expert guidance, based on validated psychological research and artful application of psychological principles to actual business situations, to help you become an authentic leader. You&apos;ll learn how to lead through reflection, action, and conscious choice and how to maintain your guiding principles while effectively leading your team. By replacing habitual reactions with authentic ones, you&apos;ll find that you&apos;re modeling good behavior and effective decision making - and that authenticity is contagious. This guide equips you with the tools and skills you need to be the catalyst of positive change your organization needs.\r\n\r\nHow do you remain authentic while being an effective leader? This book argues that the question isn&apos;t a duality. Authenticity is the best way to lead and the only way to maintain sustainable success as an organization. This insightful guide shows you how to find your authentic self and leverage that into an effective, executable leadership strategy.\r\n\r\nBecome authentic in a way that befits your values\r\nShow loyalty, honesty, ethics, and consideration\r\nMaintain authenticity in leadership roles\r\nMake conscious choices instead of blind reactions\r\n\r\nSome are born to lead, and others must be taught, but all leaders must work to retain their own values and basic sense of self. A simple pause can mean the difference between a knee-jerk reaction and an authentic decision, and the effects ripple throughout your organization. The Art of Authenticity is your guidebook to finding the true authentic leader within and leading from the inside out for the long haul.\r\n\r\nxx","last_updated":"2017-12-11T12:01:23.487Z","parsed":{"xt":"urn:btih:728cc3877b7eaaa36e64b073f253f2d390401fe9","dn":"The Art of Authenticity by Karissa Thacker EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"728cc3877b7eaaa36e64b073f253f2d390401fe9","infoHashBuffer":{"type":"Buffer","data":[114,140,195,135,123,126,170,163,110,100,176,115,242,83,242,211,144,64,31,233]},"name":"The Art of Authenticity by Karissa Thacker EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}