{"title":"Carry On by Lisa Fenn 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:7326fd45567b4c0fc596b3289e6ff317733aa63e&dn=Carry+On+by+Lisa+Fenn+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3808823","seeders":"0","leechers":"0","description":"xx\r\n\r\nCarry On by Lisa Fenn 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn the spirit of The Blind Side and Friday Night Lights comes a tender and profoundly moving memoir about an ESPN producer&apos;s unexpected relationship with two disabled wrestlers from inner city Cleveland and how these bonds - blossoming, ultimately, into a most unorthodox family - would transform their lives.\r\n\r\nWhen award-winning ESPN producer Lisa Fenn returned to her hometown for a story about two wrestlers at one of Cleveland&apos;s toughest public high schools, she had no idea that the trip would change her life. Both young men were disadvantaged students with significant physical disabilities. Dartanyon Crockett was legally blind as a result of Leber&apos;s disease; Leroy Sutton lost both his legs at 11, when he was run over by a train. Brought together by wrestling, they had developed a brother-like bond as they worked to overcome their disabilities.\r\n\r\nAfter forming a profound connection with Dartanyon and Leroy, Fenn realized she couldn&apos;t just walk away when filming ended; these boys had had to overcome the odds too many times. Instead Fenn dedicated herself to ensuring their success long after the reporting was finished and the story aired - and an unlikely family of three was formed.\r\n\r\nThe years ahead would be fraught with complex challenges, but Fenn stayed with the boys every step of the way - teaching them essential life skills, helping them heal old wounds and traumatic pasts, and providing the first steady and consistent support system they&apos;d ever had.\r\n\r\nThis powerful memoir is one of love, hope, faith, and strength - a story about an unusual family and the courage to carry on, even in the most extraordinary circumstances.\r\n\r\nxx","last_updated":"2017-09-18T12:03:18.334Z","parsed":{"xt":"urn:btih:7326fd45567b4c0fc596b3289e6ff317733aa63e","dn":"Carry On by Lisa Fenn 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7326fd45567b4c0fc596b3289e6ff317733aa63e","infoHashBuffer":{"type":"Buffer","data":[115,38,253,69,86,123,76,15,197,150,179,40,158,111,243,23,115,58,166,62]},"name":"Carry On by Lisa Fenn 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}