{"title":"Deus Ex Mankind Divided [Reload]","magnet":"magnet:?xt=urn:btih:734b4ce2d83f1beeab27cd3348d201972e4f095d&dn=Deus+Ex+Mankind+Divided+%5BReload%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"midrozomlu26","categoryP":"games","categoryS":"pc","size":"26251964602","seeders":"0","leechers":"0","description":"Deus Ex (Latin pronunciation: [&#x2C8;de.&#x28A;s &#x25B;ks]) is a 2000 action role-playing video game developed by Ion Storm and published by Eidos Interactive. Set in a cyberpunk-themed dystopian world in the year 2052, the story follows JC Denton, an anti-terrorist agent given superhuman abilities by nanotechnology, as he sets out to combat hostile forces in a world ravaged by inequality and a deadly plague. His missions entangle him in a conspiracy that brings him into conflict with the Triad, Majestic 12, and the Illuminati.\r\n\r\nDeus Ex&apos;s gameplay combines elements of the first-person shooter with stealth elements, adventure, and role-playing genres, allowing for its tasks and missions to be completed in a variety of ways, that in turn lead to differing outcomes. Presented from the first-person perspective, the player can customize Denton&apos;s various abilities such as weapon skills or lockpicking, increasing his effectiveness in these areas; this opens up different avenues of exploration and methods of interacting with or manipulating other characters. The player is able to complete side missions away from the primary storyline by moving freely around the available areas, which can reward the player with experience points to upgrade abilities and alternative ways to tackle main missions.\r\n\r\nThe game was first released for Microsoft Windows in June 2000, with a Mac OS port following the next month. A modified version of the game was released later for the PlayStation 2 in 2002. In the years following its release, Deus Ex has received additional improvements and content from its fan community.\r\n\r\nThe game received critical acclaim, including repeatedly being named &quot;Best PC Game of All Time&quot; in PC Gamer&apos;s &quot;Top 100 PC Games&quot; in 2011 and in a poll carried out by the UK gaming magazine PC Zone. It was a frequent candidate for and winner of Game of the Year awards, drawing praise for its pioneering designs in player choice and multiple narrative paths. It has sold more than 1 million copies, as of April 23, 2009. The game has spawned both a sequel, Deus Ex: Invisible War, released in 2003, and three prequels: Deus Ex: Human Revolution, released in 2011, Deus Ex: The Fall, released in 2013, and Deus Ex: Mankind Divided, released in 2016","last_updated":"2017-08-09T12:00:49.878Z","parsed":{"xt":"urn:btih:734b4ce2d83f1beeab27cd3348d201972e4f095d","dn":"Deus Ex Mankind Divided [Reload]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"734b4ce2d83f1beeab27cd3348d201972e4f095d","infoHashBuffer":{"type":"Buffer","data":[115,75,76,226,216,63,27,238,171,39,205,51,72,210,1,151,46,79,9,93]},"name":"Deus Ex Mankind Divided [Reload]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}