{"title":"Antoine Leiris - You Will Not Have My Hate 2016 RETAiL ePUB eBOO","magnet":"magnet:?xt=urn:btih:739755c122f78d478e63707d5aac70ccd88a9140&dn=Antoine+Leiris+-+You+Will+Not+Have+My+Hate+2016+RETAiL+ePUB+eBOO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3691566","seeders":"1","leechers":"1","description":"Antoine Leiris - You Will Not Have My Hate 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nNumber one international best seller\r\n\r\n&quot;On Friday night you stole the life of an exceptional person, the love of my life, the mother of my son, but you will not have my hate.&quot;\r\n\r\nOn November 13, 2015, Antoine Leiris&apos; wife, H&#xE9;l&#xE8;ne Muyal-Leiris, was killed by terrorists while attending a rock concert at the Bataclan Theater in Paris, in the deadliest attack on France since World War II. Three days later Leiris wrote an open letter addressed directly to his wife&apos;s killers, which he posted onHe refused to be cowed or to let his 17-month-old son&apos;s life be defined by H&#xE9;l&#xE8;ne&apos;s murder. He refused to let the killers have their way: &quot;For as long as he lives, this little boy will insult you with his happiness and freedom.&quot; Instantly that shortpost caught fire and was reported on by newspapers and television stations all over the world. In his determination to honor the memory of his wife, he became an international hero to everyone searching desperately for a way to deal with the horror of the Paris attacks and the grim shadow cast today by the threat of terrorism.\r\n\r\nNow Leiris tells the full story of his grief and struggle. You Will Not Have My Hate is a remarkable, heartbreaking, and indeed beautiful memoir of how he and his baby son, Melvil, endured in the days and weeks after H&#xE9;l&#xE8;ne&apos;s murder. With absolute emotional courage and openness, he somehow finds a way to answer that impossible question: How can I go on? He visits H&#xE9;l&#xE8;ne&apos;s body at the morgue, has to tell Melvil that Mommy will not be coming home, and buries the woman he had planned to spend the rest of his life with.\r\n\r\n//","last_updated":"2017-06-10T12:00:54.144Z","parsed":{"xt":"urn:btih:739755c122f78d478e63707d5aac70ccd88a9140","dn":"Antoine Leiris - You Will Not Have My Hate 2016 RETAiL ePUB eBOO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"739755c122f78d478e63707d5aac70ccd88a9140","infoHashBuffer":{"type":"Buffer","data":[115,151,85,193,34,247,141,71,142,99,112,125,90,172,112,204,216,138,145,64]},"name":"Antoine Leiris - You Will Not Have My Hate 2016 RETAiL ePUB eBOO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}