{"title":"House Party ISO NoGrp","magnet":"magnet:?xt=urn:btih:73a7f96ecf198aec05b09dc4de5dda0980d77968&dn=House+Party+ISO+NoGrp&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ljstorm","categoryP":"games","categoryS":"pc","size":"1069518848","seeders":"4","leechers":"0","description":"House Party, in its play-style and sense of humor, takes inspiration from the adventure style games of the 80s and 90s like Leisure Suit Larry and Monkey Island, but it is rendered in a beautiful full-3D first-person context.\r\n\r\nIn the game, you&apos;ll experience the usual debauchery found at these types of parties in the form of foul language, party games, nudity, fighting, sex, and more, and believe me, it doesn&apos;t pull any punches! Each character has their own personality, story and quests for the player. You can enjoy this alongside full immersive 3D gameplay, gorgeous models, and a very sarcastic and dry sense of humor. The AI is very robust, and the characters respond to a large number of stimuli and player choices. There are multiple story-paths and different outcomes based on your decisions.\r\n\r\nThe stories are customizable, and Eek! Games offers tools on their website to craft your own story including full dialogues, interactions, and logic dictating how the player&apos;s night goes and import it into your game. Users are already creating and sharing stories on the game&apos;s forum, and we are excited to see what the player community creates next!\r\n\r\nThe game is still in beta, and there are still some placeholder graphics in place in the demo video you see. We are wanting to offer free early access. The game in its current state has plenty of game play available and comes with full immersive stories with the option to download new stories from the forum. As the game goes further into development, more official stories and forked story-lines will be worked on, and more content will be added to the game in the sense of what is available for the characters to do.\r\n <a href=\"\nhttp://games.eekllc.com/the-app/\" rel=\"nofollow\" target=\"_NEW\">\nhttp://games.eekllc.com/the-app/</a>\r\n\r\nInstalation:\r\n\r\n1. Mount Image With Daemon Tools\r\n2. Install\r\n3. Have fun!!!","last_updated":"2017-08-05T12:04:04.262Z","parsed":{"xt":"urn:btih:73a7f96ecf198aec05b09dc4de5dda0980d77968","dn":"House Party ISO NoGrp","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"73a7f96ecf198aec05b09dc4de5dda0980d77968","infoHashBuffer":{"type":"Buffer","data":[115,167,249,110,207,25,138,236,5,176,157,196,222,93,218,9,128,215,121,104]},"name":"House Party ISO NoGrp","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}