{"title":"\nKing of Spies by Blaine Harden EPUB","magnet":"magnet:?xt=urn:btih:73feb396435c8e6ab880124a58d01a8e350726eb&dn=King+of+Spies+by+Blaine+Harden+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1465155","seeders":"2","leechers":"3","description":"xx\r\n\r\nKing of Spies by Blaine Harden EPUB\r\n\r\nThe New York Times best-selling author of Escape from Camp 14 returns with the untold story of one of the most powerful spies in American history, shedding new light on the US role in the Korean War and its legacy.\r\n\r\nIn 1946, Master Sergeant Donald Nichols was repairing jeeps on the sleepy island of Guam when he caught the eye of recruiters from the army&apos;s Counter Intelligence Corps. After just three months&apos; training, he was sent to Korea, then a backwater beneath the radar of MacArthur&apos;s Pacific Command. Though he lacked the pedigree of most US spies - Nichols was a seventh-grade dropout - he quickly metamorphosed from army mechanic to black ops phenomenon. He insinuated himself into the affections of America&apos;s chosen puppet in South Korea, President Syngman Rhee, and became a pivotal player in the Korean War, warning months in advance about the North Korean invasion, breaking enemy codes, and identifying most of the targets destroyed by American bombs in North Korea.\r\n\r\nBut Nichols&apos; triumphs had a dark side. Immersed in a world of torture and beheadings, he became a spymaster with his own secret base, his own covert army, and his own rules. He recruited agents from refugee camps and prisons, sending many to their deaths on reckless missions. His closeness to Rhee meant that he witnessed - and did nothing to stop or even report - the slaughter of tens of thousands of South Korean civilians in anticommunist purges. Nichols&apos; clandestine reign lasted for an astounding 11 years.\r\n\r\nIn this riveting book, Blaine Harden traces Nichols&apos; unlikely rise and tragic ruin, from his birth in an operatically dysfunctional family in New Jersey to his sordid postwar decline, which began when the US military sacked him in Korea, sent him to an air force psych ward in Florida, and subjected him - against his will - to months of electroshock therapy. But King of Spies is not just the story of one American spy: With napalmed villages and severed heads, high-level lies and long-running cover-ups, it reminds us that the darkest sins of the Vietnam War - and many other conflicts that followed - were first committed in Korea.\r\n\r\nxx","last_updated":"2017-10-09T12:02:29.490Z","parsed":{"xt":"urn:btih:73feb396435c8e6ab880124a58d01a8e350726eb","dn":"King of Spies by Blaine Harden EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"73feb396435c8e6ab880124a58d01a8e350726eb","infoHashBuffer":{"type":"Buffer","data":[115,254,179,150,67,92,142,106,184,128,18,74,88,208,26,142,53,7,38,235]},"name":"King of Spies by Blaine Harden EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}