{"title":"\nInto Thin Air_ A Personal Account of the Mount Everest Disaster ","magnet":"magnet:?xt=urn:btih:74216c8ae7a3618ee19c8fdb7a3668e5b384cfe4&dn=Into+Thin+Air_+A+Personal+Account+of+the+Mount+Everest+Disaster+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8129089","seeders":"22","leechers":"17","description":"xx\r\n\r\nInto Thin Air_ A Personal Account of the Mount Everest Disaster by Jon Krakauer ePUB eBOOK-ZAK\r\n\r\nInto Thin Air is the definitive, personal account of the deadliest season in the history of Everest by the acclaimed journalist and author of Eiger Dreams and Into the Wild. On assignment for Outside magazine, Krakauer, an accomplished climber, went to the Himalayas to report on the growing commercialization of the planet&apos;s highest mountain. Everest has always been a dangerous mountain. From the first British expeditions in the 1920s until 1996, one climber has died for ever 4 who have attained the summit. This shocking death toll has not put a damper on the burgeoning business of guided ascents, however, in which amateur alpinists with alarmingly disparate skills are ushered up the mountain for a $65,000 fee. To ascend into the thin, frigid air above 26,000 feet - the cruising altitude of a commercial jetliner - is an inherently irrational act. The environment is unimaginably harsh, the margin for error miniscule. Krakauer examines what it is about Everest that has compelled so many people - including himself - to throw caution to the wind, ignore the concern of loved ones, and willingly subject themselves to such risk, hardship, and expense. Written with emotional clarity and supported by his unimpeachable reporting, Krakauer&apos;s frank eyewitness account of what happened on the roof of the world is a singular achievement.\r\n\r\nxx","last_updated":"2017-09-26T12:06:58.962Z","parsed":{"xt":"urn:btih:74216c8ae7a3618ee19c8fdb7a3668e5b384cfe4","dn":"Into Thin Air_ A Personal Account of the Mount Everest Disaster ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"74216c8ae7a3618ee19c8fdb7a3668e5b384cfe4","infoHashBuffer":{"type":"Buffer","data":[116,33,108,138,231,163,97,142,225,156,143,219,122,54,104,229,179,132,207,228]},"name":"Into Thin Air_ A Personal Account of the Mount Everest Disaster ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}