{"title":"Seven Million -The Still-Unsolved Rochester Brink's Heist(2017)","magnet":"magnet:?xt=urn:btih:74822751c5db87d1ec1934683a43e25531cd238c&dn=+Seven+Million+-The+Still-Unsolved+Rochester+Brink%27s+Heist%282017%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"9103698","seeders":"40","leechers":"7","description":"\r\nSeven Million - The Still-Unsolved Rochester Brink&apos;s Heist (2017) (Epub) Gooner\r\n\r\nPublisher: University Press of New England (13 Jun. 2017)\r\nAuthor: Gary Craig\r\nLanguage: English\r\nISBN-10: 1611688914\r\nISBN-13: 9781611688917\r\nASIN: B01N42J4MF\r\n\r\nOn a freezing night in January 1993, masked gunmen walked through the laughably lax security at the Rochester Brink&#x2019;s depot, tied up the guards, and unhurriedly made off with $7.4 million in one of the FBI&#x2019;s top-five armored car heists in history. Suspicion quickly fell on a retired Rochester cop working security for Brinks at the time&#x2014;as well it might. Officer Tom O&#x2019;Connor had been previously suspected of everything from robbery to murder to complicity with the IRA. One ex-IRA soldier in particular was indebted to O&#x2019;Connor for smuggling him and his girlfriend into the United States, and when he was caught in New York City with $2 million in cash from the Brink&#x2019;s heist, prosecutors were certain they finally had enough to nail O&#x2019;Connor. But they were wrong. In Seven Million, the reporter Gary Craig meticulously unwinds the long skein of leads, half-truths, false starts, and dead ends, taking us from the grim solitary pens of Northern Ireland&#x2019;s Long Kesh prison to the illegal poker rooms of Manhattan to the cold lakeshore on the Canadian border where the body parts began washing up.\r\n\r\nThe story is populated by a colorful cast of characters, including cops and FBI agents, prison snitches, a radical priest of the Melkite order who ran a home for troubled teenagers on the Lower East Side of Manhattan, and the IRA rebel who&#x2019;d spent long years jailed in one of Northern Ireland&#x2019;s most brutal prisons and who was living underground in New York posing as a comics dealer. Finally, Craig investigates the strange, sad fate of Ronnie Gibbons, a down-and-out boxer and muscle-for-hire in illegal New York City card rooms, who was in on the early planning of the heist, and who disappeared one day in 1995 after an ill-advised trip to Rochester to see some men about getting what he felt he was owed. Instead, he got was what was coming to him. Seven Million is a meticulous re-creation of a complicated heist executed by a variegated and unsavory crew, and of its many repercussions. Some of the suspects are now dead, some went to jail; none of them are talking about the robbery or what really happened to Ronnie Gibbons. And the money? Only a fraction was recovered, meaning that most of the $7 million is still out there somewhere","last_updated":"2017-05-29T13:20:58.726Z","parsed":{"xt":"urn:btih:74822751c5db87d1ec1934683a43e25531cd238c","dn":" Seven Million -The Still-Unsolved Rochester Brink's Heist(2017)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"74822751c5db87d1ec1934683a43e25531cd238c","infoHashBuffer":{"type":"Buffer","data":[116,130,39,81,197,219,135,209,236,25,52,104,58,67,226,85,49,205,35,140]},"name":" Seven Million -The Still-Unsolved Rochester Brink's Heist(2017)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}