{"title":"Mental Health Inc_ How Corruption, Lax Oversight, and Failed Ref","magnet":"magnet:?xt=urn:btih:748b1f50f9babe56a58b1bb78c59013b1ce15bbb&dn=Mental+Health+Inc_+How+Corruption%2C+Lax+Oversight%2C+and+Failed+Ref&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3500492","seeders":"0","leechers":"0","description":"xx\r\n\r\nMental Health Inc_ How Corruption, Lax Oversight, and Failed Reforms Endanger Our Most Vulnerable Citizens by Art Levine ePUB eBOOK-ZAK\r\n\r\nPrizewinning investigative journalist Art Levine offers a no-holds-barred and crucial call to action for America&apos;s broken mental health system.\r\n\r\nThe mental health system in America is hardly a front-burner issue, despite lip service about reform after a tragic mass killing. Yet every American should care deeply about fixing a system a presidential commission reported was in &quot;shambles&quot;. By some measures, about 20 percent of Americans have some sort of mental health condition, including the most vulnerable among us - veterans, children, the elderly, prisoners, and the homeless. With Mental Health, Inc., award-winning investigative journalist Art Levine delivers a Shock Doctrine-style expos&#xE9; of the failures of our out-of-control, profits-driven mental health system, with a special emphasis on the failures of the pharmaceuticals industry, including the treatment of children with antipsychotics and disastrous PTSD protocols for veterans.\r\n\r\nLevine provides narrative portraits of victims and people who won unexpected victories against their illnesses by getting smart, personalized help, as well as snapshots of corrupt Big Pharma executives and researchers who created fraudulent marketing schemes. Levine also tells the dramatic David vs. Goliath stories of a few brave reformers, including Harvard-trained psychiatrist and researcher Dr. Stefan Kruszewski, who has acted as a whistle-blower in numerous cases, leading to major federal and state settlements, as well as spotlighting pioneering clinicians challenging outmoded, drug-and-sedate practices that leave 90 percent of people with serious mental illness too disabled to work.\r\n\r\nBy taking a comprehensive look at mental health abuses and dangerous, ineffective practices as well as pointing toward solutions for creating a system for effective, proven, and compassionate care, Art Levine&apos;s essential Mental Health, Inc. is a call to action for politicians and citizens alike.\r\n\r\nxx","last_updated":"2017-09-02T12:01:08.272Z","parsed":{"xt":"urn:btih:748b1f50f9babe56a58b1bb78c59013b1ce15bbb","dn":"Mental Health Inc_ How Corruption, Lax Oversight, and Failed Ref","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"748b1f50f9babe56a58b1bb78c59013b1ce15bbb","infoHashBuffer":{"type":"Buffer","data":[116,139,31,80,249,186,190,86,165,139,27,183,140,89,1,59,28,225,91,187]},"name":"Mental Health Inc_ How Corruption, Lax Oversight, and Failed Ref","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}