{"title":"\nConversations with Friends by Sally Rooney EPUB","magnet":"magnet:?xt=urn:btih:74bac17a27f323fd5780f81339a241a0eb1f05d8&dn=Conversations+with+Friends+by+Sally+Rooney+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"306410","seeders":"0","leechers":"0","description":"xx\r\n\r\nConversations with Friends by Sally Rooney EPUB\r\n\r\nA sharply intelligent novel about friendship, lust, jealousy, and the unexpected complications of adulthood in the 21st century\r\n\r\nFrances is a cool-headed and darkly observant young woman vaguely pursuing a career in writing while studying in Dublin. Her best friend and comrade-in-arms is the beautiful and endlessly self-possessed Bobbi. At a local poetry performance one night, Frances and Bobbi catch the eye of Melissa, a well-known photographer, and as the girls are then gradually drawn into Melissa&apos;s world, Frances is reluctantly impressed by the older woman&apos;s sophisticated home and tall, handsome husband, Nick. However amusing and ironic Frances and Nick&apos;s flirtation seems at first, it gives way to a strange intimacy, and Frances&apos; friendship with Bobbi begins to fracture. As Frances tries to keep her life in check, her relationships increasingly resist her control: with Nick, with her difficult and unhappy father, and finally, terribly, with Bobbi.\r\n\r\nDesperate to reconcile her inner life to the desires and vulnerabilities of her body, Frances&apos; intellectual certainties begin to yield to something new: a painful and disorienting way of living from moment to moment.\r\n\r\nWritten with gemlike precision and marked by a sly sense of humor, Conversations with Friends is wonderfully alive to the pleasures and dangers of youth and the messy edges of female friendship.\r\n\r\nxx","last_updated":"2017-10-21T12:01:07.514Z","parsed":{"xt":"urn:btih:74bac17a27f323fd5780f81339a241a0eb1f05d8","dn":"Conversations with Friends by Sally Rooney EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"74bac17a27f323fd5780f81339a241a0eb1f05d8","infoHashBuffer":{"type":"Buffer","data":[116,186,193,122,39,243,35,253,87,128,248,19,57,162,65,160,235,31,5,216]},"name":"Conversations with Friends by Sally Rooney EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}