{"title":"The Spark and the Grind_ Ignite the Power of Disciplined Creativ","magnet":"magnet:?xt=urn:btih:74edf0dc535303f31dfdf5e4c4450572591d076e&dn=The+Spark+and+the+Grind_+Ignite+the+Power+of+Disciplined+Creativ&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4035286","seeders":"47","leechers":"9","description":"xx\r\n\r\nThe Spark and the Grind_ Ignite the Power of Disciplined Creativity by Erik Wahl ePUB MOBI eBOOK-ZAK\r\n\r\nWe&apos;ve been conditioned to think about creative genius as a dichotomy: dreamers versus doers, creativity versus discipline, the spark versus the grind.\r\n\r\nBut what if we&apos;re wrong?\r\n\r\nWhat if it&apos;s the spark and the grind?\r\n\r\nWe love people whose creative genius arrives in sudden sparks of inspiration. Think of Archimedes in his bathtub or Newton under his apple tree.\r\n\r\nBut we also admire people who work incredibly hard and long for their creative breakthroughs. Think of Edison in his lab, grinding through hundreds of failed variations on the lightbulb. We remember his words in tough times: &quot;Genius is 1 percent inspiration, 99 percent perspiration.&quot;\r\n\r\nNow Erik Wahl, a visual artist, speaker, and entrepreneur, helps us unite the yin and yang of creativity - the dynamic new ideas with the dogged effort. He shows why we won&apos;t get far if we rely on the spark without the grind or the grind without the spark. What the world really needs are the creators who can hold the two in balance.\r\n\r\nFortunately, it&apos;s possible to get good at both, as Wahl knows from experience. After his corporate career suddenly ended, he pursued a spark - to paint photorealistic portraits - and ground it out until he got good enough to make very good art very quickly. That&apos;s the basis of his riveting live shows, which have captivated skeptical audiences who never expected to be inspired by art - and taught them to embrace creativity in a whole new way.\r\n\r\nThis book offers surprising insights and practical advice about how to fan the sparks and make the grind more productive. Wahl deftly synthesizes the wisdom of other artists, philosophers, scientists, and business visionaries throughout history, along with his own views. Here&apos;s how he sums up his approach:\r\n\r\nThe world needs people who enjoy swimming in ideas until they discover a great one. The world also needs doers who have a gift for activation, aka &quot;getting s--- done.&quot; But the most potent individual creators in any industry or environment have learned how to be both. They&apos;ve learned how to spark their grind, and they&apos;ve learned how to grind their sparks. As a result they not only make things happen, they make great things.\r\n\r\nIf you want to ensure constant creativity in your life and produce your most innovative work - this is your guide.\r\n\r\nxx","last_updated":"2017-09-02T12:05:20.253Z","parsed":{"xt":"urn:btih:74edf0dc535303f31dfdf5e4c4450572591d076e","dn":"The Spark and the Grind_ Ignite the Power of Disciplined Creativ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"74edf0dc535303f31dfdf5e4c4450572591d076e","infoHashBuffer":{"type":"Buffer","data":[116,237,240,220,83,83,3,243,29,253,245,228,196,69,5,114,89,29,7,110]},"name":"The Spark and the Grind_ Ignite the Power of Disciplined Creativ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}