{"title":"HomeGuard Professional Edition v3.5.1 x86","magnet":"magnet:?xt=urn:btih:7587992827ce6f90849f1f41ffe132983fcbaaca&dn=HomeGuard+Professional+Edition+v3.5.1+x86&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"5697615","seeders":"5","leechers":"1","description":"HomeGuard Professional Edition v3.5.1 x86\r\n\r\nSafer Internet and Computer Use for All Family Members and Maximum Productivity for Work Teams\r\n\r\nHomeGuard Professional is an easy to use activity monitoring tool for tracking and controlling the use of computers in home and office networks. HomeGuard records web activity and automatically blocks all adult and inappropriate content in websites in addition to customizable website block and allow lists and filtering based on file types (e.g.: exe downloads or online flash games).\r\nIt also records detailed reports on usage of programs including active usage time, run time, bandwidth used, mouse clicks and keystrokes typed in each program with the option to block or time limit certain programs or games. Plus screen capture, periodically or based on specific activities, chat and email monitoring and filtering, printer and USB devices monitoring and blocking, Internet time restrictions, network connection monitoring and filtering, email notifications and more.\r\n\r\nHomeGuard runs, by default, in stealth mode completely hidden and undetectable, however, it can be set to show warnings to users when anything is blocked. Either way it is uninstallable, unclosable and cannot be bypassed using proxy servers.\r\n\r\nRemote Monitoring\r\nComplete control over every aspect of network computers use.\r\n\r\nMonitoring Data collected by HomeGuard on monitored (client) computers can be viewed remotely using the HomeGuard server component which keeps a main database of monitoring records that is securely and automatically synchronized with client computers with support for compression and 256-bit strong encryption of all data transferred over the network. The server component runs as a Windows service and can also be used to remotely change monitoring and blocking settings.\r\n\r\nOfficial Website: http://veridium.net/homeguard-professional/","last_updated":"2017-12-10T12:03:44.693Z","parsed":{"xt":"urn:btih:7587992827ce6f90849f1f41ffe132983fcbaaca","dn":"HomeGuard Professional Edition v3.5.1 x86","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7587992827ce6f90849f1f41ffe132983fcbaaca","infoHashBuffer":{"type":"Buffer","data":[117,135,153,40,39,206,111,144,132,159,31,65,255,225,50,152,63,203,170,202]},"name":"HomeGuard Professional Edition v3.5.1 x86","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}