{"title":"Ravenfield v20.07.2017","magnet":"magnet:?xt=urn:btih:759eb861f859ebf98e6e4b0d9c061b85628bdd22&dn=Ravenfield+v20.07.2017&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"122150158","seeders":"4","leechers":"1","description":"Fight upon the Ravenfield together with your Blue allies! Take down those pesky Reds using helicopters, tanks, guns, and active ragdoll physics!Ravenfield is a singleplayer game in the vein of older team-vs-team AI shooters. The game is designed to be easy to pick up and play, but also rewarding for all skill levels!Key FeaturesEasy-to-pickup, singleplayer mayhemFight as infantry, or in ground vehicles, aircraft, or watercraftActive ragdoll physics combines tactical strategies with a sprinkle of silly funThe number of combatants is only limited by what your computer can handle!Damaged soldiers drop team-colored blood splats, indicating where battles have taken placeDevelopment RoadmapRavenfield is being developed as an early access game, with major content updates scheduled to be released every 4-6 weeks. Additionally, minor updates may be distributed via a beta branch for those who do not fear slightly more buggy releases.While some content, such as new weapons, vehicles and maps will be released on a regular basis, other key features will be added roughly in the following order:Custom map supportSteam Workshop integrationAI CommandingCampaign modeCustom vehicle supportCustom weapon support","last_updated":"2017-07-22T12:00:39.954Z","parsed":{"xt":"urn:btih:759eb861f859ebf98e6e4b0d9c061b85628bdd22","dn":"Ravenfield v20.07.2017","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"759eb861f859ebf98e6e4b0d9c061b85628bdd22","infoHashBuffer":{"type":"Buffer","data":[117,158,184,97,248,89,235,249,142,110,75,13,156,6,27,133,98,139,221,34]},"name":"Ravenfield v20.07.2017","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}