{"title":"The Oxford Handbook of Ancient Greek Religion","magnet":"magnet:?xt=urn:btih:75bd30aec79c1b1ce27cad46de6a44ac46e50acc&dn=The+Oxford+Handbook+of+Ancient+Greek+Religion&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"3314771","seeders":"83","leechers":"8","description":"The Oxford Handbook of Ancient Greek Religion - Esther Eidinow, Julia Kindt [epub]\r\n\r\nThis handbook offers both students and teachers of ancient Greek religion a comprehensive overview of the current state of scholarship in the subject, from the Archaic to the Hellenistic periods. It not only presents key information, but also explores the ways in which such information is gathered and the different approaches that have shaped the area. In doing so, the volume provides a crucial research and orientation tool for students of the ancient world, and also makes a vital contribution to the key debates surrounding the conceptualization of ancient Greek religion. \r\n\r\nThe handbook&apos;s initial chapters lay out the key dimensions of ancient Greek religion, approaches to evidence, and the representations of myths. The following chapters discuss the continuities and differences between religious practices in different cultures, including Egypt, the Near East, the Black Sea, and Bactria and India. The range of contributions emphasizes the diversity of relationships between mortals and the supernatural - in all their manifestations, across, between, and beyond ancient Greek cultures - and draws attention to religious activities as dynamic, highlighting how they changed over time, place, and context.\r\n\r\nEsther Eidinow is Associate Professor in Ancient Greek History at the University of Nottingham. Julia Kindt is Associate Professor in the Department of Classics and Ancient History at the University of Sydney.\r\n\r\nHardcover: 736 pages\r\nPublisher: Oxford University Press; 1st edition (December 1, 2015)","last_updated":"2017-12-09T12:08:55.726Z","parsed":{"xt":"urn:btih:75bd30aec79c1b1ce27cad46de6a44ac46e50acc","dn":"The Oxford Handbook of Ancient Greek Religion","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"75bd30aec79c1b1ce27cad46de6a44ac46e50acc","infoHashBuffer":{"type":"Buffer","data":[117,189,48,174,199,156,27,28,226,124,173,70,222,106,68,172,70,229,10,204]},"name":"The Oxford Handbook of Ancient Greek Religion","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}