{"title":"Daniel Mark Epstein - The Loyal Son_ The War in Ben Franklin's H","magnet":"magnet:?xt=urn:btih:75ed0fd26427fa1b7ac51543e3c75c4d20d4e848&dn=Daniel+Mark+Epstein+-+The+Loyal+Son_+The+War+in+Ben+Franklin%27s+H&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"18474228","seeders":"5","leechers":"24","description":"xx\r\n\r\nDaniel Mark Epstein - The Loyal Son_ The War in Ben Franklin&apos;s House 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe dramatic story of a founding father, his illegitimate son, and the tragedy of their conflict during the American Revolution - from the acclaimed author of The Lincolns.\r\n\r\nBen Franklin is the most lovable of America&apos;s founding fathers. His wit, his charm, his inventiveness - even his grandfatherly appearance - are legendary. But this image obscures the scandals that dogged him throughout his life. In The Loyal Son, award-winning historian Daniel Mark Epstein throws the spotlight on one of the more enigmatic aspects of Franklin&apos;s biography: his complex and confounding relationship with his illegitimate son, William.\r\n\r\nWhen he was 24, Franklin fathered a child with a woman who was not his wife. He adopted the boy, raised him, and educated him to be his aide. Ben and William became inseparable. After the famous kite-in-a-thunderstorm experiment, it was William who proved that the electrical charge in a lightning bolt travels from the ground up, not from the clouds down. On a diplomatic mission to London, it was William who charmed London society. He was invited to walk in the procession of the coronation of George III; Ben was not.\r\n\r\nThe outbreak of the American Revolution caused a devastating split between father and son. By then William was royal governor of New Jersey while Ben was one of the foremost champions of American independence. In 1776 the Continental Congress imprisoned William for treason. George Washington made efforts to win William&apos;s release while his father, to the world&apos;s astonishment, appeared to have abandoned him to his fate.\r\n\r\nxx","last_updated":"2017-08-09T12:00:59.740Z","parsed":{"xt":"urn:btih:75ed0fd26427fa1b7ac51543e3c75c4d20d4e848","dn":"Daniel Mark Epstein - The Loyal Son_ The War in Ben Franklin's H","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"75ed0fd26427fa1b7ac51543e3c75c4d20d4e848","infoHashBuffer":{"type":"Buffer","data":[117,237,15,210,100,39,250,27,122,197,21,67,227,199,92,77,32,212,232,72]},"name":"Daniel Mark Epstein - The Loyal Son_ The War in Ben Franklin's H","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}