{"title":"Cold Storage, Alaska by John Straley EPUB","magnet":"magnet:?xt=urn:btih:760828669f6a1bb639582cd3566ed4b7b76d2c26&dn=Cold+Storage%2C+Alaska+by+John+Straley+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2379400","seeders":"0","leechers":"1","description":"xx\r\n\r\nCold Storage, Alaska by John Straley EPUB\r\n\r\nCold Storage, Alaska, is a remote fishing outpost where salmonberries sparkle in the morning frost and where you just might catch a King Salmon if you&apos;re Zen enough to wait for it. Settled in 1935 by Norse fishermen who liked to skinny dip in its natural hot springs, the town enjoyed prosperity in the mid-20th century, at the height of the frozen fish boom. But now the cold storage plant is all but abandoned and the population is shrinking every day.\r\n\r\nClive &quot;the Milkman&quot; McCahon returns to his tiny Alaska hometown after a seven-year jail stint for dealing coke. He has a lot to make up to his younger brother, Miles, who has dutifully been taking care of their ailing mother - and, really, all of Cold Storage. Miles is a physician&apos;s assistant and the closest thing to a doctor this side of Sitka. But Clive doesn&apos;t realize the trouble he&apos;s bringing home. He&apos;s reformed now, and his dream is to open a bar-slash-church (a Cold Storage ordinance requires there to be as many churches in town as there are bars). Clive&apos;s vengeful old business partner is hot on his heels, a stick-in-the-mud State Trooper is dying to bust Clive for narcotics, and, to complicate everything, Clive might be going insane - lately, he&apos;s been hearing animals talking to him. Will his arrival in Cold Storage be a breath of fresh air for the sleepy, depopulated town? Or will it turn the whole place upside-down?\r\n\r\nxx","last_updated":"2017-11-13T12:00:58.948Z","parsed":{"xt":"urn:btih:760828669f6a1bb639582cd3566ed4b7b76d2c26","dn":"Cold Storage, Alaska by John Straley EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"760828669f6a1bb639582cd3566ed4b7b76d2c26","infoHashBuffer":{"type":"Buffer","data":[118,8,40,102,159,106,27,182,57,88,44,211,86,110,212,183,183,109,44,38]},"name":"Cold Storage, Alaska by John Straley EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}