{"title":"The World Broke in Two_ Virginia Woolf, T S Eliot, D H Lawrence,","magnet":"magnet:?xt=urn:btih:76736203c59f4cac53c22fde5c3807a8df485034&dn=The+World+Broke+in+Two_+Virginia+Woolf%2C+T+S+Eliot%2C+D+H+Lawrence%2C&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4416702","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe World Broke in Two_ Virginia Woolf, T S Eliot, D H Lawrence, E M Forster and the Year That Changed Literature by Bill Goldstein ePUB eBOOK-ZAK\r\n\r\nA revelatory narrative of the intersecting lives and works of revered authors Virginia Woolf, T. S. Eliot, E. M. Forster, and D. H. Lawrence during 1922, the birth year of modernism.\r\n\r\nThe World Broke in Two tells the fascinating story of the intellectual and personal journeys four legendary writers - Virginia Woolf, T. S. Eliot, E. M. Forster, and D. H. Lawrence - make over the course of one pivotal year. As 1922 begins, all four are literally at a loss for words, confronting an uncertain creative future despite success in the past. The literary ground is shifting, as Ulysses is published in February and Proust&apos;s In Search of Lost Time begins to be published in England in the autumn. Yet, dismal as their prospects seemed in January, by the end of the year Woolf has started Mrs. Dalloway, Forster has, for the first time in nearly a decade, returned to work on the novel that will become A Passage to India, Lawrence has written Kangaroo, his unjustly neglected and most autobiographical novel, and Eliot has finished - and published to acclaim - &quot;The Waste Land&quot;.\r\n\r\nAs Willa Cather put it, &quot;The world broke in two in 1922 or thereabouts&quot;, and what these writers were struggling with that year was in fact the invention of modernism. Based on original research, Bill Goldstein&apos;s The World Broke in Two captures both the literary breakthroughs and the intense personal dramas of these beloved writers as they strive for greatness.\r\n\r\nxx","last_updated":"2017-08-20T12:00:23.273Z","parsed":{"xt":"urn:btih:76736203c59f4cac53c22fde5c3807a8df485034","dn":"The World Broke in Two_ Virginia Woolf, T S Eliot, D H Lawrence,","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"76736203c59f4cac53c22fde5c3807a8df485034","infoHashBuffer":{"type":"Buffer","data":[118,115,98,3,197,159,76,172,83,194,47,222,92,56,7,168,223,72,80,52]},"name":"The World Broke in Two_ Virginia Woolf, T S Eliot, D H Lawrence,","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}