{"title":"Structural Health Monitoring of Aerospace Composites","magnet":"magnet:?xt=urn:btih:76b0d12908e4d1533040dfbe5f062962832cec28&dn=Structural+Health+Monitoring+of+Aerospace+Composites&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"TehBone","categoryP":"other","categoryS":"e_books","size":"51426921","seeders":"29","leechers":"8","description":"Structural Health Monitoring of Aerospace Composites - Victor Giurgiutiu (AP, 2016).pdf\r\n\r\nStructural Health Monitoring of Aerospace Composite Structures offers a comprehensive review of established and promising technologies under development in the emerging area of structural health monitoring (SHM) of aerospace composite structures.\r\n\r\nBeginning with a description of the different types of composite damage, which differ fundamentally from the damage states encountered in metallic airframes, the book moves on to describe the SHM methods and sensors currently under consideration before considering application examples related to specific composites, SHM sensors, and detection methods. Expert author Victor Giurgiutiu closes with a valuable discussion of the advantages and limitations of various sensors and methods, helping you to make informed choices in your structure research and development.\r\n\r\nThe first comprehensive review of one of the most ardent research areas in aerospace structures, providing breadth and detail to bring engineers and researchers up to speed on this rapidly developing field\r\nCovers the main classes of SHM sensors, including fiber optic sensors, piezoelectric wafer active sensors, electrical properties sensors and conventional resistance strain gauges, and considers their applications and limitation\r\nIncludes details of active approaches, including acousto-ultrasonics, vibration, frequency transfer function, guided-wave tomography, phased arrays, and electrochemical impedance spectroscopy (ECIS), among other emerging methods","last_updated":"2017-06-10T12:04:56.844Z","parsed":{"xt":"urn:btih:76b0d12908e4d1533040dfbe5f062962832cec28","dn":"Structural Health Monitoring of Aerospace Composites","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"76b0d12908e4d1533040dfbe5f062962832cec28","infoHashBuffer":{"type":"Buffer","data":[118,176,209,41,8,228,209,83,48,64,223,190,95,6,41,98,131,44,236,40]},"name":"Structural Health Monitoring of Aerospace Composites","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}