{"title":"Fuels and Fuel-additives","magnet":"magnet:?xt=urn:btih:7760cc052f9565fb1b81a4a434b671b307d4676e&dn=Fuels+and+Fuel-additives&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"2832124","seeders":"19","leechers":"1","description":"Fuels and Fuel-additives - S.P. Srivastava, Jen&#xF5; Hancs&#xF3;k (Wiley, 2014).pdf\r\n\r\nExamines all stages of fuel production, from feedstocks to finished products\r\n\r\nExploring chemical structures and properties, this book sheds new light on the current science and technology of producing energy efficient and environmentally friendly fuels. Moreover, it explains the role of fuel-additives in the production cycle. This expertly written and organized guide to fuels and fuel-additives also presents requirements, rules and regulations, including US and EU standards governing automotive emissions, fuel quality and specifications, alternate fuels, biofuels, antioxidants, deposit control detergents/dispersants, stabilizers, corrosion inhibitors, and polymeric fuel-additives.\r\n\r\nFuels and Fuel-Additives covers all stages and facets of the production of engine fuels as well as heating and fuel oils. The book begins with a quick portrait of the future of fuels and fuel production. Then, it sets forth the regulations controlling exhaust gas emissions and fuel quality from around the world. Next, the book covers:\r\n\r\nProcessing of engine fuels derived from crude oil, including the production of blending components\r\nProduction of alternative fuels\r\nFuel-additives for automotive engines\r\nBlending of fuels\r\nKey properties of motor fuels and their effects on engines and the environment\r\nAviation fuels\r\nThe final chapter of the book deals with fuel oils and marine fuels. Each chapter is extensively referenced, providing a gateway to the primary and secondary literature in the field. At the end of the book, a convenient glossary defines all the key terms used in the book.\r\n\r\nExamining the full production cycle from feedstocks to final products, Fuels and Fuel-Additives is recommended for students, engineers, and scientists working in fuels and energy production","last_updated":"2017-06-08T12:01:30.054Z","parsed":{"xt":"urn:btih:7760cc052f9565fb1b81a4a434b671b307d4676e","dn":"Fuels and Fuel-additives","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7760cc052f9565fb1b81a4a434b671b307d4676e","infoHashBuffer":{"type":"Buffer","data":[119,96,204,5,47,149,101,251,27,129,164,164,52,182,113,179,7,212,103,110]},"name":"Fuels and Fuel-additives","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}