{"title":"Comics Art in China - John A. Lent and Xu Ying","magnet":"magnet:?xt=urn:btih:77f65c71bb3c491217ca7753591d8da0afdeb766&dn=Comics+Art+in+China+-+John+A.+Lent+and+Xu+Ying&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"suprbayrequest","categoryP":"other","categoryS":"e_books","size":"13933628","seeders":"48","leechers":"5","description":"Comics Art in China by John A. Lent and Xu Ying\r\n\r\nretail epub\r\n\r\nIn the most comprehensive and authoritative source on this subject, Comics Art in China covers almost all comics art forms in mainland China, providing the history from the nineteenth century to the present as well as perspectives on both the industry and the art form.\r\n\r\nThis volume encompasses political, social, and gag cartoons, lianhuanhua (picture books), comic books, humorous drawings, cartoon and humor periodicals, and donghua (animation) while exploring topics ranging from the earliest Western-influenced cartoons and the popular, often salacious, 1930s humor magazines to cartoons as wartime propaganda and comics art in the reform. Coupling a comprehensive review of secondary materials (histories, anthologies, biographies, memoirs, and more) in English and Chinese with the artists&apos; actual works, the result spans more than two centuries of Chinese animation. Structured chronologically, the study begins with precursors in early China and proceeds through the Republican, wartime, Communist, and market economy periods.\r\n\r\nBased primarily on interviews senior scholar John A. Lent and Xu Ying conducted with over one hundred cartoonists, animators, and other comics art figures, Comics Art in China sheds light on tumult and triumphs. Meticulously, Lent and Xu describe the evolution of Chinese comics within a global context, probing the often-tense relationship between expression and government, as well as proving that art can be a powerful force for revolution. Indeed, the authors explore Chinese comics art as it continues to grow and adapt in the twenty-first century. Enhanced with over one hundred black-and-white and color illustrations, this book stands out as not only the first such survey in English, but perhaps the most complete one in any language.\r\n\r\nHardcover: 288 pages\r\nPublisher: University Press of Mississippi (July 20, 2017)\r\n\r\n\r\n    <a href=\"\nhttps://pirates-forum.org/Forum-Requests\" rel=\"nofollow\" target=\"_NEW\">\nhttps://pirates-forum.org/Forum-Requests</a>","last_updated":"2017-11-05T12:13:18.599Z","parsed":{"xt":"urn:btih:77f65c71bb3c491217ca7753591d8da0afdeb766","dn":"Comics Art in China - John A. Lent and Xu Ying","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"77f65c71bb3c491217ca7753591d8da0afdeb766","infoHashBuffer":{"type":"Buffer","data":[119,246,92,113,187,60,73,18,23,202,119,83,89,29,141,160,175,222,183,102]},"name":"Comics Art in China - John A. Lent and Xu Ying","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}