{"title":"\nOnce upon a Time in Russia by Ben Mezrich EPUB","magnet":"magnet:?xt=urn:btih:7815bf61195c78cb8a37bee4c0477dbb6e212fcc&dn=Once+upon+a+Time+in+Russia+by+Ben+Mezrich+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2978837","seeders":"0","leechers":"0","description":"xx\r\n\r\nOnce upon a Time in Russia by Ben Mezrich EPUB\r\n\r\nThe best-selling author of Bringing Down the House (63 weeks on the New York Times best-seller list and the basis for the hit movie 21) and The Accidental Billionaires (the basis for the Academy Award-winning film The Social Network) delivers an epic drama of wealth, rivalry, and betrayal among megawealthy Russian oligarchs - and its international repercussions.\r\n\r\nOnce Upon a Time in Russia is the untold true story of the larger-than-life billionaire oligarchs who surfed the waves of privatization to reap riches after the fall of the Soviet regime: &quot;Godfather of the Kremlin&quot; Boris Berezovsky, a former mathematician whose first entrepreneurial venture was running an automobile reselling business, and Roman Abramovich, his dashing young prot&#xE9;g&#xE9;, who built a multibillion-dollar empire of oil and aluminum. Locked in a complex, uniquely Russian partnership, Berezovsky and Abramovich battled their way through the &quot;Wild East&quot; of Russia, with Berezovsky acting as the younger man&apos;s krysha - his roof, his protector.\r\n\r\nWritten with the heart-stopping pacing of a thriller - but even more compelling because it is true - this story of amassing obscene wealth and power depicts a rarefied world seldom seen up close. Under Berezovsky&apos;s krysha, Abramovich built one of Russia&apos;s largest oil companies from the ground up and in exchange made cash deliveries - including $491 million in just one year. But their relationship frayed when Berezovsky attacked President Vladimir Putin in the media - and had to flee to the UK. Abramovich continued to prosper. Dead bodies trailed Berezovsky&apos;s footsteps, and threats followed him to London, where an associate of his died painfully and famously of Polonium poisoning. Then Berezovsky himself was later found dead, declared a suicide.\r\n\r\nxx","last_updated":"2017-10-17T12:07:11.202Z","parsed":{"xt":"urn:btih:7815bf61195c78cb8a37bee4c0477dbb6e212fcc","dn":"Once upon a Time in Russia by Ben Mezrich EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7815bf61195c78cb8a37bee4c0477dbb6e212fcc","infoHashBuffer":{"type":"Buffer","data":[120,21,191,97,25,92,120,203,138,55,190,228,192,71,125,187,110,33,47,204]},"name":"Once upon a Time in Russia by Ben Mezrich EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}