{"title":"Kerry Egan - On Living 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:7817cd2abc4f6fec46c83fceaef383e7399a23eb&dn=Kerry+Egan+-+On+Living+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3082249","seeders":"8","leechers":"3","description":"xx\r\n\r\nKerry Egan - On Living 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA hospice chaplain passes on wisdom on giving meaning to life, from those taking leave of it.\r\n\r\nAs a hospice chaplain, Kerry Egan didn&apos;t offer sermons or prayers unless they were requested; in fact, she found, the dying rarely want to talk about God, at least not overtly. Instead she discovered she&apos;d been granted an invaluable chance to witness firsthand what she calls the &quot;spiritual work of dying&quot; - the work of finding or making meaning of one&apos;s life, the experiences it&apos;s contained, and the people who have touched it, the betrayals, wounds, unfinished business, and unrealized dreams. Instead of talking she mainly listened: to stories of hope and regret, shame and pride, mystery and revelation and secrets held too long. Most of all, though, she listened as her patients talked about love - love for their children and partners and friends; love they didn&apos;t know how to offer; love they gave unconditionally; love they learned, sometimes belatedly, to grant themselves.\r\n\r\nThis isn&apos;t a book about dying - it&apos;s a book about living. And Egan isn&apos;t just passively bearing witness to these stories. An emergency procedure during the birth of her first child left her physically whole but emotionally and spiritually adrift. Her work as a hospice chaplain healed her from a brokenness she came to see we all share. Each of her patients taught her something - how to find courage in the face of fear or the strength to make amends; how to be profoundly compassionate and fiercely empathetic; how to see the world in grays instead of black and white. In this poignant, moving, and beautiful book, she passes along all their precious and necessary gifts.\r\n\r\nxx","last_updated":"2017-08-08T12:01:14.047Z","parsed":{"xt":"urn:btih:7817cd2abc4f6fec46c83fceaef383e7399a23eb","dn":"Kerry Egan - On Living 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7817cd2abc4f6fec46c83fceaef383e7399a23eb","infoHashBuffer":{"type":"Buffer","data":[120,23,205,42,188,79,111,236,70,200,63,206,174,243,131,231,57,154,35,235]},"name":"Kerry Egan - On Living 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}