{"title":"It Ends with Us by Colleen Hoover EPUB","magnet":"magnet:?xt=urn:btih:78699f83ab4e9c1667c405af6c4c0833ab8a109f&dn=It+Ends+with+Us+by+Colleen+Hoover+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"411260","seeders":"14","leechers":"10","description":"xx\r\n\r\nIt Ends with Us by Colleen Hoover EPUB\r\n\r\nThe newest, highly anticipated novel from beloved New York Times best-selling author, Colleen Hoover.\r\n\r\nSometimes it is the one who loves you who hurts you the most.\r\n\r\nLily hasn&apos;t always had it easy, but that&apos;s never stopped her from working hard for the life she wants. She&apos;s come a long way from the small town in Maine where she grew up - she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily&apos;s life suddenly seems almost too good to be true.\r\n\r\nRyle is assertive, stubborn, maybe even a little arrogant. He&apos;s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn&apos;t hurt. Lily can&apos;t get him out of her head. But Ryle&apos;s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his &quot;no dating&quot; rule, she can&apos;t help but wonder what made him that way in the first place.\r\n\r\nAs questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan - her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.\r\n\r\nWith this bold and deeply personal novel, Colleen Hoover delivers a heart-wrenching story that breaks exciting new ground for her as a writer. Combining a captivating romance with a cast of all-too-human characters, It Ends with Us is an unforgettable tale of love that comes at the ultimate price.\r\n\r\nxx","last_updated":"2017-12-18T12:01:31.582Z","parsed":{"xt":"urn:btih:78699f83ab4e9c1667c405af6c4c0833ab8a109f","dn":"It Ends with Us by Colleen Hoover EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78699f83ab4e9c1667c405af6c4c0833ab8a109f","infoHashBuffer":{"type":"Buffer","data":[120,105,159,131,171,78,156,22,103,196,5,175,108,76,8,51,171,138,16,159]},"name":"It Ends with Us by Colleen Hoover EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}