{"title":"Hacking Growth_ How Today's Fastest-Growing Companies Drive Brea","magnet":"magnet:?xt=urn:btih:7885b857c825dae8d0aaf4406aa78e63eb94eeed&dn=Hacking+Growth_+How+Today%27s+Fastest-Growing+Companies+Drive+Brea&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3677653","seeders":"0","leechers":"0","description":"xx\r\n\r\nHacking Growth_ How Today&apos;s Fastest-Growing Companies Drive Breakout Success by Sean Ellis and Morgan Brown ePUB eBOOK-ZAK\r\n\r\nThe definitive playbook by the pioneers of Growth Hacking, one of the hottest business methodologies in Silicon Valley and beyond.\r\n\r\nIt seems hard to believe today, but there was a time when Airbnb was the best-kept secret of travel hackers and couch surfers, Pinterest was a niche website frequented only by bakers and crafters, LinkedIn was an exclusive network for C-suite executives and top-level recruiters,was My Space&apos;s sorry step-brother, and Uber was a scrappy upstart that didn&apos;t stand a chance against the Goliath that was New York City yellow cabs.\r\n\r\nSo how did these companies grow from these humble beginnings into the powerhouses they are today? Contrary to popular belief, they didn&apos;t explode to massive worldwide popularity simply by building a great product then crossing their fingers and hoping it would catch on. There was a studied, carefully implemented methodology behind these companies&apos; extraordinary rise. That methodology is called Growth Hacking, and its practitioners include not just today&apos;s hottest start-ups, but also companies like IBM, Walmart, and Microsoft as well as the millions of entrepreneurs, marketers, managers, and executives who make up the community of GrowthHackers.com.\r\n\r\nThink of the Growth Hacking methodology as doing for market-share growth what Lean Start-Up did for product development, and Scrum did for productivity. It involves cross-functional teams and rapid-tempo testing and iteration that focuses customers: attaining them, retaining them, engaging them, and motivating them to come back and buy more.\r\n\r\nAn accessible and practical toolkit that teams and companies in all industries can use to increase their customer base and market share, this book walks readers through the process of creating and executing their own custom-made growth hacking strategy. It is a must read for any marketer, entrepreneur, innovator or manager looking to replace wasteful big bets and &quot;spaghetti-on-the-wall&quot; approaches with more consistent, replicable, cost-effective, and data-driven results.\r\n\r\nxx","last_updated":"2017-09-20T12:01:16.183Z","parsed":{"xt":"urn:btih:7885b857c825dae8d0aaf4406aa78e63eb94eeed","dn":"Hacking Growth_ How Today's Fastest-Growing Companies Drive Brea","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7885b857c825dae8d0aaf4406aa78e63eb94eeed","infoHashBuffer":{"type":"Buffer","data":[120,133,184,87,200,37,218,232,208,170,244,64,106,167,142,99,235,148,238,237]},"name":"Hacking Growth_ How Today's Fastest-Growing Companies Drive Brea","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}