{"title":"Secrecy World_ Inside the Panama Papers by Jake Bernstein EPUB","magnet":"magnet:?xt=urn:btih:78a7c6337059b4c9ab9944e81300720c5b510551&dn=Secrecy+World_+Inside+the+Panama+Papers+by+Jake+Bernstein+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10634678","seeders":"0","leechers":"0","description":"xx\r\n\r\nSecrecy World_ Inside the Panama Papers by Jake Bernstein EPUB\r\n\r\nPulitzer Prize-winning journalist Jake Bernstein takes readers inside the scandalous world revealed by the Panama Papers, a landscape of illicit money, political corruption, and fraud on a global scale.\r\n\r\nA hidden circulatory system flows beneath the surface of global finance, carrying trillions of dollars from drug trafficking, tax evasion, bribery, and other illegal enterprises. This network masks the identities of the individuals who benefit from these activities, aided by bankers, lawyers, and auditors who get paid to look the other way. In Secrecy World, Pulitzer Prize-winning investigative reporter Jake Bernstein explores this shadow economy and how it developed, drawing on millions of leaked documents from the files of the Panamanian law firm Mossack Fonseca - a trove now known as the Panama Papers - as well as other journalistic and government investigations. Bernstein shows how shell companies allow the uber wealthy and celebrities to escape taxes and provide cover for illicit activities on a massive scale by crime bosses and corrupt politicians across the globe.\r\n\r\nBernstein has traveled to Latin America and Europe and within the United States to uncover how these strands fit together - who is involved, how they operate, and the real-world impact. He also recounts how Mossack Fonseca was finally exposed and what lies ahead for the corporations, banks, law firms, individuals, and governments that were implicated.\r\n\r\nSecrecy World offers a disturbing and sobering view of how the world really works and raises crucial questions about financial and legal institutions we may once have trusted. This book discusses the fragile scaffolding upholding any tax haven, the flexible laws of banking, and the radiating impact of an international financial scandal.\r\n\r\nxx","last_updated":"2017-11-23T12:04:52.809Z","parsed":{"xt":"urn:btih:78a7c6337059b4c9ab9944e81300720c5b510551","dn":"Secrecy World_ Inside the Panama Papers by Jake Bernstein EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78a7c6337059b4c9ab9944e81300720c5b510551","infoHashBuffer":{"type":"Buffer","data":[120,167,198,51,112,89,180,201,171,153,68,232,19,0,114,12,91,81,5,81]},"name":"Secrecy World_ Inside the Panama Papers by Jake Bernstein EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}