{"title":"Rod Dreher - The Benedict Option_ A Strategy for Christians in a","magnet":"magnet:?xt=urn:btih:78c71dc00d03efd19c739da50904b59a0c5fc561&dn=Rod+Dreher+-+The+Benedict+Option_+A+Strategy+for+Christians+in+a&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3251547","seeders":"0","leechers":"0","description":"xx\r\n\r\nRod Dreher - The Benedict Option_ A Strategy for Christians in a Post-Christian Nation 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe light of the Christian faith is flickering out all over the West. American churches are beset by a rapidly secularizing culture, the departure of young people, and watered-down pseudo-spirituality. Political solutions have failed, as the self-destruction of the Republican Party indicates, and the future of religious freedom has never been in greater doubt. The center is not holding. The West, cut off from its Christian roots, is falling into a new Dark Age.\r\n\r\nThe good news is that there is a blueprint for a time-tested Christian response to this decline. In The Benedict Option, Dreher calls on traditional Christians to learn from the example of St. Benedict of Nursia, a sixth-century monk who turned from the chaos and decadence of the collapsing Roman Empire and found a new way to live out the faith in community. For five difficult centuries, Benedict&apos;s monks kept the faith alive through the Dark Ages, and prepared the way for the rebirth of civilization. The Benedict Option shows believers how to build the resilience to face the modern world with the confidence and fervor of the early church. Christians face a time of choosing, with the fate of Christianity in Western civilization hanging in the balance. In this powerful challenge to complacency, Dreher shows why churches who fail to take the Benedict Option aren&apos;t going to make it.\r\n\r\nxx","last_updated":"2017-08-09T12:00:59.572Z","parsed":{"xt":"urn:btih:78c71dc00d03efd19c739da50904b59a0c5fc561","dn":"Rod Dreher - The Benedict Option_ A Strategy for Christians in a","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78c71dc00d03efd19c739da50904b59a0c5fc561","infoHashBuffer":{"type":"Buffer","data":[120,199,29,192,13,3,239,209,156,115,157,165,9,4,181,154,12,95,197,97]},"name":"Rod Dreher - The Benedict Option_ A Strategy for Christians in a","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}