{"title":"The Golden House_ A Novel by Salman Rushdie ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:78f1e6879e0b008bd11493162d81a63a9657e560&dn=The+Golden+House_+A+Novel+by+Salman+Rushdie+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3437677","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Golden House_ A Novel by Salman Rushdie ePUB eBOOK-ZAK\r\n\r\nA modern American epic set against the panorama of contemporary politics and culture - a hurtling mystery that is equal parts The Great Gatsby and The Bonfire of the Vanities.\r\n\r\nOn the day of Barack Obama&apos;s inauguration, an enigmatic billionaire from foreign shores takes up residence in the architectural jewel of &quot;the Gardens&quot;, a cloistered community in New York&apos;s Greenwich Village. The neighborhood is a bubble within a bubble, and the residents are immediately intrigued by the eccentric newcomer and his family. Along with his improbable name, untraceable accent, and unmistakable whiff of danger, Nero Golden has brought along his three adult sons: agoraphobic, alcoholic Petya, a brilliant recluse with a tortured mind; Apu, the flamboyant artist, sexually and spiritually omnivorous, famous on 20 blocks; and D, at 22 the baby of the family, harboring an explosive secret even from himself. There is no mother, no wife, at least not until Vasilisa, a sleek Russian expat, snags the septuagenarian Nero, becoming the queen to his king - a queen in want of an heir.\r\n\r\nOur guide to the Goldens&apos; world is their neighbor Ren&#xE9;, an ambitious young filmmaker. Researching a movie about the Goldens, he ingratiates himself into their household. Seduced by their mystique, he is inevitably implicated in their quarrels, their infidelities, and, indeed, their crimes. Meanwhile, like a bad joke, a certain comic-book villain embarks upon a crass presidential run that turns New York upside-down.\r\n\r\nSet against the strange and exuberant backdrop of current American culture and politics, The Golden House also marks Salman Rushdie&apos;s triumphant and exciting return to realism. The result is a modern epic of love and terrorism, loss and reinvention - a powerful, timely story told with the daring and panache that make Salman Rushdie a force of light in our dark new age.\r\n\r\nxx","last_updated":"2017-09-06T12:01:01.128Z","parsed":{"xt":"urn:btih:78f1e6879e0b008bd11493162d81a63a9657e560","dn":"The Golden House_ A Novel by Salman Rushdie ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"78f1e6879e0b008bd11493162d81a63a9657e560","infoHashBuffer":{"type":"Buffer","data":[120,241,230,135,158,11,0,139,209,20,147,22,45,129,166,58,150,87,229,96]},"name":"The Golden House_ A Novel by Salman Rushdie ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}