{"title":"Rory Feek - This Life I Live 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:7a1a5464c4cb2253d09b896c903d81f192732794&dn=Rory+Feek+-+This+Life+I+Live+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2641320","seeders":"0","leechers":"0","description":"xx\r\n\r\nRory Feek - This Life I Live 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe story she said he was born to write.\r\n\r\nHer story. His story. The love story of Joey and Rory.\r\n\r\nBy inviting so many into the final months of Joey&apos;s life as she battled cancer, Joey and Rory Feek captured hearts around the world with how they handled the diagnosis; the inspiring, simple way they chose to live; and how they loved each other every step of the way. But there is far more to the story.\r\n\r\n&quot;My life is very ordinary,&quot; says Rory. &quot;On the surface it is not very special. If you looked at it day to day, it wouldn&apos;t seem like much. But when you look at it in a bigger context - as part of a larger story - you start to see the magic that is on the pages of the book that is my life. And the more you look, the more you see. Or at least I do.&quot;\r\n\r\nIn this vulnerable book, he takes us for the first time into his own challenging life story and what it was like growing up in rural America with little money and even less family stability.\r\n\r\nThis is the story of a man searching for meaning and security in a world that offered neither. And it&apos;s the story of a man who finally gives it all to a power higher than himself and soon meets a young woman who will change his heart forever.\r\n\r\nIn This Life I Live, Rory Feek helps us to connect more fully not only to his and \r\nJoey&apos;s story but also to our own journeys. He shows what can happen when we are fully open in life&apos;s key moments, whether meeting our life companion or tackling an unexpected tragedy. He also gives never-before-revealed details on their life together and what he calls &quot;the long good-bye&quot; - the blessing of being able to know that life is going to end and taking advantage of it. Rory shows how we are all actually there already and how we can learn to live that way every day.\r\n\r\nA gifted man from nowhere and everywhere in search of something to believe in. A young woman from the Midwest with an angelic voice and deep roots that just needed a place to be planted. This is their story. Two hearts that found each other and touched millions of other hearts along the way.\r\n\r\nxx","last_updated":"2017-07-05T12:00:14.596Z","parsed":{"xt":"urn:btih:7a1a5464c4cb2253d09b896c903d81f192732794","dn":"Rory Feek - This Life I Live 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7a1a5464c4cb2253d09b896c903d81f192732794","infoHashBuffer":{"type":"Buffer","data":[122,26,84,100,196,203,34,83,208,155,137,108,144,61,129,241,146,115,39,148]},"name":"Rory Feek - This Life I Live 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}