{"title":"The Girl with the Lower Back Tattoo by Amy Schumer 2016 RETAiL e","magnet":"magnet:?xt=urn:btih:7a3c5bdd70c16e2c6d3ac191797e70aa7a9294d9&dn=The+Girl+with+the+Lower+Back+Tattoo+by+Amy+Schumer+2016+RETAiL+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"49185998","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Girl with the Lower Back Tattoo by Amy Schumer 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\n&quot;Amy&apos;s got your back. She&apos;s in your corner. She&apos;s an honesty bomb. And she&apos;s coming for you.&quot; (Actress Tilda Swinton, Trainwreck costar)\r\n\r\nThe Emmy Award-winning comedian, actress, writer, and star of Inside Amy Schumer and the acclaimed film Trainwreck has taken the entertainment world by storm with her winning blend of smart, satirical humor. Now Amy Schumer has written a refreshingly candid and uproariously funny collection of (extremely) personal and observational essays.\r\n\r\nIn The Girl with the Lower Back Tattoo, Amy mines her past for stories about her teenage years, her family, relationships, and sex and shares the experiences that have shaped who she is - a woman with the courage to bare her soul to stand up for what she believes in, all while making us laugh. Down to earth and relatable, frank and unapologetic, Amy Schumer is one of us: She relies on her sister for advice, still hangs out with her high school pals, and continues to navigate the ever-changing boundaries in love, work, and life.\r\n\r\nRanging from the raucous to the romantic, the heartfelt to the harrowing, this highly entertaining and universally appealing collection is the literary equivalent of a night out with your best friend - an unforgettable and fun adventure that you wish could last forever. Whether she&apos;s experiencing lust at first sight while in the airport security line, sharing her own views on love and marriage, admitting to being an introvert, or discovering her cross-fit instructor&apos;s secret bad habit, Amy Schumer proves to be a bighearted, brave, and thoughtful storyteller that will leave you nodding your head in recognition, laughing out loud, and sobbing uncontrollably - but only because it&apos;s over.\r\n\r\nxx","last_updated":"2017-08-19T12:00:31.030Z","parsed":{"xt":"urn:btih:7a3c5bdd70c16e2c6d3ac191797e70aa7a9294d9","dn":"The Girl with the Lower Back Tattoo by Amy Schumer 2016 RETAiL e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7a3c5bdd70c16e2c6d3ac191797e70aa7a9294d9","infoHashBuffer":{"type":"Buffer","data":[122,60,91,221,112,193,110,44,109,58,193,145,121,126,112,170,122,146,148,217]},"name":"The Girl with the Lower Back Tattoo by Amy Schumer 2016 RETAiL e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}