{"title":"\nThe Elder Scrolls V Skyrim Legendary Edition repack-P2P","magnet":"magnet:?xt=urn:btih:7a4de3f10f3e6cca3c07b81d6c90fdca5acefb8f&dn=The+Elder+Scrolls+V+Skyrim+Legendary+Edition+repack-P2P&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"psychana","categoryP":"games","categoryS":"pc","size":"125008089","seeders":"0","leechers":"0","description":"\r\n\r\nRelease Date: November 11, 2011\r\nGenre: RPG\r\nDeveloper: Bethesda Game Studios\r\nPublisher: Bethesda Softworks\r\nLanguage: ENG\r\nLanguage: ENG\r\nPublication Type: RePack (game + DLC + Mod&apos;s)\r\nTablet: DeZoMoR4iN\r\n\r\nSystem requirements:\r\nv Operating system: Windows XP, Vista, 7,\r\nv Processor: Intel Core 2 Duo 2.7\r\nv RAM: 3 GB\r\nv Video: 1024 MB\r\nv Sound Card: DirectX 9.0c compatible\r\nv Free hard drive space: 23 GB\r\n\r\nDescription: After the murder of the King of Skyrim Empire was on the brink of disaster. Around the pretenders to the throne rallied new alliances, and conflict broke out. Moreover, as predicted by the ancient scrolls in the world returned the brutal and merciless dragon. Now the future of Skyrim and the whole empire depends on the Dragonborn - the man in whose veins flows the blood of the legendary creatures. Only the hero, using the power given him Voters will be able to confront the dragons. And that you have to play its role and determine the fate of Tamriel!\r\n\r\n- The Elder Scrolls V: Skyrim. Create a unique character and do whatever they want in the wizarding world. Skyrim has absorbed all the best features of the series The Elder Scrolls: freedom of choice, the ability to write the history of Tamriel and experience an unforgettable adventure.\r\n- The Elder Scrolls V: Skyrim - Dawnguard. You, Dragonborn, will meet with the Lord Vampire Harkonnen, who intended to destroy the sun through the power of the Ancient scrolls. Will you join the ancient Order of Dawn Guardians or decide themselves to become the lord of vampires? Whichever side you adopt, you will find a lot of adventures.\r\n- The Elder Scrolls V: Skyrim - Hearthfire. Become a landowner and build your dream home - a one-room hut or a huge mansion with his weapons, alchemical laboratory and other necessary buildings. Use new tools to create the stones, clay and timber furniture and decorations. And with the possibility of adoption, you can turn your home into a real home.\r\n- The Elder Scrolls V: Skyrim - Dragonborn. Leave behind the harsh Skyrim. In the vast expanses Solsteyma you have to meet the dark elves and meet with the tribe Skaal. But most importantly, you will meet face to face with the enemy unprecedented - the first Dragonbo","last_updated":"2017-09-26T12:01:28.832Z","parsed":{"xt":"urn:btih:7a4de3f10f3e6cca3c07b81d6c90fdca5acefb8f","dn":"The Elder Scrolls V Skyrim Legendary Edition repack-P2P","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7a4de3f10f3e6cca3c07b81d6c90fdca5acefb8f","infoHashBuffer":{"type":"Buffer","data":[122,77,227,241,15,62,108,202,60,7,184,29,108,144,253,202,90,206,251,143]},"name":"The Elder Scrolls V Skyrim Legendary Edition repack-P2P","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}