{"title":"ShareX v12.0.0","magnet":"magnet:?xt=urn:btih:7a50b4acc7ad7cd14929a68bb4302b44e6aeb2e1&dn=ShareX+v12.0.0&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"distrail","categoryP":"applications","categoryS":"windows","size":"5235316","seeders":"3","leechers":"7","description":"    ______)          _____                        ______         \r\n   (, /  /)         (, /   ) ,                   (, /    )       \r\n     /  (/    _      _/__ /    __  _  _/_  _       /---(  _      \r\n  ) /   / )__(/_     /     _(_/ (_(_(_(___(/_   ) / ____)(_(_(_/_\r\n (_/              ) /                          (_/ (        .-/  ( distrail\r\n\r\n-------------------------------------------------------------------------------\r\n                                 Release Notes\r\n-------------------------------------------------------------------------------\r\nShareX - the Swiss Knife of the screenshot tools.\r\n\r\n\r\nTake a screenshot or a screencast, have it uploaded and get the URL copied to your clipboard with a single hotkey.\r\n\r\nFree, open source, lightweight and free from advertisements!\r\n\r\nAdvanced screenshot capture, screen recorder, file sharing and productivity tool.\r\n\r\nVarious methods of capturing screenshots including full screen, window, monitor, region, freehand, scrolling, and more.\r\n\r\nCustomizable after capture tasks such as annotating, adding effects, watermarking, uploading, printing and other actions.\r\n\r\nUpload any files using configurable hotkeys, clipboard upload, drag &amp; drop or from the Windows Explorer context menu.\r\n\r\nSupports over 50 different image, text, and file hosting services such as Imgur, FTP, Dropbox, Pastebin etc. Also supports many URL shortening and sharing services.\r\n\r\nContains tools like a screen color picker, an image editor, a ruler, a DNS changer, a QR code generator, a directory indexer and more.\r\n\r\nUnlimited customizable workflows with hotkey specific settings.\r\n\r\nProgram that you can trust with over 10 years of active development.\r\n\r\n    ShareX v12.0.0\r\n\r\n    Changelog - 2017-11-27\r\n\r\n    Added windowed mode support to image editor\r\n    Added panning support to image editor, hold middle mouse button to pan canvas (by @L1Q)\r\n    Added real time image effect (blur, pixelate, highlight) preview support to image editor\r\n    Added &#x201C;Image&#x201D; menu to image editor toolbar with these items:\r\n    Image size\r\n    Canvas size\r\n    Rotate 90&#xB0; clockwise\r\n    Rotate 90&#xB0; counter clockwise\r\n    Rotate 180&#xB0;\r\n    Flip horizontal\r\n    Flip vertical\r\n    Added image editor start mode option to &#x201C;Options&#x201D; menu:\r\n    Normal window\r\n    Maximized window (Default)\r\n    Remember and use previous window size, position and maximized state\r\n    Fullscreen\r\n    Added image editor background color option to &#x201C;Options&#x201D; menu\r\n    Added cursor type option to cursor drawing tool\r\n    Show image size, file name and FPS in image editor title bar\r\n    Image editor last selected tool will be remembered separately from region capture\r\n    Changed region capture/image editor resize node visuals\r\n    Support proportional resizing when dragging resize node while holding Shift\r\n    Added QR code decode support, which can scan multiple QR codes at the same time from screen or file\r\n    Added &#x201C;Upload text&#x201D; to main window upload menu and as hotkey\r\n    Added &#x201C;Shorten URL&#x201D; to main window upload menu and as hotkey\r\n    Removed update button from custom uploaders tab because now settings apply instantly\r\n    If custom uploader name field is empty then name will be generated automatically from request url, which is recommended for consistency\r\n    Custom uploader won&#x2019;t export with empty request url or destination type\r\n    While exporting custom uploader all default or empty values will be ignored, that way JSON output can be more compact\r\n    Added custom URL sharing service support, which can be used for example for Discord webhooks\r\n    Added response syntax to custom uploader which can be used in URL fields\r\n    Added random syntax support to custom uploader request URL\r\n    Added Text/URL input to custom uploader arguments/headers value suggestion list\r\n    Renamed Picasa to Google Photos\r\n    Removed dead uploaders: Someimage, Imgland, Minus, Uplea\r\n    Added image effects preset list support, this will cause previous image effect settings to reset\r\n    Added markdown copy options to main window task context menu\r\n    Removed Amazon S3 reduced redundancy storage option because it is now deprecated and even costs more than standard storage to encourage moving to standard storage\r\n    Added standard infrequent access storage option to Amazon S3\r\n    Hide notification window from Alt + Tab and Win + Tab menu (by @sylveon)\r\n    Implemented latest paste.ee API, this will cause previous authentication setting to reset\r\n    Implemented latest Flickr API which is using OAuth for authentication now, this will cause previous authentication setting to reset\r\n    Added direct link option to Flickr\r\n    Updated Lithiio to new API which is using username/password for authentication now instead of Steam OAuth\r\n    Increased Twitter message character limit to 280\r\n    Windows Store ShareX build is now using .NET Framework 4.6.1 so there is no need for additional executable to handle Centennial startup changes anymore (by @sylveon)\r\n    Touch input improvements for region capture (by @mghiasi75)\r\n    Watch folder feature will also check for file size multiple times to make sure that file is not being written before starting upload\r\n    Added ShareX Discord server invite link to main window, you can press X button to permanently hide it\r\n    Both Discord and Patreon buttons will be automatically hidden when main window task list is not empty\r\n    Pressing Esc in quick task menu will close it\r\n    Added verbose request logs option to application settings advanced tab which can be used to debug upload related issues\r\n    Added drag and drop file from history window support (by @campbeb)\r\n    Support Ctrl + A in OCR results window (by @campbeb)\r\n    Main window image preview can now be positioned on the bottom (by @campbeb)\r\n    Removed https option for Imgur and instead always https will be used because now it is used by default on Imgur\r\n    Show current version and latest version in update message box\r\n    In application settings window middle mouse clicking on pre-release check box will download latest dev build from AppVeyor but it should be only used for testing purposes because dev builds can be unstable and therefore not recommended for production use\r\n    Updated design of ShareX web site to have dark colors\r\n    ______________________________________________________________________________\r\n\r\n    CONTACT ME: You can reach me with comments, requests, error reports, etc., at TPB&apos;s forum, SuprBay (you will need to register an account): https://pirates-forum.org//User-distrail\r\n\r\n    PLEASE HELP SEED! If you like this software and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","last_updated":"2017-12-16T12:03:25.595Z","parsed":{"xt":"urn:btih:7a50b4acc7ad7cd14929a68bb4302b44e6aeb2e1","dn":"ShareX v12.0.0","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7a50b4acc7ad7cd14929a68bb4302b44e6aeb2e1","infoHashBuffer":{"type":"Buffer","data":[122,80,180,172,199,173,124,209,73,41,166,139,180,48,43,68,230,174,178,225]},"name":"ShareX v12.0.0","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}