{"title":"Why Bob Dylan Matters by Richard F. Thomas EPUB","magnet":"magnet:?xt=urn:btih:7b0128ba3071201d9bb360de5a6e3a941c43c8c0&dn=Why+Bob+Dylan+Matters+by+Richard+F.+Thomas+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1481187","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhy Bob Dylan Matters by Richard F. Thomas EPUB\r\n\r\nWhen the Nobel Prize for Literature was awarded to Bob Dylan in 2016, a debate raged. Some celebrated while many others questioned the choice. How could the world&apos;s most prestigious book prize be awarded to a famously cantankerous singer-songwriter who wouldn&apos;t even deign to attend the medal ceremony?\r\n\r\nIn Why Bob Dylan Matters, Harvard professor Richard F. Thomas answers this question with magisterial erudition. A world expert on classical poetry, Thomas was initially ridiculed by his colleagues for teaching a course on Bob Dylan alongside his traditional seminars on Homer, Virgil, and Ovid. Dylan&apos;s Nobel Prize brought him vindication, and he immediately found himself thrust into the spotlight as a leading academic voice in all matters Dylanological. Today, through his wildly popular Dylan seminar - affectionately dubbed &quot;Dylan 101&quot; - Thomas is introducing a new generation of fans and scholars to the revered bard&apos;s work.\r\n\r\nThis witty, personal volume is a distillation of Thomas&apos; famous course and makes a compelling case for moving Dylan out of the Rock and Roll Hall of Fame and into the pantheon of classical poets. Asking us to reflect on the question &quot;what makes a classic?&quot;, Thomas offers an eloquent argument for Dylan&apos;s modern relevance while interpreting and decoding Dylan&apos;s lyrics for readers. The most original and compelling volume on Dylan in decades, Why Bob Dylan Matters will illuminate Dylan&apos;s work for the Dylan neophyte and the seasoned fanatic alike. You&apos;ll never think about Bob Dylan in the same way again.\r\n\r\nxx","last_updated":"2017-12-04T12:01:17.847Z","parsed":{"xt":"urn:btih:7b0128ba3071201d9bb360de5a6e3a941c43c8c0","dn":"Why Bob Dylan Matters by Richard F. Thomas EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7b0128ba3071201d9bb360de5a6e3a941c43c8c0","infoHashBuffer":{"type":"Buffer","data":[123,1,40,186,48,113,32,29,155,179,96,222,90,110,58,148,28,67,200,192]},"name":"Why Bob Dylan Matters by Richard F. Thomas EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}