{"title":"Jungle of Stone by William Carlsen EPUB","magnet":"magnet:?xt=urn:btih:7b1c89006ad0b867116431dbcf876e76a24bd1bb&dn=Jungle+of+Stone+by+William+Carlsen+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"19972580","seeders":"0","leechers":"0","description":"xx\r\n\r\nJungle of Stone by William Carlsen EPUB\r\n\r\n&quot;Thrilling.... A captivating history of two men who dramatically changed their contemporaries&apos; view of the past.&quot; (Kirkus)\r\n\r\nIn 1839 rumors of extraordinary yet baffling stone ruins buried within the unmapped jungles of Central America reached two of the world&apos;s most intrepid travelers. Seized by the reports, American diplomat John Lloyd Stephens and British artist Frederick Catherwood - each already celebrated for their adventures in Egypt, the Holy Land, Greece, and Rome - sailed together out of New York Harbor on an expedition into the forbidding rainforests of present-day Honduras, Guatemala, and Mexico. What they found would rewrite the West&apos;s understanding of human history.\r\n\r\nIn the tradition of The Lost City of Z and In the Kingdom of Ice, former San Francisco Chronicle journalist and Pulitzer Prize finalist William Carlsen reveals the unforgettable true story of the discovery of the ancient Maya. Enduring disease, war, and the torments of nature and terrain, Stephens and Catherwood uncovered and documented the remains of an astonishing civilization that had flourished in the Americas at the same time as classic Greece and Rome. Their remarkable book about the experience became a sensation and is recognized today as the birth of American archeology. Most importantly, Stephens and Catherwood were the first to grasp the significance of the Maya remains, recognizing that their antiquity and sophistication overturned the West&apos;s assumptions about the development of civilization.\r\n\r\nBy the time of the flowering of classical Greece (400 BC), the Maya were already constructing pyramids and temples around central plazas. Within a few hundred years, the structures took on a monumental scale. Over the next millennium dozens of city-states evolved, each governed by powerful lords, some with populations larger than any city in Europe at the time. The Maya developed a unified cosmology, an array of common gods, a creation story, and a shared artistic and architectural vision. They created dazzling stucco and stone monuments and bas reliefs, sculpting figures and hieroglyphs with refined artistic skill. At their peak an estimated 10 million people occupied the Maya&apos;s heartland on the Yucatan Peninsula. And yet, by the time the Spanish reached the &quot;New World&quot;, the classic-era Maya had all but disappeared; they would remain a mystery for the next 300 years.\r\n\r\n..\r\n\r\nxx","last_updated":"2017-11-13T12:00:51.512Z","parsed":{"xt":"urn:btih:7b1c89006ad0b867116431dbcf876e76a24bd1bb","dn":"Jungle of Stone by William Carlsen EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7b1c89006ad0b867116431dbcf876e76a24bd1bb","infoHashBuffer":{"type":"Buffer","data":[123,28,137,0,106,208,184,103,17,100,49,219,207,135,110,118,162,75,209,187]},"name":"Jungle of Stone by William Carlsen EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}