{"title":"Planet Nomads v0.6.8","magnet":"magnet:?xt=urn:btih:7ba4acc2ebaae6ff884dd1a7bb4a8c31190cea33&dn=Planet+Nomads+v0.6.8&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"jeux","categoryS":"pc","size":"1309747460","seeders":"5","leechers":"7","description":"Planet Nomads is a sci-fi sandbox game of survival on alien planets through lego-style building. You are a lone astronaut scientist crash-landing on a strangely captivating planet where no human has set foot before. Keeping your wit together and securing your basic survival needs that include food, water and building material is your best start towards figuring out how to get out of this messy situation.Planet Nomads delivers a unique gaming experience by combining building, survival and exploration together to make you you feel like a true survivor.BuildingBuilding is the cornerstone of Planet Nomads. What you build determines your chances of survival and increases your action radius and potential to uncover more advanced materials. Choose from several dozens blocks to create nearly anything your imagination can come up with.ExplorationYou may have explored your immediate surrounding, but a couple kilometers away or a thousand meters higher, things could be radically different. The Sandy engine generates believable planets of all kinds with multiple biomes spreading from pole to pole. The 200 kilometer journey from North pole to South pole become an epic and everchanging adventure. Unlocking advanced technology allows you to explore the more hazardous places where you wouldn&apos;t survive before.SurvivalLiving the nomadic life is full of danger. and adventure. But mostly danger. Surviving on an inhabited planet is no easy task, but with careful planning, caution and a","last_updated":"2017-07-04T12:02:52.084Z","parsed":{"xt":"urn:btih:7ba4acc2ebaae6ff884dd1a7bb4a8c31190cea33","dn":"Planet Nomads v0.6.8","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7ba4acc2ebaae6ff884dd1a7bb4a8c31190cea33","infoHashBuffer":{"type":"Buffer","data":[123,164,172,194,235,170,230,255,136,77,209,167,187,74,140,49,25,12,234,51]},"name":"Planet Nomads v0.6.8","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}