{"title":"\nDrone Warrior_ An Elite Soldier's Inside Account of the Hunt for","magnet":"magnet:?xt=urn:btih:7bb42327982a0ce94f7da136f9913ca601db26fa&dn=Drone+Warrior_+An+Elite+Soldier%27s+Inside+Account+of+the+Hunt+for&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5253975","seeders":"24","leechers":"13","description":"xx\r\n\r\nDrone Warrior_ An Elite Soldier&apos;s Inside Account of the Hunt for America&apos;s Most Dangerous Enemies by Brett Velicovich 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA former Delta Force black ops member takes us inside America&apos;s covert drone war in this headline-making, never-before-told account for fans of Zero Dark Thirty and Lone Survivor, told by a Pulitzer Prize-winning Wall Street Journal writer and filled with eye-opening and sure to be controversial details.\r\n\r\nFor nearly a decade, Brett Velicovich was at the center of America&apos;s new warfare: using unmanned aerial vehicles - drones - to take down the world&apos;s deadliest terrorists across the globe. One of an elite handful in the entire military with the authority to select targets and issue death orders, he worked in concert with the full human and technological network of American intelligence - assets, analysts, spies, informants - and the military&apos;s elite operatives to stalk, capture, and eliminate high-value targets in al-Qaeda and ISIS.\r\n\r\nIn this remarkable book, cowritten with journalist Christopher S. Stewart, Velicovich offers unprecedented perspective on the remarkably complex nature of drone operations and the rigorous and wrenching decisions behind them. In intimate, gripping detail, he shares action-packed insider stories of the most coordinated, advanced, and secret missions that neutralized terrorists, preserved the lives of US and international warriors across the globe, and saved countless innocents in the hottest conflict zones today.\r\n\r\nDrone Warrior also chronicles the US military&apos;s evolution in the past decade and the technology driving it. Velicovich considers the future it foretells and speaks candidly on the physical and psychological toll it exacts, including the impact on his own life. He reminds us that while these machines can kill, they can also be used productively to improve and preserve life, including protecting endangered species, work he is engaged in today.\r\n\r\nJoining warfare classics such as American Sniper, Lone Survivor, and No Easy Day, Drone Warrior is the definitive account of our nation&apos;s capacity and capability for war in the modern age.\r\n\r\nxx","last_updated":"2017-09-24T12:02:50.085Z","parsed":{"xt":"urn:btih:7bb42327982a0ce94f7da136f9913ca601db26fa","dn":"Drone Warrior_ An Elite Soldier's Inside Account of the Hunt for","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7bb42327982a0ce94f7da136f9913ca601db26fa","infoHashBuffer":{"type":"Buffer","data":[123,180,35,39,152,42,12,233,79,125,161,54,249,145,60,166,1,219,38,250]},"name":"Drone Warrior_ An Elite Soldier's Inside Account of the Hunt for","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}