{"title":"\nCorel PaintShop Pro 2018 20.1.0.15 (x64) Multilingual.Portable","magnet":"magnet:?xt=urn:btih:7bc57006d67d1e990fdb9b8f10a6cf058d853877&dn=Corel+PaintShop+Pro+2018+20.1.0.15+%28x64%29+Multilingual.Portable&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zebart71","categoryP":"applications","categoryS":"windows","size":"201507828","seeders":"1","leechers":"3","description":"Corel PaintShop Pro 2018, a part of the PaintShop family of digital imaging and photography products, is the most complete, easy-to-use software for creating professional digital imaging results. By combining automatic and precision tools with an integrated learning system, Corel PaintShop Pro 2018 helps you produce professional results with power and ease. Filled with one-of-a-kind photo tools sure to please even the most discerning photographer, Corel PaintShop Pro 2018 is the ideal choice for people who want extraordinary photos.\t\r\n\r\nMore Features:\r\nText Wrapping. Instantly fill a selection or vector shape with text that automatically wraps within it. Create interesting design elements for web graphics, posters, scrapbooking, brochures, collages, and other projects.\r\nMagic Move and Magic Fill. Edit pictures faster with content-aware editing tools. Move an object or background with Magic Move or erase an unwanted part of your image with Magic Fill. The empty area will automatically fill in to match the surrounding background.\r\nPrecise selections. Accurate selections are essential in photo editing software. PaintShop Pro 2018 lets you define a selection size by height and width. Or with a fixed aspect ratio, for easier, more precise selections.\r\nLens Correction. Apply Lens Correction tools automatically within the Edit workspace or the Camera RAW Lab to quickly correct the distortions, vignetting and chromatic aberrations that are commonly introduced by most camera lenses.\r\n4K monitor support. See each detail and appreciate the beauty of your photos when you pair your new photo editing software with a high resolution monitor. PaintShop Pro X9 is compatible with Ultra High DPI displays (up to 250% zoom with 4K resolution)","last_updated":"2017-09-28T12:06:20.237Z","parsed":{"xt":"urn:btih:7bc57006d67d1e990fdb9b8f10a6cf058d853877","dn":"Corel PaintShop Pro 2018 20.1.0.15 (x64) Multilingual.Portable","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7bc57006d67d1e990fdb9b8f10a6cf058d853877","infoHashBuffer":{"type":"Buffer","data":[123,197,112,6,214,125,30,153,15,219,155,143,16,166,207,5,141,133,56,119]},"name":"Corel PaintShop Pro 2018 20.1.0.15 (x64) Multilingual.Portable","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}