{"title":"\nBirds Art Life_ A Year of Observation by Kyo Maclear ePUB eBOOK-","magnet":"magnet:?xt=urn:btih:7c32cc4d3a4cbe93c0b7e7578e07dcdb53828e3d&dn=Birds+Art+Life_+A+Year+of+Observation+by+Kyo+Maclear+ePUB+eBOOK-&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11562096","seeders":"0","leechers":"0","description":"xx\r\n\r\nBirds Art Life_ A Year of Observation by Kyo Maclear ePUB eBOOK-ZAK\r\n\r\nA writer&apos;s search for inspiration, beauty, and solace leads her to birds in this intimate and exuberant meditation on creativity and life - a field guide to things small and significant.\r\n\r\nWhen it comes to birds, Kyo Maclear isn&apos;t seeking the exotic. Rather she discovers joy in the seasonal birds that find their way into view in city parks and harbors, along eaves and on wires. In a world that values big and fast, Maclear looks to the small, the steady, the slow accumulations of knowledge, and the lulls that leave room for contemplation.\r\n\r\nA distilled, crystal-like companion to H is for Hawk, Birds Art Life celebrates the particular madness of chasing after birds in the urban environment and explores what happens when the core lessons of birding are applied to other aspects of art and life. Moving with ease between the granular and the grand, peering into the inner landscape as much as the outer one, this is a deeply personal year-long inquiry into big themes: love, waiting, regrets, endings. If Birds Art Life was sprung from Maclear&apos;s sense of disconnection, her passions faltering under the strain of daily existence, this book is ultimately about the value of reconnection - and how the act of seeking engagement and beauty in small ways can lead us to discover our most satisfying and meaningful lives.\r\n\r\nxx","last_updated":"2017-09-21T12:01:03.831Z","parsed":{"xt":"urn:btih:7c32cc4d3a4cbe93c0b7e7578e07dcdb53828e3d","dn":"Birds Art Life_ A Year of Observation by Kyo Maclear ePUB eBOOK-","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c32cc4d3a4cbe93c0b7e7578e07dcdb53828e3d","infoHashBuffer":{"type":"Buffer","data":[124,50,204,77,58,76,190,147,192,183,231,87,142,7,220,219,83,130,142,61]},"name":"Birds Art Life_ A Year of Observation by Kyo Maclear ePUB eBOOK-","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}