{"title":"MSAct++ 2.01 [CracksNow]","magnet":"magnet:?xt=urn:btih:7c736526b02c41681b8bdcd2cf55799582c45665&dn=MSAct%2B%2B+2.01+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"2105233","seeders":"8","leechers":"1","description":"The program is intended for installation key and activate Windows 7-10 and Office 2010-2016. If the set key enables activation over the network, via the Internet, the product is activated automatically, if this does not happen and the key is not blocked - the code is issued to transfer M$ Activation Center to activate by phone. Unlike MSAct in the program MSAct Plus has the ability to create groups of keys for different products. \r\n\r\n\r\nFEATURES - \r\n1. Select a product to install key and activation; \r\n2. Type in the input box key the key for the selected product; \r\n3. Click &quot;Set key&quot;. \r\n\r\nIf the set key enables activation over the network, via the Internet, the product is activated automatically, otherwise, if the key is not blocked, in boxes 1-9 display the code for sending the Activation Center M$ to activate by phone. To activate by phone, you must call the Activation Center, send the code of the fields &quot;1-9&quot; and to get the return code that must be entered in the field &quot;A-H&quot; and click &quot;Apply&quot;. If everything is completed without errors, the product is activated. When activation is completed, you can save the key and the return code into a text file using special button. Subsequently, for example, after reinstalling the system, rather will set key to enter the program previously stored return code and click &quot;Apply&quot;. Recovery activation is possible even if the key is already blocked. \r\n\r\n*** If you copy to the clipboard saved response code and set the cursor to the fileld &quot;A&quot;, the code will be inserted automatically. \r\n*** A button near the block &quot;9&quot; forcibly displays the code for transmitting to the Center Activation, even if the key is blocked. This enables you to activate by phone, for keys held online activation","last_updated":"2017-09-02T12:03:49.754Z","parsed":{"xt":"urn:btih:7c736526b02c41681b8bdcd2cf55799582c45665","dn":"MSAct   2.01 [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7c736526b02c41681b8bdcd2cf55799582c45665","infoHashBuffer":{"type":"Buffer","data":[124,115,101,38,176,44,65,104,27,139,220,210,207,85,121,149,130,196,86,101]},"name":"MSAct   2.01 [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}