{"title":"Sam Walker - The Captain Class_ The Hidden Force That Creates th","magnet":"magnet:?xt=urn:btih:7d03ee1dd73c0f6e93511d4ac645b926a5fd3955&dn=Sam+Walker+-+The+Captain+Class_+The+Hidden+Force+That+Creates+th&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7702576","seeders":"0","leechers":"0","description":"xx\r\n\r\nSam Walker - The Captain Class_ The Hidden Force That Creates the World&apos;s Greatest Teams 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe former global sports editor of The Wall Street Journal profiles the greatest teams in history and identifies the counterintuitive leadership qualities of the unconventional men and women who drove them to succeed.\r\n\r\nThe secret to winning is not what you think it is.\r\n\r\nIt&apos;s not the coach. It&apos;s not the star.\r\n\r\nIt&apos;s not money. It&apos;s not a strategy.\r\n\r\nIt&apos;s something else entirely.\r\n\r\nSeveral years ago Sam Walker set out to answer one of the most hotly debated questions in sports: What are the greatest teams of all time? He devised a formula, then applied it to thousands of teams from leagues all over the world, from the NBA to the English Premier League to Olympic field hockey. When he was done, he had a list of the 16 most dominant teams in history. At that point he became obsessed with another more complicated question: What did these freak teams have in common?\r\n\r\nAs Walker dug into their stories, a pattern emerged. Each team had the same type of captain - a singular leader with an unconventional skill set who drove it to achieve sustained, historic greatness.\r\n\r\nFueled by a lifetime of sports spectating, 20 years of reporting, and a decade of painstaking research, The Captain Class tells the surprising story of what makes teams exceptional. Drawing on original interviews with athletes from two dozen countries as well as general managers, coaches, executives, and others skilled at building teams, Walker identifies the seven core qualities of this Captain Class - from extreme doggedness and emotional control to a knack for nonverbal communication to aggression and the courage to stand apart.\r\n\r\nTold through riveting accounts of some of the most pressure-soaked moments in sports history - from Bill Russell&apos;s legendary &quot;Coleman Play&quot; in the 1957 NBA Finals to Barcelona&apos;s &quot;Figo Game&quot; against Real Madrid in 2000 - The Captain Class doesn&apos;t just bring these events to life; it presents a fresh, counterintuitive take on leadership that can be applied to a wide spectrum of competitive disciplines.\r\n\r\nThe men and women who make up the Captain Class were never the most skilled athletes, nor were they gifted orators or paragons of sportsmanship. They were often role players who were allergic to the spotlight. In short, the seven attributes they shared challenge your assumptions of what inspired leadership looks like.\r\n\r\nxx","last_updated":"2017-08-08T12:01:14.248Z","parsed":{"xt":"urn:btih:7d03ee1dd73c0f6e93511d4ac645b926a5fd3955","dn":"Sam Walker - The Captain Class_ The Hidden Force That Creates th","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7d03ee1dd73c0f6e93511d4ac645b926a5fd3955","infoHashBuffer":{"type":"Buffer","data":[125,3,238,29,215,60,15,110,147,81,29,74,198,69,185,38,165,253,57,85]},"name":"Sam Walker - The Captain Class_ The Hidden Force That Creates th","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}