{"title":"Acupuncture for IVF and Assisted Reproduction","magnet":"magnet:?xt=urn:btih:7d136abc207ae69f9ec4cba9b86c2397fbaef4b5&dn=Acupuncture+for+IVF+and+Assisted+Reproduction&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"15044733","seeders":"34","leechers":"8","description":"The management of infertility using acupuncture is an expanding area of practice and one which is frequently rewarding for TCM acupuncture practitioners.\r\n\r\nAcupuncture for IVF and Assisted Reproduction has been specially prepared to meet the growing demand for information in this area and draws upon 20 years combined experience of the authors together with the latest evidence from both orthodox medicine and TCM.\r\n\r\nRichly illustrated and clearly written throughout, the book takes the reader through the anatomy and physiology of reproductive medicine (from both an orthodox and TCM perspective) and explains the underlying basis of orthodox medical fertility tests and investigations. The volume then explores the pathology and aetiology of TCM syndromes and shows how common fertility-related conditions, such as endometriosis and male factor infertility, affect Assisted Reproductive Technology (ART) success rates. It explains in great detail how to take a reproductive medical history and successfully diagnose TCM syndromes. Acupuncture for IVF and Assisted Reproduction also provides guidelines on how to regulate the menstrual cycle in preparation for IVF treatment and shows how lifestyle can affect fertility and ART success rates.\r\n\r\nPlacing a strong emphasis on the practical aspects of patient care, Acupuncture for IVF and Assisted Reproduction contains an abundance of case history templates, algorithmic acupuncture treatment pathways and patient fact sheets and will be ideal for all acupuncture practitioners working in this field","last_updated":"2017-06-15T12:06:44.310Z","parsed":{"xt":"urn:btih:7d136abc207ae69f9ec4cba9b86c2397fbaef4b5","dn":"Acupuncture for IVF and Assisted Reproduction","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7d136abc207ae69f9ec4cba9b86c2397fbaef4b5","infoHashBuffer":{"type":"Buffer","data":[125,19,106,188,32,122,230,159,158,196,203,169,184,108,35,151,251,174,244,181]},"name":"Acupuncture for IVF and Assisted Reproduction","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}