{"title":"Doc and Merle Watson-Pickin the Blues (audiophile recording)","magnet":"magnet:?xt=urn:btih:7d1547f624c6f0afeab130ed225350bef466117f&dn=Doc+and+Merle+Watson-Pickin+the+Blues+%28audiophile+recording%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"music","size":"275137400","seeders":"38","leechers":"7","description":"Son Merle Watson gets top billing along with his dad on this superior release of acoustic mountain music, but it is really a group effort in which the smooth mastery of Doc Watson serves as a kind of a picture frame for each of the musical canvases included. The album title might indicate some limitation in the material, but the concept of &quot;blues&quot; has always been a bit more open in the white, Appalachian tradition than in Afro-American music. For example, one of the chord changes in &quot;Freight Train Blues&quot; would have probably made Muddy Waters want to jump out in front of one. Of course, a great amount of work has gone into segregating black and white music throughout the United States, with the Appalachian area absolutely no exception. Jesse Helms would no doubt be proud of how much energy has gone into making it seem like the black and white musicians of his home state of North Carolina had absolutely nothing to do with each other over the years. What we have here is really a delightful blend of several different blues traditions, transcending the stupid questions of race as if it were a bit of dust that can be blown off a the phonograph needle. Some of the music is quite swinging, such as &quot;Carroll County Blues,&quot; the fiddle playing of Sam Bush evoking more the clean sound of jazz violinists than the rugged tone of old-time fiddlers. &quot;Stormy Weather&quot; comes from the catalog of vocal jazz classics that are strongly influenced by blues, but actually have their own harmonic structure that is quite different from typical blues. Watson is such a fine vocalist that he is able to make a number such as this sound relatively fresh, no doubt helped by a blend of acoustic instruments not normally associated with this type of tune. But whatever style the players take on, everything is performed beautifully with deep feeling, comfortable tempos, and inspired picking that is never simply grandstanding. Fans of acoustic guitar will love this record -- the instruments are recorded beautifully, especially in that warm, sonorous mid-register","last_updated":"2017-05-06T18:09:44.614Z","parsed":{"xt":"urn:btih:7d1547f624c6f0afeab130ed225350bef466117f","dn":"Doc and Merle Watson-Pickin the Blues (audiophile recording)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7d1547f624c6f0afeab130ed225350bef466117f","infoHashBuffer":{"type":"Buffer","data":[125,21,71,246,36,198,240,175,234,177,48,237,34,83,80,190,244,102,17,127]},"name":"Doc and Merle Watson-Pickin the Blues (audiophile recording)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}