{"title":"Jamey Stegmaier - A Crowdfunder's Strategy Guide 2015 RETAiL ePu","magnet":"magnet:?xt=urn:btih:7efa12d70d76d02e89e0867821af29b8f68f9441&dn=Jamey+Stegmaier+-+A+Crowdfunder%27s+Strategy+Guide+2015+RETAiL+ePu&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6283529","seeders":"11","leechers":"5","description":"xx\r\n\r\nJamey Stegmaier - A Crowdfunder&apos;s Strategy Guide 2015 RETAiL ePub eBOOk-rebOOk\r\n\r\nAs a veteran of six successful Kickstarter campaigns (and counting) and the proprietor of the Kickstarter Lessons blog, Jamey Stegmaier knows something about crowdfunding. In this book he goes beyond the nuts and bolts of how it works to a deeper level - crowdfunding not just as a cool way to raise money but as a better way to build and run a business.\r\n\r\nThis book features over 40 illustrative examples of crowdfunding campaigns. Some succeeded wildly - like the high-tech cooler designer whose first attempt faltered but whose second raised $13 million. Some were sobering disasters, like the board-game maker (not the author!) whose mistakes caused his project to collapse in two months, forcing him to return over $100,000. Stegmaier uses these stories to make points about topics such as preparation, timing, what kind of offers to make and what kind to avoid, what to spend money on and when, and more.\r\n\r\nBut he insists it&apos;s not just about the money - if you follow Stegmaier&apos;s advice, crowdfunding can enable you to build a loyal following before you even have a product. He shows that if you treat your backers as people, not pocketbooks - communicate regularly with them, ask their opinions, attend to their needs - they&apos;ll become advocates as well as funders, exponentially increasing your and your projects&apos; chances of succeeding.\r\n\r\nxx","last_updated":"2017-07-22T12:01:33.757Z","parsed":{"xt":"urn:btih:7efa12d70d76d02e89e0867821af29b8f68f9441","dn":"Jamey Stegmaier - A Crowdfunder's Strategy Guide 2015 RETAiL ePu","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7efa12d70d76d02e89e0867821af29b8f68f9441","infoHashBuffer":{"type":"Buffer","data":[126,250,18,215,13,118,208,46,137,224,134,120,33,175,41,184,246,143,148,65]},"name":"Jamey Stegmaier - A Crowdfunder's Strategy Guide 2015 RETAiL ePu","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}