{"title":"\nReagan at Reykjavik_ Forty-Eight Hours That Ended the Cold War b","magnet":"magnet:?xt=urn:btih:7f02d2721b72166bc22df60fb11382e327e5f095&dn=Reagan+at+Reykjavik_+Forty-Eight+Hours+That+Ended+the+Cold+War+b&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5491611","seeders":"0","leechers":"0","description":"xx\r\n\r\nReagan at Reykjavik_ Forty-Eight Hours That Ended the Cold War by Ken Adelman ePUB eBOOK-ZAK\r\n\r\nA dramatic account of the historic 1986 Reagan-Gorbachev summit in Iceland - the turning point in the Cold War - by Ken Adelman, Reagan&apos;s arms control director and a key player in that weekend&apos;s world-changing events.\r\n\r\nIn October 1986, Ronald Reagan and Mikhail Gorbachev met for a 48-hour summit in Reykjavik, Iceland. Planned as a short gathering to outline future talks, the meeting quickly turned to major international issues, including SDI (&quot;Star Wars&quot;) and the possibility of eliminating all nuclear weapons. Both men were at the height of their powers, and they had a rare opportunity to move toward peace. The meeting led to negotiations and concessions that neither side had predicted - and laid the groundwork for the most sweeping arms accord in history, adopted the following year, and the end of the Soviet Union a half decade later.\r\n\r\nFrom his position as a participant in these historic events, Ken Adelman is able to reveal the motivations, relationships, and conversations that led to the summit&apos;s breakthroughs. His analysis as both a participant and historian provides an invaluable perspective on this uniquely significant episode.\r\n\r\nScrupulously researched and based on now-declassified documents, Reagan at Reykjavik tells the gripping tale of the weekend that changed the world. Adelman provides an honest, laser-etched portrait of President Reagan at one of his finest and most challenging moments - and, indisputably, one of the most significant triumphs of his presidency.\r\n\r\nxx","last_updated":"2017-09-28T12:01:57.823Z","parsed":{"xt":"urn:btih:7f02d2721b72166bc22df60fb11382e327e5f095","dn":"Reagan at Reykjavik_ Forty-Eight Hours That Ended the Cold War b","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f02d2721b72166bc22df60fb11382e327e5f095","infoHashBuffer":{"type":"Buffer","data":[127,2,210,114,27,114,22,107,194,45,246,15,177,19,130,227,39,229,240,149]},"name":"Reagan at Reykjavik_ Forty-Eight Hours That Ended the Cold War b","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}