{"title":"Mastering Concurrency Programming with Java 8 by Javier Fernande","magnet":"magnet:?xt=urn:btih:7f5cefed1bb7ad5ce541ea6bf303c740c77927bd&dn=Mastering+Concurrency+Programming+with+Java+8+by+Javier+Fernande&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"31365838","seeders":"10","leechers":"7","description":"\nMastering Concurrency Programming with Java 8 by Javier Fernandez Gonzalez(2016) - True PDF - zeke23\r\nEnglish | 2016 | ISBN: 1785886126 | 426 Pages | True PDF | 3.38 MB\r\nMaster the principles and techniques of multithreaded programming with the Java 8 Concurrency API.\r\n\r\nIf you are a competent Java developer with a good understanding of concurrency but have no knowledge of how to effectively implement concurrent programs or use streams to make processes more efficient, then this book is for you.\r\n\r\nWhat You Will Learn:\r\n\r\n- Design concurrent applications by converting a sequential algorithm into a concurrent one\r\n- Discover how to avoid all the possible problems you can get in concurrent algorithms\r\n- Use the Executor framework to manage concurrent tasks without creating threads\r\n- Extend and modify Executors to adapt their behavior to your needs\r\n- Solve problems using the divide and conquer technique and the Fork/Join framework\r\n- Process massive data sets with parallel streams and Map/Reduce implementation\r\n- Control data-race conditions using concurrent data structures and synchronization mechanisms\r\n- Test and monitor concurrent applications\r\n\r\nConcurrency programming allows several large tasks to be divided into smaller sub-tasks, which are further processed as individual tasks that run in parallel. All the sub-tasks are combined together once the required results are achieved; they are then merged to get the final output. The whole process is very complex. This process goes from the design of concurrent algorithms to the testing phase where concurrent applications need extra attention. Java includes a comprehensive API with a lot of ready-to-use components to implement powerful concurrency applications in an easy way, but with a high flexibility to adapt these components to your needs","last_updated":"2017-07-18T12:01:21.834Z","parsed":{"xt":"urn:btih:7f5cefed1bb7ad5ce541ea6bf303c740c77927bd","dn":"Mastering Concurrency Programming with Java 8 by Javier Fernande","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f5cefed1bb7ad5ce541ea6bf303c740c77927bd","infoHashBuffer":{"type":"Buffer","data":[127,92,239,237,27,183,173,92,229,65,234,107,243,3,199,64,199,121,39,189]},"name":"Mastering Concurrency Programming with Java 8 by Javier Fernande","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}