{"title":"\nStealing Fire_ How Silicon Valley, the Navy SEALs, and Maverick ","magnet":"magnet:?xt=urn:btih:7f6d9d67eeed806a09edb308ceaf1f34f9060bd0&dn=Stealing+Fire_+How+Silicon+Valley%2C+the+Navy+SEALs%2C+and+Maverick+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2854796","seeders":"0","leechers":"0","description":"xx\r\n\r\nStealing Fire_ How Silicon Valley, the Navy SEALs, and Maverick Scientists Are Revolutionizing the Way We Live and Work by Steven Kotler and Jamie Wheal ePUB eBOOK-ZAK\r\n\r\nThe authors of the best-selling Bold and The Rise of Superman explore altered states of consciousness and how they can ignite passion, fuel creativity, and accelerate problem solving, in this groundbreaking book in the vein of Daniel Pink&apos;s Drive and Charles Duhigg&apos;s Smarter Faster Better.\r\n\r\nWhy has generating &quot;flow&quot; and getting &quot;into the zone&quot; become the goal of the world&apos;s most elite organizations? Why are business moguls attending Burning Man? Why has meditation become a billion-dollar industry? Why are technology gurus turning to psychedelic drugs to unlock creativity?\r\n\r\nAll of these people are seeking to shift their state of mind as a way of unlocking their true potential. Altered states, the authors reveal, sharpen our decision-making capabilities, unleash creativity, fuel cooperation, and let us tap in to levels of inspiration and innovation unavailable at all other times. Stealing Fire combines cutting-edge research and firsthand reporting to explore a revolution in human performance - a movement millions of people strong to harness and utilize some of the most misunderstood and controversial experiences in history.\r\n\r\nBuilding a bridge between the extreme and the mainstream, this groundbreaking and provocative book examines how the world&apos;s top performers - the Navy SEALS, Googlers, Fortune 100 CEOs - are using altered states to radically accelerate performance and massively improve their lives, and how we can, too.\r\n\r\nUltimately, Stealing Fire is a book about profound possibility - about what is actually possible for ourselves and our species when we unlock the full potential of the human mind.\r\n\r\nxx","last_updated":"2017-10-02T12:00:54.213Z","parsed":{"xt":"urn:btih:7f6d9d67eeed806a09edb308ceaf1f34f9060bd0","dn":"Stealing Fire_ How Silicon Valley, the Navy SEALs, and Maverick ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f6d9d67eeed806a09edb308ceaf1f34f9060bd0","infoHashBuffer":{"type":"Buffer","data":[127,109,157,103,238,237,128,106,9,237,179,8,206,175,31,52,249,6,11,208]},"name":"Stealing Fire_ How Silicon Valley, the Navy SEALs, and Maverick ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}