{"title":"Athens","magnet":"magnet:?xt=urn:btih:7f742e2c633529dc6bb29c6ec1b781b3c4c7754a&dn=Athens&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4280669","seeders":"0","leechers":"0","description":"Athens - James H.S. McGregor [epub]\r\n\r\nRevered as the birthplace of Western thought and democracy, Athens is much more than an open-air museum filled with crumbling monuments to ancient glory. Athens takes readers on a journey from the classical city-state to today&apos;s contemporary capital, revealing a world-famous metropolis that has been resurrected and redefined time and again.\r\n\r\nAlthough the Acropolis remains the city&apos;s anchor, Athens&apos; vibrant culture extends far beyond the Greek city&apos;s antique boundaries. James H. S. McGregor points out how the cityscape preserves signs of the many actors who have crossed its historical stage. Alexander the Great incorporated Athens into his empire, as did the Romans. Byzantine Christians repurposed Greek temples, the Parthenon included, into churches. From the thirteenth to fifteenth centuries, the city&apos;s language changed from French to Spanish to Italian, as Crusaders and adventurers from different parts of Western Europe took turns sacking and administering the city. An Islamic Athens took root following the Ottoman conquest of 1456 and remained in place for nearly four hundred years, until Greek patriots finally won independence in a blood-drenched revolution.\r\n\r\nSince then, Athenians have endured many hardships, from Nazi occupation and military coups to famine and economic crisis. Yet, as McGregor shows, the history of Athens is closer to a heroic epic than a Greek tragedy. Richly supplemented with maps and illustrations, Athens paints a portrait of one of the world&apos;s great cities, designed for travelers as well as armchair students of urban history.\r\n\r\nHardcover: 256 pages\r\nPublisher: Belknap Press: An Imprint of Harvard University Press; First Edition edition (April 7, 2014)","last_updated":"2017-12-13T12:00:25.815Z","parsed":{"xt":"urn:btih:7f742e2c633529dc6bb29c6ec1b781b3c4c7754a","dn":"Athens","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7f742e2c633529dc6bb29c6ec1b781b3c4c7754a","infoHashBuffer":{"type":"Buffer","data":[127,116,46,44,99,53,41,220,107,178,156,110,193,183,129,179,196,199,117,74]},"name":"Athens","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}