{"title":"Acquitted (Frikjent) S02 - Hardcoded Eng Subs - Sno","magnet":"magnet:?xt=urn:btih:7fb607c2a587ab104d921c70182c818ff3da1398&dn=Acquitted+%28Frikjent%29+S02+-+Hardcoded+Eng+Subs+-+Sno&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Snowhiter","categoryP":"video","categoryS":"tv_shows","size":"3169874516","seeders":"0","leechers":"0","description":"Acquitted (Frikjent) S02 - Hardcoded Eng Subs - Sno\r\n\r\nAksel has the answer he so desperately sought and his search for justice seems to be over, but his hopes for reconciliation with the community may be short-lived. \r\n\r\n\r\n1/8. The town of Lifjord is shaken by William&apos;s actions. Aksel is impatient for the place, and the world, to know the truth about Karine&apos;s death but the end of his nightmare is further away than he thinks. \r\n\r\n2/8. It is now Aksel&apos;s word against Eva and William&apos;s, and there is little hope that anyone will believe him. Could a note of concern about Karine given to Child Protection hold the key to Eva&apos;s secrecy?\r\n\r\n3/8. Aksel turns directly to Eva with his suspicions about incest, but she denies everything. Kristoffersen has a completely different explanation for Karine&apos;s problems that could account for her death.\r\n\r\n4/8. At the trial, Kristoffersen&apos;s testimony about Karine&apos;s phone call and Eva&apos;s reaction to the suicide attempt sends shock waves through the court. But Eva and William have some tricks up their sleeve.\r\n\r\n5/8. Aksel is convinced William is lying and Amina encourages him to take the stand and give his own account of what happened on the night of the murder, but a surprise witness complicates the situation\r\n\r\n\r\n6/8. Aksel is furious with the outcome of the trial. Amina tries to make him see that he can&apos;t win this fight and she implores him to leave town. Erik opens his door to a deeply unhappy and shaken Helene.\r\n\r\n7/8. Helene has disappeared without a trace. Meanwhile, Aksel seeks out Lars and confronts him with what has happened, but Lars responds furiously and advises him not to meddle in their affairs.\r\n\r\n8/8. Lifjord is shaken by another tragedy. Aksel goes to the police and demands his brother&apos;s release, insisting he had no motive for murder. And when Aksel uncovers a lie, truth dawns in all its horror . . .\r\n\r\n\r\nVideo 852 x 480 / 29.97 fps / 1000 (Approx) kbps / Mp4\r\n\r\nAudio 128 kbps AAC\r\n\r\nDuration 0:45 (Approx)\r\n\r\nSeed to the Max - Takk alle sammen . . .\r\n\r\n\r\nSno","last_updated":"2017-11-19T12:00:35.712Z","parsed":{"xt":"urn:btih:7fb607c2a587ab104d921c70182c818ff3da1398","dn":"Acquitted (Frikjent) S02 - Hardcoded Eng Subs - Sno","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7fb607c2a587ab104d921c70182c818ff3da1398","infoHashBuffer":{"type":"Buffer","data":[127,182,7,194,165,135,171,16,77,146,28,112,24,44,129,143,243,218,19,152]},"name":"Acquitted (Frikjent) S02 - Hardcoded Eng Subs - Sno","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}