{"title":"Stealing History: Art Theft, Looting, And Other Crimes Against O","magnet":"magnet:?xt=urn:btih:7fd6f9b44fb1d7b6268fc6fffc20f27bd32af435&dn=Stealing+History%3A+Art+Theft%2C+Looting%2C+And+Other+Crimes+Against+O&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"3437210","seeders":"77","leechers":"12","description":"Stealing History: Art Theft, Looting, And Other Crimes Against Our Cultural Heritage/Colleen Clarke/2017/ EPUB|\r\n\r\nEnglish|Non-Fiction|ISBN-10: 14422607931|176pg|3.2MB|\r\n\r\nWhen compared to terrorism, drugs and violent crimes that occupy the news today art is not considered as important. But, as it turns out, art and cultural crime is currently ranked as the third-largest criminal enterprise in the world.\r\n\r\nWhat exactly is art crime? Why does art matter? And what is law enforcement doing to prevent this crime today?\r\n\r\n Due to the misleading portrayal of art crime in the entertainment industry people have the flawed belief that art and cultural crime doesn&#x2019;t damage anyone in a direct way. And the truth of the matter is that this crime results in the loss of billions of dollars annually.\r\n\r\nArt and cultural crime is not simply focused on museums or private displays, the loss of art directly affects our cultural identity and history.\r\n\r\n Napoleon moved from one region to the next collecting art and sending as much as possible back to France. The Nazis looted cultural property from every territory they occupied.\r\n\r\n And there have been various cases of ISIL and ISIS destroying archaeological sites as a method of destroying any evidence of past culture or history that disagree with their own.\r\n\r\nWith the United States being the largest market for both legal and illicit artwork in the world more preventative attention from law enforcement and security is needed for our country to meet international standards and end detrimental art crimes.\r\n\r\nIn Stealing History, Colleen Clarke and Eli J. Szydlo look at the history behind art crime, how these crimes have grown over the last half century, and what law enforcement has been involved in protecting the world from these crimes","last_updated":"2017-05-27T09:00:41.262Z","parsed":{"xt":"urn:btih:7fd6f9b44fb1d7b6268fc6fffc20f27bd32af435","dn":"Stealing History: Art Theft, Looting, And Other Crimes Against O","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"7fd6f9b44fb1d7b6268fc6fffc20f27bd32af435","infoHashBuffer":{"type":"Buffer","data":[127,214,249,180,79,177,215,182,38,143,198,255,252,32,242,123,211,42,244,53]},"name":"Stealing History: Art Theft, Looting, And Other Crimes Against O","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}