{"title":"FileMenols v7.3.0 Final + Patch - [SH]","magnet":"magnet:?xt=urn:btih:800fcda37e3dac23992b84a0b13851e142f0cfd4&dn=FileMenols+v7.3.0+Final+%2B+Patch+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"16025810","seeders":"8","leechers":"4","description":"FileMenu Tools is a program that you can use to customize the Explorer right-click menu. It can be easily installed and configured, even by less experienced users. The interface of the application is based on a standard window with an intuitive layout. So, you can arrange entries when it comes to context menu commands, &#x2018;Send To&#x2019; menu, and commands of other applications. FileMenu Tools allows you to add commands, submenus and separators, as well as remove entries from the list. But you can also reconfigure general properties when it comes to the action, menu text, description, icon, element types, file extensions, folders, drives, modifier keys, arguments, working folder, multiple instances, and administrative mode. Settings can be exported to an INI or REG file for further processing. FileMenu Tools runs on a low-to-moderate amount of CPU and system memory, has a good response time, supports two languages for the interface, and contains user documentation. No error dialogs have been displayed during our evaluation and FileMenu Tools did not freeze or crash. Thanks to its intuitive layout and overall simplicity, the app&#x2019;s features can be seamlessly figured out. All in all, FileMenu Tools provides a straightforward and efficient way to manage context menu entries and actions","last_updated":"2017-05-29T13:19:32.043Z","parsed":{"xt":"urn:btih:800fcda37e3dac23992b84a0b13851e142f0cfd4","dn":"FileMenols v7.3.0 Final   Patch - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"800fcda37e3dac23992b84a0b13851e142f0cfd4","infoHashBuffer":{"type":"Buffer","data":[128,15,205,163,126,61,172,35,153,43,132,160,177,56,81,225,66,240,207,212]},"name":"FileMenols v7.3.0 Final   Patch - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}