{"title":"Gravy Train-Ballad of a Peaceful Man; great prog/southern rock","magnet":"magnet:?xt=urn:btih:80ddc2e9702563a1eb1a5c24ecc48a09aa517097&dn=Gravy+Train-Ballad+of+a+Peaceful+Man%3B+great+prog%2Fsouthern+rock&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"313741989","seeders":"12","leechers":"4","description":"Gravy Train is never what you call the most progressive of bands out there, although they&apos;re often regarded as one of the finest acts on the Vertigo label. Their debut is a quite raw and aggressive breed of hard rock with psychedelic and prog rock soundling like Black Sabbath meets Jethro Tull. For progressive rock fans, many look to their 1971 followup, (A Ballad Of) A Peaceful Man, their last for Vertigo (they released two more albums on the Dawn label, Second Birth in 1973 and Staircase to the Day in 1974). Much of the hard rock elements of their debut had been toned down considerably in place of more atmospheric ballads dominated by strings, with symphonic overtones. J.D. Hughes still handles flute and sax, but he started including keyboards, like harpsichord and even a little Mellotron. Guitarist Norman Barratt, who also handles lead vocals is much more dominate than their debut, and I have to warn you his raspy vocals really are an acquired taste. \r\n\r\n&quot;Alone in Georgia&quot; is the opening piece, a pop-oriented number with gospel and Southern rock overtones. This piece is really out of place compared to the rest of the album, it sounded like their misguided attempt at scoring a hit (it was released as a single), so it&apos;s a real shocker when the next piece comes next, the title track. It features some really stunning flute work and strings. &quot;Jule&apos;s Delight&quot; is another atmospheric ballad, while &quot;Messenger&quot; has a more symphonic feel complete with Mellotron. &quot;Can Anybody Hear Me&quot; and &quot;Won&apos;t Talk About It&quot; harkens back to the harder rock sound more typical of their debut. &quot;Home Again&quot; shows some psychedelic overtones, and a nice way to close the album. \r\n\r\nReally, when it comes for early, Vertigo-era Gravy Train, it all comes to taste, hard rock fans are obviously advised to check out their debut, prog rock fans should go to (A Ballad Of) A Peaceful Man. Aside from &quot;Alone in Georgia&quot;, it&apos;s truly a great album to have. (Amazon review)","last_updated":"2017-11-24T12:06:28.476Z","parsed":{"xt":"urn:btih:80ddc2e9702563a1eb1a5c24ecc48a09aa517097","dn":"Gravy Train-Ballad of a Peaceful Man; great prog/southern rock","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"80ddc2e9702563a1eb1a5c24ecc48a09aa517097","infoHashBuffer":{"type":"Buffer","data":[128,221,194,233,112,37,99,161,235,26,92,36,236,196,138,9,170,81,112,151]},"name":"Gravy Train-Ballad of a Peaceful Man; great prog/southern rock","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}