{"title":"The Chickenshit Club: Why the Justice Department Fails to...","magnet":"magnet:?xt=urn:btih:8193b5a68d878c2084b8bfb7ee0a44cd3dc9ab19&dn=The+Chickenshit+Club%3A+Why+the+Justice+Department+Fails+to...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1421833","seeders":"43","leechers":"4","description":"The Chickenshit Club: Why the Justice Department Fails to Prosecute Executives - Jesse Eisinger [epub]\r\n\r\nFrom Pulitzer Prize&#x2013;winning journalist Jesse Eisinger, a blistering account of corporate greed and impunity, and the reckless, often anemic response from the Department of Justice.\r\n\r\nWhy were no bankers put in prison after the financial crisis of 2008? Why do CEOs seem to commit wrongdoing with impunity? The problem goes beyond banks deemed &#x201C;Too Big to Fail&#x201D; to almost every large corporation in America&#x2014;to pharmaceutical companies and auto manufacturers and beyond.\r\n\r\nThe Chickenshit Club&#x2014;an inside reference to prosecutors too scared of failure and too daunted by legal impediments to do their jobs&#x2014;explains why. A character-driven narrative, the book tells the story from inside the Department of Justice. The complex and richly reported story spans the last decade and a half of prosecutorial fiascos, corporate lobbying, trial losses, and culture shifts that have stripped the government of the will and ability to prosecute top corporate executives.\r\n\r\nThe book begins in the 1970s, when the government pioneered the notion that top corporate executives, not just seedy crooks, could commit heinous crimes and go to prison. The book travels to trading desks on Wall Street, to corporate boardrooms and the offices of prosecutors and F.B.I agents. These revealing looks provide context for the evolution of the Justice Department&#x2019;s approach to pursuing corporate criminals through the early aughts and into the Justice Department of today.\r\n\r\nExposing one of the most important scandals of our time, The Chickenshit Club provides a clear, detailed explanation as to how our Justice Department has come to avoid, bungle, and mismanage the fight to bring these alleged criminals to justice.\r\n\r\nHardcover: 400 pages\r\nPublisher: Simon &amp; Schuster (July 11, 2017)","last_updated":"2017-09-05T12:07:10.784Z","parsed":{"xt":"urn:btih:8193b5a68d878c2084b8bfb7ee0a44cd3dc9ab19","dn":"The Chickenshit Club: Why the Justice Department Fails to...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8193b5a68d878c2084b8bfb7ee0a44cd3dc9ab19","infoHashBuffer":{"type":"Buffer","data":[129,147,181,166,141,135,140,32,132,184,191,183,238,10,68,205,61,201,171,25]},"name":"The Chickenshit Club: Why the Justice Department Fails to...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}