{"title":"Playing Dead by Elizabeth Greenwood EPUB","magnet":"magnet:?xt=urn:btih:81c11e7fc541d1bea1010432752110d15c3356a7&dn=Playing+Dead+by+Elizabeth+Greenwood+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1239572","seeders":"0","leechers":"1","description":"xx\r\n\r\nPlaying Dead by Elizabeth Greenwood EPUB\r\n\r\nA darkly comic inquiry into how to fake your own death, the disappearance industry, and the lengths to which people will go to be reborn.\r\n\r\nIs it still possible to fake your own death in the 21st century? With six figures of student loan debt, Elizabeth Greenwood is tempted to find out.\r\n\r\nSo she sets off on a foray into the world of death fraud, where for $30,000 a consultant can make you disappear - but your suspicious insurance company might hire a private detective to dig up your coffin...only to find it filled with rocks.\r\n\r\nGreenwood tracks down a man who staged a kayaking accident and then returned to live in his own house while all his neighbors thought he was dead. She takes a call from Michael Jackson (yes, he&apos;s alive - or so some would have her believe); talks to people contemplating pseudocide; and gathers intel on black market morgues in the Philippines, where she may or may not succeed in obtaining some fraudulent goodies of her own. Along the way she learns that love is a much less common motive than money and that making your death look like a drowning virtually guarantees you&apos;ll be caught. (Disappearing while hiking, however, is a great way to go.)\r\n\r\nPlaying Dead is an utterly fascinating and charmingly bizarre investigation into our all-too-human desire to escape from the lives we lead and the men and women desperate enough to lose their identities - and their families - to begin again.\r\n\r\nxx","last_updated":"2017-11-05T12:00:49.318Z","parsed":{"xt":"urn:btih:81c11e7fc541d1bea1010432752110d15c3356a7","dn":"Playing Dead by Elizabeth Greenwood EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"81c11e7fc541d1bea1010432752110d15c3356a7","infoHashBuffer":{"type":"Buffer","data":[129,193,30,127,197,65,209,190,161,1,4,50,117,33,16,209,92,51,86,167]},"name":"Playing Dead by Elizabeth Greenwood EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}