{"title":"When Mystical Creatures Attack! by Kathleen Founds ePUB eBOOK-ZA","magnet":"magnet:?xt=urn:btih:81dfad3095f0882ff06395c4c8a8b5e66328f2a9&dn=When+Mystical+Creatures+Attack%21+by+Kathleen+Founds+ePUB+eBOOK-ZA&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Bläddra zakareya","categoryP":"annat","categoryS":"e_böcker","size":"2997170","seeders":"3","leechers":"6","description":"xx\r\n\r\nWhen Mystical Creatures Attack! by Kathleen Founds ePUB eBOOK-ZAK\r\n\r\nIn When Mystical Creatures Attack!, Ms. Freedman&apos;s high school English class writes essays in which mystical creatures resolve the greatest sociopolitical problems of our time. Students include Janice Gibbs, &quot;a feral child with excessive eyeliner and an anti-authoritarian complex that would be interesting were it not so ill-informed&quot;, and Cody Splunk, an aspiring writer working on a time machine. Following a nervous breakdown, Ms. Freedman corresponds with Janice and Cody from an insane asylum run on the capitalist model of cognitive-behavioral therapy, where inmates practice water aerobics to rebuild their Psychiatric Credit Scores.\r\n\r\nThe lives of Janice, Cody, and Ms. Freedman are revealed through in-class essays, letters, therapeutic journal exercises, an advice column, a reality show television transcript, a diary, and a Methodist women&apos;s fundraising cookbook. (Recipes include &quot;Dark Night of the Soul Food&quot;, &quot;Render Unto Caesar Salad&quot;, and &quot;Valley of the Shadow of Death by Chocolate Cake&quot;.)\r\n\r\nIn &quot;Virtue of the Month&quot;, the ghost of Ms. Freedman&apos;s mother argues that suicide is not a choice. In &quot;The Un-Game&quot;, Janice&apos;s chain-smoking nursing home charge composes a dirty limerick. In &quot;The Hall of Old-Testament Miracles&quot;, wax figures of Bible characters come to life, hungry for Cody&apos;s flesh.\r\n\r\nSet against a South Texas landscape where cicadas hum and the air smells of taco stands and jasmine flowers, these stories range from laugh-out-loud funny to achingly poignant. This surreal, exuberant collection mines the dark recesses of the soul while illuminating the human heart.\r\n\r\nxx","last_updated":"2017-09-03T12:00:25.814Z","parsed":{"xt":"urn:btih:81dfad3095f0882ff06395c4c8a8b5e66328f2a9","dn":"When Mystical Creatures Attack! by Kathleen Founds ePUB eBOOK-ZA","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"81dfad3095f0882ff06395c4c8a8b5e66328f2a9","infoHashBuffer":{"type":"Buffer","data":[129,223,173,48,149,240,136,47,240,99,149,196,200,168,181,230,99,40,242,169]},"name":"When Mystical Creatures Attack! by Kathleen Founds ePUB eBOOK-ZA","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}