{"title":"Dragons Den UK - Season 1-14","magnet":"magnet:?xt=urn:btih:81f1ab143ecaf9335eba2712075abb2d3c4eb192&dn=Dragons+Den+UK+-+Season+1-14&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Browse Invader97","categoryP":"video","categoryS":"tv_shows","size":"84713529530","seeders":"0","leechers":"0","description":"Within the past week, I have twice uploaded an identical version of this torrent (except for different comments) to The Pirate Bay. After several days, The Pirate Bay erroneously indicated that both torrents always had zero seeders and leechers. I am really getting pissed off with Pirate Bay since this is happening with something close to ten percent of the torrents I am uploading there. I am crossing my fingers and re-launching again here. I apologize to those people who were downloading these previous torrents which I deleted, but I cannot leave a torrent active when erroneous Pirate Bay statistics about the seeders and leechers make the torrent appear to be completely dead.\r\n\r\nDragons&apos; Den is a British television series, hosted by Evan Davis. The format of the show is owned by Sony Pictures and is based on the original Japanese series, which has been sold around the world. The programme has been produced by BBC Manchester since its inception and was first broadcast on BBC Two on 4 January 2005.\r\n\r\nSeveral entrepreneurs are each allowed an opportunity to present their business idea to a panel of five wealthy investors, the &quot;Dragons&quot; of the show&apos;s title, and pitch for financial investment while offering a stake of the company in return.\r\n\r\nAll the regular Dragons Den UK episodes from the first 14 series are here. In addition, I have included most of the important special post-season episodes, and I have tried to label these specials so as to best convey what they are about. Enjoy!","last_updated":"2017-04-26T09:06:22.376Z","parsed":{"xt":"urn:btih:81f1ab143ecaf9335eba2712075abb2d3c4eb192","dn":"Dragons Den UK - Season 1-14","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"81f1ab143ecaf9335eba2712075abb2d3c4eb192","infoHashBuffer":{"type":"Buffer","data":[129,241,171,20,62,202,249,51,94,186,39,18,7,90,187,45,60,78,177,146]},"name":"Dragons Den UK - Season 1-14","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}