{"title":"\nTaking People with You_ The Only Way to Make Big Things Happen b","magnet":"magnet:?xt=urn:btih:820404ed2730004a24a3d58de006c2b5be46fcc8&dn=Taking+People+with+You_+The+Only+Way+to+Make+Big+Things+Happen+b&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3384784","seeders":"0","leechers":"0","description":"xx\r\n\r\nTaking People with You_ The Only Way to Make Big Things Happen by David Novak ePUB eBOOK-ZAK\r\n\r\nDavid Novak learned long ago that you can&apos;t lead a great organization of any size without getting your people aligned, enthusiastic, and focused relentlessly on the mission. But how do you do that? There are countless leadership books, but how many will actually help a Taco Bell shift manager, a Fortune 500 CEO, a new entrepreneur, or anyone in between? Over his 15 years at Yum! Brands, Novak has developed a trademarked program he calls Taking People with You. He spends several weeks each year personally teaching it to thousands of managers around the world. He convinces them that they&apos;ll never make big things happen until they learn how to get people on their side. No skill in business is more important. And Yum!&apos;s extraordinary success (at least 13 percent growth for each of the last nine years) proves his point. Novak knows that managers don&apos;t need leadership platitudes or business school theories. So he cuts right to the chase with a step-by- step guide to setting big goals, getting people to work together, blowing past your targets, and celebrating after you shock the skeptics. And then doing it again and again until consistent excellence becomes a core element of your culture. This book has specific tools at the end of each chapter that will challenge you to reflect on how you&apos;re really doing on key aspects of leadership. And if you apply it, you&apos;ll immediately start to improve.\r\n\r\nxx","last_updated":"2017-10-06T12:00:59.000Z","parsed":{"xt":"urn:btih:820404ed2730004a24a3d58de006c2b5be46fcc8","dn":"Taking People with You_ The Only Way to Make Big Things Happen b","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"820404ed2730004a24a3d58de006c2b5be46fcc8","infoHashBuffer":{"type":"Buffer","data":[130,4,4,237,39,48,0,74,36,163,213,141,224,6,194,181,190,70,252,200]},"name":"Taking People with You_ The Only Way to Make Big Things Happen b","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}