{"title":"Streampunks_ YouTube and the Rebels Remaking Entertainment by Ro","magnet":"magnet:?xt=urn:btih:8279b8eeb9415acbc88e841f60ce07744a76593e&dn=Streampunks_+YouTube+and+the+Rebels+Remaking+Entertainment+by+Ro&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3063123","seeders":"0","leechers":"0","description":"xx\r\n\r\nStreampunks_ YouTube and the Rebels Remaking Entertainment by Robert Kyncl and Maany Peyvan ePUB eBOOK-ZAK\r\n\r\nAn entertainment and tech insider - YouTube&apos;s chief business officer - delivers the first detailed account of the rise of YouTube, the creative minds who have capitalized on it to become pop culture stars, and how streaming video is revolutionizing the media world.\r\n\r\nIn the past 10 years, the Internet video platform YouTube has changed media and entertainment as profoundly as the invention of film, radio, and television did more than six decades earlier. Streampunks is a firsthand account of this upstart company, examining how it evolved and where it will take us next.\r\n\r\nSharing behind-the-scenes stories of YouTube&apos;s most influential stars - Streampunks like Tyler Oakley, Lilly Singh, and Casey Neistat - and the dealmakers brokering the future of entertainment, like Scooter Braun and Shane Smith, Robert Kyncl uses his experiences at three of the most innovative media companies - HBO, Netflix, and YouTube - to tell the story of streaming video and this modern pop-culture juggernaut. Collaborating with Google speechwriter Maany Peyvan, Kyncl explains how the new rules of entertainment are being written and how and why the media landscape is radically changing, while giving aspiring Streampunks some necessary advice to launch their own new media careers.\r\n\r\nKyncl persuasively argues that, despite concerns about technology impoverishing artists or undermining artistic quality, the new media revolution is actually fueling a creative boom and leading to more compelling, diverse, and immersive content. Enlightening, surprising, and thoroughly entertaining, Streampunks is a revelatory ride through the new media rebellion that is reshaping our world.\r\n\r\nxx","last_updated":"2017-09-15T12:00:28.408Z","parsed":{"xt":"urn:btih:8279b8eeb9415acbc88e841f60ce07744a76593e","dn":"Streampunks_ YouTube and the Rebels Remaking Entertainment by Ro","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8279b8eeb9415acbc88e841f60ce07744a76593e","infoHashBuffer":{"type":"Buffer","data":[130,121,184,238,185,65,90,203,200,142,132,31,96,206,7,116,74,118,89,62]},"name":"Streampunks_ YouTube and the Rebels Remaking Entertainment by Ro","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}