{"title":"Disappearance at Devil's Rock by Paul Tremblay EPUB","magnet":"magnet:?xt=urn:btih:83fa9d4fd098fc33e09462274baaa701453d5fef&dn=Disappearance+at+Devil%27s+Rock+by+Paul+Tremblay+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2393937","seeders":"1","leechers":"0","description":"xx\r\n\r\nDisappearance at Devil&apos;s Rock by Paul Tremblay EPUB\r\n\r\nA family is shaken to its core after the mysterious disappearance of a teenage boy in this eerie tale, a blend of literary fiction, psychological suspense, and supernatural horror from the author of A Head Full of\r\n\r\n&quot;A Head Full ofscared the living hell out of me, and I&apos;m pretty hard to scare,&quot; raved Stephen King about Paul Tremblay&apos;s previous novel. Now Tremblay returns with another disturbing tale sure to unsettle readers.\r\n\r\nLate one summer night, Elizabeth Sanderson receives the devastating news that every mother fears: Her 13-year-old son, Tommy, has vanished without a trace in the woods of a local park.\r\n\r\nThe search isn&apos;t yielding any answers, and Elizabeth and her young daughter, Kate, struggle to comprehend Tommy&apos;s disappearance. They feel helpless and alone, and their sorrow is compounded by anger and frustration: The local and state police have uncovered no leads. Josh and Luis, the friends who were the last to see Tommy before he vanished, may not be telling the whole truth about that night in Borderland State Park, when they were supposedly hanging out at a landmark the local teens have renamed Devil&apos;s Rock.\r\n\r\nLiving in an all-too-real nightmare, riddled with worry, pain, and guilt, Elizabeth is wholly unprepared for the strange series of events that follow. She believes ashadow of Tommy materializes in her bedroom while Kate and other local residents claim to see a shadow peering through their windows in the dead of night. Then, random pages torn from Tommy&apos;s journal begin to mysteriously appear - entries that reveal an introverted teenager obsessed with the phantasmagoric; the loss of his father, killed in a drunk-driving accident a decade earlier; a folktale involving the devil and the woods of Borderland; and a horrific incident that Tommy believed connects them.\r\n\r\nAs the search grows more desperate, and the implications of what happened become more haunting and sinister, no one is prepared for the shocking truth about that night and Tommy&apos;s disappearance at Devil&apos;s Rock.\r\n\r\nxx","last_updated":"2018-01-05T12:01:14.501Z","parsed":{"xt":"urn:btih:83fa9d4fd098fc33e09462274baaa701453d5fef","dn":"Disappearance at Devil's Rock by Paul Tremblay EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"83fa9d4fd098fc33e09462274baaa701453d5fef","infoHashBuffer":{"type":"Buffer","data":[131,250,157,79,208,152,252,51,224,148,98,39,75,170,167,1,69,61,95,239]},"name":"Disappearance at Devil's Rock by Paul Tremblay EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}