{"title":"Streets of Rogue Alpha 27","magnet":"magnet:?xt=urn:btih:8480f4189a98a3b1bac97da46bacefe27b6e6417&dn=Streets+of+Rogue+Alpha+27&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"159458977","seeders":"12","leechers":"3","description":"Streets of Rogue is a rogue-lite about player choice, freedom, and anarchic fun. The game takes inspiration from fast-paced top-down rogue-lites like Binding of Isaac and Nuclear Throne, and adds free-form, experimentation-driven, emergent gameplay elements of RPGs like Deus Ex.Rather than taking place in a dungeon, the game is set in a functioning, procedurally generated city, where complex AI informs denizens from all walks of life, who are just trying to get by in their daily activities.In order to progress, the player will need to accomplish specific mission goals in any way they see fit through use of their special character traits, items, and the environment.Will you play as a soldier who shoots first and asks questions later?A stealthy scientist who uses chloroform and tranquilizer darts to silently take down the opposition?A genial bartender who can talk his way past the most intimidating of guards?Or how about a hyper-intelligent gorilla, rescuing other caged gorillas to form a small mobilized gorilla army?The Mighty Feature-ListPlay the game YOUR way! Don&#x2019;t want to kill anybody? That&#x2019;s cool! Want to hack computers? Got ya covered!Random world generation and TOTALLY EXTREME gameplay variety means you can play for 600 hours and not get bored! Seriously though, go outside!!!Super-advanced artificial intelligence that won&#x2019;t put up with your crap! Outsmart these virtual humans and feel superior to your computer!Play as over 20 (and growing!) wildly different types of characters!","last_updated":"2017-06-18T12:06:10.770Z","parsed":{"xt":"urn:btih:8480f4189a98a3b1bac97da46bacefe27b6e6417","dn":"Streets of Rogue Alpha 27","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8480f4189a98a3b1bac97da46bacefe27b6e6417","infoHashBuffer":{"type":"Buffer","data":[132,128,244,24,154,152,163,177,186,201,125,164,107,172,239,226,123,110,100,23]},"name":"Streets of Rogue Alpha 27","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}