{"title":"\nManhattan Beach_ A Novel by Jennifer Egan ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:84973a714200c6ae023335cd8021a3849d1c0c18&dn=Manhattan+Beach_+A+Novel+by+Jennifer+Egan+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6606996","seeders":"0","leechers":"0","description":"xx\r\n\r\nManhattan Beach_ A Novel by Jennifer Egan ePUB eBOOK-ZAK\r\n\r\nThe long-awaited novel from the Pulitzer Prize-winning author of A Visit from the Goon Squad, Manhattan Beach opens in Brooklyn during the Great Depression. Anna Kerrigan, nearly 12 years old, accompanies her father to the house of a man who, she gleans, is crucial to the survival of her father and her family. Anna observes the uniformed servants, the lavishing of toys on the children, and some secret pact between her father and Dexter Styles.\r\n\r\nYears later her father has disappeared, and the country is at war. Anna works at the Brooklyn Navy Yard, where women are allowed to hold jobs that had always belonged to men. She becomes the first female diver, the most dangerous and exclusive of occupations, repairing the ships that will help America win the war. She is the sole provider for her mother, a farm girl who had a brief and glamorous career as a Ziegfield folly, and her lovely, severely disabled sister. At a nightclub she chances to meet Styles, the man she visited with her father before he vanished, and she begins to understand the complexity of her father&apos;s life, the reasons he might have been murdered.\r\n\r\nMesmerizing, hauntingly beautiful, with the pace and atmosphere of a noir thriller and a wealth of detail about organized crime, the merchant marine, and the clash of classes in New York, Egan&apos;s first historical novel is a masterpiece, a deft, startling, intimate exploration of a transformative moment in the lives of women and men, America, and the world. Manhattan Beach is a magnificent novel by one of the greatest writers of our time.\r\n\r\nxx","last_updated":"2017-10-05T12:03:38.863Z","parsed":{"xt":"urn:btih:84973a714200c6ae023335cd8021a3849d1c0c18","dn":"Manhattan Beach_ A Novel by Jennifer Egan ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"84973a714200c6ae023335cd8021a3849d1c0c18","infoHashBuffer":{"type":"Buffer","data":[132,151,58,113,66,0,198,174,2,51,53,205,128,33,163,132,157,28,12,24]},"name":"Manhattan Beach_ A Novel by Jennifer Egan ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}