{"title":"Bulk Image Downloader v5.16","magnet":"magnet:?xt=urn:btih:8530b08f7abb45415ff03a9701f44d1f84be671f&dn=Bulk+Image+Downloader+v5.16&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"7577993","seeders":"10","leechers":"0","description":"Bulk Image Downloader v5.16\r\n\r\nDownload Full Sized images from almost any web gallery or web forum\r\n\r\nFeatures\r\nImage Host Support - BID works with almost all popular image hosting sites, such as flickr, imagevenue, imagefap, imageshack, imagebam, etc. \r\n\r\nSocial Networking Sites - BID supports album downloading from sites such asmyspace, and twitter related hosts like tweetphoto.com, twitpic.com, yfrog.com\r\n\r\nFull Sized Images - BID uses an advanced heuristic scoring method to locate full sized images. This means BID can work on most galleries automatically, with no user configuration necessary. \r\n\r\nBatch Downloading -  Automatically download from huge lists of gallery URLs via the integrated Queue Manager.\r\n\r\nWeb Browser Integration - BID integrates with IE, Opera, FireFox and Chrome. Just right click inside your browser window and select &quot;Open current page with BID&quot;\r\n\r\nWeb Forum Support - BID can scan multi page forum threads and quickly extract all image links\r\nMulti Page Gallery Downloads - BID can detect and download from most popular multi page web galleries out of the box.\r\n\r\nPassword Protected Websites - BID will prompt for user names and passwords if the web site requires them. \r\n\r\nVideo Downloading - It&apos;s not just for images - BID also supports VIDEO downloading from directly linked video files (.avi, .wmv, .mpeg, .mov, .flv, .mp4, etc)\r\n\r\nEmbedded images - Apart from locating and downloading full sized imaged, BID can also download images embedded on a page \r\n\r\nSequenced image filenames (fusker) - BID supports &apos;ranged&apos; URLs for sequenced image downloading. e.g. http://mysite/pics/image[001-100].jpg \r\n\r\nImage Validation - BID checks every image to make sure it&apos;s been downloaded correctly. Invalid images are retried automatically.\r\n\r\nResume Downloads - BID will resume downloads from the point at which the connection was broken.\r\nMulti Threaded Downloading - BID can download up to 50 images at once. Download those galleries quickly! \r\n\r\nRedirection Resolution -Some sites use image redirection &quot;services&quot; like imagecash, urlcash etc. to display adverts before redirecting to the imagehost. BID automatically resolves these types of links. \r\n\r\nFile name unmangling - BID will retrieve the correct file name from image hosts that scramble filenames (where possible), such as imagevenue, imagefap. \r\n\r\nGenerate File names - Optionally create your own sequenced file names for image hosts that scramble the file names\r\n\r\nExport Galleries to HTML or BB Code - Quickly generate gallery code suitable for pasting into web forums.\r\n\r\nAdvanced Configuration - BID has many advanced settings for things like Javascript processing, redirection handling, and more for those tricky galleries that thwart BID&apos;s download attempts. We&apos;re happy to help out with these settings if you get stuck - just contact us. \r\n\r\n... and more!\r\n\r\nOfficial Website: http://bulkimagedownloader.com/","last_updated":"2017-10-29T12:14:30.712Z","parsed":{"xt":"urn:btih:8530b08f7abb45415ff03a9701f44d1f84be671f","dn":"Bulk Image Downloader v5.16","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8530b08f7abb45415ff03a9701f44d1f84be671f","infoHashBuffer":{"type":"Buffer","data":[133,48,176,143,122,187,69,65,95,240,58,151,1,244,77,31,132,190,103,31]},"name":"Bulk Image Downloader v5.16","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}