{"title":"\nIslands in by Ernest Hemingway EPUB","magnet":"magnet:?xt=urn:btih:85e4103b824e8d8c12d53ceb217edaa36c94424d&dn=Islands+in++by+Ernest+Hemingway+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3207785","seeders":"0","leechers":"0","description":"xx\r\n\r\nIslands in the Stream by Ernest Hemingway EPUB\r\n\r\nFirst published in 1970, nine years after Hemingway&apos;s death, this is the story of an artist and adventurer, a man much like Hemingway himself. Beginning in the 1930s, Islands in the Stream follows the fortunes of Thomas Hudson, from his experiences as a painter on the Gulf Stream island of Bimini through his antisubmarine activities off the coast of Cuba during World War II. Hemingway is at his mature best in this beguiling tale.\r\n\r\nErnest Hemingway did more to change the style of English prose than any other writer in the 20th century, and for his efforts he was awarded the Nobel Prize for literature in 1954. Hemingway wrote in short, declarative sentences and was known for his tough, terse prose. Publication of The Sun Also Rises and A Farewell to Arms immediately established Ernest Hemingway as one of the greatest literary lights of the 20th century.\r\n\r\nAs part of the expatriate community in 1920s Paris, the former journalist and World War I ambulance driver began a career that lead to international fame. Hemingway was an aficionado of bullfighting and big-game hunting, and his main protagonists were always men and women of courage and conviction who suffered unseen scars, both physical and emotional. He covered the Spanish Civil War, portraying it in fiction in his brilliant novel For Whom the Bell Tolls, and he subsequently covered World War II. His classic novella The Old Man and the Sea won the Pulitzer Prize in 1953. He died in 1961.\r\n\r\nxx","last_updated":"2017-10-17T12:07:22.821Z","parsed":{"xt":"urn:btih:85e4103b824e8d8c12d53ceb217edaa36c94424d","dn":"Islands in  by Ernest Hemingway EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"85e4103b824e8d8c12d53ceb217edaa36c94424d","infoHashBuffer":{"type":"Buffer","data":[133,228,16,59,130,78,141,140,18,213,60,235,33,126,218,163,108,148,66,77]},"name":"Islands in  by Ernest Hemingway EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}