{"title":"RimWorld.Alpha.18c.v0.18.1753 -MULTILANGUAGE","magnet":"magnet:?xt=urn:btih:86873af3850c93e4a693527eb7b77a8c6e7385ed&dn=RimWorld.Alpha.18c.v0.18.1753+-MULTILANGUAGE&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Izomag","categoryP":"games","categoryS":"pc","size":"104539578","seeders":"0","leechers":"0","description":"RimWorld is a sci-fi colony sim driven by an intelligent AI storyteller. Inspired by Dwarf Fortress, Firefly, and Dune.You begin with three survivors of a shipwreck on a distant world.Manage colonists&apos; moods, needs, wounds, and illnesses.Fashion structures, weapons, and apparel from metal, wood, stone, cloth, or futuristic materials.Tame and train cute pets, productive farm animals, and deadly attack beasts.Watch colonists develop and break relationships with family members, lovers, and spouses.Fight pirate raiders, hostile tribes, rampaging animals, giant tunnelling insects and ancient killing machines.Trade with passing ships and trade caravans.Decorate your colony to make it into a pleasurable space.Dig through snow, weather storms, and fight fires.Capture refugees or prisoners and turn them to your side or sell them into slavery.Discover a new generated world each time you play.Build colonies in the desert, jungle, tundra, and more.Learn to play easily with the help of an intelligent and unobtrusive AI tutor.RimWorld is a story generator. It&#x2019;s designed to co-author tragic, twisted, and triumphant stories about imprisoned pirates, desperate colonists, starvation and survival. It works by controlling the &#x201C;random&#x201D; events that the world throws at you. Every thunderstorm, pirate raid, and traveling salesman is a card dealt into your story by the AI Storyteller. There are several storytellers to choose from. Randy Random does crazy stuff, Cassandra Classic goes for rising tension, and Phoebe Chillax likes to relax.Your colonists are not professional","last_updated":"2017-06-29T12:00:48.451Z","parsed":{"xt":"urn:btih:86873af3850c93e4a693527eb7b77a8c6e7385ed","dn":"RimWorld.Alpha.18c.v0.18.1753 -MULTILANGUAGE","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"86873af3850c93e4a693527eb7b77a8c6e7385ed","infoHashBuffer":{"type":"Buffer","data":[134,135,58,243,133,12,147,228,166,147,82,126,183,183,122,140,110,115,133,237]},"name":"RimWorld.Alpha.18c.v0.18.1753 -MULTILANGUAGE","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}