{"title":"Blanche Wiesen Cook - Eleanor Roosevelt Volume 3 2016 RETAiL ePU","magnet":"magnet:?xt=urn:btih:86c1189b17be33f236fbef5efec824287d631672&dn=Blanche+Wiesen+Cook+-+Eleanor+Roosevelt+Volume+3+2016+RETAiL+ePU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13946562","seeders":"2","leechers":"3","description":"Blanche Wiesen Cook - Eleanor Roosevelt Volume 3 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe final volume in the definitive biography of America&apos;s greatest first lady.\r\n\r\nHistorians, politicians, critics, and listeners everywhere have praised Blanche Wiesen Cook&apos;s biography of Eleanor Roosevelt as the essential portrait of a woman who towers over the 20th century. The third and final volume takes us through World War II, FDR&apos;s death, the founding of the UN, and Eleanor Roosevelt&apos;s death in 1962. It follows the arc of war and the evolution of a marriage as the first lady realized the cost of maintaining her principles even as the country and her husband were not prepared to adopt them. Eleanor Roosevelt continued to struggle for her core issues - economic security, New Deal reforms, racial equality, and rescue - when they were sidelined by FDR while he marshaled the country through war. The chasm between Eleanor and Franklin grew, and the strains on their relationship were as political as they were personal. She also had to negotiate the fractures in the close circle of influential women around her at Val-Kill, but through it she gained confidence in her own vision, even when forced to amend her agenda when her beliefs clashed with government policies on such issues as neutrality, refugees, and eventually the threat of communism. These years - the war years - made Eleanor Roosevelt the woman she became: leader, visionary, guiding light. FDR&apos;s death in 1945 changed her world, but she was far from finished, returning to the spotlight as a crucial player in the founding of the United Nations.\r\n\r\nThis is a sympathetic but unblinking portrait of a marriage and of a woman whose passion and commitment has inspired generations of Americans to seek a decent future for all people. Modest and self-deprecating, a moral force in a turbulent world, Eleanor Roosevelt was unique","last_updated":"2017-05-25T11:59:23.848Z","parsed":{"xt":"urn:btih:86c1189b17be33f236fbef5efec824287d631672","dn":"Blanche Wiesen Cook - Eleanor Roosevelt Volume 3 2016 RETAiL ePU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"86c1189b17be33f236fbef5efec824287d631672","infoHashBuffer":{"type":"Buffer","data":[134,193,24,155,23,190,51,242,54,251,239,94,254,200,36,40,125,99,22,114]},"name":"Blanche Wiesen Cook - Eleanor Roosevelt Volume 3 2016 RETAiL ePU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}