{"title":"\nDagger 22_ U.S. Marine Corps Special Operations in Bala Murghab,","magnet":"magnet:?xt=urn:btih:86e4cf0cc58a12ec19c30e9016afea598e88bdb3&dn=Dagger+22_+U.S.+Marine+Corps+Special+Operations+in+Bala+Murghab%2C&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7789482","seeders":"1","leechers":"6","description":"xx\r\n\r\nDagger 22_ U.S. Marine Corps Special Operations in Bala Murghab, Afghanistan by Michael Golembesky ePUB eBOOK-ZAK\r\n\r\nLevel Zero Heroes, Michael Golembesky&apos;s best-selling account of Marine Special Operations Team 8222 in Bala Murghab, Afghanistan, was just the beginning for these now battle-hardened special operations warriors.\r\n\r\nThe unforgiving Afghan winter settled upon the 22 men of Marine Special Operations Team 8222, call sign Dagger 22, in the remote and hostile river valley of Bala Murghab, Afghanistan. The Taliban fighters in the region would have liked nothing more than to once again go dormant and rest until the new spring fighting season began. No chance of that - this winter would be different.\r\n\r\nAlong with Afghan and International Security Forces (NATO), the marines of Dagger 22 continued their fight throughout the harsh winter to shape the battlefield before the Afghan ground began to thaw. From one firefight to the next, the noose began to tighten around the village of Daneh Pasab and the Taliban command cell operating there. On April 6, 2010, a ground force consisting of US Army Special Forces, Afghan commandos, and Marine Corps special operations conducted a night assault to destroy the heavily entrenched Taliban force, breaking their grip on the valley and stopping the spring offensive before it even began.\r\n\r\nBut nothing in Bala Murghab comes easily, and combat operations wear on the operators of Dagger 22 as they lean on each other once again in order to complete their mission in one of the most brutal environments on earth.\r\n\r\nxx","last_updated":"2017-09-23T12:03:47.985Z","parsed":{"xt":"urn:btih:86e4cf0cc58a12ec19c30e9016afea598e88bdb3","dn":"Dagger 22_ U.S. Marine Corps Special Operations in Bala Murghab,","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"86e4cf0cc58a12ec19c30e9016afea598e88bdb3","infoHashBuffer":{"type":"Buffer","data":[134,228,207,12,197,138,18,236,25,195,14,144,22,175,234,89,142,136,189,179]},"name":"Dagger 22_ U.S. Marine Corps Special Operations in Bala Murghab,","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}