{"title":"Thrice Great Hermetica and the Janus Age","magnet":"magnet:?xt=urn:btih:8737c08e84315a6925a41f173f26e1cc7e54a3ac&dn=Thrice+Great+Hermetica+and+the+Janus+Age&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"7620316","seeders":"0","leechers":"0","description":"Thrice Great Hermetica and the Janus Age: Hermetic Cosmology, Finance, Politics and Culture in the Middle Ages through the Late Renaissance - Joseph P. Farrell [epub]\r\n\r\nWhat do the Fourth Crusade, the exploration of the New World, secret excavations of the Holy Land, and the pontificate of Innocent the Third, all have in common? Answer: Venice and the Templars. What do they have in common with Jesus, Gottfried Leibniz, Sir Isaac Newton, Rene Descartes, and the Earl of Oxford? Answer: Egypt and a body of doctrine known as Hermeticism.\r\n\r\nIn this book, noted author and researcher Joseph P Farrell takes the reader on a journey through the hidden history of the Middle Ages, the Renaissance and early Enlightenment, connecting the dots between Venice, international banking, the Templars, and hidden knowledge, drawing out the connections between the notorious Venetian &#x201C;Council of Ten,&#x201D; little known Venetian voyages to the New World, and the sack of Constantinople during the Fourth Crusade. That hidden role of Venice and Hermeticism reached far and wide, into the plays of Shakespeare (a.k.a. Edward DeVere), Earl of Oxford, into the quest of the three great mathematicians of the Early Enlightenment for a lost form of analysis, and back into the end of the classical era, to little known Egyptian influences at work during the time of Jesus.\r\n\r\nJoseph Farrell is an Oxford-educated historian who specializes in alternative history, World War II and secret technologies. Raised in Kansas, he has had a wide range of jobs and is currently a full-time author and researcher. His many books include: The Giza Death Star Trilogy; Reich of the Black Sun; The SS Brotherhood of the Bell; Nazi International; Secrets of the Unified Field; Roswell and the Reich; The Cosmic War; Grid of the Gods; Babylon&#x2019;s Banksters; Transhumanism, The Vipers of Venice; Covert Wars and Breakaway Civilizations and others.\r\n\r\nPaperback: 354 pages\r\nPublisher: Adventures Unlimited Press (September 10, 2014)","last_updated":"2017-12-30T12:00:30.181Z","parsed":{"xt":"urn:btih:8737c08e84315a6925a41f173f26e1cc7e54a3ac","dn":"Thrice Great Hermetica and the Janus Age","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8737c08e84315a6925a41f173f26e1cc7e54a3ac","infoHashBuffer":{"type":"Buffer","data":[135,55,192,142,132,49,90,105,37,164,31,23,63,38,225,204,126,84,163,172]},"name":"Thrice Great Hermetica and the Janus Age","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}