{"title":"Caitlyn Jenner - The Secrets of My Life (epub)","magnet":"magnet:?xt=urn:btih:876a340a5a05c7116ae6b17750682e4403740ca3&dn=Caitlyn+Jenner+-+The+Secrets+of+My+Life+%28epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Browse suprbayrequest","categoryP":"other","categoryS":"e_books","size":"48123098","seeders":"0","leechers":"1","description":"The Secrets of My Life by Caitlyn Jenner\r\n\r\nHardcover version : 336 pages\r\nPublisher         : Grand Central Publishing (April 25, 2017)\r\nISBN-13           : 978-1455596751\r\nFormat            : ePUB\r\n\r\n\r\nIn this remarkable memoir-written during her pivotal first years of becoming her authentic self-Caitlyn Jenner reflects on her past as she looks to her future\r\n\r\n\r\n&quot;Imagine denying your core and soul. Then add to it the most impossible expectations that people have for you because you are the personification of The American Male Athlete.&quot;\r\n\r\nBruce Jenner, the celebrated Olympic icon and later the patriarch of one of the most famous families in the world, seemed to be living a dream life of success, fame, and prosperity. But the all-American image and million-dollar smile belied a lifelong struggle with gender dysphoria, and it wasn&apos;t until the sensational Diane Sawyer interview that the public mask of Bruce Jenner was finally retired, and through the memorable Vanity Fair piece by Buzz Bissinger, that Caitlyn Jenner was introduced to the world and set free to exist on her own terms. Since then, Caitlyn has undertaken an arduous emotional and physical odyssey to achieve the completeness she always felt was missing.\r\n\r\nIn THE SECRETS OF MY LIFE, Caitlyn reflects on the inner conflict she experienced growing up in an era of rigidly defined gender identities, and the cruel irony of being hailed by an entire nation as the ultimate symbol of manhood. She recounts her Olympic triumph, her rise to fame, and relates how her sense of frustration and shame grew with the passing years and the lengths to which she had to go to conceal her true self. Caitlyn in turn uncovers the toll that these personal struggles had on her three marriages and, subsequently, the relationships with her children. She also talks candidly about her life in the public eye as a member of the Kardashian clan, what led to her decision to become Caitlyn, and how she, her family, the transgender community, and the rest of the world has since embraced her new life.\r\n\r\nFilled with incredibly personal and moving stories of struggle and victory, of anxiety and fear, and, finally, of surrender and acceptance, THE SECRETS OF MY LIFE reveals the real Caitlyn Jenner by tracing her long and eventful journey to becoming herself.","last_updated":"2017-04-26T09:05:57.668Z","parsed":{"xt":"urn:btih:876a340a5a05c7116ae6b17750682e4403740ca3","dn":"Caitlyn Jenner - The Secrets of My Life (epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"876a340a5a05c7116ae6b17750682e4403740ca3","infoHashBuffer":{"type":"Buffer","data":[135,106,52,10,90,5,199,17,106,230,177,119,80,104,46,68,3,116,12,163]},"name":"Caitlyn Jenner - The Secrets of My Life (epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}