{"title":"\nThe Twelve-Mile Straight by Eleanor Henderson EPUB","magnet":"magnet:?xt=urn:btih:8855aae336d72c68ce4a0acef1e8d1b2a3ea9d8e&dn=The+Twelve-Mile+Straight+by+Eleanor+Henderson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2919990","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Twelve-Mile Straight by Eleanor Henderson EPUB\r\n\r\nFrom New York Times best-selling author Eleanor Henderson, an audacious American epic set in rural Georgia during the years of the Depression and Prohibition.\r\n\r\nCotton County, Georgia, 1930: In a house full of secrets, two babies - one light-skinned, the other dark - are born to Elma Jesup, a white sharecropper&apos;s daughter. Accused of her rape, field hand Genus Jackson is lynched and dragged behind a truck down the Twelve-Mile Straight, the road to the nearby town. In the aftermath, the farm&apos;s inhabitants are forced to contend with their complicity in a series of events that left a man dead and a family irrevocably fractured.\r\n\r\nDespite the prying eyes and curious whispers of the townspeople, Elma begins to raise her babies as best she can, under the roof of her mercurial father, Juke, and with the help of Nan, the young black housekeeper who is as close to Elma as a sister. But soon it becomes clear that the ties that bind all of them together are more intricate than any could have ever imagined. As startling revelations mount, a web of lies begins to collapse around the family, destabilizing their precarious world and forcing all to reckon with the painful truth.\r\n\r\nAcclaimed author Eleanor Henderson has returned with a novel that combines the intimacy of a family drama with the staggering presence of a great Southern saga. Tackling themes of racialized violence, social division, and financial crisis, The Twelve-Mile Straight is a startlingly timely, emotionally resonant, and magnificent tour de force.\r\n\r\nxx","last_updated":"2017-10-17T12:02:10.641Z","parsed":{"xt":"urn:btih:8855aae336d72c68ce4a0acef1e8d1b2a3ea9d8e","dn":"The Twelve-Mile Straight by Eleanor Henderson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8855aae336d72c68ce4a0acef1e8d1b2a3ea9d8e","infoHashBuffer":{"type":"Buffer","data":[136,85,170,227,54,215,44,104,206,74,10,206,241,232,209,178,163,234,157,142]},"name":"The Twelve-Mile Straight by Eleanor Henderson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}