{"title":"WinCatalog 2017 17.40.12.29 + Crack [CracksNow]","magnet":"magnet:?xt=urn:btih:891eec3c8961588c7bee9396d26346b479d152c2&dn=WinCatalog+2017+17.40.12.29+%2B+Crack+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"54433696","seeders":"42","leechers":"7","description":"WinCatalog 2017 - is versatile cataloguer software for disks, files, folders and any non-file objects. It is not always easy to track where some files are located in your computer especially if you have a large collection of CDs and DVDs. If you are one of those users, then it definitely pays off to have the right tool for working with such a task. WinCatalog is software utility designed to help you find documents and data from your computer by building an index that offers you instant access to them. This program can be mastered even by less experienced users because it sports a straightforward interface. \r\n\r\nWinCatalog is a truly full-featured tool, so it would be natural to expect drag and drop support in such an app. Although the developer didn&#x2019;t include this option, it made the process of adding files to the list pretty simple. You can add a fixed or removable disk, specific folders or individual files to the catalog. Virtual folders and customs items can be created pretty easily. \r\n\r\nThe app works fast and it is able to display the contents of your folders properly by preserving the hierarchical folder structure. It remembers the files&#x2019; attributes (e.g. path, size, and dates of creation) and you can also preview them in the right panel. \r\n\r\nWinCatalog can perform searches throughout the entire collection thanks to its built-in search engine. Simply type in the file name or use additional filters for more accurate results such as size, tags, locations and date. It includes multi-tabbed support and this means you can work with multiple searches at the same time","last_updated":"2017-12-31T12:05:29.516Z","parsed":{"xt":"urn:btih:891eec3c8961588c7bee9396d26346b479d152c2","dn":"WinCatalog 2017 17.40.12.29   Crack [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"891eec3c8961588c7bee9396d26346b479d152c2","infoHashBuffer":{"type":"Buffer","data":[137,30,236,60,137,97,88,140,123,238,147,150,210,99,70,180,121,209,82,194]},"name":"WinCatalog 2017 17.40.12.29   Crack [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}