{"title":"\nLeaving Islam- Apostates Speak Out - Ibn Warraq (Editor)","magnet":"magnet:?xt=urn:btih:89e99d306a53db4faef2f3d3cba4ca012e90f6b5&dn=Leaving+Islam-+Apostates+Speak+Out+-+Ibn+Warraq+%28Editor%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"onh4","categoryP":"other","categoryS":"e_books","size":"12867595","seeders":"14","leechers":"8","description":"In the West abandoning one&apos;s religion (apostasy) can be a difficult, emotional decision, which sometimes has social repercussions. However, in culturally diverse societies where there is a mixture of ethnic groups and various philosophies of life, most people look upon such shifts in intellectual allegiance as a matter of personal choice and individual right. By contrast, in Islam apostasy is still viewed as an almost unthinkable act, and in orthodox circles it is considered a crime punishable by death. Renowned scholar of Islamic Studies Bernard Lewis described the seriousness of leaving the Islamic faith in the following dire terms: &quot;Apostasy was a crime as well as a sin, and the apostate was damned both in this world and the next. His crime was treason &#xF9; desertion and betrayal of the community to which he belonged, and to which he owed loyalty; his life and property were forfeit. He was a dead limb to be excised.&quot;\r\n\r\nDefying the death penalty applicable to all apostates in Islam, the ex-Muslims who are here represented feel it is their duty to speak up against their former faith, to tell the truth about the fastest growing religion in the world. These former Muslims, from all parts of the Islamic world, recount how they slowly came to realize that the religion into which they were born was in many respects unbelievable and sometimes even dangerous.\r\n\r\nThese memoirs of personal journeys to enlightenment and intellectual freedom make for moving reading and are a courageous signal to other ex-Muslims to come out of the closet","last_updated":"2017-09-23T12:05:45.527Z","parsed":{"xt":"urn:btih:89e99d306a53db4faef2f3d3cba4ca012e90f6b5","dn":"Leaving Islam- Apostates Speak Out - Ibn Warraq (Editor)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"89e99d306a53db4faef2f3d3cba4ca012e90f6b5","infoHashBuffer":{"type":"Buffer","data":[137,233,157,48,106,83,219,79,174,242,243,211,203,164,202,1,46,144,246,181]},"name":"Leaving Islam- Apostates Speak Out - Ibn Warraq (Editor)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}