{"title":"\nInheritors of the Earth_ How Nature Is Thriving in an Age of Ext","magnet":"magnet:?xt=urn:btih:8a31ca10342d81f02f4b3aab36a5a53fd6076c9b&dn=Inheritors+of+the+Earth_+How+Nature+Is+Thriving+in+an+Age+of+Ext&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"45684051","seeders":"13","leechers":"11","description":"xx\r\n\r\nInheritors of the Earth_ How Nature Is Thriving in an Age of Extinction by Chris D Thomas ePUB eBOOK-ZAK\r\n\r\nHuman activity has irreversibly changed the natural environment. But the news isn&apos;t all bad.\r\n\r\nIt&apos;s accepted wisdom today that human beings have permanently damaged the natural world, causing extinction, deforestation, pollution, and, of course, climate change. But in Inheritors of the Earth, biologist Chris Thomas shows that this obscures a more hopeful truth - we&apos;re also helping nature grow and change. Human cities and mass agriculture have created new places for enterprising animals and plants to live, and our activities have stimulated evolutionary change in virtually every population of living species. Most remarkably, Thomas shows, humans may well have raised the rate at which new species are formed to the highest level in the history of our planet.\r\n\r\nDrawing on the success stories of diverse species, from the ochre-colored comma butterfly to the New Zealand pukeko, Thomas overturns the accepted story of declining biodiversity on Earth. In so doing, he questions why we resist new forms of life and why we see ourselves as unnatural. Ultimately, he suggests that if life on Earth can recover from the asteroid that killed off the dinosaurs, it can survive the onslaughts of the technological age. This eye-opening book is a profound reexamination of the relationship between humanity and the natural world.\r\n\r\nxx","last_updated":"2017-09-30T12:06:45.977Z","parsed":{"xt":"urn:btih:8a31ca10342d81f02f4b3aab36a5a53fd6076c9b","dn":"Inheritors of the Earth_ How Nature Is Thriving in an Age of Ext","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8a31ca10342d81f02f4b3aab36a5a53fd6076c9b","infoHashBuffer":{"type":"Buffer","data":[138,49,202,16,52,45,129,240,47,75,58,171,54,165,165,63,214,7,108,155]},"name":"Inheritors of the Earth_ How Nature Is Thriving in an Age of Ext","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}