{"title":"The Fortunate Ones by Ellen Umansky EPUB","magnet":"magnet:?xt=urn:btih:8a66e23044831339f09c670fcaeeb8dbb6538c99&dn=The+Fortunate+Ones+by+Ellen+Umansky+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"535496","seeders":"0","leechers":"0","description":"xx \r\n\r\nThe Fortunate Ones by Ellen Umansky EPUB \r\n\r\nOne very special work of art - a Chaim Soutine painting - will connect the lives and fates of two different women, generations apart, in this enthralling and transporting debut novel that moves from World War II Vienna to contemporary Los Angeles. \r\n\r\nIt is 1939 in Vienna, and as the specter of war darkens Europe, Rose Zimmer&apos;s parents are desperate. Unable to get out of Austria, they manage to secure passage for their young daughter on a kindertransport and send her to live with strangers in England. \r\n\r\nSix years later, the war finally over, a grief-stricken Rose attempts to build a life for herself. Alone in London, devastated, she cannot help but try to search out one piece of her childhood: the Chaim Soutine painting her mother had cherished. \r\n\r\nMany years later the painting finds its way to America. In modern-day Los Angeles, Lizzie Goldstein has returned home for her father&apos;s funeral. Newly single and unsure of her path, she also carries a burden of guilt that cannot be displaced. Years ago, as a teenager, Lizzie threw a party at her father&apos;s house with unexpected but far-reaching consequences. The Soutine painting that she loved and that had provided lasting comfort to her after her own mother had died was stolen and has never been recovered. This painting will bring Lizzie and Rose together and ignite an unexpected friendship, eventually revealing long-held secrets that hold painful truths. \r\n\r\nSpanning decades and unfolding in crystalline, atmospheric prose, The Fortunate Ones is a haunting story of longing, devastation, and forgiveness and a deep examination of the bonds and desires that map our private histories. \r\n\r\nxx","last_updated":"2017-11-30T12:00:36.481Z","parsed":{"xt":"urn:btih:8a66e23044831339f09c670fcaeeb8dbb6538c99","dn":"The Fortunate Ones by Ellen Umansky EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8a66e23044831339f09c670fcaeeb8dbb6538c99","infoHashBuffer":{"type":"Buffer","data":[138,102,226,48,68,131,19,57,240,156,103,15,202,238,184,219,182,83,140,153]},"name":"The Fortunate Ones by Ellen Umansky EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}