{"title":"RimArts Becky! Internet Mail v2.74","magnet":"magnet:?xt=urn:btih:8ac91376e6e158c962c16565404e5d68439f6436&dn=RimArts+Becky%21+Internet+Mail+v2.74&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"4123720","seeders":"9","leechers":"2","description":"RimArts Becky! Internet Mail v2.74\n\nBecky! Internet Mail is the Internet e-mail client.\nSince its birth in 1996, we kept improving its functionalities listening to the users&apos; feedback, and it has become one of the most successful shareware e-mail products.\nIt runs on most of the Windows platform from Windows95 to the latest Windows10. (except Windows Mobile (CE))\nIt has almost every feature that are needed for e-mail client and has nothing that are only useful for the marketing hype.\nIts no-nonsense usability is widely supported by not only individual users but also large companies and schools, especially in Japan.\n\nFeatures\n\nYou can create not only multiple mailboxes but also create multiple profiles for each mailbox. That will make very flexible mailbox management for people who has a lot of e-mail accounts.\nIt supports POP3, IMAP4, SMTP (with or without SSL).\nFor its features, the program size is unbelievably compact. It is developed with good old C++ and optimized for Windows, which promises quick response in every aspect.\nYou can view and write HTML mail within Becky! using Microsoft IE&apos;s inline component.\nThe useful &quot;Template&quot; feature allows you to create templates for everyday&apos;s fixed work, that will incredibly save your time.\nThe friendly &quot;Reminder&quot; feature allows you to deliver messages from you to you on the scheduled date.\nThe powerful filtering manager allows you to create very flexible filtering rule that can contain almost infinite And/Or conditions and various filtering actions. You can also quickly make a filtering rule by drag&amp;drop with Alt key.\nThe &quot;Mailing lists Manager&quot; can manage many mailing list that you have subscribed in one window.\nIts &quot;Plug-in Interface&quot; allows the third parties to create powerful add-on programs.\nYou can bring out your Becky! in your USB memory using &quot;Sync With Portable Media&quot; functionality. You can plug-in your USB memory to any Windows computer and she is there! It leaves virtually no footprint on the target computer, so it is ideal for Internet Cafe.\nIts &quot;Query&quot; feature searches strings in any folders, and this Query result can be saved as a folder.\nIts unique &quot;Agents&quot; feature can manage non-urgent work like &quot;Need Reply in Xdays&quot;, &quot;Wait for Reply&quot;, etc. You can forget about those chores and concentrate on the important work.\n\nOfficial Website: http://www.rimarts.co.jp/becky.htm","last_updated":"2017-09-03T12:02:24.035Z","parsed":{"xt":"urn:btih:8ac91376e6e158c962c16565404e5d68439f6436","dn":"RimArts Becky! Internet Mail v2.74","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8ac91376e6e158c962c16565404e5d68439f6436","infoHashBuffer":{"type":"Buffer","data":[138,201,19,118,230,225,88,201,98,193,101,101,64,78,93,104,67,159,100,54]},"name":"RimArts Becky! Internet Mail v2.74","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}