{"title":"\nHope_ Entertainer of the Century by Richard Zoglin ePUB eBOOK-ZA","magnet":"magnet:?xt=urn:btih:8af3e590d5768f04a87111162fcfa47d1384b238&dn=Hope_+Entertainer+of+the+Century+by+Richard+Zoglin+ePUB+eBOOK-ZA&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6966891","seeders":"11","leechers":"2","description":"xx\r\n\r\nHope_ Entertainer of the Century by Richard Zoglin ePUB eBOOK-ZAK\r\n\r\nBorn in 1903, and until his death in 2003, Bob Hope was the only entertainer to achieve top-rated success in every major mass-entertainment medium, from vaudeville to television and everything in between. He virtually invented modern stand-up comedy. His tours to entertain US troops and patriotic radio broadcasts, along with his all-American, brash-but-cowardly movie character, helped to ease the nation&apos;s jitters during the stressful days of World War II. He helped redefine the very notion of what it means to be a star: a savvy businessman, pioneer of the brand extension (churning out books, writing a newspaper column, hosting a golf tournament), and public-spirited entertainer whose Christmas military tours and tireless work for charity set the standard for public service in Hollywood. But he became a polarizing figure during the Vietnam War, and the book sheds new light on his close relationship with President Richard Nixon during those embattled years.\r\n\r\nBob Hope is a household name. However, as Richard Zoglin shows in this revelatory biography, there is still much to be learned about this most public of figures, from his secret first marriage and his stint in reform school, to his indiscriminate womanizing and his ambivalent relationship with Bing Crosby and Johnny Carson. Hope could be cold, self-centered, tight with a buck, and perhaps the least introspective man in Hollywood. But he was also a dogged worker, gracious with fans, and generous with friends.\r\n\r\nHope is both a celebration of an entertainer whose vast contribution has never been properly appreciated, and a complex portrait of a gifted but flawed man, who, unlike many Hollywood stars, truly loved being famous, appreciated its responsibilities, and handled celebrity with extraordinary grace.\r\n\r\nxx","last_updated":"2017-09-22T12:04:04.650Z","parsed":{"xt":"urn:btih:8af3e590d5768f04a87111162fcfa47d1384b238","dn":"Hope_ Entertainer of the Century by Richard Zoglin ePUB eBOOK-ZA","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8af3e590d5768f04a87111162fcfa47d1384b238","infoHashBuffer":{"type":"Buffer","data":[138,243,229,144,213,118,143,4,168,113,17,22,47,207,164,125,19,132,178,56]},"name":"Hope_ Entertainer of the Century by Richard Zoglin ePUB eBOOK-ZA","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}