{"title":"The Met - Policing London S02E02","magnet":"magnet:?xt=urn:btih:8b4abf8cde59387a2d5245c40b9f7fa52b26e7ae&dn=The+Met+-+Policing+London+S02E02&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"RoaElson","categoryP":"video","categoryS":"other","size":"1012560739","seeders":"10","leechers":"7","description":"The Met - Policing London S02E02\r\n\r\nWith violent crime on the increase and the threat of terrorism, the Met want more armed police on the streets. They&apos;re recruiting another 600 officers, but Derek is one of the Met&apos;s most experienced with nearly 20 years spent patrolling London&apos;s streets. He leads his team on a pursuit through London to intercept a car suspected of carrying a gun, a last-resort tactic known as an armed stop. \r\n\r\nGangs are a major problem for police and in Harlesden a long running turf war has had horrific consequences. A young man has been shot, an innocent casualty of a violent gang feud. Detectives Hitesh Patel and Paul Connelly work for Trident, the Met&apos;s specialist gang unit. They have focused on one of the most notorious gangs in Harlesden, working undercover to take down as many of them as possible and stop the drug trade thriving on the streets of north west London. \r\n\r\nOver the last five years robberies committed on mopeds have increased tenfold across London and in Islington there&apos;s an epidemic of phones being snatched, often by teenagers. Pursuing them is controversial following the death of a local teenager, Henry Hicks, whilst driving a moped. His family are waiting for the results of the coroner&apos;s inquest - the police believe he died from reckless driving, his family believe he died as a result of a police pursuit. The Met commissioner (at the time) Sir Bernard Hogan-Howe visits Islington and is confronted by the grieving family. Against the backdrop of this community tension, Sergeant Steve Brown, who grew up in the area, is determined to arrest and convict the phone snatchers.\r\n\r\n(with soft subtitles) \r\n\r\nFirst broadcast: 31 May 2017\r\nDuration:  1 hour","last_updated":"2017-06-03T12:06:05.408Z","parsed":{"xt":"urn:btih:8b4abf8cde59387a2d5245c40b9f7fa52b26e7ae","dn":"The Met - Policing London S02E02","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8b4abf8cde59387a2d5245c40b9f7fa52b26e7ae","infoHashBuffer":{"type":"Buffer","data":[139,74,191,140,222,89,56,122,45,82,69,196,11,159,127,165,43,38,231,174]},"name":"The Met - Policing London S02E02","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}