{"title":"Rigmar Sunfly Karaoke Collection (RAR Archive)","magnet":"magnet:?xt=urn:btih:8c7cf233f459eb4d6a6a0da9925bba7d73de5132&dn=Rigmar+Sunfly+Karaoke+Collection+%28RAR+Archive%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rigmar_radio","categoryP":"other","categoryS":"other","size":"52157420216","seeders":"2","leechers":"2","description":"The Sunfly Collection CDG+MP3 Karaoke.  Audio 128 or better \r\n\r\nSunfly is a UK Based Karaoke manufacturer and new tracks may be purchased online from there web site.  This torrent is just to kick start new Karaoke presenters who can not afford to purchase all these tracks in one hit.\r\n\r\nErrors and duplications in this working collection are less than 1 song in 200.  WHERE DUPLICATE SONGS EXIST PLEASE DELETE THE SMALLER OF THE TWO .mp3 files for the best audio quality.   Most duplications are caused by file name errors which I correct after making this torrent.\r\n\r\nThis is a very large 48 GB download.  Recommended download speed 2.5 MB/s or FASTER.  Target download time at 2.5 MB/s or 20 mbps is 6 Hours or a LOT LESS.   This torrent is duel seed from Europe for ultra fast download speeds for those who know how to torrent.\r\n\r\nWARNING: Slow downloading peers are killing bit torrent in 2017 and will be REMOVED and BANNED from this swarm until other seeders can help out.  This torrent is not a place to learn how to bit torrent.  Try just running this one active download and see how your download speed on this torrent get better!!!  \r\n\r\nWARNING: OVER 11700 Karaoke songs or 23 thousand files on the Sunfly Label are placed into a single RAR Archive which will take a very long time to decompress.  This unarchiving time depends on the age and power of your hardware.  Please be very patient when decompressing this file.\r\n\r\nWARNING: If you downloaded the Rigmar Collection April 2017 CDG+MP3 Karaoke then you already have 99% of these songs, best wait for the 2018 collection early next year when most of the duplications in this torrent will have been corrected.\r\n\r\nAll songs are tagged and file named using best industry practise for the naming of computer music files and will import correctly into all professional playout software where the file name template of the imported track is:\r\n\r\nArtist - Song title [Any Other information] ie:\r\n\r\nBing Crosby - White Christmas [SF Karaoke]\r\n\r\nIf you can afford the upload bandwidth, staying behind to help seed would be nice and the correct thing to do.\r\n\r\nRigmar Radio - Rockin&apos; the Free World since 1967","last_updated":"2017-07-05T12:01:55.812Z","parsed":{"xt":"urn:btih:8c7cf233f459eb4d6a6a0da9925bba7d73de5132","dn":"Rigmar Sunfly Karaoke Collection (RAR Archive)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8c7cf233f459eb4d6a6a0da9925bba7d73de5132","infoHashBuffer":{"type":"Buffer","data":[140,124,242,51,244,89,235,77,106,106,13,169,146,91,186,125,115,222,81,50]},"name":"Rigmar Sunfly Karaoke Collection (RAR Archive)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}