{"title":"Understanding Cultural and Human Geography by Paul Robbins (The ","magnet":"magnet:?xt=urn:btih:8d5aa0d10a9d77aa0d99fed773b7a575441c267b&dn=Understanding+Cultural+and+Human+Geography+by+Paul+Robbins+%28The+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3546008","seeders":"0","leechers":"0","description":"xx\r\n\r\nUnderstanding Cultural and Human Geography by Paul Robbins (The Great Courses) PDF eBOOK-ZAK\r\n\r\nNo one is an island. The community where you live, the food you eat, and the people you know are all part of a global chain of connections. Over the past 10,000 years, humans have transformed the planet - yet the planet has also influenced human life in myriad ways. In these 24 eye-opening lectures, take an interdisciplinary voyage across time and around the world to consider the dual nature of our relationship with &quot;place&quot;.\r\n\r\nWith insights drawn from ecology, anthropology, economics, geopolitics, and more, Professor Robbins reveals the underlying structures that explain why the world is the way it is. Understanding global trends and connections - from environmental changes such as deforestation to the way money and labor slosh around the globe - will give you new insights into the story of human civilization and current events.\r\n\r\nOne key theme of this course is that &quot;place&quot; is a construct. People make (and constantly re-make) places in response to myriad circumstances, ranging from economic conditions to changes in the ecology around them. Indeed, humans have taken over the Earth so completely that some geologists now refer to our era as the Anthropocene - the &quot;human era&quot;.\r\n\r\nWhile it is tempting to despair over humanity&apos;s takeover of the planet, you see how the picture is surprisingly complex, and that there is reason for optimism. Much of the human impact on the Earth, from deforestation to rapid urbanization, is not an inexorable march of destruction without any means of revitalization.\r\n\r\nIn addition to the study of the environment, Professor Robbins examines the wide-ranging implications of a world economy. You&apos;ll explore the wellspring of culture and delve into the thorny issues of geography, ethnicity, and statehood. When you complete this course, you&apos;ll have all the tools you need to look beyond the headlines and analyze world events in a whole new way.\r\n\r\nxx","last_updated":"2017-08-13T12:01:20.517Z","parsed":{"xt":"urn:btih:8d5aa0d10a9d77aa0d99fed773b7a575441c267b","dn":"Understanding Cultural and Human Geography by Paul Robbins (The ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8d5aa0d10a9d77aa0d99fed773b7a575441c267b","infoHashBuffer":{"type":"Buffer","data":[141,90,160,209,10,157,119,170,13,153,254,215,115,183,165,117,68,28,38,123]},"name":"Understanding Cultural and Human Geography by Paul Robbins (The ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}