{"title":"The Sunlight Pilgrims by Jenni Fagan EPUB","magnet":"magnet:?xt=urn:btih:8df34baafc9c0ca61ecc9064a8ea136ecc2935b5&dn=The+Sunlight+Pilgrims+by+Jenni+Fagan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"366417","seeders":"22","leechers":"5","description":"xx\r\n\r\nThe Sunlight Pilgrims by Jenni Fagan EPUB\r\n\r\nSet in a Scottish caravan park during a freak winter - it is snowing in Jerusalem, the Thames is overflowing, and an iceberg separated from the Fjords in Norway is expected to arrive off the coast of Scotland - The Sunlight Pilgrims tells the story of a small Scottish community living through what people have begun to think is the end of times. Bodies are found frozen in the street with their eyes open; midst economic collapse, schooling and health care are run primarily on a voluntary basis.\r\n\r\nDylan, a refugee from panic-stricken London who is grieving for his mother and his grandmother, arrives in the caravan park in the middle of the night - to begin his life anew. Under the lights of the aurora borealis, he is drawn to his neighbour Constance, a woman who is known for having two lovers; her 11-year-old daughter, Stella, who is struggling to navigate changes in her own life; and elderly Barnacle, so crippled that he walks facing the earth.\r\n\r\nBut as the temperature drops, daily life carries on: people get out of bed, they make a cup of tea, they fall in love, they complicate.\r\n\r\nThe Sunlight Pilgrims, the thrilling follow-up to The Panopticon, is a humane, sad, funny, odd and beautiful novel about absence, about the unknowability of mothers. It is a story about people in extreme circumstances finding one another - and finding themselves.\r\n\r\nxx","last_updated":"2017-12-25T12:07:44.710Z","parsed":{"xt":"urn:btih:8df34baafc9c0ca61ecc9064a8ea136ecc2935b5","dn":"The Sunlight Pilgrims by Jenni Fagan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8df34baafc9c0ca61ecc9064a8ea136ecc2935b5","infoHashBuffer":{"type":"Buffer","data":[141,243,75,170,252,156,12,166,30,204,144,100,168,234,19,110,204,41,53,181]},"name":"The Sunlight Pilgrims by Jenni Fagan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}