{"title":"Tilar J Mazzeo - Irenas Children 2016 RETAiL ePUB eBOOK-DiSTRiBU","magnet":"magnet:?xt=urn:btih:8dfaef69c6a1f3d67871aebec982c8800d385bb4&dn=Tilar+J+Mazzeo+-+Irenas+Children+2016+RETAiL+ePUB+eBOOK-DiSTRiBU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"21912688","seeders":"7","leechers":"6","description":"Tilar J Mazzeo - Irenas Children 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the New York Times best-selling author of The Widow Clicquot comes an extraordinary and gripping true account of Irena Sendler - the &quot;female Oskar Schindler&quot; - who took staggering risks to save 2,500 children from death and deportation in Nazi-occupied Poland during World War II.\r\n\r\nIn 1942 one young social worker, Irena Sendler, was granted access to the Warsaw Ghetto as a public health specialist. While she was there, she began to understand the fate that awaited the Jewish families who were unable to leave. Soon she reached out to the trapped families, going from door to door and asking them to trust her with their young children. She started smuggling children out of the walled district, convincing her friends and neighbors to hide them. Driven to extreme measures, and with the help of a network of local tradesmen, ghetto residents, and her star-crossed lover in the Jewish resistance, Irena ultimately smuggled thousands of children past the Nazis. She made dangerous trips through the city&apos;s sewers, hid children in coffins, snuck them under overcoats at checkpoints, and slipped them through secret passages in abandoned buildings.\r\n\r\nBut Irena did something even more astonishing at immense personal risk: She kept a secret list buried in bottles under an old apple tree in a friend&apos;s back garden. On it were the names and true identities of these Jewish children, recorded so their families could find them after the war. She could not know that more than 90 percent of their families would perish.\r\n\r\nIn Irena&apos;s Children, Tilar Mazzeo shares the incredible story of this courageous and brave woman who risked her life to save innocent children from the Holocaust - a truly heroic tale of survival, resilience, and redemption","last_updated":"2017-06-15T12:01:32.161Z","parsed":{"xt":"urn:btih:8dfaef69c6a1f3d67871aebec982c8800d385bb4","dn":"Tilar J Mazzeo - Irenas Children 2016 RETAiL ePUB eBOOK-DiSTRiBU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8dfaef69c6a1f3d67871aebec982c8800d385bb4","infoHashBuffer":{"type":"Buffer","data":[141,250,239,105,198,161,243,214,120,113,174,190,201,130,200,128,13,56,91,180]},"name":"Tilar J Mazzeo - Irenas Children 2016 RETAiL ePUB eBOOK-DiSTRiBU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}