{"title":"Loving: Interracial Intimacy In America And The Threat To White ","magnet":"magnet:?xt=urn:btih:8e64d56f3746be602018434d1dba959d8e42877b&dn=Loving%3A+Interracial+Intimacy+In+America+And+The+Threat+To+White+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"456508","seeders":"46","leechers":"2","description":"Loving: Interracial Intimacy In America And The Threat To White Supremacy/Sheryll Cashin/2017/EPUB/\r\n\r\nEnglish|Non-Fiction|ASIN: B01LWDZA7H|250pg|414KB\r\n\r\nHow interracial love and marriage changed history, and may soon alter the landscape of American politics.\r\n\r\nLoving beyond boundaries is a radical act that is changing America. When Mildred and Richard Loving wed in 1958, they were ripped from their shared bed and taken to court.\r\n\r\nTheir crime: miscegenation, punished by exile from their home state of Virginia. The resulting landmark decision of Loving v. Virginia ended bans on interracial marriage and remains a signature case&#x2014;the first to use the words &#x201C;white supremacy&#x201D; to describe such racism.\r\n\r\nDrawing from the earliest chapters in US history, legal scholar Sheryll Cashin reveals the enduring legacy of America&#x2019;s original sin, tracing how we transformed from a country without an entrenched construction of race to a nation where one drop of nonwhite blood merited exclusion from full citizenship.\r\n\r\nIn vivid detail, she illustrates how the idea of whiteness was created by the planter class of yesterday and is reinforced by today&#x2019;s power-hungry dog-whistlers to divide struggling whites and people of color, ensuring plutocracy and undermining the common good.\r\n\r\nCashin argues that over the course of the last four centuries there have been &#x201C;ardent integrators&#x201D; and that those people are today contributing to the emergence of a class of &#x201C;culturally dexterous&#x201D; Americans.\r\n\r\nIn the fifty years since the Lovings won their case, approval for interracial marriage rose from 4 percent to 87 percent.\r\n\r\nCashin speculates that rising rates of interracial intimacy&#x2014;including cross-racial adoption, romance, and friendship&#x2014;combined with immigration, demographic, and generational change, will create an ascendant coalition of culturally dexterous whites and people of color.\r\n\r\nLoving is both a history of white supremacy and a hopeful treatise on the future of race relations in America, challenging the notion that trickle-down progressive politics is our only hope for a more inclusive society.\r\n\r\nAccessible and sharp, Cashin reanimates the possibility of a future where interracial understanding serves as a catalyst of a social revolution ending not in artificial color blindness but in a culture where acceptance and difference are celebrated","last_updated":"2017-06-28T12:08:55.327Z","parsed":{"xt":"urn:btih:8e64d56f3746be602018434d1dba959d8e42877b","dn":"Loving: Interracial Intimacy In America And The Threat To White ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8e64d56f3746be602018434d1dba959d8e42877b","infoHashBuffer":{"type":"Buffer","data":[142,100,213,111,55,70,190,96,32,24,67,77,29,186,149,157,142,66,135,123]},"name":"Loving: Interracial Intimacy In America And The Threat To White ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}