{"title":"SexArt - Dido Angel, Luna Corazon (Special Friend) NEW 06 Septem","magnet":"magnet:?xt=urn:btih:8ec795cb3a3881b90b42a5ac1a561859f6ebb7aa&dn=SexArt+-+Dido+Angel%2C+Luna+Corazon+%28Special+Friend%29+NEW+06+Septem&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"293345560","seeders":"0","leechers":"0","description":"Swinging couple Dido A and Ryan Ryder have a &#x201C;Special Friend&#x201D; in Luna C, the kind of friend we&#x2019;d all love to have as a guest in our home. Ebony beauty Luna arrives to hang out with the lovers and everyone knows why she&#x2019;s there &#x2013; to get laid. The fun kicks off swiftly; before anyone&#x2019;s finished their drink, sexy blonde Dido is pulling Luna onto Ryan&#x2019;s lap to kiss her passionately. Ryan sits back and relaxes as the two gorgeous babes get frisky, Luna grinding on his lap in just her panties, reaching up to slip a hand under Dido&#x2019;s dress and finger her naked pussy. She pulls up Dido&#x2019;s dress and licks her shaved slit as Ryan plays with her hard nipples. Unzipping Ryan&#x2019;s pants to free his rigid cock, the girls take turns to suck him, Luna deepthroating him avidly as Dido kisses him and strokes his balls, then switching so Dido gets her taste of his thick prick. Luna is first to ride it, mounting Ryan in reverse cowgirl so she can kiss Dido and fondle her perfect breasts as she slides up and down on her man&#x2019;s pole. Luna turns around into cowgirl, with Dido squeezing her ass cheeks as they bounce, and diddling herself as she takes in the delicious show. Luna climaxes noisily, and climbs off to let Dido lick her cream from Ryan&#x2019;s shaft before mounting it herself as Luna straddles his face. Luna spanks Dido&#x2019;s ass as she rides hard and fast, getting off on the sight as Dido has a powerful orgasm and keeps on fucking until she has another and Ryan fills her with his hot load. They drink a toast to their friendship before the girls take a shower that looks set to get Ryan riled up all over again&#x2026;\r\nTags: Threesome, FFM, Creampie, Ebony, All Sex\r\n <a href=\"\nhttp://img.imgdone.com/image/mrU8n\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/mrU8n</a>\r\n <a href=\"\nhttp://img.imgdone.com/image/mrko0\" rel=\"nofollow\" target=\"_NEW\">\nhttp://img.imgdone.com/image/mrko0</a>","last_updated":"2017-09-06T12:00:30.639Z","parsed":{"xt":"urn:btih:8ec795cb3a3881b90b42a5ac1a561859f6ebb7aa","dn":"SexArt - Dido Angel, Luna Corazon (Special Friend) NEW 06 Septem","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8ec795cb3a3881b90b42a5ac1a561859f6ebb7aa","infoHashBuffer":{"type":"Buffer","data":[142,199,149,203,58,56,129,185,11,66,165,172,26,86,24,89,246,235,183,170]},"name":"SexArt - Dido Angel, Luna Corazon (Special Friend) NEW 06 Septem","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}