{"title":"Exportizer Pro v6.1.1.35 Final + Patch - [SH]","magnet":"magnet:?xt=urn:btih:8eea0061f33d82ae991e60afb86ee18f9d9681f5&dn=Exportizer+Pro+v6.1.1.35+Final+%2B+Patch+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"3371410","seeders":"0","leechers":"0","description":"Exportizer Pro is a database export tool. It allows to export data to database, file, clipboard, or printer. Exportizer Pro works with databases via ADO, BDE, or Interbase/Firebird. It can open ODBC data sources, files of DB, DBF, MDB, ACCDB, XLS, XLSM, XLSB, GDB, IB, FDB, HTML, UDL, DBC, TXT, CSV types, and databases specified by ADO connection strings. Data can be exported to several file formats like text, CSV, XLS, RTF, XML, HTML, DBF, INSERT statements, and to relational database of any type supported by ADO or BDE. For example, it is possible to perform such popular database conversions as dbf to txt, txt to xls, dbf to csv, txt to dbf, Access to HTML, Excel to Access, Interbase to MySQL, and much more. It is possible to export all or selected database files from a folder or all or selected tables from a database at once. Exportizer Pro can automatically detect the most known image types (JPG, PNG, GIF, BMP, ICO) in BLOB fields and export them, for example, to HTML. During the export, you can convert BLOB images to another image format. Many export options ensure full control over output. There is an ability to specify the source-to-target field mappings. Export operations can be performed either via the program interface or via command line with large number of parameters. You can easily generate needed command line directly from the GUI","last_updated":"2017-05-31T12:05:33.388Z","parsed":{"xt":"urn:btih:8eea0061f33d82ae991e60afb86ee18f9d9681f5","dn":"Exportizer Pro v6.1.1.35 Final   Patch - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8eea0061f33d82ae991e60afb86ee18f9d9681f5","infoHashBuffer":{"type":"Buffer","data":[142,234,0,97,243,61,130,174,153,30,96,175,184,110,225,143,157,150,129,245]},"name":"Exportizer Pro v6.1.1.35 Final   Patch - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}