{"title":"Starbound v1.3.2","magnet":"magnet:?xt=urn:btih:8ef4f896ec29e63b223b33de0ed587bbda521e95&dn=Starbound+v1.3.2&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"857393074","seeders":"5","leechers":"8","description":"You&#x2019;ve fled your home, only to find yourself lost in space with a damaged ship. Your only option is to beam down to the planet below and gather the resources you need to repair your ship and set off to explore the vast, infinite universe&#x2026;In Starbound, you create your own story - there&#x2019;s no wrong way to play! You may choose to save the universe from the forces that destroyed your home, uncovering greater galactic mysteries in the process, or you may wish to forego a heroic journey entirely in favor of colonizing uncharted planets.Settle down and farm the land, become an intergalactic landlord, hop from planet to planet collecting rare creatures, or delve into dangerous dungeons and lay claim to extraordinary treasures.Discover ancient temples and modern metropolises, trees with eyes and mischievous penguins. Make use of hundreds of materials and over two thousand objects to build a sleepy secluded cabin in the woods, a medieval castle, or an underwater arcade.Starbound has been built from the ground up to be multiplayer and easily moddable. You have the tools to make the universe your own and modify the game to suit your play style - add new races, biomes, dungeons, and quests - the possibilities are limitless.Choose from one of 7 playable races","last_updated":"2017-07-19T12:02:19.425Z","parsed":{"xt":"urn:btih:8ef4f896ec29e63b223b33de0ed587bbda521e95","dn":"Starbound v1.3.2","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8ef4f896ec29e63b223b33de0ed587bbda521e95","infoHashBuffer":{"type":"Buffer","data":[142,244,248,150,236,41,230,59,34,59,51,222,14,213,135,187,218,82,30,149]},"name":"Starbound v1.3.2","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}