{"title":"Caesar's Last Breath by Sam Kean EPUB","magnet":"magnet:?xt=urn:btih:8f31ccc5da54c9b44940c963c772ceb6a5fdbc52&dn=Caesar%27s+Last+Breath+by+Sam+Kean+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8542997","seeders":"45","leechers":"6","description":"xx\r\n\r\nCaesar&apos;s Last Breath by Sam Kean EPUB\r\n\r\nThe fascinating science and history of the air we breathe.\r\n\r\nIt&apos;s invisible. It&apos;s ever present. Without it, you would die in minutes. And it has an epic story to tell.\r\n\r\nIn Caesar&apos;s Last Breath, New York Times best-selling author Sam Kean takes us on a journey through the periodic table, around the globe, and across time to tell the story of the air we breathe, which, it turns out, is also the story of earth and our existence on it.\r\n\r\nWith every breath, you literally inhale the history of the world. On the Ides of March, 44 BC, Julius Caesar died of stab wounds on the Senate floor, but the story of his last breath is still unfolding; in fact you&apos;re probably inhaling some of it now. Of the sextillions of molecules entering or leaving your lungs at this moment, some might well bear traces of Cleopatra&apos;s perfumes, German mustard gas, particles exhaled by dinosaurs or emitted by atomic bombs, even remnants of stardust from the universe&apos;s creation.\r\n\r\nTracing the origins and ingredients of our atmosphere, Kean reveals how the alchemy of air reshaped our continents, steered human progress, powered revolutions, and continues to influence everything we do. Along the way we&apos;ll swim with radioactive pigs, witness the most important chemical reactions humans have discovered, and join the crowd at the Moulin Rouge for some of the crudest performance art of all time. Lively, witty, and filled with the astounding science of ordinary life, Caesar&apos;s Last Breath illuminates the science stories swirling around us every second.\r\n\r\nxx","last_updated":"2017-11-25T13:58:10.942Z","parsed":{"xt":"urn:btih:8f31ccc5da54c9b44940c963c772ceb6a5fdbc52","dn":"Caesar's Last Breath by Sam Kean EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8f31ccc5da54c9b44940c963c772ceb6a5fdbc52","infoHashBuffer":{"type":"Buffer","data":[143,49,204,197,218,84,201,180,73,64,201,99,199,114,206,182,165,253,188,82]},"name":"Caesar's Last Breath by Sam Kean EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}