{"title":"COUNTER-STRIKE PRO ","magnet":"magnet:?xt=urn:btih:8f6dc0b73ed61b0ab08ea4262278ea5504669806&dn=COUNTER-STRIKE+PRO+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"michael2018","categoryP":"games","categoryS":"pc","size":"290083551","seeders":"1","leechers":"0","description":"COUNTER-STRIKE PRO\r\nDownload CS 1.6 PRO\r\n\r\n \r\n\r\nAre you bored with the old cs 1.6? Want to try a really different kit? Cs manages to bring a series of hd skin styles that perfectly integrate with player models, sprite and mapping textures. The game is one of the most downloaded games in its category and this is due to the fact that it offers many advantages over the old kits. Counter Strike 1.6 PRO can be played with bots or the internet and is protected against servers that try to keep your keys or to change certain game settings. This is recommended for all existing modes: normal / classic, gungame, respawn, zombie, hns, jb, base builder, furien. A lot of backtracks and targets as accurately as possible! What this Counter Strike kit brings: High Definition skin quality. The skin of the weapons is carefully selected. Tero and CT new generation models. Both the tero and the Ct team are now more realistic. The maps are modified and look better, the textures are of high quality. Now that this looks different, you will not be bored with the outdated appearance. You can play with bots on any map you just want to wait 1-2 minutes to load bots. You can play with both boots and other players on the internet servers. The kit is exe if you download it through setup or archive if you download it by torrent! Even if you like this cs please leave a comment below! If you want to add / delete something or idea to create another cs please and leave a comment! Bafta la fragile and I do not recommend using codes because you will never learn to play cs professionally!\r\n\r\nThe submitted file has been flagged as Freeware! / This Version is Freeware!","last_updated":"2017-12-05T12:03:59.046Z","parsed":{"xt":"urn:btih:8f6dc0b73ed61b0ab08ea4262278ea5504669806","dn":"COUNTER-STRIKE PRO ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8f6dc0b73ed61b0ab08ea4262278ea5504669806","infoHashBuffer":{"type":"Buffer","data":[143,109,192,183,62,214,27,10,176,142,164,38,34,120,234,85,4,102,152,6]},"name":"COUNTER-STRIKE PRO ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}