{"title":"The Imaginary Girlfriend by John Irving epub RtR","magnet":"magnet:?xt=urn:btih:8f76bf5e4bf230df285c052c816c8babcadaaae5&dn=The+Imaginary+Girlfriend+by+John+Irving+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3072491","seeders":"0","leechers":"0","description":"The Imaginary Girlfriend by John Irving epub RtR\r\n\r\nDedicated to the memory of two wrestling coaches and two writer friends, The Imaginary Girlfriend is John Irving&apos;s candid memoir of his twin careers in writing and wrestling. The award-winning author of best-selling novels from The World According to Garp to In One Person, Irving began writing when he was 14, the same age at which he began to wrestle at Exeter. He competed as a wrestler for 20 years, was certified as a referee at 24, and coached the sport until he was 47. Irving coached his sons Colin and Brendan to New England championship titles, a championship that he himself was denied.\r\n\r\nIn an autobiography filled with the humor and compassion one finds in his fiction, Irving explores the interrelationship between the two disciplines of writing and wrestling, from the days when he was a beginner at both until his fourth wresting-related surgery at the age of 53. Writing as a father and mentor, he offers a lucid portrait of those - writers and wrestlers from Kurt Vonnegut to Ted Seabrooke - who played a mentor role in his development as a novelist, wrestler, and wrestling coach. He reveals lessons he learned about the pursuit for which he is best known, writing. And, as the Denver Post observed, &quot;in filling his narrative with anecdotes that are every bit as hilarious as the antics in his novels, Irving combines the lessons of both obsessions (wrestling and writing)...into a somber reflection on the importance of living well.&quot;","last_updated":"2017-06-29T12:00:30.006Z","parsed":{"xt":"urn:btih:8f76bf5e4bf230df285c052c816c8babcadaaae5","dn":"The Imaginary Girlfriend by John Irving epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8f76bf5e4bf230df285c052c816c8babcadaaae5","infoHashBuffer":{"type":"Buffer","data":[143,118,191,94,75,242,48,223,40,92,5,44,129,108,139,171,202,218,170,229]},"name":"The Imaginary Girlfriend by John Irving epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}