{"title":"The Sugar Queen by Sarah Addison Allen ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:8f8fc85bd978cb490994a94361def614d5360c80&dn=The+Sugar+Queen+by+Sarah+Addison+Allen+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2637507","seeders":"5","leechers":"4","description":"xx\r\n\r\nThe Sugar Queen by Sarah Addison Allen ePUB eBOOK-ZAK\r\n\r\nIn this irresistible follow-up to her New York Times best selling debut, Garden Spells, author Sarah Addison Allen tells the tale of a young woman whose family secrets - and secret passions - are about to change her life forever.\r\n\r\nTwenty-seven-year-old Josey Cirrini is sure of three things: winter in her North Carolina hometown is her favorite season, she&apos;s a sorry excuse for a Southern belle, and sweets are best eaten in the privacy of her hidden closet. For while Josey has settled into an uneventful life in her mother&apos;s house, her one consolation is the stockpile of sugary treats and paperback romances she escapes to each night - until she finds it harboring none other than local waitress Della Lee Baker, a tough-talking, tenderhearted woman who is one part nemesis and two parts fairy godmother.\r\n\r\nFleeing a life of bad luck and big mistakes, Della Lee has decided Josey&apos;s clandestine closet is the safest place to crash. In return she&apos;s going to change Josey&apos;s life - because, clearly, it is not the closet of a happy woman. With Della Lee&apos;s tough love, Josey is soon forgoing pecan rolls and caramels, tapping into her startlingly keen feminine instincts, and finding her narrow existence quickly expanding.\r\n\r\nBefore long, Josey bonds with Chloe Finley, a young woman who makes the best sandwiches in town, is hounded by books that inexplicably appear whenever she needs them, and - most amazing of all - has a close connection to Josey&apos;s longtime crush.\r\n\r\nAs little by little Josey dares to step outside herself, she discovers a world where the color red has astonishing power, passion can make eggs fry in their cartons, and romance can blossom at any time - even for her. It seems that Della Lee&apos;s work is done, and it&apos;s time for her to move on. But the truth about where she&apos;s going, why she showed up in the first place - and what Chloe has to do with it all - is about to add one more unexpected chapter to Josey&apos;s fast-changing life.\r\n\r\nxx","last_updated":"2017-08-07T12:02:12.318Z","parsed":{"xt":"urn:btih:8f8fc85bd978cb490994a94361def614d5360c80","dn":"The Sugar Queen by Sarah Addison Allen ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8f8fc85bd978cb490994a94361def614d5360c80","infoHashBuffer":{"type":"Buffer","data":[143,143,200,91,217,120,203,73,9,148,169,67,97,222,246,20,213,54,12,128]},"name":"The Sugar Queen by Sarah Addison Allen ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}