{"title":"Anne Sebba - Les Parisiennes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:8fbd14778891c2096d777cc3bc72970ef1ad7c11&dn=Anne+Sebba+-+Les+Parisiennes+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"25458556","seeders":"25","leechers":"3","description":"Anne Sebba - Les Parisiennes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nNew York Times best-selling author Anne Sebba explores a devastating period in Paris&apos; history and tells the stories of how women survived - or didn&apos;t - during the Nazi occupation.\r\n\r\nParis in the 1940s was a place of fear, power, aggression, courage, deprivation, and secrets. During the occupation, the swastika flew from the Eiffel Tower and danger lurked on every corner. While Parisian men were either fighting at the front or captured and forced to work in German factories, the women of Paris were left behind, where they would come face-to-face with the German conquerors on a daily basis, as waitresses, shop assistants, or wives and mothers increasingly desperate to find food to feed their families as hunger became part of everyday life.\r\n\r\nWhen the Nazis and the puppet Vichy regime began rounding up Jews to ship east to concentration camps, the full horror of the war was brought home, and the choice between collaboration and resistance became unavoidable. Sebba focuses on the role of women, many of whom faced life and death decisions every day. After the war ended, there would be a fierce settling of accounts between those who made peace with or, worse, helped the occupiers, and those who fought the Nazis in any way they could.\r\n\r\nThis program includes an interview with the author and her editor. The audiobook is read by Polly Stone, narrator of The Nightingale and Sarah&apos;s Key. In a starred Library Journal review of The Nightingale, Stone was applauded for her &quot;impeccable narration that brings...wartime France to life with a distinctive and memorable set of voices that will keep listeners coming back for more.&quot;","last_updated":"2017-05-23T18:53:19.901Z","parsed":{"xt":"urn:btih:8fbd14778891c2096d777cc3bc72970ef1ad7c11","dn":"Anne Sebba - Les Parisiennes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"8fbd14778891c2096d777cc3bc72970ef1ad7c11","infoHashBuffer":{"type":"Buffer","data":[143,189,20,119,136,145,194,9,109,119,124,195,188,114,151,14,241,173,124,17]},"name":"Anne Sebba - Les Parisiennes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}