{"title":"Java Homework Projects: A NetBeans GUI Swing Programming Tutoria","magnet":"magnet:?xt=urn:btih:901f133f1889d084ad060026fc9a366a98144d33&dn=Java+Homework+Projects%3A+A+NetBeans+GUI+Swing+Programming+Tutoria&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"24161154","seeders":"0","leechers":"0","description":"Java Homework Projects: A NetBeans GUI Swing Programming Tutorial, 8th Edition(2017) - AZW3 - zeke23\r\nPublication Date: 2017-05-08 - ISBN-10: B071RYHXDS - 855 pages - AZW3 - English\r\nJAVA HOMEWORK PROJECTS teaches Java GUI (Graphical User Interface) Swing programming concepts and provides detailed step-by-step instructions in building many fun and useful projects. To grasp the concepts presented in JAVA HOMEWORK PROJECTS, you should possess a working knowledge of programming with Java and be acquainted with using the Swing control library. Our tutorial LEARN JAVA GUI APPLICATIONS&#x200B; can help you gain this needed exposure.\r\n\r\nJAVA HOMEWORK PROJECTS explains (in simple, easy-to-follow terms) how to build a Java GUI project. Students learn about project design, the Java Swing controls, many elements of the Java language, and how to distribute finished projects. The projects built include:&#x200B;\r\n\r\n    Dual-Mode Stopwatch &#x2013; Allows you to time tasks you may be doing.\r\n    Consumer Loan Assistant &#x2013; Helps you see just how much those credit cards will cost you.\r\n    Flash Card Math Quiz &#x2013; Lets you practice basic addition, subtraction, multiplication and division skills.\r\n    Multiple Choice Exam &#x2013; Quizzes a user on matching pairs of items, like countries/capitals, and words/meanings.\r\n    Blackjack Card Game &#x2013; Play the classic card game against the computer and learn why gambling is very risky.\r\n    Weight Monitor &#x2013; Track your weight each day and monitor your progress toward established goals.\r\n    Home Inventory Manager &#x2013; Helps you keep track of all your belongings &#x2013; even includes photographs.\r\n    Snowball Toss Game &#x2013; Lets you throw snowballs at another player or against the computer. &#x200B;&#x200B;\r\n\r\nThe tutorial includes over 850 pages of self-study notes. The Java source code and all needed multimedia files are available after book registration from the publisher&apos;s website (KidwareSoftware.com).\r\n\r\nJAVA HOMEWORK PROJECTS requires Microsoft Windows, MAC OS X, or Linux. You also need the 8th Edition of the Java Development Kit (a free download from Oracle). This 8th edition tutorial also uses the free NetBeans 8 IDE (Integrated Development Environment) for building and testing Java applications.&#x200B;","last_updated":"2017-07-15T12:01:05.646Z","parsed":{"xt":"urn:btih:901f133f1889d084ad060026fc9a366a98144d33","dn":"Java Homework Projects: A NetBeans GUI Swing Programming Tutoria","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"901f133f1889d084ad060026fc9a366a98144d33","infoHashBuffer":{"type":"Buffer","data":[144,31,19,63,24,137,208,132,173,6,0,38,252,154,54,106,152,20,77,51]},"name":"Java Homework Projects: A NetBeans GUI Swing Programming Tutoria","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}