{"title":"A Girls Fabric Face v2.0","magnet":"magnet:?xt=urn:btih:90598983d23d81f65daec4f61dc19a49a43f8584&dn=A+Girls+Fabric+Face+v2.0&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"jeux","categoryS":"pc","size":"308692704","seeders":"3","leechers":"5","description":"A brutal murder has taken place in an old home located in SattleWen. Three girls have been brutally murdered in the home, and police call it &#x201C;The most violent crime to ever happen in this city&#x201D;. Young Anna, aged 16 is intrigued by what has happened, and has decided to investigate the house. Upon arriving at the old abandoned premises, Anna sets up two cameras, and begins to investigate the home to hopefully gather any data that may prove of some importance. Unfortunately, nothing quite seemed right. After learning about the terrifying things that have been going on this whole time, Anna determines that nothing was as it has appeared to be. In the end, a horrible truth is revealed, and an important decision must be made. What is really going on with the case known as &#x201C;The girls with the fabric face&#x201D;? At this point in time, I can finally say with confidence that the game is complete! And quite good at that. After the massive wreck of Minds Eyes, I was able to gather quite a nice amount of input from a lot of players who have given me suggestions, complaints, and support in creating A Girls Fabric Face. After working for quite a long time, I believe I can say with confidence that this game is a &#x201C;Proper&#x201D; horror game. In this game, I focused far more on suspense and adventure than anything else (Aside form the overall story); and I believe that everything flowed very well. Based","last_updated":"2017-07-02T12:01:11.189Z","parsed":{"xt":"urn:btih:90598983d23d81f65daec4f61dc19a49a43f8584","dn":"A Girls Fabric Face v2.0","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"90598983d23d81f65daec4f61dc19a49a43f8584","infoHashBuffer":{"type":"Buffer","data":[144,89,137,131,210,61,129,246,93,174,196,246,29,193,154,73,164,63,133,132]},"name":"A Girls Fabric Face v2.0","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}