{"title":"ProgDVB 7.20.0 Final + active","magnet":"magnet:?xt=urn:btih:90b065152cf959c5434506867d544f78f22f27d2&dn=ProgDVB+7.20.0+Final+%2B+active&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mrkiven0","categoryP":"applications","categoryS":"windows","size":"22490322","seeders":"2","leechers":"3","description":"ProgDVB is a powerful tool that allows you to watch digital TV, listen to digital radio, play internet TV streams and more.\r\n\r\nIt&apos;s packed with professional features, including time shifting, electronic program guides from Digital TV or XmlTV,JTV, subtitle support, a teletext module and more.\r\n\r\nTo get the most from the program you will of course need a suitable digital TV card. Fortunately there&apos;s wide hardware support here, with ProgDVB able to work with many DVB-S (satellite), DVB-S2, DVB-C (cable), DVB-T, ATSC and ISDB-T cards, from manufacturers including AverMedia, Azurewave (TwinHan), Hauppauge, Kworld, Pinnacle, Technotrend, Tongsho, Terratec, and many, many others \r\nEven if you don&apos;t have a card, the program still works well as a media player with extras. It includes a huge database of internet TV and radio channels, for instance - around 4,000 in total - and you can use it to search, view and record YouTube videos.\r\n\r\nPlease note, the ProgDVB authors also produce a Professional version that has many more desirable features, including HDTV and DVB-S2 support, picture-in-picture, multi-audio channels, and the ability to record internet TV and radio. It&apos;s yours for 25 Euros and you can find out more at the ProgDVB site.\r\n\r\nWhat&apos;s new in v7?\r\n\r\n- Video On Demand. Now ProgDVB completely supports OTT include timeshift and VOD. \r\n- In this version VOD implemented for Kartina TV and Rodina TV. \r\n- New generation of Internet TV/Radio. \r\n- Support links to mp4 over GDCL. \r\n- Improves of MIS/PLS, EPG for IPTV/OTT, Prog Audio renderer, UI\r\n\r\nVerdict:\r\nIt won&apos;t work with all TV tuners or streams, but if you&apos;re in luck then ProgDVB will prove a useful media player with lots of interesting features","last_updated":"2017-07-30T12:02:50.243Z","parsed":{"xt":"urn:btih:90b065152cf959c5434506867d544f78f22f27d2","dn":"ProgDVB 7.20.0 Final   active","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"90b065152cf959c5434506867d544f78f22f27d2","infoHashBuffer":{"type":"Buffer","data":[144,176,101,21,44,249,89,197,67,69,6,134,125,84,79,120,242,47,39,210]},"name":"ProgDVB 7.20.0 Final   active","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}