{"title":"\nThe Darkening Age: Christian Destruction of the Classical World","magnet":"magnet:?xt=urn:btih:910569fb9961b4286039d9a6473d48c66b0f935f&dn=The+Darkening+Age%3A+Christian+Destruction+of+the+Classical+World&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"23109442","seeders":"35","leechers":"15","description":"The Darkening Age: The Christian Destruction of the Classical World - Catherine Nixey [epub]\r\n\r\nA bold new history of the rise of Christianity, showing how its radical followers ravaged vast swathes of classical culture, plunging the world into an era of dogma and intellectual darkness.\r\n \r\nIn Harran, the locals refused to convert. They were dismembered, their limbs hung along the town&#x2019;s main street. In Alexandria, zealots pulled the elderly philosopher-astronomer Hypatia from her chariot and flayed her to death with shards of broken pottery. Not long before, their fellow Christians had invaded the city&#x2019;s greatest temple and razed it&#x2014;smashing its world-famous statues and destroying all that was left of Alexandria&#x2019;s Great Library.\r\n \r\nToday, we refer to Christianity&#x2019;s conquest of the West as a &#x201C;triumph.&#x201D; But this victory entailed an orgy of destruction in which Jesus&#x2019;s followers attacked and suppressed classical culture, helping to pitch Western civilization into a thousand-year-long decline. Just one percent of Latin literature would survive the great purge; countless antiquities, artworks, and ancient traditions were lost forever.  \r\n \r\nAs Catherine Nixey reveals, evidence of early Christians&#x2019; campaign of terror has been hiding in plain sight: in the palimpsests and shattered statues proudly displayed in churches and museums the world over. In The Darkening Age, Nixey resurrects this lost history, offering a wrenching account of the rise of Christianity and its terrible cost.\r\n\r\nCatherine Nixey is a journalist and a classicist. Her mother was a nun, her father was a monk, and she was brought up Catholic. She studied classics at Cambridge and taught the subject for several years before becoming a journalist on the arts desk at the Times, where she still works.\r\n\r\nHardcover: 384 pages\r\nPublisher: Houghton Mifflin Harcourt 2017","last_updated":"2017-10-07T12:04:52.050Z","parsed":{"xt":"urn:btih:910569fb9961b4286039d9a6473d48c66b0f935f","dn":"The Darkening Age: Christian Destruction of the Classical World","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"910569fb9961b4286039d9a6473d48c66b0f935f","infoHashBuffer":{"type":"Buffer","data":[145,5,105,251,153,97,180,40,96,57,217,166,71,61,72,198,107,15,147,95]},"name":"The Darkening Age: Christian Destruction of the Classical World","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}