{"title":"\n[EverythingButt] Lea Lexis, Jenna Foxx, Annie Cruz (Goldie Lock ","magnet":"magnet:?xt=urn:btih:911238d5a03e632bdd9f207a7d32e9224647919d&dn=%5BEverythingButt%5D+Lea+Lexis%2C+Jenna+Foxx%2C+Annie+Cruz+%28Goldie+Lock+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Vikcy41","categoryP":"porn","categoryS":"movie_clips","size":"405781878","seeders":"13","leechers":"8","description":"[EverythingButt] Lea Lexis, Jenna Foxx, Annie Cruz (Goldie Lock Botox to make the perfect tightness of Ass / 42397 / 20.10.17) [360p]\r\n\r\nJenna Foxx and Annie Cruz both purchased online group coupons for anal botox. It&apos;s all the rage right now. Girls and boys around the world have discovered that getting botox in specific areas of their assholes can either tighten or loosen their assholes. Today, Annie Cruz wants to get her loose asshole tightened and Jenna Foxx wants to get her tight asshole loosened. They go to see the anal specialist, Lea Lexis who isn&apos;t impressed with the thriftiness of the clients. Lea detests cheap people and she detests girls who come into her office and destroy her bathroom. Jenna Foxx is so nervous about someone seeing her asshole that she runs into the restroom to relieve some stress. A pungent odor emits from the restroom which catches Lea&apos;s and Annie&apos;s attention. Annie is so turned on by the nervous pheromones that Jenna is releasing in the bathroom. Lea can see how perverted Annie is and she decides to have a little fun with the two cheapskates. Lea has the two clients compare asshole tightness and as they say the grASS is always greener on the other side. Annie wants what Jenna has and Jenna wants what Annie Has. Lea decides to stretch them both out. Annie Cruz is spread wide open with the speculum while Jenna licks and sniffs the asshole tunnel. Annie Cruz takes the slink while Jenns licks and sucks on the toy coming out of Annie&apos;s freshly fucked Ass. Jenna loves ATM. Jenna&apos;s tight ass gets loosened up with strap-on fucking until she calls mercy. Her Asshole depth is challenged with the slink but her tightness prevents her from taking too much of it. Lea has primed their assholes for the procedure. Now these girls will have the perfect asshole tightness which is loose and gaping wide\r\n <a href=\"\nhttp://ximagehost.org/img-59eae4ecbfdb6.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59eae4ecbfdb6.html</a>\r\n <a href=\"\nhttp://ximagehost.org/img-59eae4e2cd063.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59eae4e2cd063.html</a>","last_updated":"2017-10-21T12:04:20.476Z","parsed":{"xt":"urn:btih:911238d5a03e632bdd9f207a7d32e9224647919d","dn":"[EverythingButt] Lea Lexis, Jenna Foxx, Annie Cruz (Goldie Lock ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"911238d5a03e632bdd9f207a7d32e9224647919d","infoHashBuffer":{"type":"Buffer","data":[145,18,56,213,160,62,99,43,221,159,32,122,125,50,233,34,70,71,145,157]},"name":"[EverythingButt] Lea Lexis, Jenna Foxx, Annie Cruz (Goldie Lock ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}