{"title":"\nThe Last Castle by Denise Kiernan EPUB","magnet":"magnet:?xt=urn:btih:917a03047bd68a642541e136cc9f5fe26fc16a6d&dn=The+Last+Castle+by+Denise+Kiernan+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"44921745","seeders":"1","leechers":"3","description":"xx\r\n\r\nThe Last Castle by Denise Kiernan EPUB\r\n\r\nFrom the author of the New York Times bestseller The Girls of Atomic City comes the fascinating true story behind the magnificent Gilded Age mansion Biltmore - the largest, grandest residence ever built in the United States.\r\n\r\nOrphaned at a young age, Edith Stuyvesant Dresser claimed lineage from one of New York&apos;s best known families. She grew up in Newport and Paris, and her engagement and marriage to George Vanderbilt was one of the most watched events of Gilded Age society. But none of this prepared her to be mistress of Biltmore House.\r\n\r\nBefore their marriage, the wealthy and bookish Vanderbilt had dedicated his life to creating a spectacular European-style estate on 125,000 acres of North Carolina wilderness. He summoned the famous landscape architect Frederick Law Olmsted to tame the grounds, collaborated with celebrated architect Richard Morris Hunt to build a 175,000-square-foot chateau, filled it with priceless art and antiques, and erected a charming village beyond the gates. Newlywed Edith was now mistress of an estate nearly three times the size of Washington, DC and benefactress of the village and surrounding rural area. When fortunes shifted and changing times threatened her family, her home, and her community, it was up to Edith to save Biltmore - and secure the future of the region and her husband&apos;s legacy.\r\n\r\nThe story of Biltmore spans World Wars, the Jazz Age, the Depression, and generations of the famous Vanderbilt family, and features a captivating cast of real-life characters including F. Scott Fitzgerald, Thomas Wolfe, Teddy Roosevelt, John Singer Sargent, James Whistler, Henry James, and Edith Wharton. The Last Castle is the unique American story of how the largest house in America flourished, faltered, and ultimately endured to this day.\r\n\r\nxx","last_updated":"2017-10-11T12:02:39.608Z","parsed":{"xt":"urn:btih:917a03047bd68a642541e136cc9f5fe26fc16a6d","dn":"The Last Castle by Denise Kiernan EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"917a03047bd68a642541e136cc9f5fe26fc16a6d","infoHashBuffer":{"type":"Buffer","data":[145,122,3,4,123,214,138,100,37,65,225,54,204,159,95,226,111,193,106,109]},"name":"The Last Castle by Denise Kiernan EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}