{"title":"Who Asked You_ by Terry McMillan epub RtR","magnet":"magnet:?xt=urn:btih:918c7c127251539271b0c599a1e77a4606ce97ac&dn=Who+Asked+You_+by+Terry+McMillan+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2855689","seeders":"0","leechers":"0","description":"xx\r\n\r\nWho Asked You_ by Terry McMillan epub RtR\r\n\r\nFamily ties are tested and transformed in the new novel from #1 New York Times bestselling author of Waiting to Exhale and How Stella Got Her Groove Back. With her wise, wry, and poignant novels of families and friendships - Waiting to Exhale, Getting to Happy, and A Day Late and a Dollar Shortamong them - Terry McMillan has touched millions of readers.\r\n\r\nNow, in her eighth novel, McMillan gives exuberant voice to characters who reveal how we live now - at least as lived in a racially diverse Los Angeles neighborhood.\r\n\r\nKaleidoscopic, fast-paced, and filled with McMillan&apos;s inimitable humor, Who Asked You? opens as Trinetta leaves her two young sons with her mother, Betty Jean, and promptly disappears. BJ, a trademark McMillan heroine, already has her hands full dealing with her other adult children, two opinionated sisters, an ill husband, and her own postponed dreams - all while holding down a job as a hotel maid. Her son Dexter is about to be paroled from prison; Quentin, the family success, can&apos;t be bothered to lend a hand; and taking care of two lively grandsons is the last thing BJ thinks she needs.\r\n\r\nThe drama unfolds through the perspectives of a rotating cast of characters, pitch-perfect, each playing a part, and full of surprises.\r\n\r\nWho Asked You? casts an intimate look at the burdens and blessings of family and speaks to trusting your own judgment even when others don&apos;t agree. McMillan&apos;s signature voice and unforgettable characters bring universal issues to brilliant, vivid life.\r\n\r\nxx","last_updated":"2017-07-19T12:00:50.526Z","parsed":{"xt":"urn:btih:918c7c127251539271b0c599a1e77a4606ce97ac","dn":"Who Asked You_ by Terry McMillan epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"918c7c127251539271b0c599a1e77a4606ce97ac","infoHashBuffer":{"type":"Buffer","data":[145,140,124,18,114,81,83,146,113,176,197,153,161,231,122,70,6,206,151,172]},"name":"Who Asked You_ by Terry McMillan epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}