{"title":"Maria Bachmann-Kiss on Wood (young violinist)","magnet":"magnet:?xt=urn:btih:91e58b705f800c20112b093670b57264e0513abe&dn=Maria+Bachmann-Kiss+on+Wood+%28young+violinist%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"251972695","seeders":"11","leechers":"9","description":"Maria Bachmann&apos;s second Catalyst recital is even more ambitious than her first (&apos;&apos;Fratres&apos;&apos;, 12/93) and yet it exhibits the same warm, expressive tone, easy virtuosity and winning musicianship. True, parts of James MacMillan&apos;s Kiss on Wood of 1994&#x2014;a strong, somewhat Spartan dialogue that becomes progressively more serene&#x2014;find Bachmann having occasional trouble sustaining the line (or so it sounds), but the music&apos;s tense character is very well captured and the players&apos; timing seems immaculate. Total contrast is afforded by William Bolcom&apos;s Second Sonata (1938), a winsome scrapbook of a piece, alternating dreams and brutality (the movement titles tell the tale) and with a finale &apos;&apos;In Memory of Joe Venuti&apos;&apos; that wouldn&apos;t be out of place on BBC Radio 3&apos;s &apos;&apos;Jazz Record Requests&apos;&apos;. Here Bachmann weaves a cool, Grappelli-style line, whereas her sensitive handling of Copland&apos;s smokey Nocturne (1928)&#x2014;so memorably recorded years ago by Louis Kaufman&#x2014;makes a strong case for an atmospheric morceau other violinists might do well to investigate. \r\nSchnittke of course keeps both players on their toes: his largely playful First Sonata (1963) flirts with atonalism (&apos;&apos;a tonal world with atonal highways&apos;&apos;, to quote the composer himself) and turns grandly solemn for a Largo that recalls the parallel movement in Shostakovich&apos;s Second Piano Trio. Then there is Paul Dresher, whose transcontinental eclecticism makes for an interesting marriage between Western and south-east Asian musical styles. Double Ikat&#x2014;Part Two for violin, piano and percussion (1988-90) is fitfully animated and dies to a wailing, curvaceous solo line backed by simple piano chords, a gong and sighing cymbal. It is a restful finale to a pleasing sequence of musical explorations, stylishly played, very well annotated (by Tim Page) and expertly recorded. R1 &apos;9505079&apos; Gramophone Review","last_updated":"2017-11-24T12:06:32.034Z","parsed":{"xt":"urn:btih:91e58b705f800c20112b093670b57264e0513abe","dn":"Maria Bachmann-Kiss on Wood (young violinist)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"91e58b705f800c20112b093670b57264e0513abe","infoHashBuffer":{"type":"Buffer","data":[145,229,139,112,95,128,12,32,17,43,9,54,112,181,114,100,224,81,58,190]},"name":"Maria Bachmann-Kiss on Wood (young violinist)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}