{"title":"BadMilfs - Arielle Faye, India Summers (Mommy Dearest Gets Freak","magnet":"magnet:?xt=urn:btih:92169955f73ecdb934e3ee1433eb901936e2f709&dn=BadMilfs+-+Arielle+Faye%2C+India+Summers+%28Mommy+Dearest+Gets+Freak&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Browse xxxlavalxxx","categoryP":"porn","categoryS":"movie_clips","size":"1021397468","seeders":"11","leechers":"28","description":"India Summers is a stepmom who is very concerned about her stepdaughtera great time with her boyfriend. As a proactive stepmom, she talks to both her stepdaughter and her daughter?s boyfriend separately. She gives some really great pointers to her stepdaughter?s boyfriend. He was very surprised she ended up on her back with her naked pussy in his face. Nonetheless, he is grateful for her help. Later, she corners her stepdaughter and asks her if she knows how to show a man a good time. Ariel admits that she is unsure. India tells her she needs to learn to be a teen and a freak at the same time. Then she starts to demonstrate sucking dick with vegetables as props. Ariel mimics her and starts to get really good at licking cucumbers. Next, India demonstrates for her stepdaughter what getting her pussy licked will feel like. The two of them continue groping and getting freaky with each other and vegetables in the kitchen together. Date night finally arrives, and Ariel?s boyfriend happened to be walking by India?s bedroom. He stops in, and she offers him a drink. Then she offers him a blowjob. Her seductive ways are just too powerful for him. Plus, his 18 year old dick was stiff the second he saw her. Soon she is sucking him off and stripping nude because she demands that he fuck her. Ariel walks in on it, but she is not at all startled. She is turned on and very happy to share everything with her mother. The two of them take turns seducing Ariel?s boyfriend. He is getting overloaded with hot tits and ass all around him. They both take turns spreading their legs and getting fucked. Then they both get some of his cum on their faces and mouths. Ariel and India kiss, mixing the boyfriend?s cum between their mouths. At last, they can both be sluts together.\r\nTags: 2 Girl BJ, Big Dicks, Blowjob, Brunette, Deepthroat, Doggystyle, Facial, Girl Next Door, Petite, Pussy Lick, Straight, Teen, Tiny\r\n <a href=\"\nhttp://imgdone.com/viewer.php?file=54397385492642043178.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/viewer.php?file=54397385492642043178.jpg</a>\r\n <a href=\"\nhttp://imgdone.com/viewer.php?file=44772479557159006257.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdone.com/viewer.php?file=44772479557159006257.jpg</a>","last_updated":"2017-04-18T10:44:32.413Z","parsed":{"xt":"urn:btih:92169955f73ecdb934e3ee1433eb901936e2f709","dn":"BadMilfs - Arielle Faye, India Summers (Mommy Dearest Gets Freak","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"92169955f73ecdb934e3ee1433eb901936e2f709","infoHashBuffer":{"type":"Buffer","data":[146,22,153,85,247,62,205,185,52,227,238,20,51,235,144,25,54,226,247,9]},"name":"BadMilfs - Arielle Faye, India Summers (Mommy Dearest Gets Freak","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}