{"title":"DK Eyewitness Travel Family Guide New York City (2016) Gooner","magnet":"magnet:?xt=urn:btih:9292d9139ec35bda27b165737d023473b2778898&dn=DK+Eyewitness+Travel+Family+Guide+New+York+City+%282016%29+Gooner&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GoonerTPB","categoryP":"other","categoryS":"e_books","size":"47144777","seeders":"96","leechers":"34","description":"DK Eyewitness Travel Family Guide - New York City - 1E (2016) (Epub) Gooner\r\n\r\nPublisher: DK Eyewitness Travel; 01 edition (1 Mar. 2016)\r\nAuthor: DK\r\nLanguage: English\r\nISBN-10: 0241204860\r\nISBN-13: 9780241204863\r\nASIN: B01AKTG1IK\r\n\r\nDK Eyewitness Travel Family Guide New York City offers you the best things to see and do on a family holiday in the Big Apple, from visiting magnificent sights such as the Empire State Building and the Statue of Liberty to exploring the treasures housed in the American Museum of Natural History and the Museum of Modern Art, and brings those places alive for children with fun facts, quizzes, and cartoons.\r\n\r\nThe major sights are treated as &quot;hub&quot; destinations and are followed by places of interest near the &quot;hub,&quot; ideal for planning your day ahead. These offer a pragmatic as well as enjoyable itinerary, giving children a real insight into the destination, but balanced with opportunities to let off steam at a nearby park or playground. All the practical information you need appears alongside the sight, including transportation information, budget tips, age range suitability, and where to eat. DK Eyewitness Travel Family Guide New York City is bursting with insider knowledge and loaded with ideas for activities that will engage children, from &quot;Medieval&quot; treasure hunts at the Metropolitan Museum of Art to ice-skating in Central Park in winter. Meanwhile, the most family-friendly, best-value accommodation options have been chosen with family budgets and needs in mind.\r\n\r\nFull-color throughout, with detailed maps of the main sightseeing areas for easy navigation and all the practical information you need for a fun, stress-free family vacation","last_updated":"2017-04-23T17:55:23.060Z","parsed":{"xt":"urn:btih:9292d9139ec35bda27b165737d023473b2778898","dn":"DK Eyewitness Travel Family Guide New York City (2016) Gooner","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9292d9139ec35bda27b165737d023473b2778898","infoHashBuffer":{"type":"Buffer","data":[146,146,217,19,158,195,91,218,39,177,101,115,125,2,52,115,178,119,136,152]},"name":"DK Eyewitness Travel Family Guide New York City (2016) Gooner","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}