{"title":"Simon Ings - Stalin and the Scientists 2017 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:9293d7771be1b91b59726a33d3c9c034afbf7964&dn=Simon+Ings+-+Stalin+and+the+Scientists+2017+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7878315","seeders":"0","leechers":"0","description":"xx\r\n\r\nSimon Ings - Stalin and the Scientists 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn epic history of science in the Soviet Union, following the scientists who survived Stalin&apos;s rule and helped to reshape the world.\r\n\r\nScientists throughout history, from Galileo to today&apos;s experts on climate change, have often had to contend with politics in their pursuit of knowledge. But in the Soviet Union, where the ruling elites embraced, patronized, and even fetishized science like never before, scientists lived their lives on a knife edge. The Soviet Union had the best-funded scientific establishment in history. Scientists were elevated as popular heroes and lavished with awards and privileges. But if their ideas or their field of study lost favor with the elites, they could be exiled, imprisoned, or murdered. And yet they persisted, making major contributions to 20th century science.\r\n\r\nStalin and the Scientists tells the story of the many gifted scientists who worked in Russia from the years leading up to the Revolution through the death of the &quot;Great Scientist&quot; himself, Joseph Stalin. It weaves together the stories of scientists, politicians, and ideologues into an intimate and sometimes horrifying portrait of a state determined to remake the world. They often wreaked great harm. Stalin was himself an amateur botanist, and by falling under the sway of dangerous charlatans like Trofim Lysenko (who denied the existence of genes), and by relying on antiquated ideas of biology, he not only destroyed the lives of hundreds of brilliant scientists, he caused the death of millions through famine.\r\n\r\nBut from atomic physics to management theory, and from radiation biology to neuroscience and psychology, these Soviet experts also made breakthroughs that forever changed agriculture, education, and medicine. A masterful book that deepens our understanding of Russian history, Stalin and the Scientists is a great achievement of research and storytelling, and a gripping look at what happens when science falls prey to politics.\r\n\r\nxx","last_updated":"2017-08-09T12:00:24.978Z","parsed":{"xt":"urn:btih:9293d7771be1b91b59726a33d3c9c034afbf7964","dn":"Simon Ings - Stalin and the Scientists 2017 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9293d7771be1b91b59726a33d3c9c034afbf7964","infoHashBuffer":{"type":"Buffer","data":[146,147,215,119,27,225,185,27,89,114,106,51,211,201,192,52,175,191,121,100]},"name":"Simon Ings - Stalin and the Scientists 2017 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}