{"title":"The Littlest Hobo (1963) - 9 Episodes","magnet":"magnet:?xt=urn:btih:92bdddc8c8f4ae33d581e1644a4036aa40b68fea&dn=The+Littlest+Hobo+%281963%29+-+9+Episodes&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Invader97","categoryP":"video","categoryS":"tv_shows","size":"3487888799","seeders":"1","leechers":"4","description":"The Littlest Hobo is a Canadian television series based upon a 1958 American film of the same name directed by Charles R. Rondeau. The series first aired from 1963 to 1965 in syndication, and was revived for a popular second run on CTV, spanning six seasons, from October 11, 1979 to March 7, 1985. The concept of the show was that of &quot;an ownerless dog&quot;. Rights to the Littlest Hobo series currently belong to Mighty Motion Pictures located in Spruce Grove, Alberta.\r\n\r\nAll three productions revolved around a stray German Shepherd, the titular Hobo, who wanders from town to town, helping people in need. Although the concept (of a dog saving the day) was perhaps similar to that of Lassie, the Littlest Hobo&apos;s destiny was to befriend those who apparently needed help, portrayed by well known actors in celebrity guest appearance roles. Despite attempts to adopt him by many people whom he helped, he appeared to prefer to be on his own, and would head off by himself at the end of each episode.\r\n\r\nNever actually named on-screen, the dog is often referred to by the name Hobo or by the names given by temporary human companions. His origins, motivation and ultimate destination are also never explained.\r\n\r\nAlthough some characters appeared in more than one episode, the only constant was the Littlest Hobo himself.\r\n\r\nFollowing the 1958 film, the original 1963 TV series was aired in syndication around the world, including the UK on ITV between 1964&#x2013;1967. Although the episodes were originally broadcast in black-and-white, they were in fact produced in color. The VCI Entertainment DVD release of the series featured the color versions of the episodes, except for the opening and closing credits which have only survived in black-and-white. The last three episodes in this torrent probably originated from that VCI DVD release. However, the first five episodes here are in black-and-white only, as originally presented on TV. Then there is  Episode 13, which is entirely in color, with a different singer during the opening and closing credits than in the first five episodes. The origin of this video is unknown. Anyway, enjoy these videos!","last_updated":"2017-12-18T12:01:18.026Z","parsed":{"xt":"urn:btih:92bdddc8c8f4ae33d581e1644a4036aa40b68fea","dn":"The Littlest Hobo (1963) - 9 Episodes","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"92bdddc8c8f4ae33d581e1644a4036aa40b68fea","infoHashBuffer":{"type":"Buffer","data":[146,189,221,200,200,244,174,51,213,129,225,100,74,64,54,170,64,182,143,234]},"name":"The Littlest Hobo (1963) - 9 Episodes","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}