{"title":"Quest Series Documentaries","magnet":"magnet:?xt=urn:btih:935629d30e4d47516674292e9302e017e196d13d&dn=Quest+Series+Documentaries&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Ravenwilde","categoryP":"video","categoryS":"tv_shows","size":"6136229477","seeders":"0","leechers":"8","description":"Klondike Quest for Gold\r\n\r\nAs seen on PBS comes this new &quot;living history&quot; series about eight &quot;average people&quot; (7 men and one women) who volunteer to relive an adventure. The epic 1200 kilometer journey by the Hudson&apos;s Bay Company fur traders of 1840s from Winnipeg, to the Hudson Bay. They undertake this grueling and difficult journey through the heart of the Canadian wilderness in a historically accurate York Boat (a hand made wooden boat 40 ft. x 8 ft.) with only period provisions. Rowing 12 to 14 hours a day, carrying 180 lb. packs, shooting the rapids, and covering over 1200 kilometers, the trip will take eight to twelve weeks.   In Episode one &quot; The Company of Adventures&quot; we meet the pioneers who have agreed to undertake the 1200 kilometer quest to the Hudson Bay. We follow the crew in their initial week of the journey as they come face-to-face with the hardships of life in 1840. \r\n\r\nPioneer Quest A Year in the Real West\r\n\r\nTwo couples assume the lives of early settlers to the West. Using only the resources and tools of the period, they will attempt to build homes, raise livestock, hunt and grow crops. \r\n\r\nQuest for the Bay\r\n\r\nQuest For The Bay follows an eight-person volunteer team (seven men and one woman) as they attempted to recreate the journey made by fur traders of the Hudson&apos;s Bay Company during the 1840s by travelling from Winnipeg to Hudson Bay. The trip covered a distance of 800 miles (1200 kilometers) and took the team though the heart of the Canadian wilderness. The crew members possessed only equipment used during the period, down to their food and clothing, and included a replica of a 40-foot wooden York Boat.\r\n \r\nQuest for the Sea\r\n\r\nQuest for the Sea is a 4x1-hour living history documentary series that follows 2 families as they return to a lost way of life in a remote fishing village in Newfoundland. In simple wooden homes with only the tools, clothing, and supplies of 1937, five adults and five children will live under a mercantile system and need to rely on cod fishing for their sustenance and survival","last_updated":"2017-06-13T12:01:56.592Z","parsed":{"xt":"urn:btih:935629d30e4d47516674292e9302e017e196d13d","dn":"Quest Series Documentaries","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"935629d30e4d47516674292e9302e017e196d13d","infoHashBuffer":{"type":"Buffer","data":[147,86,41,211,14,77,71,81,102,116,41,46,147,2,224,23,225,150,209,61]},"name":"Quest Series Documentaries","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}