{"title":"\nThe Grace of Dogs_ A Boy, a Black Lab, and a Father's Search for","magnet":"magnet:?xt=urn:btih:939bf7ed17c81dae8948ae801fd48355ba224d08&dn=The+Grace+of+Dogs_+A+Boy%2C+a+Black+Lab%2C+and+a+Father%27s+Search+for&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4495177","seeders":"2","leechers":"4","description":"xx\r\n\r\nThe Grace of Dogs_ A Boy, a Black Lab, and a Father&apos;s Search for the Canine Soul by Andrew Root 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn the best-selling tradition of Inside of a Dog and Marley &amp; Me, a smart, illuminating, and entertaining book on why the dog-human relationship is unique - and possibly even &quot;spiritual&quot;.\r\n\r\nDr. Andrew Root&apos;s search for the canine soul began the day his eight-year-old son led the family in a moving Christian ritual at the burial service for Kirby, their beloved black Lab. In the coming weeks, Root found himself wondering: What was this thing we&apos;d experienced with this animal? Why did the loss hurt so poignantly? Why did his son&apos;s act seem so right in its sacramental feel?\r\n\r\nIn The Grace of Dogs, Root draws on biology, history, theology, cognitive ethology (the study of animal minds), and paleontology to trace how, in our mutual evolution, humans and dogs have so often helped each other to become more fully ourselves. Root explores questions like: Do dogs have souls? Is it accurate to say that dogs &quot;love&quot; us? What do psychology and physiology say about why we react to dogs in the way that we do?\r\n\r\nThe Grace of Dogs paints a vivid picture of how, beyond sentimentality, the dog-human connection can legitimately be described as &quot;spiritual&quot; - as existing not for the sake of gain but for the unselfish desire to be with and for the other, and to remind us that we are persons worthy of love and able to share love. In this book for any parent whose kids have asked if they&apos;ll see Fido in heaven or who has looked their beloved dog in the face and wondered what&apos;s going on in there, Dr. Root delivers an illuminating and heartfelt book that will change how we understand man&apos;s best friend.\r\n\r\nxx","last_updated":"2017-09-24T12:01:49.386Z","parsed":{"xt":"urn:btih:939bf7ed17c81dae8948ae801fd48355ba224d08","dn":"The Grace of Dogs_ A Boy, a Black Lab, and a Father's Search for","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"939bf7ed17c81dae8948ae801fd48355ba224d08","infoHashBuffer":{"type":"Buffer","data":[147,155,247,237,23,200,29,174,137,72,174,128,31,212,131,85,186,34,77,8]},"name":"The Grace of Dogs_ A Boy, a Black Lab, and a Father's Search for","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}