{"title":"Vagante v57b","magnet":"magnet:?xt=urn:btih:93ca6e8fb405a2ab09d53e03801602c2692fe901&dn=Vagante+v57b&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"63111911","seeders":"9","leechers":"1","description":"Vagante is an adventure set in a dark fantasy world filled with monsters, demons, and crooks. Despite these dangers, adventurers commonly travel these unforgiving lands questing for fame, riches, and power.A recent rumor has it that a certain cave at the edge of the woods guards an unfathomable treasure. While a handful of intrepid adventurers have ventured into the cave already, none have returned. Undeterred by the potential danger, you set out by caravan to investigate...Key FeaturesLocal and Online Co-op - Adventure cooperatively with up to four players, either locally or online through Steam!Procedural Generation - With procedurally generated levels, no two runs are ever the same, allowing for countless hours of gameplay.Choose How You Play - Choose a unique class, skin, and background, then customize your character further as you play with your choice of unique class skills at each level.Enchanted Items - Discover magic items that bestow powerful enchantments and game changing abilities.Discover Secrets - Keep track of unlocked classes, backgrounds, music, and more in the Book of Secrets.Explore a Rich World - Explore five unique areas each with their own set of dangers such as monsters, unique bosses, and traps.Tough, but Fair - Play a game designed for players looking for a challenging but rewarding experience","last_updated":"2017-05-27T09:06:09.228Z","parsed":{"xt":"urn:btih:93ca6e8fb405a2ab09d53e03801602c2692fe901","dn":"Vagante v57b","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"93ca6e8fb405a2ab09d53e03801602c2692fe901","infoHashBuffer":{"type":"Buffer","data":[147,202,110,143,180,5,162,171,9,213,62,3,128,22,2,194,105,47,233,1]},"name":"Vagante v57b","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}