{"title":"Mo Gawdat - Solve for Happy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:94d52c88d681369e3494e0b53164b1e7c401681f&dn=Mo+Gawdat+-+Solve+for+Happy+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11860809","seeders":"3","leechers":"0","description":"xx\r\n\r\nMo Gawdat - Solve for Happy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nMo Gawdat is a remarkable thinker and the Chief Business Officer at Google&apos;s [X], an elite team of engineers that comprise Google&apos;s futuristic &quot;dream factory.&quot; Applying his superior skills of logic and problem solving to the issue of happiness, he proposes an algorithm based on an understanding of how the brain takes in and processes joy and sadness. Then he solves for happy.\r\n\r\nIn 2001 Mo Gawdat realized that despite his incredible success, he was desperately unhappy. A lifelong learner, he attacked the problem as an engineer would: examining all the provable facts and scrupulously applying logic. Eventually, his countless hours of research and science proved successful, and he discovered the equation for permanent happiness.\r\n\r\nThirteen years later, Mo&apos;s algorithm would be put to the ultimate test. After the sudden death of his son, Ali, Mo and his family turned to his equation&#x2014;and it saved them from despair. In dealing with the horrible loss, Mo found his mission: he would pull off the type of &quot;moonshot&quot; goal that he and his colleagues were always aiming for&#x2014;he would share his equation with the world and help as many people as possible become happier.\r\n\r\nIn Solve for Happy Mo questions some of the most fundamental aspects of our existence, shares the underlying reasons for suffering, and plots out a step-by-step process for achieving lifelong happiness and enduring contentment. He shows us how to view life through a clear lens, teaching us how to dispel the illusions that cloud our thinking; overcome the brain&apos;s blind spots; and embrace five ultimate truths.\r\n\r\nNo matter what obstacles we face, what burdens we bear, what trials we&apos;ve experienced, we can all be content with our present situation and optimistic about the future.\r\n\r\nxx","last_updated":"2017-07-12T12:00:25.208Z","parsed":{"xt":"urn:btih:94d52c88d681369e3494e0b53164b1e7c401681f","dn":"Mo Gawdat - Solve for Happy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"94d52c88d681369e3494e0b53164b1e7c401681f","infoHashBuffer":{"type":"Buffer","data":[148,213,44,136,214,129,54,158,52,148,224,181,49,100,177,231,196,1,104,31]},"name":"Mo Gawdat - Solve for Happy 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}