{"title":"Ultimate.General.Civil.War.v0.92.Hotfix3.rev.23795","magnet":"magnet:?xt=urn:btih:95204d7e745e3ba8e01ae62c3f81eab23e9c642f&dn=Ultimate.General.Civil.War.v0.92.Hotfix3.rev.23795&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"TomTomy","categoryP":"games","categoryS":"pc","size":"2479447956","seeders":"0","leechers":"1","description":"Ultimate General: Civil War is a tactical war-game. Experience the bloodiest period of U.S. history - the American Civil War of 1861-1865. MAIN FEATURESFull campaign: Fight in the American Civil War campaign and participate in 50+ battles from small engagements to massive battles that can last several days over hundreds of square miles of terrain. Campaign fully depends on player actions and battle results. Historical battles can also be played separately.The game includes the following battles in the campaign:Battle of Aquia CreekBattle of Philippi1st Battle of Bull RunBattle of ShilohBattle of Gaines&apos; MillBattle of Malvern Hill2nd Battle of Bull RunBattle of AntietamBattle of FredericksburgBattle of Stones RiverBattle of ChancellorsvilleBattle of GettysburgBattle of ChickamaugaBattle of Cold HarborBattle of RichmondBattle of Washington+ 45 smaller scale battlesArmy management: You are the general. You have full control over the army composition. Based on your successes and reputation you might get access to more corps, divisions and brigades. Keep your soldiers alive and they will learn to fight better, turning from green rookies to crack veterans. Lose a lot of your soldiers and you might not have enough reinforcements to deliver victories. Your reputation will suffer, army morale will drop and you will be forced to resign.Innovative command system: You decide which level of control you","last_updated":"2017-06-23T12:01:16.836Z","parsed":{"xt":"urn:btih:95204d7e745e3ba8e01ae62c3f81eab23e9c642f","dn":"Ultimate.General.Civil.War.v0.92.Hotfix3.rev.23795","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"95204d7e745e3ba8e01ae62c3f81eab23e9c642f","infoHashBuffer":{"type":"Buffer","data":[149,32,77,126,116,94,59,168,224,26,230,44,63,129,234,178,62,156,100,47]},"name":"Ultimate.General.Civil.War.v0.92.Hotfix3.rev.23795","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}