{"title":"The Bridge to Brilliance by Nadia Lopez 2016 RETAiL ePUB eBOOK-D","magnet":"magnet:?xt=urn:btih:952ad0a5ce4c70221c1852e57407e3a6b67beadc&dn=The+Bridge+to+Brilliance+by+Nadia+Lopez+2016+RETAiL+ePUB+eBOOK-D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2854275","seeders":"10","leechers":"8","description":"xx\r\n\r\nThe Bridge to Brilliance by Nadia Lopez 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe inspirational account of the creation of a path-breaking inner-city middle school in Brooklyn, New York, by the magnetic young principal who rocketed to national fame via Humans of New York.\r\n\r\nWhen 13-year-old Vidal Chastanet told photographer Brandon Stanton that his principal, Ms. Lopez, was the person who most influenced his life, it was the pebble that started a whirlwind for Nadia Lopez and her small, new public school in one of Brooklyn&apos;s most wretched communities. The posting on Stanton&apos;s wildly popular site, Humans of New York (HONY), went megaviral. Lopez - not long before on the verge of quitting - found herself in the national spotlight and headed for a meeting with Obama as well as the beneficiary of a million-dollar IndieGoGo campaign for the school. Here is her first-person account of what it took to get to that moment.\r\n\r\nMott Hall Bridges Academy isn&apos;t just a hallway inside a typically underserved public school in one of New York City&apos;s most underprivileged communities - it is a school that glows with energy and excitement. Lopez tells the kids every day that they&apos;re extraordinary and that she loves them. When trouble stirs, she asks, &quot;Would I have been proud to see what happened in that classroom? No? Then why did it happen?&quot; She tells her teachers, &quot;Don&apos;t tell me our scholars can&apos;t learn, because if you can&apos;t teach them, then I&apos;ll come teach your class for a couple of weeks.&quot;\r\n\r\nEverything was an uphill battle - to get the school launched, to recruit faculty and students, to solve a million new problems every day, from violent crime to vanishing supplies, but Lopez illustrates how leadership often means just picking the right people to support you. In middle school, one year lost with an unengaged teacher is a year that can send a kid down a terrible path. And then, of course, there is the educational system itself, how &quot;teaching to the test&quot; is an enormous problem, particularly in schools with kids who are already disadvantaged and underprepared.\r\n\r\nThe Bridge to Brilliance is a book filled with common sense and caring that will carry her message to classrooms far from Brooklyn. As she says modestly, &quot;There are hundreds of Ms. Lopezes around this country doing good work for kids. This honors all of them.&quot;\r\n\r\nxx","last_updated":"2017-09-20T12:04:04.301Z","parsed":{"xt":"urn:btih:952ad0a5ce4c70221c1852e57407e3a6b67beadc","dn":"The Bridge to Brilliance by Nadia Lopez 2016 RETAiL ePUB eBOOK-D","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"952ad0a5ce4c70221c1852e57407e3a6b67beadc","infoHashBuffer":{"type":"Buffer","data":[149,42,208,165,206,76,112,34,28,24,82,229,116,7,227,166,182,123,234,220]},"name":"The Bridge to Brilliance by Nadia Lopez 2016 RETAiL ePUB eBOOK-D","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}