{"title":"Benjamin Franklin's Bastard_ A Novel by Sally Cabo eBOOK-Z","magnet":"magnet:?xt=urn:btih:9548bfef06186c1f496e431de9a15f4c98ddf826&dn=Benjamin+Franklin%27s+Bastard_+A+Novel+by+Sally+Cabo+eBOOK-Z&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3330163","seeders":"0","leechers":"0","description":"xx\r\n\r\nBenjamin Franklin&apos;s Bastard_ A Novel by Sally Cabot MOBI eBOOK-ZAK\r\n\r\nAn absorbing and compelling work of literary historical fiction, set in colonial Philadelphia, that brings to life a little-known chapter of the American Revolution - the story of Benjamin Franklin and his bastard son, and the women who loved them.\r\n\r\nSixteen-year-old Anne is an uneducated serving girl at the Penny Pot tavern when she first meets the commanding Benjamin Franklin. The time she spends with the brilliant young printer teases her curious mind, and the money he provides keeps her family from starving. But the ambitious Franklin is committed to someone else, a proper but infatuated woman named Deborah Read who becomes his common-law wife. At least Anne has William, her cherished infant son, to remind her of his father and to soften some of life&apos;s bleakness.\r\n\r\nBut growing up a bastard amid the squalor of Eades Alley isn&apos;t the life Anne wants for her only son. Acutely aware of the challenges facing them, she makes a heartbreaking sacrifice. She will give up William forever, allowing Benjamin and Deborah Franklin to raise him as their own.\r\n\r\nThough she cannot be with him, Anne secretly watches out for her beloved child, daring to be close to him without revealing the truth about herself or his birth, and standing guard as Deborah Franklin struggles to accept her husband&apos;s bastard son as her own.\r\n\r\nAs the years pass, the bustling colonies grow and prosper, offering opportunities for wealth and power for a talented man like William&apos;s father. Benjamin&apos;s growing fame and connections as a scientist, writer, philosopher, businessman, and political genius open doors for the astute William as well, and eventually King George III appoints Benjamin&apos;s bastard son to the new position of Royal Governor of New Jersey. Anne&apos;s fortunes also rise. A shrewd woman of many talents, she builds a comfortable life of her own - yet nothing fills her with more joy or pride than her son&apos;s success and happiness.\r\n\r\nBut all that her accomplished son has achieved is threatened when the colonies - led by influential men, including his own father - begin the fight for independence. A steadfast, loyal subject of the British Crown, William cannot accept his father&apos;s passionate defense of the patriots&apos; cause, and the enduring bond they share fractures, a heart-wrenching break that will forever haunt them and those they love.\r\n\r\nA poignant tale of passion, family, love, and war, Benjamin Franklin&apos;s Bastard skillfully brings into focus a cast of remarkable characters drawn from real life, and vividly re-creates one of the most remarkable and thrilling periods of history - the birth of the American nation.\r\n\r\nxx","last_updated":"2017-07-29T12:00:26.350Z","parsed":{"xt":"urn:btih:9548bfef06186c1f496e431de9a15f4c98ddf826","dn":"Benjamin Franklin's Bastard_ A Novel by Sally Cabo eBOOK-Z","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9548bfef06186c1f496e431de9a15f4c98ddf826","infoHashBuffer":{"type":"Buffer","data":[149,72,191,239,6,24,108,31,73,110,67,29,233,161,95,76,152,221,248,38]},"name":"Benjamin Franklin's Bastard_ A Novel by Sally Cabo eBOOK-Z","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}