{"title":"Sarah Dunant - Blood and Beauty The Borgias 2013 Retail EPUB eBo","magnet":"magnet:?xt=urn:btih:95829d224b1b6e153f299bff559bb6a326dfe0f3&dn=Sarah+Dunant+-+Blood+and+Beauty+The+Borgias+2013+Retail+EPUB+eBo&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5600190","seeders":"0","leechers":"0","description":"Sarah Dunant - Blood and Beauty The Borgias 2013 Retail EPUB eBook-BitBook\r\n\r\nThe New York Times bestselling author of the acclaimed Italian Renaissance novels&#x2014;The Birth of Venus, In the Company of the Courtesan, and Sacred Hearts&#x2014;has an exceptional talent for breathing life into history. Now Sarah Dunant turns her discerning eye to one of the world&#x2019;s most intriguing and infamous families&#x2014;the Borgias&#x2014;in an engrossing work of literary fiction.\r\n\r\nBy the end of the fifteenth century, the beauty and creativity of Italy is matched by its brutality and corruption, nowhere more than in Rome and inside the Church. When Cardinal Rodrigo Borgia buys his way into the papacy as Alexander VI, he is defined not just by his wealth or his passionate love for his illegitimate children, but by his blood: He is a Spanish Pope in a city run by Italians. If the Borgias are to triumph, this charismatic, consummate politician with a huge appetite for life, women, and power must use papacy and family&#x2014;in particular, his eldest son, Cesare, and his daughter Lucrezia&#x2014;in order to succeed.\r\n\r\nCesare, with a dazzlingly cold intelligence and an even colder soul, is his greatest&#x2014;though increasingly unstable&#x2014;weapon. Later immortalized in Machiavelli&#x2019;s The Prince, he provides the energy and the muscle. Lucrezia, beloved by both men, is the prime dynastic tool. Twelve years old when the novel opens, hers is a journey through three marriages, and from childish innocence to painful experience, from pawn to political player.\r\n\r\nStripping away the myths around the Borgias, Blood &amp; Beauty is a majestic novel that breathes life into this astonishing family and celebrates the raw power of history itself: compelling, complex and relentless","last_updated":"2017-06-19T12:00:29.956Z","parsed":{"xt":"urn:btih:95829d224b1b6e153f299bff559bb6a326dfe0f3","dn":"Sarah Dunant - Blood and Beauty The Borgias 2013 Retail EPUB eBo","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"95829d224b1b6e153f299bff559bb6a326dfe0f3","infoHashBuffer":{"type":"Buffer","data":[149,130,157,34,75,27,110,21,63,41,155,255,85,155,182,163,38,223,224,243]},"name":"Sarah Dunant - Blood and Beauty The Borgias 2013 Retail EPUB eBo","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}