{"title":"The Room of White Fire - T. Jefferson Parker [EN EPUB] [ebook]","magnet":"magnet:?xt=urn:btih:95ff7fa9a97d2e00d379f5033efbfe50d6e9ca59&dn=The+Room+of+White+Fire+-+T.+Jefferson+Parker+%5BEN+EPUB%5D+%5Bebook%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"perfect_stan","categoryP":"other","categoryS":"e_books","size":"3101005","seeders":"0","leechers":"0","description":"The Room of White Fire by T. Jefferson Parker\r\nEnglish | 2017 | Mystery &amp; Thriller | EPUB | 3 MB\r\n\r\n\r\nFor fans of Michael Connelly and CJ Box, a stirring thriller from New York Times bestseller and award winner T. Jefferson Parker: The Room of White Fire is the tale of a private investigator tasked with hunting down a returned soldier broken and made dangerous by his experiences at war.\r\nA young soldier shattered by war, on the run from a mental institute. A P.I. carrying his own vicious wounds hired to track that soldier down. A race against the clock to bring the soldier home before he reveals the secret that haunts him.\r\nRoland Ford once a cop, then a marine, now a private investigator is good at finding people. But when he&#x2019;s asked to locate air force veteran Clay Hickman, he realizes he&#x2019;s been drawn into something deep and dark. He knows the weight of war, having served as a marine in First Fallujah; he also knows the nightmare of indescribable personal pain, as only two years have passed since his young wife&#x2019;s sudden death. What he doesn&#x2019;t know is why a shroud of secrecy hangs over the disappearance of Clay Hickman and why he&#x2019;s getting a different story from everyone involved.\r\nTo begin with, there&#x2019;s the teenage girl who helped Clay escape: she&#x2019;s smart enough to fend off Ford&#x2019;s questions but impetuous enough to be on the run with an armed and dangerous man. Then there&#x2019;s Clay&#x2019;s attractive doctor, who clearly cares deeply for his welfare but is impossible to read, even as she inspires in Ford the first desire he has felt since his wife&#x2019;s death. And there&#x2019;s the proprietor of the mental institute who is as enigmatic as he is brash, and ambitious to the point of being ruthless; what could Clay possibly know to make this search so desperate?\r\nSoon, what began as just a job becomes a life-and-death obsession for Ford, pitting him against immensely powerful and treacherous people and forcing him to contend with chilling questions about truth, justice, and the American way.\r\n\r\nEnjoy and please SEED!!!","last_updated":"2017-09-02T12:05:11.755Z","parsed":{"xt":"urn:btih:95ff7fa9a97d2e00d379f5033efbfe50d6e9ca59","dn":"The Room of White Fire - T. Jefferson Parker [EN EPUB] [ebook]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"95ff7fa9a97d2e00d379f5033efbfe50d6e9ca59","infoHashBuffer":{"type":"Buffer","data":[149,255,127,169,169,125,46,0,211,121,245,3,62,251,254,80,214,233,202,89]},"name":"The Room of White Fire - T. Jefferson Parker [EN EPUB] [ebook]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}