{"title":"Shakespeare_ The Biography by Peter Ackroyd ePUB MOBI eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:96cea8f457471e50cf0692dbb3a0eb554be966bb&dn=Shakespeare_+The+Biography+by+Peter+Ackroyd+ePUB+MOBI+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6122050","seeders":"0","leechers":"0","description":"xx\r\n\r\nShakespeare_ The Biography by Peter Ackroyd ePUB MOBI eBOOK-ZAK\r\n\r\nIn a magnificent feat of re-creating sixteenth-century London and Stratford, best-selling biographer and novelist Peter Ackroyd brings William Shakespeare to life in the manner of a contemporary rather than a biographer. Following his magisterial and ingenious re-creations of the lives of Chaucer, Dickens, T. S. Eliot, William Blake, and Sir Thomas More, Ackroyd delivers his crowning achievement with this definitive and imaginative biographical masterpiece.\r\n\r\nThousands of books have been written about the playwright, but none has borne Ackroyd&apos;s unique and accessible stamp. His method is to position the playwright in the context of his world, exploring everything from Stratford&apos;s humble town to its fields of wildflowers; discerning influences on the plays from unexpected quarters; and entering London with the playwright as modern theatre, as we know it, is just beginning to emerge.\r\n\r\nWriting as though we are observing Shakespeare and his circle of friends, patrons, managers, and fellow actors and writers, Ackroyd is able to see Shakespeare&apos;s genius from within, so we feel that Ackroyd the writer merges with Shakespeare the writer, the poet, the man; and thus with great sympathy and clarity we experience the way in which Shakespeare worked.\r\n\r\nShakespeare: The Biography is quite unlike other more analytic biographies that have been written. Rather, Peter Ackroyd has used his skill, his extraordinary knowledge, and his historical intuition to craft this major full-scale book on one of the most towering figures of the English language.\r\n\r\nxx","last_updated":"2017-08-12T12:00:26.210Z","parsed":{"xt":"urn:btih:96cea8f457471e50cf0692dbb3a0eb554be966bb","dn":"Shakespeare_ The Biography by Peter Ackroyd ePUB MOBI eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"96cea8f457471e50cf0692dbb3a0eb554be966bb","infoHashBuffer":{"type":"Buffer","data":[150,206,168,244,87,71,30,80,207,6,146,219,179,160,235,85,75,233,102,187]},"name":"Shakespeare_ The Biography by Peter Ackroyd ePUB MOBI eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}