{"title":"\nFifty Inventions That Shaped the Modern Economy by Tim Harford e","magnet":"magnet:?xt=urn:btih:96d500a804d75571dbd4dd6cc0a38db7d5f23a3e&dn=Fifty+Inventions+That+Shaped+the+Modern+Economy+by+Tim+Harford+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3348198","seeders":"0","leechers":"0","description":"xx\r\n\r\nFifty Inventions That Shaped the Modern Economy by Tim Harford ePUB eBOOK-ZAK\r\n\r\nA lively history seen through the 50 inventions that shaped it most profoundly, by the best-selling author of The Undercover Economist and Messy.\r\n\r\nWho thought up paper money? What was the secret element that made the Gutenberg printing press possible? And what is the connection between The Da Vinci Code and the collapse of Lehman Brothers?\r\n\r\nFifty Inventions That Shaped the Modern Economy paints an epic picture of change in an intimate way by telling the stories of the tools, people, and ideas that had far-reaching consequences for all of us. From the plough to artificial intelligence, from Gillette&apos;s disposable razor to IKEA&apos;s Billy bookcase, best-selling author and Financial Times columnist Tim Harford recounts each invention&apos;s own curious, surprising, and memorable story.\r\n\r\nInvention by invention, Harford reflects on how we got here and where we might go next. He lays bare often unexpected connections: how the bar code undermined family corner stores and why the gramophone widened inequality. In the process, he introduces characters who developed some of these inventions, profited from them, and were ruined by them, as he traces the principles that helped explain their transformative effects. The result is a wise and witty book of history, economics, and biography.\r\n\r\nxx","last_updated":"2017-10-03T12:03:35.511Z","parsed":{"xt":"urn:btih:96d500a804d75571dbd4dd6cc0a38db7d5f23a3e","dn":"Fifty Inventions That Shaped the Modern Economy by Tim Harford e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"96d500a804d75571dbd4dd6cc0a38db7d5f23a3e","infoHashBuffer":{"type":"Buffer","data":[150,213,0,168,4,215,85,113,219,212,221,108,192,163,141,183,213,242,58,62]},"name":"Fifty Inventions That Shaped the Modern Economy by Tim Harford e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}