{"title":"Electronic Noses and Tongues in Food Science","magnet":"magnet:?xt=urn:btih:9723def724a4402ad7c9a5c633e5c8c4aa5b1ea7&dn=Electronic+Noses+and+Tongues+in+Food+Science&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"26505331","seeders":"0","leechers":"0","description":"Electronic Noses and Tongues in Food Science - Mar&#xED;a Luz Rodr&#xED;guez M&#xE9;ndez (AP, 2016).pdf\r\n\r\nElectronic Noses and Tongues in Food Science describes the electronic products of advanced chemical and physical sciences combined with intuitive integration of microprocessors, advanced bioinformatics and statistics. These include, for example, voltammetric, bio-electronic, piezoelectric platforms made from a variety of components including, nanoparticles, enzyme biosensors, heavy metals, graphite-epoxy composites, metal oxide semiconductors, microelectrodes, microfluidic channels, pre-manufactured gas sensors, redox enzymes and others and is an ideal resource for understanding and utilizing their power in Food Science settings.\r\n\r\nDevices used to analyse one particular food item can theoretically be adapted for other food items or components. This does not just mean the re-deploying the physical platforms but also the mode of bioinformatic and statistical analysis. This includes artificial neural networks (ANN), linear discriminant analysis (LDA), partial least squares (PLS), principal component analysis (PCA) etc. In other words, there is cross transference of chemistry, physics, concepts, techniques, findings and approaches from one food to another. Electronic noses and tongues are two of these devices but are advancing in application and importance.\r\n\r\nThis book provides examples of the use of electronic noses and tongues to characterise components that contribute to sensory or compositional profiles, from ripening to harvesting and from storage of raw materials to packaging and consumption. These devises are suitable for high-throughput analysis, quality control or to determine the nature and extent of spoilage and adulteration, and have also been used to ascertain the geographical origins of food and mixtures.\r\n\r\nPresents latest developments in the application of electronic nose and tongue technologies to a variety of food-specific needs\r\nIncludes both electronic nose, electronic tongue and combined technology insights\r\nEach chapter has sections on: The physical and chemical platforms; Analysis of specific foods; Applications to other foods and areas of food science","last_updated":"2017-05-31T12:01:41.574Z","parsed":{"xt":"urn:btih:9723def724a4402ad7c9a5c633e5c8c4aa5b1ea7","dn":"Electronic Noses and Tongues in Food Science","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9723def724a4402ad7c9a5c633e5c8c4aa5b1ea7","infoHashBuffer":{"type":"Buffer","data":[151,35,222,247,36,164,64,42,215,201,165,198,51,229,200,196,170,91,30,167]},"name":"Electronic Noses and Tongues in Food Science","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}