{"title":"Andrea Centazzo Mitteleuropa Orchestra 2002 Live","magnet":"magnet:?xt=urn:btih:97436d235192df0cf7c83e62411e174b2d6fdfdd&dn=Andrea+Centazzo+Mitteleuropa+Orchestra+2002+Live&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wwino","categoryP":"audio","categoryS":"flac","size":"371988231","seeders":"7","leechers":"1","description":"Andrea Centazzo Mitteleuropa Orchestra ~ Live ~ 2002\r\nNew Tone Records rdc 5047 2.\r\n <a href=\"\nhttp://i2.imageban.ru/out/2017/06/11/0f293efc761b3d39934796baa63afe6b.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i2.imageban.ru/out/2017/06/11/0f293efc761b3d39934796baa63afe6b.jpg</a>\r\n\r\n1 \tChirimia \t15:27\r\n2 \tFirst Environment (For Orchestra) \t8:30\r\n3 \tMusica Schema # 1 \t10:50\r\n4 \tThird Environment (For Orchestra) \t15:07\r\n5 \tCjant: VI Movement \t13:10\r\n6 \tCjant: V Movement \t4:01\r\n\r\nLong before the Italian Instabile Orchestra, Andrea Centazzo was organizing and leading his Mitteleuropa Orchestra that focused on free improvisation, complex arrangements, and outstanding soloists. Most, although not all, of the musicians of the orchestra were Italians, and the all-star nature of the groups on this live recording make this a must-have for anyone immersed in its genre. The first four tracks -- with Enrico Rava, Franz Koglmann, Giancarlo Trovesi, and Carlos Zingaro among the notables -- are a straight reissue of the original Ictus LP, while the fifth and sixth tracks -- with a different conglomeration that counts two cellists, seven violinists, and two violas among its members, along with Carlo Actis Dato -- was never released before. This new and expanded release on Felmay is an important document for both historical and aesthetic reasons. Not only does it reflect positively on Centazzo&apos;s own percussion work and leadership skills (not to mention an excellent smell for talent), but it features one of the rare orchestras of its kind that presaged later work by the Italian Instabile Orchestra and the ICP Orchestra, just to name a couple of similarly influential large groups. While some orchestras, such as the spectacular Globe Unity Orchestra, date back further, few large groups addressed the issues raised by Centazzo&apos;s writing. He merges composition and improvisation and in so doing speaks thoughtfully to a unified approach. He emphasizes the strings throughout, but especially on the last three cuts. (The last two have been performed and recorded by the Poznan Philharmonic, a symphony orchestra from Poland.) There is considerable concern with color, rhythm, and shading, with the xylophone and strings offering a unique air. The solos, too, are often riveting. The sound quality is surprisingly good for a concert recording. - Steve Loewy, AMG","last_updated":"2017-06-11T12:02:00.805Z","parsed":{"xt":"urn:btih:97436d235192df0cf7c83e62411e174b2d6fdfdd","dn":"Andrea Centazzo Mitteleuropa Orchestra 2002 Live","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"97436d235192df0cf7c83e62411e174b2d6fdfdd","infoHashBuffer":{"type":"Buffer","data":[151,67,109,35,81,146,223,12,247,200,62,98,65,30,23,75,45,111,223,221]},"name":"Andrea Centazzo Mitteleuropa Orchestra 2002 Live","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}