{"title":"Stephen R. Donaldson - The Chronicles of Thomas Covenant 1 - 11","magnet":"magnet:?xt=urn:btih:979954995c9797c9fde5390151e8aa0955f73ed9&dn=Stephen+R.+Donaldson+-+The+Chronicles+of+Thomas+Covenant+1+-+11&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Agricola","categoryP":"other","categoryS":"e_books","size":"9862344","seeders":"0","leechers":"0","description":"Thomas Covenant is an author who has contracted leprosy.  He has been abandoned by his family and shunned by society.  One day he appears to have a car accident and is magically transported to The Land.  The Land is a world full of health and people dedicated to the preservation of life and The Land.  Covenant is convinced The Land is a dream after he is treated with a mysterious substance called &quot;hurtloam&quot; and his damaged nerves begin to heal.  He refuses to believe in The Land thinking he is dreaming and dubs himself the Unbeliever.\r\n\r\nBut Covenant is the incarnation of The Land&apos;s greatest hero, Berek Halfhand (Covenant had two fingers amputated due to his leprosy).  He also bears a magical talisman; his wedding ring made of white gold.  White gold is not found in The Land and is supposed to be a substance that commands wild magic.  Covenant has been warned by Lord Foul, who more or less represents Satan, that The Land will come under his control within 49 years.  Covenant journeys to warn the Lords of The Land who are wielders of great magical power.  The Lords wish to enlist Covenant&apos;s help (wielding the magic of the white gold) in defeating Lord Foul, but no one knows how to make use of the white gold.  Will Covenant learn to use his power in time to aid The Land?","last_updated":"2017-06-13T12:00:47.451Z","parsed":{"xt":"urn:btih:979954995c9797c9fde5390151e8aa0955f73ed9","dn":"Stephen R. Donaldson - The Chronicles of Thomas Covenant 1 - 11","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"979954995c9797c9fde5390151e8aa0955f73ed9","infoHashBuffer":{"type":"Buffer","data":[151,153,84,153,92,151,151,201,253,229,57,1,81,232,170,9,85,247,62,217]},"name":"Stephen R. Donaldson - The Chronicles of Thomas Covenant 1 - 11","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}