{"title":"Germar Rudolf - Lectures on the Holocaust - Controversial Issues","magnet":"magnet:?xt=urn:btih:98250dfbb7027a86a96c078b06fac7494374b9db&dn=Germar+Rudolf+-+Lectures+on+the+Holocaust+-+Controversial+Issues&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"140871370","seeders":"35","leechers":"12","description":"Germar Rudolf - Lectures on the Holocaust - Controversial Issues Cross Examined (2004) pdf - roflcopter2110\r\n <a href=\"\nhttps://extraimage.net/images/2018/01/05/563977f710ae177aff143a049ec4891e.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2018/01/05/563977f710ae177aff143a049ec4891e.jpg</a>\r\n\r\nPublisher: Theses &amp; Dissertations Press\r\nLanguage: English\r\nISBN-10: 1591480019\r\nISBN-13: 978-1591480013\r\nFormat: PDF\r\n\r\nSince 1992, German scholar Germar Rudolf has been giving lectures to various mainstream audiences all over the world. His topic is very controversial: the Holocaust in the light of new forensic and historical findings. Initially his listeners think they know exactly what &apos;&apos;the Holocaust&apos;&apos; is all about, but their world view is completely turned upside down after the evidence is presented. Even though Rudolf presents nothing short of full-fledged Holocaust revisionism, his arguments fall on fertile soil, because they are presented in a very pedagogically sensitive and scholarly way. This book is the literary version of Rudolf&apos;s lectures, enriched with the most recent findings of historiography to a topic regulated by penal law in many countries. The book&apos;s style is as unique as its topic: It is a dialogue between the lecturer on the one hand and the reactions of actual audience members on the other. Germar Rudolf introduces the reader to the most important arguments and counter arguments of Holocaust revisionism. The audience reacts with supportive, skeptical, and alsocomments, questions, and assertions. The &apos;&apos;Lectures&apos;&apos; read like a vivid and exciting real-life exchange between persons of various points of view. This book is a compilation of Frequently Asked Questions on the Holocaust and its critical re-examination. The usual moral, political, and pseudo-scientific arguments against revisionism are all addressed and refuted. With more than 1,300 references to sources and a vast bibliography, this easy-to-understand book is the best introduction into this taboo topic for both readers unfamiliar with revisionism and for those wanting to know more","last_updated":"2018-01-06T12:04:29.970Z","parsed":{"xt":"urn:btih:98250dfbb7027a86a96c078b06fac7494374b9db","dn":"Germar Rudolf - Lectures on the Holocaust - Controversial Issues","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"98250dfbb7027a86a96c078b06fac7494374b9db","infoHashBuffer":{"type":"Buffer","data":[152,37,13,251,183,2,122,134,169,108,7,139,6,250,199,73,67,116,185,219]},"name":"Germar Rudolf - Lectures on the Holocaust - Controversial Issues","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}