{"title":"Additives for Plastics Vol. 1 - State of the Art","magnet":"magnet:?xt=urn:btih:9841801d826df8d1681915179b0bba0cc994adff&dn=Additives+for+Plastics+Vol.+1+-+State+of+the+Art&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"4236845","seeders":"16","leechers":"3","description":"Additives for Plastics Vol. 1 - State of the Art - Raymond B. Seymour (AP, 1978).pdf\r\n\r\nAdditives for Plastics: Volume 1, State of the Art summarizes the state of the art about additives for plastics, including coupling agents for fillers and plasticizers, as well as colorants, silicas, cellulose fiber, whiskers, and microfibers. Stabilizers for weather, fungal, and heat resistance and resistance to ultraviolet radiation are also considered. \r\nThis volume is comprised of 13 chapters; the first of which introduces the reader to nonreinforcing fillers such as carbon black, wood flour, alpha cellulose, calcium carbonate, and natural and synthetic silicates. The discussion then turns to synthetic and naturally occurring silicas, short cellulose fibers for reinforcing polymers, and asbestiform fillers. Whiskers and microfibers are the subject of the subsequent chapter, with emphasis on their differences and similarities, application in various plastics, and prospects. Silane and nonsilane coupling agents, nonfiller additives, plasticizers, biocides, and heat stabilizers are also examined. This volume also evaluates rutile titanium dioxide and other white pigments with regard to the opacification and coloring of plastics. \r\nThis book will be of vital interest to those who are closely associated with the plastics industry as well as those who are concerned with the design, fabrication, and use of plastics","last_updated":"2017-06-16T12:04:54.578Z","parsed":{"xt":"urn:btih:9841801d826df8d1681915179b0bba0cc994adff","dn":"Additives for Plastics Vol. 1 - State of the Art","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9841801d826df8d1681915179b0bba0cc994adff","infoHashBuffer":{"type":"Buffer","data":[152,65,128,29,130,109,248,209,104,25,21,23,155,11,186,12,201,148,173,255]},"name":"Additives for Plastics Vol. 1 - State of the Art","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}