{"title":"If You Can Keep It_ The Forgotten Promise of American Liberty by","magnet":"magnet:?xt=urn:btih:9967c0b2d808bab7ffe59b5d037ca035a306b897&dn=If+You+Can+Keep+It_+The+Forgotten+Promise+of+American+Liberty+by&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2793715","seeders":"38","leechers":"9","description":"xx\r\n\r\nIf You Can Keep It_ The Forgotten Promise of American Liberty by Eric Metaxas ePUB eBOOK-ZAK\r\n\r\nFrom the number-one New York Times best-selling author Eric Metaxas comes If You Can Keep It, a new book that is part history and part manifesto, steeped in a critical analysis of our founding fathers&apos; original intentions for America. Two hundred and forty years after the Declaration of Independence, it examines how we as a nation are living up to our founders&apos; lofty vision for liberty and justice.\r\n\r\nIf You Can Keep It is at once a thrilling review of America&apos;s uniqueness, and a sobering reminder that America&apos;s greatness cannot continue unless we truly understand what our founding fathers meant for us to be. The book includes a stirring call-to-action for every American to understand the ideals behind the &quot;noble experiment in ordered liberty&quot; that is America. It also paints a vivid picture of the tremendous fragility of that experiment and explains why that fragility has been dangerously forgotten - and in doing so it lays out our own responsibility to live those ideals and carry on those freedoms.\r\n\r\nMetaxas believes America is not a nation bounded by ethnic identity or geography, but rather by a radical and unprecedented idea, based upon liberty and freedom. It&apos;s time to reconnect to that idea before America loses the very foundation for what made it exceptional in the first place.\r\n\r\nxx","last_updated":"2017-09-03T12:03:49.512Z","parsed":{"xt":"urn:btih:9967c0b2d808bab7ffe59b5d037ca035a306b897","dn":"If You Can Keep It_ The Forgotten Promise of American Liberty by","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9967c0b2d808bab7ffe59b5d037ca035a306b897","infoHashBuffer":{"type":"Buffer","data":[153,103,192,178,216,8,186,183,255,229,155,93,3,124,160,53,163,6,184,151]},"name":"If You Can Keep It_ The Forgotten Promise of American Liberty by","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}