{"title":"Mawson's Will by Lennard Bickel EPUB","magnet":"magnet:?xt=urn:btih:9967db3db76d45a01608264ea5add47ff2367b3b&dn=Mawson%27s+Will+by+Lennard+Bickel+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"476447","seeders":"0","leechers":"0","description":"xx\r\n\r\nMawson&apos;s Will by Lennard Bickel EPUB\r\n\r\nMawson&apos;s Will is the dramatic story of what Sir Edmund Hillary calls &quot;the most outstanding solo journey ever recorded in Antarctic history&quot;. For weeks in Antarctica, Douglas Mawson faced some of the most daunting conditions ever known to man: blistering wind, snow, and cold; loss of his companion, his dogs and supplies, the skin on his hands and the soles of his feet; thirst, starvation, disease, snowblindness - and he survived.\r\n\r\nSir Douglas Mawson is remembered as the young Australian who would not go to the South Pole with Robert Scott in 1911, choosing instead to lead his own expedition on the less glamorous mission of charting nearly 1,500 miles of Antarctic coastline and claiming its resources for the British Crown. His party of three set out through the mountains across glaciers in 60-mile-per-hour winds. Six weeks and 320 miles out, one man fell into a crevasse, along with the tent, most of the equipment, all of the dogs&apos; food, and all except a week&apos;s supply of the men&apos;s provisions.\r\n\r\nMawson&apos;s Will is the unforgettable story of one man&apos;s ingenious practicality and unbreakable spirit and how he continued his meticulous scientific observations even in the face of death. When the expedition was over, Mawson had added more territory to the Antarctic map than anyone else of his time. Thanks to Bickel&apos;s moving account, Mawson can be remembered for the vision and dedication that make him one of the world&apos;s great explorers.\r\n\r\nxx","last_updated":"2017-11-02T12:04:41.627Z","parsed":{"xt":"urn:btih:9967db3db76d45a01608264ea5add47ff2367b3b","dn":"Mawson's Will by Lennard Bickel EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9967db3db76d45a01608264ea5add47ff2367b3b","infoHashBuffer":{"type":"Buffer","data":[153,103,219,61,183,109,69,160,22,8,38,78,165,173,212,127,242,54,123,59]},"name":"Mawson's Will by Lennard Bickel EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}