{"title":"Robin Hood - Sherwood","magnet":"magnet:?xt=urn:btih:99c4542e1feb8057723dca8fc0b7ccfa6ecad30c&dn=Robin+Hood+-+Sherwood&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"alrox","categoryP":"games","categoryS":"pc","size":"1593938662","seeders":"10","leechers":"7","description":"REVIEWS\r\n\r\n&#x201C;The game has it all: the lush surroundings will create a perfect atmosphere of medieval England, and together with the well animated characters they will make you feel a part of Robin Hood&apos;s adventures.&#x201D;\r\n87% &#x2013; ActionTrip\r\n&#x201C;&#x2026;an absorbing game that fans of the strategy will be playing for quite some time.&#x201D;\r\n87% &#x2013; Gamespy\r\n&#x201C;An enjoyable outing in an historic time, Robin Hood offers solid tactical combat and delightful animation.&#x201D;\r\n85% &#x2013; GameZone\r\n\r\nABOUT THIS GAME\r\n\r\nEngland, Anno Domini 1190 &#x2013; Richard the Lionheart is held prisoner and his brother, Prince John rules over the simple peasants with an iron hand and this pure force of arms forces them to bend to authority. Only one man takes up the struggle against the oppressors, supported by a small band of brave and loyal followers. His name; Robin Hood.\r\n\r\nRoam the dense foliage of Sherwood, come face to face with royal trouble and battle against Prince John&#x2019;s forces as you take on the role of legendary nobleman, Robin Hood. Team up with Little John and the rest of the Merry Men as the battle for the King&#x2019;s throne ensues in this stealth-based, real-time strategy game. \r\n\r\nKey features:\r\nNon-linear campaign system with over 30 different missions\r\nMission types from Robbery and Infiltration to Castle Attack and Ambush\r\nCombines action and adventure with stealth tactical elements\r\nInnovative combat system, interact with the mouse while fighting to access special combat skills\r\nPlay as Robin Hood, Little John, Friar Tuck or even Maid Marian, nine characters in all, each with specific abilities and attributes\r\nSpectacular graphics with realistic atmospheric conditions like day, night and fog\r\nExplore historic locations; Sherwood Forest, Nottingham Castle, York and many more","last_updated":"2018-01-01T12:06:14.837Z","parsed":{"xt":"urn:btih:99c4542e1feb8057723dca8fc0b7ccfa6ecad30c","dn":"Robin Hood - Sherwood","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"99c4542e1feb8057723dca8fc0b7ccfa6ecad30c","infoHashBuffer":{"type":"Buffer","data":[153,196,84,46,31,235,128,87,114,61,202,143,192,183,204,250,110,202,211,12]},"name":"Robin Hood - Sherwood","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}