{"title":"The Chinese Typewriter: A History","magnet":"magnet:?xt=urn:btih:9af5157cf9f93b98878ee0d0597c7f330bfd22bf&dn=The+Chinese+Typewriter%3A+A+History&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"10098767","seeders":"64","leechers":"5","description":"The Chinese Typewriter: A History - Thomas Mullaney [epub]\r\n\r\nChinese writing is character based, the one major world script that is neither alphabetic nor syllabic. Through the years, the Chinese written language encountered presumed alphabetic universalism in the form of Morse Code, Braille, stenography, Linotype, punch cards, word processing, and other systems developed with the Latin alphabet in mind. This book is about those encounters -- in particular thousands of Chinese characters versus the typewriter and its QWERTY keyboard. Thomas Mullaney describes a fascinating series of experiments, prototypes, failures, and successes in the century-long quest for a workable Chinese typewriter. \r\n\r\nThe earliest Chinese typewriters, Mullaney tells us, were figments of popular imagination, sensational accounts of twelve-foot keyboards with 5,000 keys. One of the first Chinese typewriters actually constructed was invented by a Christian missionary, who organized characters by common usage (but promoted the less-common characters for &quot;Jesus&quot; to the common usage level). Later came typewriters manufactured for use in Chinese offices, and typewriting schools that turned out trained &quot;typewriter girls&quot; and &quot;typewriter boys.&quot; Still later was the &quot;Double Pigeon&quot; typewriter produced by the Shanghai Calculator and Typewriter Factory, the typewriter of choice under Mao. Clerks and secretaries in this era experimented with alternative ways of organizing characters on their tray beds, inventing an arrangement method that was the first instance of &quot;predictive text.&quot; \r\n\r\nToday, after more than a century of resistance against the alphabetic, not only have Chinese characters prevailed, they form the linguistic substrate of the vibrant world of Chinese information technology. The Chinese Typewriter, not just an &quot;object history&quot; but grappling with broad questions of technological change and global communication, shows how this happened.\r\n\r\nHardcover: 504 pages\r\nPublisher: The MIT Press; 1st edition (August 8, 2017)","last_updated":"2017-09-05T12:07:12.682Z","parsed":{"xt":"urn:btih:9af5157cf9f93b98878ee0d0597c7f330bfd22bf","dn":"The Chinese Typewriter: A History","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9af5157cf9f93b98878ee0d0597c7f330bfd22bf","infoHashBuffer":{"type":"Buffer","data":[154,245,21,124,249,249,59,152,135,142,224,208,89,124,127,51,11,253,34,191]},"name":"The Chinese Typewriter: A History","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}