{"title":"Greg Mitchell - The Tunnels 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:9b21ef13d98f25e9f957db6412e578fae322d962&dn=Greg+Mitchell+-+The+Tunnels+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13810391","seeders":"1","leechers":"0","description":"Greg Mitchell - The Tunnels 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA thrilling Cold War narrative exploring two harrowing attempts to rescue East Germans by tunneling beneath the Berlin Wall, the US television networks who financed and filmed them, and the Kennedy administration&apos;s unprecedented attempt to suppress both films.\r\n\r\nIn the summer of 1962, one year after East German Communists built the Berlin Wall, a group of daring young West Germans came up with a plan. They would risk prison, Stasi torture, even death to liberate friends, lovers, and strangers in East Berlin by digging tunnels under the wall. Among the tunnelers and escape helpers were a legendary cyclist, an American student from Stanford, and an engineer who would later help build the tunnel under the English Channel.\r\n\r\nThen two US television networks, NBC and CBS, heard about the secret projects and raced to be first to air a spectacular &quot;inside tunnel&quot; special on the human will for freedom. The networks funded two separate tunnels in return for exclusive rights to film the escapes. In response, President John F. Kennedy and Secretary of State Dean Rusk, wary of anything that might raise tensions and force a military confrontation with the Soviets, maneuvered to quash both documentaries.\r\n\r\nUnfolding week by week, sometimes hour by hour, Greg Mitchell&apos;s riveting narrative deftly cuts back and forth from one extraordinary character to another. There was the tunneler who had already served four years in an East German gulag; the Stasi informer who betrayed the &quot;CBS tunnel&quot;; the young East Berliner who escaped with her baby, then married one of the tunnelers; and broadcast legend Daniel Schorr, who battled unsuccessfully to save his film from White House interference and remained bitter about it to the end of his life. Looming over all is John F. Kennedy, who was ambivalent about - even hostile toward - the escape operations. Kennedy confessed to Dean Rusk, &quot;We don&apos;t care about East Berlin&quot;","last_updated":"2017-06-14T12:00:38.922Z","parsed":{"xt":"urn:btih:9b21ef13d98f25e9f957db6412e578fae322d962","dn":"Greg Mitchell - The Tunnels 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9b21ef13d98f25e9f957db6412e578fae322d962","infoHashBuffer":{"type":"Buffer","data":[155,33,239,19,217,143,37,233,249,87,219,100,18,229,120,250,227,34,217,98]},"name":"Greg Mitchell - The Tunnels 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}