{"title":"\nA More Beautiful Question_ The Power of Inquiry to Spark Breakth","magnet":"magnet:?xt=urn:btih:9b352e1a2ca1ee36ecd90e590121568938121ff0&dn=A+More+Beautiful+Question_+The+Power+of+Inquiry+to+Spark+Breakth&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3131517","seeders":"0","leechers":"0","description":"xx\r\n\r\nA More Beautiful Question_ The Power of Inquiry to Spark Breakthrough Ideas by Warren Berger ePUB eBOOK-ZAK\r\n\r\nIn this groundbreaking book, journalist and innovation expert Warren Berger shows that one of the most powerful forces for igniting change in business and in our daily lives is a simple, underappreciated tool - one that has been available to us since childhood. Questioning - deeply, imaginatively, &quot;beautifully&quot; - can help us identify and solve problems, come up with game-changing ideas, and pursue fresh opportunities. So why are we often reluctant to ask &quot;Why?&quot;\r\n\r\nBerger&#x2019;s surprising findings reveal that even though children start out asking hundreds of questions a day, questioning &quot;falls off a cliff&quot; as kids enter school. In an education and business culture devised to reward rote answers over challenging inquiry, questioning isn&#x2019;t encouraged - and, in fact, is sometimes barely tolerated.\r\n\r\nAnd yet, as Berger shows, the most creative, successful people tend to be expert questioners. They&#x2019;ve mastered the art of inquiry, raising questions no one else is asking - and finding powerful answers. The author takes us inside red-hot businesses like Google, Netflix, IDEO, and Airbnb to show how questioning is baked into their organizational DNA. He also shares inspiring stories of artists, teachers, entrepreneurs, basement tinkerers, and social activists who changed their lives and the world around them - by starting with a &quot;beautiful question&quot;.\r\n\r\nBerger explores important questions, such as:\r\n\r\nWhy aren&#x2019;t we nurturing kids&#x2019; natural ability to question - and what can parents and schools do about that?\r\n\r\nSince questioning is a starting point for innovation, how might companies and business leaders begin to encourage and exploit it?\r\n\r\nAnd most important, how can each of us reignite that questioning spark - and use inquiry as a powerful means to rethink and reinvent our lives?\r\n\r\nA More Beautiful Question outlines a practical Why/What If/How system of inquiry that can guide you through the process of innovative questioning - helping you find imaginative, powerful answers to your own &quot;beautiful questions&quot;.\r\n\r\nxx","last_updated":"2017-09-30T12:01:46.112Z","parsed":{"xt":"urn:btih:9b352e1a2ca1ee36ecd90e590121568938121ff0","dn":"A More Beautiful Question_ The Power of Inquiry to Spark Breakth","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9b352e1a2ca1ee36ecd90e590121568938121ff0","infoHashBuffer":{"type":"Buffer","data":[155,53,46,26,44,161,238,54,236,217,14,89,1,33,86,137,56,18,31,240]},"name":"A More Beautiful Question_ The Power of Inquiry to Spark Breakth","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}