{"title":"The New Anti-Catholicism: The Last Acceptable Prejudice","magnet":"magnet:?xt=urn:btih:9c3de7c34a1a194e83df46af8fe838611a127ebb&dn=The+New+Anti-Catholicism%3A+The+Last+Acceptable+Prejudice&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Mousebelt","categoryP":"other","categoryS":"e_books","size":"8310505","seeders":"24","leechers":"7","description":"Anti-Catholicism has a long history in America. And as Philip Jenkins argues in The New Anti-Catholicism, this virulent strain of hatred--once thought dead--is alive and well in our nation, but few people seem to notice, or care. \r\nA statement that is seen as racist, misogynistic, anti-Semitic, or homophobic can haunt a speaker for years, writes Jenkins, but it is still possible to make hostile and vituperative public statements about Roman Catholicism without fear of serious repercussions. Jenkins shines a light on anti-Catholic sentiment in American society and illuminates its causes, looking closely at gay and feminist anti-Catholicism, anti-Catholic rhetoric and imagery in the media, and the anti-Catholicism of the academic world. For newspapers and newsmagazines, for television news and in movies, for major book publishers, the Catholic Church has come to provide a grossly stereotyped public villain. Catholic opinions, doctrines, and individual leaders are frequently the butt of harsh satire. Indeed, the notion that the church is a deadly enemy of women, the idea of Catholic misogyny, is commonly accepted in the news media and in popular culture, says Jenkins. And the recent pedophile priest scandal, he shows, has revived many ancient anti-Catholic stereotypes.\r\nIt was said that with the election of John F. Kennedy, anti-Catholicism in America was dead. This provocative new book corrects that illusion, drawing attention to this important issue","last_updated":"2017-06-15T12:03:43.198Z","parsed":{"xt":"urn:btih:9c3de7c34a1a194e83df46af8fe838611a127ebb","dn":"The New Anti-Catholicism: The Last Acceptable Prejudice","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9c3de7c34a1a194e83df46af8fe838611a127ebb","infoHashBuffer":{"type":"Buffer","data":[156,61,231,195,74,26,25,78,131,223,70,175,143,232,56,97,26,18,126,187]},"name":"The New Anti-Catholicism: The Last Acceptable Prejudice","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}