{"title":"\nThe Measure of the Moon by Lisa Preston EPUB","magnet":"magnet:?xt=urn:btih:9d1360dd1ed6a94b205c3dc575788edce7b6459d&dn=The+Measure+of+the+Moon+by+Lisa+Preston+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"485301","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Measure of the Moon by Lisa Preston EPUB\r\n\r\n&quot;If you ever say anything to anyone, they all die.&quot;\r\n\r\nWhen eight-year-old Greer Donner falls off his horse in the Washington wilderness, he braces himself to face the long hike home alone. But screams pierce the darkness, and he stumbles upon a dead-end road where a man is beating a woman - nearly to death. In a moment of courage, he stops the assault, but he&apos;s left to face the man, who turns his wrath into an ominous threat: if the boy ever reveals what he has seen, his family will pay the ultimate price. The secret Greer now carries begins his emotional unraveling.\r\n\r\nIn Seattle, Gillian Trett is a photographer with a troubled marriage and a childhood she&apos;s trying to forget. Domestic tension mounts when her husband&apos;s stepsister arrives. Desperate for a distraction, and a way to advance her career, Gillian throws herself into uncovering the history behind an old man&apos;s Holocaust photo of boys in a forest. The mysterious children and the truth behind the scene haunt her - she can&apos;t let go of the image, or of her own shadowed past.\r\n\r\nThen a horrifying revelation entangles Gillian&apos;s path with young Greer&apos;s. The boy and the woman, separated by a generation and 100 miles, each confront the terrible power of harbored secrets - not only to eclipse the truth but also to illuminate the dark, unknown dimensions of their loved ones and themselves.\r\n\r\nxx","last_updated":"2017-10-22T12:01:39.631Z","parsed":{"xt":"urn:btih:9d1360dd1ed6a94b205c3dc575788edce7b6459d","dn":"The Measure of the Moon by Lisa Preston EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9d1360dd1ed6a94b205c3dc575788edce7b6459d","infoHashBuffer":{"type":"Buffer","data":[157,19,96,221,30,214,169,75,32,92,61,197,117,120,142,220,231,182,69,157]},"name":"The Measure of the Moon by Lisa Preston EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}