{"title":"Germany's Third Empire","magnet":"magnet:?xt=urn:btih:9e5d2b626601a2bcb5e77b9fb201a614e355523d&dn=Germany%27s+Third+Empire&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"1231196","seeders":"13","leechers":"0","description":"Germany&apos;s Third Empire - Arthur Moeller van den Bruck [epub]\r\n\r\nWritten in 1923, when Germany was in the throes of revolutionary demands from both the Left and the Right, Moeller van den Bruck envisioned a Germany that was radical, traditional and nationalistic.\r\n\r\nAngered by the harsh conditions imposed by the Treaty of Versailles which ended the First World War, and frustrated by the types of reforms being called for in the Weimar Republic, he examines all of the major political doctrines of his day and finds them wanting. Instead, he calls for a return to empire - not the empire of the Kaiser or the Holy Roman Empire, but an empire of all German-speaking peoples, with a social hierarchy based upon strong communal values and German traditions which nurture, rather than belittle, strong individuals.\r\n\r\nAlthough van den Bruck was not a supporter of the National Socialists, they ended up adopting his term Das dritte Reich for the state they intended to build. With an original Foreword and Bibliography compiled by French &quot;New Right&quot; founder Alain de Benoist, who explains the book&apos;s continuing relevancy, this edition makes one of the most important works of Germany&apos;s Conservative Revolution available again for the English-speaking world.\r\n\r\nThis edition is a revised version of the condensed edition first published in 1934. Moeller van den Bruck (1876-1925) was primarily a man of letters who translated all of Dostoevsky&apos;s works into German for the first time, as well as an advocate of German nationalism, authoring an eight-volume history of great figures from German history. He served as a soldier in the First World War, and later as a press officer in the Foreign Ministry.\r\n\r\nPaperback: 254 pages\r\nPublisher: Arktos Media Ltd; 3rd edition (May 15, 2012)","last_updated":"2017-08-30T12:01:20.769Z","parsed":{"xt":"urn:btih:9e5d2b626601a2bcb5e77b9fb201a614e355523d","dn":"Germany's Third Empire","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9e5d2b626601a2bcb5e77b9fb201a614e355523d","infoHashBuffer":{"type":"Buffer","data":[158,93,43,98,102,1,162,188,181,231,123,159,178,1,166,20,227,85,82,61]},"name":"Germany's Third Empire","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}