{"title":"There Is Life After College by Jeffrey J. Selingo EPUB","magnet":"magnet:?xt=urn:btih:9ef81717f7c4a9d3a278272b10a6592d22438ae0&dn=There+Is+Life+After+College+by+Jeffrey+J.+Selingo+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Erikson69","categoryP":"other","categoryS":"e_books","size":"643473","seeders":"42","leechers":"9","description":"xx\r\n\r\nThere Is Life After College by Jeffrey J. Selingo EPUB\r\n\r\nFrom the best-selling author of College Unbound comes a hopeful, inspiring blueprint to help alleviate parents&apos; anxiety and prepare their college-educated child to successfully land a good job after graduation.\r\n\r\nSaddled with thousands of dollars of debt, today&apos;s college students are graduating into an uncertain job market that is leaving them financially dependent on their parents for years to come - a reality that has left moms and dads wondering: What did I pay all that money for?\r\n\r\nThere Is Life After College offers students, parents, and even recent graduates the practical advice and insight they need to jump-start their careers. Education expert Jeffrey Selingo answers key questions - why is the transition to postcollege life so difficult for many recent graduates? How can graduates market themselves to employers that are reluctant to provide on-the-job training? What can institutions and individuals do to end the current educational and economic stalemate? - and offers a practical step-by-step plan every young professional can follow. From the end of high school through college graduation, he lays out exactly what students need to do to acquire the skills companies want.\r\n\r\nFull of tips, advice, and insight, this wise, practical guide will help all students, no matter their majors or degrees, find real employment - and give their parents some peace of mind.\r\n\r\nxx","last_updated":"2017-12-09T12:07:05.712Z","parsed":{"xt":"urn:btih:9ef81717f7c4a9d3a278272b10a6592d22438ae0","dn":"There Is Life After College by Jeffrey J. Selingo EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9ef81717f7c4a9d3a278272b10a6592d22438ae0","infoHashBuffer":{"type":"Buffer","data":[158,248,23,23,247,196,169,211,162,120,39,43,16,166,89,45,34,67,138,224]},"name":"There Is Life After College by Jeffrey J. Selingo EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}