{"title":"The Atheist Muslim: A Journey from Religion to Reason - Ali A. R","magnet":"magnet:?xt=urn:btih:9f33a9444be777dc9f586508554fb6e5f4e12fd4&dn=The+Atheist+Muslim%3A+A+Journey+from+Religion+to+Reason+-+Ali+A.+R&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"onh4","categoryP":"other","categoryS":"e_books","size":"1090493","seeders":"15","leechers":"4","description":"The Atheist Muslim: A Journey from Religion to Reason - Ali A. Rizvi epub/mobi\r\n\r\nIn much of the Muslim world, religion is the central foundation upon which family, community, morality, and identity are built. The inextricable embedment of religion in Muslim culture has forced a new generation of non-believing Muslims to face the heavy costs of abandoning their parents&apos; religion: disowned by their families, marginalized from their communities, imprisoned, or even sentenced to death by their governments. Struggling to reconcile the Muslim society he was living in as a scientist and physician and the religion he was being raised in, Ali A. Rizvi eventually loses his faith. Discovering that he is not alone in his beliefs, he moves to North America and promises to use his new freedom of speech to represent the voices that are usually quashed before reaching the mainstream media - the Atheist Muslim. In The Atheist Muslim, we follow Rizvi as he finds himself caught between two narrative voices he cannot relate to: extreme Islam and anti-Muslim bigotry in a post-9/11 world. The Atheist Muslim recounts the journey that allows Rizvi to criticise Islam - as one should be able to criticize any set of ideas - without demonising his entire people. Emotionally and intellectually compelling, his personal story outlines the challenges of modern Islam and the factors that could help lead it toward a substantive, progressive reformation","last_updated":"2017-05-27T08:52:57.234Z","parsed":{"xt":"urn:btih:9f33a9444be777dc9f586508554fb6e5f4e12fd4","dn":"The Atheist Muslim: A Journey from Religion to Reason - Ali A. R","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9f33a9444be777dc9f586508554fb6e5f4e12fd4","infoHashBuffer":{"type":"Buffer","data":[159,51,169,68,75,231,119,220,159,88,101,8,85,79,182,229,244,225,47,212]},"name":"The Atheist Muslim: A Journey from Religion to Reason - Ali A. R","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}