{"title":"Crash Override_ How Gamergate (Nearly) Destroyed My Life, and Ho","magnet":"magnet:?xt=urn:btih:9f75c98eafdf91418d55cd71e2c52000f962fd29&dn=Crash+Override_+How+Gamergate+%28Nearly%29+Destroyed+My+Life%2C+and+Ho&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14901397","seeders":"0","leechers":"0","description":"xx\r\n\r\nCrash Override_ How Gamergate (Nearly) Destroyed My Life, and How We Can Win the Fight Against Online Hate by Zoe Quinn ePUB eBOOK-ZAK\r\n\r\nYou&apos;ve heard the stories about the dark side of the Internet - hackers, #gamergate, anonymous mobs attacking an unlucky victim, and revenge porn - but they remain just that: stories. Surely these things would never happen to you.\r\n\r\nZoe Quinn used to feel the same way. She is a video game developer whose ex-boyfriend published a crazed blog post cobbled together from private information, half truths, and outright fictions along with a rallying cry to the online hordes to go after her. They answered in the form of a so-called movement known as #gamergate - they hacked her accounts; stole nude photos of her; harassed her family, friends, and colleagues; and threatened to rape and murder her. But instead of shrinking into silence as the online mobs wanted her to, she raised her voice and spoke out against this vicious online culture and for making the Internet a safer place for everyone.\r\n\r\nIn the years since #gamergate, Quinn has helped thousands of people with her advocacy and online-abuse crisis resource Crash Override Network. From locking down victims&apos; personal accounts to working with tech companies and lawmakers to inform policy, she has firsthand knowledge about every angle of online abuse, what powerful institutions are (and aren&apos;t) doing about it, and how we can protect our digital spaces and selves.\r\n\r\nCrash Override offers an up-close look inside the controversy, threats, and social and cultural battles that started in the far corners of the Internet and have since permeated our online lives. Through her story - as target and as activist - Quinn provides a human look at the ways the Internet impacts our lives and culture along with practical advice for keeping yourself and others safe online.\r\n\r\nxx","last_updated":"2017-09-17T12:04:09.148Z","parsed":{"xt":"urn:btih:9f75c98eafdf91418d55cd71e2c52000f962fd29","dn":"Crash Override_ How Gamergate (Nearly) Destroyed My Life, and Ho","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9f75c98eafdf91418d55cd71e2c52000f962fd29","infoHashBuffer":{"type":"Buffer","data":[159,117,201,142,175,223,145,65,141,85,205,113,226,197,32,0,249,98,253,41]},"name":"Crash Override_ How Gamergate (Nearly) Destroyed My Life, and Ho","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}