{"title":"Claire Dederer - Love and Trouble 2017 RETAiL ePUB eBOOK-DiSTRiB","magnet":"magnet:?xt=urn:btih:9fac81cbc1d2a0e62a7b9b4907eb326045460b0b&dn=Claire+Dederer+-+Love+and+Trouble+2017+RETAiL+ePUB+eBOOK-DiSTRiB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3836080","seeders":"0","leechers":"0","description":"xx\r\n\r\nClaire Dederer - Love and Trouble 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the New York Times best-selling author of Poser: My Life in Twenty-Three Yoga Poses, a ferocious, sexy, hilarious memoir about going off the rails at midlife and trying to reconcile the girl she was with the woman she has become.\r\n\r\nClaire Dederer is a happily married mother of two, ages nine and 12, when she suddenly finds herself totally despondent and, simultaneously, suffering through a kind of erotic reawakening. This exuberant memoir shifts between her present experience as a middle-aged mom in the grip of mysterious new hungers and herself as a teenager - when she last experienced life with such heightened sensitivity and longing.\r\n\r\nFrom her hilarious chapter titles (&quot;How to Have Sex with Your Husband of Seventeen Years&quot;) to her subjects - from the boyfriend she dumped at 14 the moment she learned how to give herself an orgasm, to the girls who ruled her elite private school (&quot;when I left Oberlin I thought I had done with them forever, but it turned out...they also edited all the newspapers and magazines, and wrote all the books&quot;), to raising a teenage daughter herself - Dederer writes with an electrifying blend of wry wit and raw honesty. She exposes herself utterly, and in doing so captures something universal about the experience of being a woman, a daughter, a wife.\r\n\r\nxx","last_updated":"2017-08-17T12:00:24.153Z","parsed":{"xt":"urn:btih:9fac81cbc1d2a0e62a7b9b4907eb326045460b0b","dn":"Claire Dederer - Love and Trouble 2017 RETAiL ePUB eBOOK-DiSTRiB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"9fac81cbc1d2a0e62a7b9b4907eb326045460b0b","infoHashBuffer":{"type":"Buffer","data":[159,172,129,203,193,210,160,230,42,123,155,73,7,235,50,96,69,70,11,11]},"name":"Claire Dederer - Love and Trouble 2017 RETAiL ePUB eBOOK-DiSTRiB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}