{"title":"\nRussia at War.Werth","magnet":"magnet:?xt=urn:btih:a011577035dcfbfa79d9c5a3702f0f6d9afe17e2&dn=Russia+at+War.Werth&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xico222","categoryP":"other","categoryS":"e_books","size":"4665477","seeders":"1","leechers":"0","description":"Russia at war.epub\r\n \r\n\r\nIn 1941, Russian-born British journalist Alexander Werth observed the unfolding of the Soviet-German conflict with his own eyes. What followed was the widely acclaimed book, Russia at War, first printed in 1964. At once a history of facts, a collection of interviews, and a document of the human condition, Russia at War is a stunning, modern classic that chronicles the savagery and struggles on Russian soil during the most incredible military conflict in modern history.\r\n\r\nAs a behind-the-scenes eyewitness to the pivotal, shattering events as they occurred, Werth chronicles with vivid detail the hardships of everyday citizens, massive military operations, and the political movements toward diplomacy as the world tried to reckon with what they had created. Despite its sheer historical scope, Werth tells the story of a country at war in startlingly human terms, drawing from his daily interviews and conversations with generals, soldiers, peasants, and other working class civilians. The result is a unique and expansive work with immeasurable breadth and depth, built on lucid and engaging prose, that captures every aspect of a terrible moment in human history.\r\n\r\nNow newly updated with a foreword by Soviet historian Nicolas Werth, the son of Alexander Werth, this new edition of Russia at War continues to be indispensable World War II journalism and the definitive historical authority on the Soviet-German war","last_updated":"2017-09-26T12:02:37.559Z","parsed":{"xt":"urn:btih:a011577035dcfbfa79d9c5a3702f0f6d9afe17e2","dn":"Russia at War.Werth","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a011577035dcfbfa79d9c5a3702f0f6d9afe17e2","infoHashBuffer":{"type":"Buffer","data":[160,17,87,112,53,220,251,250,121,217,197,163,112,47,15,109,154,254,23,226]},"name":"Russia at War.Werth","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}