{"title":"Carole Bayer Sager - Theyre Playing Our Song 2016 RETAiL ePUB eB","magnet":"magnet:?xt=urn:btih:a0b90343394c864605c2c17f340d91047db1a99d&dn=Carole+Bayer+Sager+-+Theyre+Playing+Our+Song+2016+RETAiL+ePUB+eB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17055352","seeders":"8","leechers":"13","description":"Carole Bayer Sager - Theyre Playing Our Song 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nGrammy and Academy Award-winning songwriter Carole Bayer Sager shares the remarkably frank and darkly funny story of her life in and out of the recording studio, from her fascinating (and sometimes calamitous) relationships to her collaborations with some of the greatest composers and musical artists of our time.\r\n\r\nFor five decades Carole Bayer Sager has been among the most admired and successful songwriters at work, responsible for her lyrical contributions to some of the most popular songs in the English language, including &quot;Nobody Does It Better&quot;, &quot;A Groovy Kind of Love&quot;, &quot;Don&apos;t Cry Out Loud&quot;, and the theme from the movie Arthur, &quot;The Best That You Can Do&quot; (about getting lost between the moon and New York City).\r\n\r\nShe has collaborated with (and written for) a dizzying number of stars, including Peter Allen, Ray Charles, Celine Dion, Bob Dylan, Neil Diamond, Clint Eastwood, Kenny &quot;Babyface&quot; Edmonds, Aretha Franklin, Whitney Houston, Michael Jackson, Carole King, Melissa Manchester, Reba McEntire, Bette Midler, Dolly Parton, Carly Simon, Frank Sinatra, and Barbra Streisand.\r\n\r\nHer relationship with composer Marvin Hamlisch was the basis of the long-running hit musical They&apos;re Playing Our Song, for which she wrote the lyrics. And her work with composer Burt Bacharach, to whom she was also married for 10 years, produced pop standards such as &quot;On My Own&quot; and &quot;That&apos;s What Friends Are For&quot; (inspired by her friendship with Elizabeth Taylor), which raised over $2 million for AIDS research.\r\n\r\nBut while her professional life was filled with success and fascinating people, her personal life was far more difficult and dramatic. In this memoir Carole Bayer Sager tells the surprisingly frank and darkly humorous story of a woman whose sometimes crippling fears and devastating relationships inspired many of the songs she would ultimately write.\r\n\r\nThey&apos;re Playing Our Song will fascinate anyone interested in the craft of songwriting and the joy of collaboration, but Carole Bayer Sager&apos;s memoir is also a deeply personal account of how love and heartbreak made her the woman - and the writer - she is","last_updated":"2017-06-15T12:01:36.966Z","parsed":{"xt":"urn:btih:a0b90343394c864605c2c17f340d91047db1a99d","dn":"Carole Bayer Sager - Theyre Playing Our Song 2016 RETAiL ePUB eB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a0b90343394c864605c2c17f340d91047db1a99d","infoHashBuffer":{"type":"Buffer","data":[160,185,3,67,57,76,134,70,5,194,193,127,52,13,145,4,125,177,169,157]},"name":"Carole Bayer Sager - Theyre Playing Our Song 2016 RETAiL ePUB eB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}