{"title":"The Jesus Cow_ A Novel by Michael Perry ePUB MOBI eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:a0f7df57695a975ba814e2c40954a809d63d976e&dn=The+Jesus+Cow_+A+Novel+by+Michael+Perry+ePUB+MOBI+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"nasserddine","categoryP":"other","categoryS":"e_books","size":"2888815","seeders":"22","leechers":"6","description":"xx\r\n\r\nThe Jesus Cow_ A Novel by Michael Perry ePUB MOBI eBOOK-ZAK\r\n\r\nNew York Times best-selling humorist Michael Perry makes his fiction debut with this hilarious and big-hearted tale, a comic yet sincere exploration of faith and the foibles of modern life that blends the barbed charm of Garrison Keillor, the irreverent humor of Christopher Moore, and the audacious insight of Chuck Klosterman.\r\n\r\nLife is suddenly full of drama for low-key Harley Jackson: A woman in a big red pickup has stolen his bachelor&apos;s heart, a Hummer-driving predatory developer is threatening to pave the last vestiges of his family farm, and inside his barn is a calf bearing the image of Jesus Christ. His best friend Billy, a giant of a man who shares his trailer house with a herd of cats and tries to pass off country music lyrics as philosophy, urges him to avoid the woman, fight the developer, and get rich off the calf. But Harley takes the opposite tack, hoping to avoid what his devout, dearly departed mother would have called &quot;a scene&quot;.\r\n\r\nThen the secret gets out - right through the barn door, and Harley&apos;s &quot;miracle&quot; goes viral. Within hours pilgrims, grifters, and the media have descended on his quiet patch of Swivel, Wisconsin, looking for a glimpse (and a percentage) of the calf. Does Harley hide the famous, possibly holy, calf and risk a riot, or give the people what they want - and raise enough money to keep his land - and just possibly, win the woman and her big red pickup truck?\r\n\r\nHarley goes all in, cutting a deal with a major Hollywood agent that transforms his little farm into an international spiritual theme park - think Lourdes, only with cheese curds and t-shirts. Soon, Harley has lots of money... and more trouble than he ever dreamed.\r\n\r\nxx","last_updated":"2017-09-03T12:03:50.453Z","parsed":{"xt":"urn:btih:a0f7df57695a975ba814e2c40954a809d63d976e","dn":"The Jesus Cow_ A Novel by Michael Perry ePUB MOBI eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a0f7df57695a975ba814e2c40954a809d63d976e","infoHashBuffer":{"type":"Buffer","data":[160,247,223,87,105,90,151,91,168,20,226,196,9,84,168,9,214,61,151,110]},"name":"The Jesus Cow_ A Novel by Michael Perry ePUB MOBI eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}