{"title":"\nA Piece of the World_ A Novel by Christina Baker Kline ePUB eBOO","magnet":"magnet:?xt=urn:btih:a1889783c93b7c283cc1488d42e4a338451db419&dn=A+Piece+of+the+World_+A+Novel+by+Christina+Baker+Kline+ePUB+eBOO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3313041","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Piece of the World_ A Novel by Christina Baker Kline ePUB eBOOK-ZAK\r\n\r\nFrom the New York Times best-selling author of the smash best seller Orphan Train, a stunning and atmospheric novel of friendship, passion, and art, inspired by Andrew Wyeth&apos;s mysterious and iconic painting Christina&apos;s World.\r\n\r\n&quot;Later he told me that he&apos;d been afraid to show me the painting. He thought I wouldn&apos;t like the way he portrayed me: dragging myself across the field, fingers clutching dirt, my legs twisted behind. The arid moonscape of wheatgrass and timothy. That dilapidated house in the distance, looming up like a secret that won&apos;t stay hidden.&quot;\r\n\r\nTo Christina Olson, the entire world was her family&apos;s remote farm in the small coastal town of Cushing, Maine. Born in the home her family had lived in for generations, and increasingly incapacitated by illness, Christina seemed destined for a small life. Instead, for more than 20 years, she was host to and inspiration for the artist Andrew Wyeth and became the subject of one of the best known American paintings of the 20th century.\r\n\r\nAs she did in her beloved smash best seller Orphan Train, Christina Baker Kline interweaves fact and fiction in a powerful novel that illuminates a little-known part of America&apos;s history. Bringing into focus the flesh-and-blood woman behind the portrait, she vividly imagines the life of a woman with a complicated relationship to her family and her past and a special bond with one of our greatest modern artists.\r\n\r\nTold in evocative and lucid prose, A Piece of the World is a story about the burdens and blessings of family history and how artist and muse can come together to forge a new and timeless legacy.\r\n\r\nxx","last_updated":"2017-10-03T12:01:00.073Z","parsed":{"xt":"urn:btih:a1889783c93b7c283cc1488d42e4a338451db419","dn":"A Piece of the World_ A Novel by Christina Baker Kline ePUB eBOO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a1889783c93b7c283cc1488d42e4a338451db419","infoHashBuffer":{"type":"Buffer","data":[161,136,151,131,201,59,124,40,60,193,72,141,66,228,163,56,69,29,180,25]},"name":"A Piece of the World_ A Novel by Christina Baker Kline ePUB eBOO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}