{"title":"Elizabeth Lesser - Marrow 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:a1edf490ce22aa2af924fd844a60b0204002032b&dn=Elizabeth+Lesser+-+Marrow+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3051077","seeders":"11","leechers":"6","description":"Elizabeth Lesser - Marrow 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe author of the New York Times best seller Broken Open returns with a visceral and profound memoir of two sisters who, in the face of a bone marrow transplant - one the donor and one the recipient - begin a quest for acceptance, authenticity, and, most of all, love.\r\n\r\nA mesmerizing and courageous memoir: the story of two sisters uncovering the depth of their love through the life-and-death experience of a bone marrow transplant.\r\nThroughout her life Elizabeth Lesser has sought understanding about what it means to be true to yourself and, at the same time, truly connected to the ones you love. But when her sister, Maggie, needs a bone marrow transplant to save her life, and Lesser learns that she is the perfect match, she faces a far more immediate and complex question about what it really means to love - honestly, generously, and authentically.\r\n\r\nHoping to give Maggie the best chance possible for a successful transplant, the sisters dig deep into the marrow of their relationship to clear a path to unconditional acceptance. They leave the bone marrow transplant up to the doctors but take on what Lesser calls a &quot;soul marrow transplant&quot;, examining their family history, having difficult conversations, examining old assumptions, and offering forgiveness until all that is left is love for each other&apos;s true selves. Their process - before, during, and after the transplant - encourages them to take risks of authenticity in other aspects their lives.\r\n\r\nBut life does not follow the storylines we plan for it. Maggie&apos;s body is ultimately too weak to fight the relentless illness. As she and Lesser prepare for the inevitable, they grow ever closer, and their shared blood cells become a symbol of the enduring bond they share.\r\n\r\nTold with suspense and humor, Marrow is joyous and heartbreaking, incandescent and profound. The story reveals how even our most difficult experiences can offer unexpected spiritual growth. Reflecting on the multifaceted nature of love - love of other, love of self, love of the world - Marrow is an unflinching and beautiful memoir about getting to the very centers of ourselves","last_updated":"2017-06-05T12:00:49.612Z","parsed":{"xt":"urn:btih:a1edf490ce22aa2af924fd844a60b0204002032b","dn":"Elizabeth Lesser - Marrow 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a1edf490ce22aa2af924fd844a60b0204002032b","infoHashBuffer":{"type":"Buffer","data":[161,237,244,144,206,34,170,42,249,36,253,132,74,96,176,32,64,2,3,43]},"name":"Elizabeth Lesser - Marrow 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}