{"title":"Gillmeister Rename Expert v5.15.3","magnet":"magnet:?xt=urn:btih:a200fcd4fe3cb967480d04044215f60f17c437d5&dn=Gillmeister+Rename+Expert+v5.15.3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"13762320","seeders":"0","leechers":"0","description":"Gillmeister Rename Expert v5.15.3\n\nQuickly and easily rename files and folders\n\nRename Expert\nWith Rename Expert you can quickly and easily rename files and folders. The program offers a variety of innovative features to create consistent and, above all, meaningful names. With a few simple clicks, you can number files and folders, shorten long file names, rename file extensions and much more.\n\nRename Expert supports metadata such as EXIF, IPTC, and ID3. By using metadata, you can organize, sort, and rename files automatically. Despite its diversity of functions the program is very easy to use. With Rename Expert, meaningless file names are a thing of the past!\n\nWith Rename Expert you can:\n\nrename thousands of files and folders at once\nre-organize files (move or copy them into a new folder structure)\ngenerate file names from metadata (for example, using the photo-shooting date or MP3 information)\nautomate the renaming by using the command line version of Rename Expert\nrename files and folders by using CSV files\nKey features\n\nSimultaneously rename folders along with subfolders and files\nAllows the batch renaming of any number of files and folders in one go (incl. network support).\n\nFilter and sort functions\nThe extensive filter and sort functions can also be used for metadata, allowing the inclusion and exclusion of files and folders.\n\nUse CSV files for naming\nCSV files - for example, exported from Excel, can be used flexibly for naming files and folders. The old and new name can be composed of several columns.\n\nMove and rename files in one step\nIn addition to renaming, files can also be moved or copyied into subfolders whose naming is based on metadata (e.g., picture taken date, creation date, etc.).\n\nMany special functions\nRename Expert offers a variety of specialized functions, such as adding the checksum (MD5, SHA, CRC32) of the file contents to the file name, the encryption of folder and file names, or the possibility of adding random characters to file names as well as to rename files completely random.\n\nReal-time preview of the new file names\nAll changes are shown in real-time and are checked for errors (e.g., duplicate name) to avoid possible conflicts.\n\nRename files using numerous metadata\nMetadata (EXIF, IPTC, ID3, etc.) can be used for the naming of files (e.g., for images and audio files).\n\nNumbering of folders and files\nFiles and folders can be numbered sequentially or in random order. An existing numbering can be easily overwritten or adjusted.\n\nCreate file names automatically from file contents\nWith Rename Expert you can automatically generate file names from the file contents of documents (e.g., XML, HTML, or log files).\n\nRename file extensions\nWith Rename Expert, file extensions can be arbitrarily changed (e.g., jpeg to jpg). They can be added or removed, and their case is individually customizable.\n\nShorten long file names / Edit file paths with more than 260 characters\nWith Rename Expert you can rename files or folders that exceed a path length of 260 characters, and therefore can no longer be edited using Windows Explorer.\n\nSave rename-settings as profile\nAction lists allow a combination of any different number of actions and can be saved as profile for future reuse.\n\nOfficial Website: http://www.rename-expert.com/","last_updated":"2017-12-09T12:05:48.951Z","parsed":{"xt":"urn:btih:a200fcd4fe3cb967480d04044215f60f17c437d5","dn":"Gillmeister Rename Expert v5.15.3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a200fcd4fe3cb967480d04044215f60f17c437d5","infoHashBuffer":{"type":"Buffer","data":[162,0,252,212,254,60,185,103,72,13,4,4,66,21,246,15,23,196,55,213]},"name":"Gillmeister Rename Expert v5.15.3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}