{"title":"\nJohn Quincy Adams_ Militant Spirit by James Traub ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:a25cc8333df4211c2ac8607c143caf2671ed1d67&dn=John+Quincy+Adams_+Militant+Spirit+by+James+Traub+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"774249","seeders":"1","leechers":"1","description":"xx\r\n\r\nJohn Quincy Adams_ Militant Spirit by James Traub ePUB eBOOK-ZAK\r\n\r\nJohn Quincy Adams was the last of his kind - a Puritan from the age of the Founders who despised party and compromise yet dedicated himself to politics and government. The son of John Adams, he was a brilliant ambassador and secretary of state, a frustrated president at a historic turning point in American politics, and a dedicated congressman who literally died in office - at the age of 80, in the House of Representatives, in the midst of an impassioned political debate.\r\n\r\nIn John Quincy Adams, scholar and journalist James Traub draws on Adams&apos; diary, letters, and writings to evoke a diplomat and president whose ideas remain with us today. Adams was a fierce nationalist who, as secretary of state, championed the idea of American expansion. Yet at the same time, he warned against moralistic and militaristic policies abroad - a chastening wisdom that makes him the father of what we now call &quot;realism&quot; in foreign policy. As president he was a bold proponent of the idea of activist government later brought to fruition by Abraham Lincoln and others.\r\n\r\nAdams&apos; numerous achievements - and equally numerous failures - stand as testaments to his unwavering moral convictions. A man who refused to take refuge in the politically prudent course of action, Adams was repudiated by his own Federalist party and, as president, by the nation that voted him out of office. And yet, in the final decade of his life, Adams regained the country&apos;s regard, and even reverence, for as a congressman he often stood alone against the forces of slavery, twice beating back motions of censure. John Quincy Adams tells the story of this brilliant, flinty, and unyielding man whose life exemplified political courage - a life against which each of us might measure our own.\r\n\r\nxx","last_updated":"2017-10-08T12:00:55.794Z","parsed":{"xt":"urn:btih:a25cc8333df4211c2ac8607c143caf2671ed1d67","dn":"John Quincy Adams_ Militant Spirit by James Traub ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a25cc8333df4211c2ac8607c143caf2671ed1d67","infoHashBuffer":{"type":"Buffer","data":[162,92,200,51,61,244,33,28,42,200,96,124,20,60,175,38,113,237,29,103]},"name":"John Quincy Adams_ Militant Spirit by James Traub ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}