{"title":"Tom Clavin - Dodge City 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:a282e943b8e58bedd8ce222b22c937bfaa8c5161&dn=Tom+Clavin+-+Dodge+City+2017+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11437386","seeders":"0","leechers":"0","description":"xx\r\n\r\nTom Clavin - Dodge City 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nDodge City, Kansas, is a place of legend. The town that started as a small military site exploded with the coming of the railroad, cattle drives, eager miners, settlers, and various entrepreneurs passing through to populate the expanding West. Before long Dodge City&apos;s streets were lined with saloons and brothels, and its populace was thick with gunmen, horse thieves, and desperadoes of every sort. By the 1870s Dodge City was known as the most violent and turbulent town in the West.\r\n\r\nEnter Wyatt Earp and Bat Masterson. Young and largely self-trained men, the lawmen led the effort that established frontier justice and the rule of law in the American West and did it in the wickedest place in the United States. When they moved on, Wyatt to Tombstone and Bat to Colorado, a tamed Dodge was left in the hands of Jim Masterson. But before long Wyatt and Bat, each having had a lawman brother killed, returned to that threatened Western Kansas town to team up to restore order again in what became known as the Dodge City War before riding off into the sunset.\r\n\r\nNumber-one New York Times best-selling author Tom Clavin&apos;s Dodge City tells the true story of their friendship, romances, gunfights, and adventures along with the remarkable cast of characters they encountered along the way (including Wild Bill Hickock, Jesse James, Doc Holliday, Buffalo Bill Cody, John Wesley Hardin, Billy the Kid, and Theodore Roosevelt) that has gone largely untold, lost in the haze of Hollywood films and Western fiction, until now.\r\n\r\nxx","last_updated":"2017-07-12T12:00:25.660Z","parsed":{"xt":"urn:btih:a282e943b8e58bedd8ce222b22c937bfaa8c5161","dn":"Tom Clavin - Dodge City 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a282e943b8e58bedd8ce222b22c937bfaa8c5161","infoHashBuffer":{"type":"Buffer","data":[162,130,233,67,184,229,139,237,216,206,34,43,34,201,55,191,170,140,81,97]},"name":"Tom Clavin - Dodge City 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}