{"title":"A Plague of Giants by Kevin Hearne EPUB","magnet":"magnet:?xt=urn:btih:a2b40acfe9ff1b2c4a8b0e4b992933d0b9a08d4f&dn=A+Plague+of+Giants+by+Kevin+Hearne+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"28710884","seeders":"0","leechers":"1","description":"xx\r\n\r\nA Plague of Giants by Kevin Hearne EPUB\r\n\r\nFrom the author of The Iron Druid Chronicles, a thrilling novel that kicks off a fantasy series with an entirely new mythology - complete with shape-shifting bards, fire-wielding giants, and children who can speak to astonishing beasts\r\n\r\nMother and warrior\r\n\r\nTallynd is a soldier who has already survived her toughest battle: losing her husband. But now she finds herself on the front lines of an invasion of giants intent on wiping out the entire kingdom, including Tallynd&apos;s two sons - all that she has left. The stakes have never been higher. If Tallynd fails, her boys may never become men.\r\n\r\nScholar and spy\r\n\r\nDervan is a historian who longs for a simple, quiet life. But he&apos;s drawn into intrigue when he&apos;s hired to record the tales of a mysterious bard who may be a spy or even an assassin for a rival kingdom. As the bard shares his fantastical stories, Dervan makes a shocking discovery: He may have a connection to the tales, one that will bring his own secrets to light.\r\n\r\nRebel and hero\r\n\r\nAbhi&apos;s family has always been hunters, but Abhi wants to choose a different life for himself. Embarking on a journey of self-discovery, Abhi soon learns that his destiny is far greater than he imagined: a powerful new magic thrust upon him may hold the key to defeating the giants once and for all - if it doesn&apos;t destroy him first.\r\n\r\nSet in a magical world of terror and wonder, this book is a deeply felt epic of courage and war, in which the fates of these characters intertwine - and where ordinary people become heroes, and their lives become legend.\r\n\r\nxx","last_updated":"2017-11-13T12:01:13.151Z","parsed":{"xt":"urn:btih:a2b40acfe9ff1b2c4a8b0e4b992933d0b9a08d4f","dn":"A Plague of Giants by Kevin Hearne EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a2b40acfe9ff1b2c4a8b0e4b992933d0b9a08d4f","infoHashBuffer":{"type":"Buffer","data":[162,180,10,207,233,255,27,44,74,139,14,75,153,41,51,208,185,160,141,79]},"name":"A Plague of Giants by Kevin Hearne EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}