{"title":"Nujeen Mustafa - Nujeen 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:a2dd1e2d5d40fe9bd63bef4fe5c4deaecd227fe5&dn=Nujeen+Mustafa+-+Nujeen+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4558124","seeders":"1","leechers":"3","description":"xx\r\n\r\nNujeen Mustafa - Nujeen 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nPrize-winning journalist and the coauthor of smash New York Times best seller I Am Malala, Christina Lamb now tells the inspiring true story of another remarkable young hero: Nujeen Mustafa, a teenager born with cerebral palsy whose harrowing journey from war-ravaged Syria to Germany in a wheelchair is a breathtaking tale of fortitude, grit, and hope that lends a face to the greatest humanitarian issue of our time: the Syrian refugee crisis.\r\n\r\nFor millions around the globe, 16-year-old Nujeen Mustafa embodies the best of the human spirit. Confined to a wheelchair because of her cerebral palsy and denied formal schooling in Syria because of her illness, Nujeen taught herself English by watching American soap operas. When her small town became the epicenter of the brutal fight between ISIS militants and US-backed Kurdish troops in 2014, she and her family were forced to flee.\r\n\r\nDespite her physical limitations, Nujeen embarked on the arduous trek to safety and a new life. The grueling 16-month odyssey by foot, boat, and bus took her across Turkey and the Mediterranean to Greece, through Macedonia to Serbia and Hungary, and finally to Germany. Yet in spite of the tremendous physical hardship she endured, Nujeen&apos;s extraordinary optimism never wavered. Refusing to give in to despair or see herself as a passive victim, she kept her head high. As she told a BBC reporter, &quot;You should fight to get what you want in this world.&quot;\r\n\r\nNujeen&apos;s positivity and resolve infuses this unforgettable story of one young woman determined to make a better life for herself. Told by acclaimed British foreign correspondent Christina Lamb, Nujeen is a unique and powerful memoir that gives voice to the Syrian refugee crisis, helping us to understand that the world must change - and offering the inspiration to make that change reality.\r\n\r\nxx","last_updated":"2017-07-28T12:00:44.412Z","parsed":{"xt":"urn:btih:a2dd1e2d5d40fe9bd63bef4fe5c4deaecd227fe5","dn":"Nujeen Mustafa - Nujeen 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a2dd1e2d5d40fe9bd63bef4fe5c4deaecd227fe5","infoHashBuffer":{"type":"Buffer","data":[162,221,30,45,93,64,254,155,214,59,239,79,229,196,222,174,205,34,127,229]},"name":"Nujeen Mustafa - Nujeen 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}