{"title":"Atmospheric Pressure Plasma for Surface Modification","magnet":"magnet:?xt=urn:btih:a35f05b456905490ebbe96c1599fc7894abd96dd&dn=Atmospheric+Pressure+Plasma+for+Surface+Modification&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"4038497","seeders":"13","leechers":"3","description":"Atmospheric Pressure Plasma for Surface Modification - Rory A. Wolf (Scrivener, 2013).pdf\r\n\r\nThis Book&#x2019;s focus and intent is to impart an understanding of the practical application of atmospheric plasma for the advancement of a wide range of current and emerging technologies. The primary key feature of this book is the introduction of over thirteen years of practical experimental evidence of successful surface modifications by atmospheric plasma methods. It offers a handbook-based approach for leveraging and optimizing atmospheric plasma technologies which are currently in commercial use. It also offers a complete treatment of both basic plasma physics and industrial plasma processing with the intention of becoming a primary reference for students and professionals. \r\n\r\nThe reader will learn the mechanisms which control and operate atmospheric plasma technologies and how these technologies can be leveraged to develop in-line continuous processing of a wide variety of substrates. Readers will gain an understanding of specific surface modification effects by atmospheric plasmas, and how to best characterize those modifications to optimize surface cleaning and functionalization for adhesion promotion. \r\n\r\nThe book also features a series of chapters written to address practical surface modification effects of atmospheric plasmas within specific application markets, and a commercially-focused assessment of those effects","last_updated":"2017-06-08T12:03:35.042Z","parsed":{"xt":"urn:btih:a35f05b456905490ebbe96c1599fc7894abd96dd","dn":"Atmospheric Pressure Plasma for Surface Modification","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a35f05b456905490ebbe96c1599fc7894abd96dd","infoHashBuffer":{"type":"Buffer","data":[163,95,5,180,86,144,84,144,235,190,150,193,89,159,199,137,74,189,150,221]},"name":"Atmospheric Pressure Plasma for Surface Modification","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}