{"title":"Quakeland_ On the Road to America's Next Devastating Earthquake ","magnet":"magnet:?xt=urn:btih:a3711f704e7bdab02b0a93b08427c0baeaf00ec5&dn=Quakeland_+On+the+Road+to+America%27s+Next+Devastating+Earthquake+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2803287","seeders":"2","leechers":"8","description":"xx\r\n\r\nQuakeland_ On the Road to America&apos;s Next Devastating Earthquake by Kathryn Miles ePUB eBOOK-ZAK\r\n\r\nA journey around the United States in search of the truth about the threat of earthquakes leads to spine-tingling discoveries, unnerving experts, and ultimately the kind of preparations that will actually help guide us through disasters. It&apos;s a road trip full of surprises.\r\n\r\nEarthquakes. You need to worry about them only if you&apos;re in San Francisco, right? Wrong. We have been making enormous changes to subterranean America, and Mother Earth, as always, has been making some of her own....\r\n\r\nThe consequences for our real estate, our civil engineering, and our communities will be huge because they will include earthquakes most of us do not expect and cannot imagine - at least not without reading Quakeland. Kathryn Miles descends into mines in the Northwest, dissects Mississippi levee engineering studies, uncovers the horrific risks of an earthquake in the Northeast, and interviews the seismologists, structual engineers, and emergency managers around the country who are addressing this ground-shaking threat.\r\n\r\nAs Miles relates, the era of human-induced earthquakes began in 1962 in Colorado after millions of gallons of chemical-weapon waste was pumped underground in the Rockies. More than 1500 quakes over the following seven years resulted. The Department of Energy plans to dump spent nuclear rods in the same way. Evidence of fracking&apos;s seismological impact continues to mount....\r\n\r\nHumans as well as fault lines built our &quot;quakeland&quot;.\r\n\r\nWhat will happen when Memphis, home of FedEx&apos;s 1.5-million-packages-a-day hub, goes offline as a result of an earthquake along the unstable Reelfoot Fault? FEMA has estimated that a modest 7.0 magnitude quake (20 of these happen per year around the world) along the Wasatch Fault under Salt Lake City would put a $33 billion dent in our economy. When the Fukushima reactor melted down, tens of thousands were displaced. If New York&apos;s Indian Point nuclear power plant blows, 10 million people will be displaced. How would that evacuation even begin?\r\n\r\nKathryn Miles&apos; tour of our land is as fascinating and frightening as it is irresistibly compelling.\r\n\r\nxx","last_updated":"2017-09-06T12:01:00.880Z","parsed":{"xt":"urn:btih:a3711f704e7bdab02b0a93b08427c0baeaf00ec5","dn":"Quakeland_ On the Road to America's Next Devastating Earthquake ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a3711f704e7bdab02b0a93b08427c0baeaf00ec5","infoHashBuffer":{"type":"Buffer","data":[163,113,31,112,78,123,218,176,43,10,147,176,132,39,192,186,234,240,14,197]},"name":"Quakeland_ On the Road to America's Next Devastating Earthquake ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}