{"title":"Jen Sincero - You Are a Badass at Making Money 2017 RETAiL ePUB ","magnet":"magnet:?xt=urn:btih:a379f66ddfc5f1d80159110a5764f65f75d2d560&dn=Jen+Sincero+-+You+Are+a+Badass+at+Making+Money+2017+RETAiL+ePUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2954061","seeders":"19","leechers":"8","description":"Jen Sincero - You Are a Badass at Making Money 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the number one New York Times best-selling author of You Are a Badass, an in-depth guide to making the kind of money you&apos;ve only ever dreamed of.\r\n\r\nYou Are a Badass at Making Money is a refreshingly frank and entertaining step-by-step guide to overcoming the fears and stumbling blocks that have kept financial success out of reach and to giving yourself the permission to make the kind of money you&apos;ve never made before. Drawing on her own experience of transforming herself - over just a few years - from a woman with tumbleweeds blowing through her bank account, subsisting solely on Taco Bell, to a woman who travels the world and stays in five-star luxury hotels, Jen knows all too well the layers of BS one can get wrapped up in when it comes to money as well as what it takes to dig your way out. You Are a Badass at Making Money goes in depth on how powerful thoughts shape our income potential and the ways in which our bank accounts are mirrors for our bugaboos about money. Written with the same inimitable sass and blunt practicality that made You Are a Badass an indomitable best seller, You Are a Badass at Making Money combines hilarious personal essays with life-changing bite-size concepts that anyone can employ to unlock earning potential and get real results","last_updated":"2017-06-05T12:00:58.219Z","parsed":{"xt":"urn:btih:a379f66ddfc5f1d80159110a5764f65f75d2d560","dn":"Jen Sincero - You Are a Badass at Making Money 2017 RETAiL ePUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a379f66ddfc5f1d80159110a5764f65f75d2d560","infoHashBuffer":{"type":"Buffer","data":[163,121,246,109,223,197,241,216,1,89,17,10,87,100,246,95,117,210,213,96]},"name":"Jen Sincero - You Are a Badass at Making Money 2017 RETAiL ePUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}