{"title":"\n[GirlsWay] Shyla Jennings, Abigail Mac, Serena Blair (VAMPIRES: ","magnet":"magnet:?xt=urn:btih:a4e10e2e981af1c1e863ce2d583cd1f079c01fb7&dn=%5BGirlsWay%5D+Shyla+Jennings%2C+Abigail+Mac%2C+Serena+Blair+%28VAMPIRES%3A+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Vikcy41","categoryP":"porn","categoryS":"hd___movies","size":"2287930927","seeders":"5","leechers":"3","description":"[GirlsWay] Shyla Jennings, Abigail Mac, Serena Blair (VAMPIRES: Part 3: Calling The Cavalry / 06.10.2017) [1080p]\r\n\r\nAfter two stepsisters move to Los Angeles in the wake of their father&apos;&apos;s untimely death, they cross paths with a coven of vampires when one them swipes right on the wrong dating profile. Sister Lucy (Abigail Mac) finds out her hookup Willow (Melissa Moore) is a vampire soon after they meet. She is seduced into an all-girl orgy with her date&apos;&apos;s whole family, and then slated for death. Lucy&apos;&apos;s date convinces the coven leader to spare Lucy&apos;&apos;s life and turn her into a vampire instead. Confused and afraid, Lucy runs home and begins to feel the effects of the turning. Her blind sister Ella (Shyla Jennings) tries to intervene. Lucy tells the whole strange story and her sister pledges to save her damned soul.\r\n\r\nThe following morning, Lucy wakes up to a call from a stranger (Serena Blair) who knows about the vampires. She strongly advises the sisters to leave the house for their own safety. They decide to heed her advice and accept her offer to pick them up. The stranger drives them to her safehouse from the undead, underneath a church, stocked with garlic and ammunition. She is a vampire hunter and tries to enlist them. Lucy is slow to trust the stranger but her sister implores her to get aboard. The stranger is a doctor and offers hope. It may be possible to reverse her condition. She can help.\r\n\r\nLucy submits to a medical exam and lets her naked body be inspected. The doctor reveals the only way Lucy can become human again is to eliminate leader of the coven. The sisters stick to their vow to save Lucy and begin formulating a plan. Serena gives them survival tools for their mission. She tells Lucy she has to prepare for tomorrow by feeding her energy to her now. She elaborates, and Lucy resists, but the blind sister slips her hand between Lucy&apos;&apos;s legs to make her more cooperative.\r\n\r\nSoon the threesome of lesbians are naked and sucking each other&apos;&apos;s hard nipples, full breasts and juicy pussies. Serena takes her time licking Lucy&apos;&apos;s meaty lips while the vampire gets face-fucked by her sister. Drained of all energy, Lucy eventually can&apos;&apos;t take it anymore, but Serena makes her keep going. And her sister pitches in to help. The lesbians form a chain of mouth to ass, licking and nibbling and making each other cum. Lucy sticks her finger in Serena&apos;&apos;s pussy and slowly extracts its juice. Her sister joins in. The threesome take turns riding each other&apos;&apos;s tongues and tribbing each other&apos;&apos;s pussies, cumming over and over again!\r\n <a href=\"\nhttp://ximagehost.org/img-59d710bc480ae.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59d710bc480ae.html</a>\r\n <a href=\"\nhttp://ximagehost.org/img-59d710afc5dba.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59d710afc5dba.html</a>","last_updated":"2017-10-06T12:10:51.372Z","parsed":{"xt":"urn:btih:a4e10e2e981af1c1e863ce2d583cd1f079c01fb7","dn":"[GirlsWay] Shyla Jennings, Abigail Mac, Serena Blair (VAMPIRES: ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a4e10e2e981af1c1e863ce2d583cd1f079c01fb7","infoHashBuffer":{"type":"Buffer","data":[164,225,14,46,152,26,241,193,232,99,206,45,88,60,209,240,121,192,31,183]},"name":"[GirlsWay] Shyla Jennings, Abigail Mac, Serena Blair (VAMPIRES: ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}