{"title":"Industrial Catalytic Processes for Fine and Specialty Chemicals","magnet":"magnet:?xt=urn:btih:a56dd072f2c949ec81714389fb0f09f056efe6a4&dn=Industrial+Catalytic+Processes+for+Fine+and+Specialty+Chemicals&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"42889017","seeders":"24","leechers":"1","description":"Industrial Catalytic Processes for Fine and Specialty Chemicals - Sunil S. Joshi, Vivek V. Ranade (Elsevier, 2016).pdf\r\n\r\nIndustrial Catalytic Processes for Fine and Specialty Chemicals provides a comprehensive methodology and state-of-the art toolbox for industrial catalysis. The book begins by introducing the reader to the interesting, challenging, and important field of catalysis and catalytic processes.\r\n\r\nThe fundamentals of catalysis and catalytic processes are fully covered before delving into the important industrial applications of catalysis and catalytic processes, with an emphasis on green and sustainable technologies. Several case studies illustrate new and sustainable ways of designing catalysts and catalytic processes.\r\n\r\nThe intended audience of the book includes researchers in academia and industry, as well as chemical engineers, process development chemists, and technologists working in chemical industries and industrial research laboratories.\r\n\r\n\r\n\r\nDiscusses the fundamentals of catalytic processes, catalyst preparation and characterization, and reaction engineering\r\nOutlines the homogeneous catalytic processes as they apply to specialty chemicals\r\nIntroduces industrial catalysis and catalytic processes for fine chemicals\r\nIncludes a number of case studies to demonstrate the various processes and methods for designing green catalysts","last_updated":"2017-06-07T12:04:41.294Z","parsed":{"xt":"urn:btih:a56dd072f2c949ec81714389fb0f09f056efe6a4","dn":"Industrial Catalytic Processes for Fine and Specialty Chemicals","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a56dd072f2c949ec81714389fb0f09f056efe6a4","infoHashBuffer":{"type":"Buffer","data":[165,109,208,114,242,201,73,236,129,113,67,137,251,15,9,240,86,239,230,164]},"name":"Industrial Catalytic Processes for Fine and Specialty Chemicals","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}