{"title":"SoftPerfect Research NetWorx v6.0.4","magnet":"magnet:?xt=urn:btih:a588c60669e93d05f9d7b099f22fdf928dac38fb&dn=SoftPerfect+Research+NetWorx+v6.0.4&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"LxByte","categoryP":"applications","categoryS":"windows","size":"8838845","seeders":"3","leechers":"2","description":"SoftPerfect Research NetWorx v6.0.4\r\n\r\nBefore anything else, if you&apos;re wandering why this needs a serial it&apos;s because it has turned into a commercial software......\r\n\r\nNetWorx is a simple, yet versatile and powerful tool that helps you objectively evaluate your bandwidth consumption situation. You can use it to collect bandwidth usage data and measure the speed of your Internet or any other network connections. NetWorx can help you identify possible sources of network problems, ensure that you do not exceed the bandwidth limits specified by your ISP, or track down suspicious network activity characteristic of Trojan horses and hacker attacks.\r\n\r\nThe program allows you to monitor all your network connections or just a specific network connection, such as Wireless or Mobile Broadband. The software also features an array of highly customisable visual and sound alerts. You can set it up to alert you when the network connection is down or when some suspicious activity &#x2014; such as unusually heavy data flow &#x2014; occurs. It can also automatically disconnect all dial-up connections and shut the system down.\r\n\r\nThe incoming and outgoing traffic is represented on a line chart and logged into a file, so that you can always view statistics about your daily, weekly and monthly bandwidth usage and dial-up duration. The reports can be exported to a variety of formats, such as HTML, MS Word and Excel, for further analysis.\r\n\r\nKey features\r\n\r\n    Clear graphic and/or numeric display.\r\n    Usage reports, exportable to a variety of file formats, including Excel, MS Word and HTML.\r\n    Close supervision of uploads and downloads.\r\n    Support of dial-up, ISDN, cable modems, ADSL, Ethernet cards, and more.\r\n    Network information and testing tools with advanced netstat that displays applications using your Internet connection.\r\n    Options to notify the user or automatically disconnect from the Internet when the network activity exceeds a certain level.\r\n    Speed meter to accurately time downloads and report the average transfer rates.\r\n    Dial-up session journal with detailed information about every session.\r\n\r\nWith NetWorx you can:\r\n\r\n    Find out and monitor how fast your Internet connection is and how much Internet traffic you consume.\r\n    Verify whether your ISP charges your Internet usage fairly.\r\n    Detect a suspicious network activity on your computer.\r\n    Perform simple network tests such as ping and trace route.\r\n    Be notified about excessive Internet usage.\r\n\r\nOfficial Website: https://www.softperfect.com/products/networx/","last_updated":"2017-12-03T12:01:18.833Z","parsed":{"xt":"urn:btih:a588c60669e93d05f9d7b099f22fdf928dac38fb","dn":"SoftPerfect Research NetWorx v6.0.4","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a588c60669e93d05f9d7b099f22fdf928dac38fb","infoHashBuffer":{"type":"Buffer","data":[165,136,198,6,105,233,61,5,249,215,176,153,242,47,223,146,141,172,56,251]},"name":"SoftPerfect Research NetWorx v6.0.4","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}