{"title":"The Art of Business Value by Mark Schwartz EPUB","magnet":"magnet:?xt=urn:btih:a5cc9bf4857caa338851bbd48e21463fb9e84ba6&dn=The+Art+of+Business+Value+by+Mark+Schwartz+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"824901","seeders":"61","leechers":"9","description":"xx\r\n\r\nThe Art of Business Value by Mark Schwartz EPUB\r\n\r\nDo you really understand what business value is? Information technology can and should deliver business value. But the Agile literature has paid scant attention to what business value means - and how to know whether or not you are delivering it. This problem becomes ever more critical as you push value delivery toward autonomous teams and away from requirements &quot;tossed over the wall&quot; by business stakeholders. An empowered team needs to understand its goal!\r\n\r\nPlayful and thought-provoking, The Art of Business Value explores what business value means, why it matters, and how it should affect your software development and delivery practices. More than any other IT delivery approach, DevOps (and Agile thinking in general) makes business value a central concern. This book examines the role of business value in software and makes a compelling case for why a clear understanding of business value will change the way you deliver software.\r\n\r\nThis book will make you think deeply about not only what it means to deliver value but also the relationship of the IT organization to the rest of the enterprise. It will give you the language to discuss value with the business, methods to cut through bureaucracy, and strategies for incorporating Agile teams and culture into the enterprise. Most of all, this book will startle you into new ways of thinking about the cutting-edge of Agile practice and where it may lead.\r\n\r\nxx","last_updated":"2017-12-26T12:06:09.897Z","parsed":{"xt":"urn:btih:a5cc9bf4857caa338851bbd48e21463fb9e84ba6","dn":"The Art of Business Value by Mark Schwartz EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a5cc9bf4857caa338851bbd48e21463fb9e84ba6","infoHashBuffer":{"type":"Buffer","data":[165,204,155,244,133,124,170,51,136,81,187,212,142,33,70,63,185,232,75,166]},"name":"The Art of Business Value by Mark Schwartz EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}