{"title":"\nThe Elephants in My Backyard by Rajiv Surendra EPUB","magnet":"magnet:?xt=urn:btih:a68c17fa9c7a1955c7c3f2741cc8d8b590d9a901&dn=The+Elephants+in+My+Backyard+by+Rajiv+Surendra+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"17776782","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Elephants in My Backyard by Rajiv Surendra EPUB\r\n\r\n&quot;This was a once-in-a-lifetime chance. I found myself standing dangerously close to the edge of a cliff. Far below me was an incredible abyss with no end in sight. I could turn back and safely return to where I had come from, or I could throw caution to the wind, lift my arms up into the air...and jump.&quot; (From The Elephants in My Backyard)\r\n\r\nWhat happens when you spend 10 years obsessively pursuing a dream, and then, in the blink of an eye, you learn that you have failed, that the dream will not come true?\r\n\r\nIn 2003, Rajiv Surendra was filming Mean Girls, playing the beloved rapping mathlete Kevin Gnapoor, when a cameraman insisted he read Yann Martel&apos;s Life of Pi.\r\n\r\nMesmerized by all the similarities between Pi and himself - both are five-foot-five with coffee-colored complexions, both share a South Indian culture, both lived by a zoo - when Rajiv learns that Life of Pi will be made into a major motion picture he is convinced that playing the title role is his destiny.\r\n\r\nIn a great leap of faith Rajiv embarks on a quest to embody the 16-year-old Tamil schoolboy. He quits university and buys a one-way ticket from Toronto to South India. He visits the sacred stone temples of Pondicherry, he travels to the frigid waters off the coast of rural Maine, and explores the cobbled streets of Munich. He befriends Yann Martel, a priest, a castaway, an eccentric old woman, and a pack of Tamil schoolboys. He learns how to swim, to spin wool, to keep bees, and to look a tiger in the eye. All the while he is really learning how to dream big, to fail, to survive, to love, and to become who he truly is.\r\n\r\nRajiv Surendra captures the uncertainty, heartache, and joy of finding ones place in the world with sly humor and refreshing honesty. The Elephants in My Backyard is not a journey of goals and victories, but a story of process and determination. It is a spellbinding and profound book for anyone who has ever failed at something and had to find a new path through life.\r\n\r\nxx","last_updated":"2017-10-17T12:01:26.244Z","parsed":{"xt":"urn:btih:a68c17fa9c7a1955c7c3f2741cc8d8b590d9a901","dn":"The Elephants in My Backyard by Rajiv Surendra EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a68c17fa9c7a1955c7c3f2741cc8d8b590d9a901","infoHashBuffer":{"type":"Buffer","data":[166,140,23,250,156,122,25,85,199,195,242,116,28,200,216,181,144,217,169,1]},"name":"The Elephants in My Backyard by Rajiv Surendra EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}