{"title":"Juicy Wet Asses Vol 6 [Dvdrip]","magnet":"magnet:?xt=urn:btih:a7bf07eec799e69344b2738338d27f1b4870c748&dn=Juicy+Wet+Asses+Vol+6+%5BDvdrip%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dawgknutz","categoryP":"porn","categoryS":"movies_dvdr","size":"1341340521","seeders":"2","leechers":"11","description":"Juicy Wet Asses Vol 6 [Dvdrip]\r\n\r\n2cd . . Anal . . Big Ass . . Big Boobs . . Black Female . . Black Male . . Cumshots . . Dvdrip . . Oil . . Pretty Face\r\n\r\n <a href=\"\nhttp://imageshtorm.com/img-59f844879e114.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59f844879e114.html</a>  <a href=\"\nhttp://imageshtorm.com/img-59f8448a13cd9.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59f8448a13cd9.html</a>  <a href=\"\nhttp://imageshtorm.com/img-59f84491efcb6.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59f84491efcb6.html</a>  <a href=\"\nhttp://imageshtorm.com/img-59f844afb469a.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59f844afb469a.html</a> \r\n\r\n\r\n\r\nIn a big house, somewhere in porn valley California, Leilani Leeanne struts her big booty around atop those spiked heals and happens upon her man she&apos;s got tied to a chair. Their eyes lock and she releases him with a knife and hands him a spray bottle. Gentle caressing ensues &apos;till he taps that big phat ass! After covering those chocolate cakes with oil and rubbing it in, she takes it doggy. Tired of his skills, she hops on top then rides, rides, rides...! Returning to doggy style, he gives her kitty a rest and go in through the back door! This fair skinned beauty can&apos;t get enough and she takes it from him! Rihanna Rimes starts out poolside, using that handrail into the pool as her scratching post. There&apos;s no doubt that girls&apos; booty floats! Later you&apos;ll see her spraying oil on those perfect domes. She needs her help getting oil on her back. It&apos;s no surprise that she gets some help double quick. Sloppy head is something he&apos;s good at and gets heated up when he spanks her tongue. Who knew she was such an outdoor girl with such a deep throat? After gobbling down all she can take, he fills her to capacity on the other end too! Next up is Momoko, big up top and down below. Lovely with light skin, she&apos;s just right. Cheeky chica Jasmine Blaze demands her man some over and show it to her! While she&apos;s waiting, she shows it to you. Move over J-Lo, you&apos;re just a gifted amateur down below compared to Jasmine! He finally arrives and she makes it hard for him, and he gives it to her just as hard. He dumps it on her face then he&apos;s gotta bounce! Now Raven Vixen likes to show off her camel toe. It looks like her panties are being eaten by a chocolate clam inside an even bigger clam! Perfectly round booty carrying a set of saddlebags you would just love to fill! Timelessly stacked, brilliantly bouncy. You&apos;re going to wonder what kind of train this girl got her caboose off of; probably something high speed and long running!\r\n\r\nStarring: - Chilli Chills -- Cj Wright -- Flash Brown -- Jasmine Blaze -- Leilani Leeanne -- Momoko -- Mr. Marcus -- Raven Vixen -- Rihanna Rimes","last_updated":"2017-10-31T12:05:02.859Z","parsed":{"xt":"urn:btih:a7bf07eec799e69344b2738338d27f1b4870c748","dn":"Juicy Wet Asses Vol 6 [Dvdrip]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a7bf07eec799e69344b2738338d27f1b4870c748","infoHashBuffer":{"type":"Buffer","data":[167,191,7,238,199,153,230,147,68,178,115,131,56,210,127,27,72,112,199,72]},"name":"Juicy Wet Asses Vol 6 [Dvdrip]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}