{"title":"Fantasyland_ How America Went Haywire A 500-Year History by Kurt","magnet":"magnet:?xt=urn:btih:a947c4448df4b3b9ada9b4cdcbe262b803343288&dn=Fantasyland_+How+America+Went+Haywire+A+500-Year+History+by+Kurt&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3309980","seeders":"4","leechers":"31","description":"xx\r\n\r\nFantasyland_ How America Went Haywire A 500-Year History by Kurt Andersen ePUB eBOOK-ZAK\r\n\r\nA razor-sharp thinker offers a new understanding of our post-truth world and explains the American instinct to believe in make-believe, from the Pilgrims to P. T. Barnum to Disneyland to zealots of every stripe...to Donald Trump.\r\n\r\nIn this sweeping, eloquent history of America, Kurt Andersen demonstrates that what&apos;s happening in our country today - this strange, post-factual, &quot;fake news&quot; moment we&apos;re all living through - is not something entirely new, but rather the ultimate expression of our national character and path. America was founded by wishful dreamers, magical thinkers, and true believers, by impresarios and their audiences, by hucksters and their suckers. Believe-whatever-you-want fantasy is deeply embedded in our DNA.\r\n\r\nOver the course of five centuries - from the Salem witch trials to Scientology to the Satanic Panic of the 1980s, from P. T. Barnum to Hollywood and the anything-goes, wild-and-crazy 60s, from conspiracy theories to our fetish for guns and obsession with extraterrestrials - our peculiar love of the fantastic has made America exceptional in a way that we&apos;ve never fully acknowledged. With the gleeful erudition and tell-it-like-it-is ferocity of a Christopher Hitchens, Andersen explores whether the great American experiment in liberty has gone off the rails.\r\n\r\nFrom the start, our ultra-individualism was attached to epic dreams and epic fantasies - every citizen was free to believe absolutely anything, or to pretend to be absolutely anybody. Little by little, and then more quickly in the last several decades, the American invent-your-own-reality legacy of the Enlightenment superseded its more sober, rational, and empirical parts. We gave ourselves over to all manner of crackpot ideas and make-believe lifestyles designed to console or thrill or terrify us. In Fantasyland, Andersen brilliantly connects the dots that define this condition, portrays its scale and scope, and offers a fresh, bracing explanation of how our American journey has deposited us here.\r\n\r\nFantasyland could not appear at a more perfect moment. If you want to understand the politics and culture of 21st-century America, if you want to know how the lines between reality and illusion have become dangerously blurred, you must read this book.\r\n\r\nxx","last_updated":"2017-09-06T12:00:44.892Z","parsed":{"xt":"urn:btih:a947c4448df4b3b9ada9b4cdcbe262b803343288","dn":"Fantasyland_ How America Went Haywire A 500-Year History by Kurt","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a947c4448df4b3b9ada9b4cdcbe262b803343288","infoHashBuffer":{"type":"Buffer","data":[169,71,196,68,141,244,179,185,173,169,180,205,203,226,98,184,3,52,50,136]},"name":"Fantasyland_ How America Went Haywire A 500-Year History by Kurt","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}