{"title":"Stolen Beauty by Laurie Lico Albanese EPUB","magnet":"magnet:?xt=urn:btih:a985495369812feace7c7248f1afffb7f08c5d71&dn=Stolen+Beauty+by+Laurie+Lico+Albanese+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11984125","seeders":"0","leechers":"0","description":"xx\r\n\r\nStolen Beauty by Laurie Lico Albanese EPUB\r\n\r\nFrom the dawn of the 20th century to the devastation of World War II, this exhilarating novel of love, war, art, and family gives voice to two extraordinary women and brings to life the true story behind the creation and near destruction of Gustav Klimt&apos;s most remarkable paintings.\r\n\r\nIn the dazzling glitter of 1900 Vienna, Adele Bloch-Bauer - young, beautiful, brilliant, and Jewish - meets painter Gustav Klimt. Wealthy in everything but freedom, Adele embraces Klimt&apos;s renegade genius as the two awaken to the erotic possibilities on the canvas and beyond. Though they enjoy a life where sex and art are just beginning to break through the fa&#xE7;ade of conventional society, the city is also exhibiting a disturbing increase in anti-Semitism, as political hatred foments in the shadows of Adele&apos;s coffee house afternoons and cultural salons.\r\n\r\nNearly 40 years later, Adele&apos;s niece Maria Altmann is a newlywed when the Nazis invade Austria - and overnight, her beloved Vienna becomes a war zone. When her husband is arrested and her family is forced out of their home, Maria must summon the courage and resilience that is her aunt&apos;s legacy if she is to survive and keep her family - and their history - alive.\r\n\r\nWill Maria and her family escape the Nazis&apos; grip? And what will become of the paintings that her aunt nearly sacrificed everything for?\r\n\r\nImpeccably researched and a &quot;must-read for fans of Kristin Hannah&apos;s The Nightingale and Paula McLain&apos;s Circling the Sun&quot; (Christina Baker Kline, number-one New York Times best-selling author), Stolen Beauty intertwines the tales of two remarkable women across more than a hundred years. It juxtaposes passion and discovery against hatred and despair and shines a light on our ability to love, to destroy, and, above all, to endure.\r\n\r\nxx","last_updated":"2017-10-24T12:03:35.997Z","parsed":{"xt":"urn:btih:a985495369812feace7c7248f1afffb7f08c5d71","dn":"Stolen Beauty by Laurie Lico Albanese EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a985495369812feace7c7248f1afffb7f08c5d71","infoHashBuffer":{"type":"Buffer","data":[169,133,73,83,105,129,47,234,206,124,114,72,241,175,255,183,240,140,93,113]},"name":"Stolen Beauty by Laurie Lico Albanese EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}