{"title":"Tangledeep","magnet":"magnet:?xt=urn:btih:a98c104dc5b936f8d83e9c00c157cc5fda54f163&dn=Tangledeep&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"125285384","seeders":"0","leechers":"0","description":"Tangledeep combines the 16-bit graphics and polish of classic SNES-era RPGs with elements from roguelikes and dungeon crawlers to create a magical experience for players of all skill levels. Trapped in underground villages with no memory of the world at the surface, you must survive an ever-changing labyrinth to discover what lies above. Experience rich, tactical, turn-based gameplay as you explore a sprawling dungeon that&#x2019;s different each time you play. Tangledeep features a customizable job system and hundreds of collectible items that allow you to approach each playthrough in a totally new way!The SettingFor hundreds of years, people have lived in the safety of underground settlements and villages &#x2013; where the only route to the surface is &#x201C;Tangledeep,&#x201D; a mysterious and ever-changing labyrinth. With memories of the surface world long forgotten, you set out for the labyrinth to discover what lies above. With each floor &#x2013; full of magical beasts, ancient automatons, bizarre environments and hybrid biomes &#x2013; the mystery grows ever deeper&#x2026;Key FeaturesExperience finely-tuned, procedurally-generated and handcrafted gameplay as you fight challenging monsters, complete quests, and collect rare items.Master deep, tactical turn-based combat across 9 unique jobs. (More to come!)Choose between two game modes &#x2013; including Adventure Mode, which removes the pain of permadeath.Share some of your progress between characters by using the banking system, or planting","last_updated":"2017-07-19T12:02:47.229Z","parsed":{"xt":"urn:btih:a98c104dc5b936f8d83e9c00c157cc5fda54f163","dn":"Tangledeep","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a98c104dc5b936f8d83e9c00c157cc5fda54f163","infoHashBuffer":{"type":"Buffer","data":[169,140,16,77,197,185,54,248,216,62,156,0,193,87,204,95,218,84,241,99]},"name":"Tangledeep","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}