{"title":"John Strausbaugh - City of Sedition 2016 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:a99fd1eb5fbe8e0ebbd38eaa61d81b1a8226108f&dn=John+Strausbaugh+-+City+of+Sedition+2016+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8712609","seeders":"10","leechers":"4","description":"John Strausbaugh - City of Sedition 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn a single definitive narrative, City of Sedition tells the spellbinding story of the huge - and hugely conflicted - role New York City played in the Civil War.\r\n\r\nNo city was more of a help to Abraham Lincoln and the Union war effort - or more of a hindrance. No city raised more men, money, and mat&#xE9;riel for the war, and no city raised more hell against it. It was a city of patriots, war heroes, and abolitionists but simultaneously a city of antiwar protest, draft resistance, and sedition.\r\n\r\nWithout his New York supporters, it&apos;s highly unlikely Lincoln would have made it to the White House. Yet because of the city&apos;s vital and intimate business ties to the Cotton South, the majority of New Yorkers never voted for him and were openly hostile to him and his politics. Throughout the war New York City was a nest of antiwar &quot;Copperheads&quot; and a haven for deserters and draft dodgers. New Yorkers would react to Lincoln&apos;s wartime policies with the deadliest rioting in American history. The city&apos;s political leaders would create a bureaucracy solely devoted to helping New Yorkers evade service in Lincoln&apos;s army. Rampant war profiteering would create an entirely new class of New York millionaires, the &quot;shoddy aristocracy&quot;. New York newspapers would be among the most vilely racist and vehemently antiwar in the country. Some editors would call on their readers to revolt and commit treason; a few New Yorkers would answer that call. They would assist Confederate terrorists in an attempt to burn their own city down and collude with Lincoln&apos;s assassin.\r\n\r\nHere, in City of Sedition, a gallery of fascinating New Yorkers comes to life - the likes of Horace Greeley, Walt Whitman, Julia Ward Howe, Boss Tweed, Thomas Nast, Matthew Brady, and Herman Melville. This book follows the fortunes of these figures and chronicles how many New Yorkers seized the opportunities the conflict presented to amass capital, create new industries, and expand their markets, laying the foundation for the city&apos;s - and the nation&apos;s - growth","last_updated":"2017-06-15T12:01:17.912Z","parsed":{"xt":"urn:btih:a99fd1eb5fbe8e0ebbd38eaa61d81b1a8226108f","dn":"John Strausbaugh - City of Sedition 2016 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"a99fd1eb5fbe8e0ebbd38eaa61d81b1a8226108f","infoHashBuffer":{"type":"Buffer","data":[169,159,209,235,95,190,142,14,187,211,142,170,97,216,27,26,130,38,16,143]},"name":"John Strausbaugh - City of Sedition 2016 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}