{"title":"Hyperpolarized and Inert Gas MRI","magnet":"magnet:?xt=urn:btih:aa2e91c1afcc04058a2f739c5b9d5cacd049a4e1&dn=Hyperpolarized+and+Inert+Gas+MRI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"50467262","seeders":"26","leechers":"2","description":"Hyperpolarized and Inert Gas MRI - Mitchell S. Albert, Francis T. Hane (AP, 2017).pdf\r\n\r\nHyperpolarized and Inert Gas MRI: Theory and Applications in Research and Medicine is the first comprehensive volume published on HP gas MRI. Since the 1990&#x2019;s, when HP gas MRI was invented by Dr. Albert and his colleagues, the HP gas MRI field has grown dramatically. The technique has proven to be a useful tool for diagnosis, disease staging, and therapy evaluation for obstructive lung diseases, including asthma, chronic obstructive pulmonary disease (COPD), and cystic fibrosis.\r\n\r\nHP gas MRI has also been developed for functional imaging of the brain and is presently being developed for molecular imaging, including molecules associated with lung cancer, breast cancer, and Alzheimer&#x2019;s disease. Taking into account the ongoing growth of this field and the potential for future clinical applications, the book pulls together the most relevant and cutting-edge research available in HP gas MRI into one resource.\r\n\r\nPresents the most comprehensive, relevant, and accurate information on HP gas MRI\r\nCo-edited by the co-inventor of HP gas MRI, Dr. Albert, with chapter authors who are the leading experts in their respective sub-disciplines\r\nServes as a foundation of understanding of HP gas MRI for researchers and clinicians involved in research, technology development, and clinical use with HP gas MRI\r\nCovers all hyperpolarized gases, including helium, the gas with which the majority of HP gas MRI has been conducted","last_updated":"2017-06-07T12:05:46.074Z","parsed":{"xt":"urn:btih:aa2e91c1afcc04058a2f739c5b9d5cacd049a4e1","dn":"Hyperpolarized and Inert Gas MRI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aa2e91c1afcc04058a2f739c5b9d5cacd049a4e1","infoHashBuffer":{"type":"Buffer","data":[170,46,145,193,175,204,4,5,138,47,115,156,91,157,92,172,208,73,164,225]},"name":"Hyperpolarized and Inert Gas MRI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}