{"title":"Hospitalize v0.11.4.1","magnet":"magnet:?xt=urn:btih:aa9f9bffbe8612e0fc71586ee5fc615b260d2585&dn=Hospitalize+v0.11.4.1&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"pelit","categoryS":"pc","size":"160050316","seeders":"3","leechers":"1","description":"Hospitalize is all about finding the most effective way to construct and manage a hospital. Build your hospital smart and avoid excess time and resources consumed by traveling and examining your hospitalized patients unnecessary. Staff it and watch your &#x201C;minions&#x201D; attempt to navigate through your hospital maze and solve all your patients&#x2019; troubles. As the administrator, you really do not need to care much about what your employees keep themselves occupied with on a daily schedule. You have much more important things to do, like taking big decisions and building the hospital.Balance your next hospital expansion between what the hospital needs and what that is most profitable. Choose the right staff and manage the hospital policies. Do the patients need to be fully healed before the doctors discharge them, or will you discharge them early and get paid?Send patients through your different hospital examinations and see if you or any of your doctors are able to identify the cause of their symptoms and give them the right treatment. Your doctors and nurses will often try to do their best, but as the hospital administrator, you can always overrule their decisions and modify all your patients&#x2019; journals. Features- Sandbox construction- Hospital management- Financial reports- Diseases and treatments based on real life- Doctors handbook- Randomized missionsEvery","last_updated":"2017-07-22T12:00:31.283Z","parsed":{"xt":"urn:btih:aa9f9bffbe8612e0fc71586ee5fc615b260d2585","dn":"Hospitalize v0.11.4.1","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aa9f9bffbe8612e0fc71586ee5fc615b260d2585","infoHashBuffer":{"type":"Buffer","data":[170,159,155,255,190,134,18,224,252,113,88,110,229,252,97,91,38,13,37,133]},"name":"Hospitalize v0.11.4.1","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}