{"title":"CLion v2017.1.3","magnet":"magnet:?xt=urn:btih:aaa1156d04e3827da250f096792183602ac9d899&dn=CLion+v2017.1.3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cutehtu","categoryP":"applications","categoryS":"mac","size":"278582070","seeders":"0","leechers":"0","description":"CLion v2017.1.3\r\n\r\nA streamlined development environment that integrates a smart code editor, helps you analyze your projects on-the-fly, and offers CMake support.\r\n\r\nCLion is a cross-platform C and C++ IDE that has been built on the Intellij platform and offers you the possibility to work on your software projects in a clean, organized environment. CLion includes all you need to generate, debug, and compile code, to organize projects, or to test test them on various environments.\r\n\r\nEasy to setup development environment that can handle popular programming languages\r\n\r\nThe CLion application is installed to your Mac with a simple drag and drop to the Applications directory. The first time you launch the utility you can easily import old settings files (in case you used the app before), you can choose the UI theme you want to employ (Default or Darcula), you get to specify the CMake and GDB executables you want to use, and to install custom plug-ins.\r\n\r\nCLion comes with a well structured user interface that allows you to quickly browse the files included in your project, and open them in the editing area with a simple mouse click. Besides C and C++, CLion also allows you to edit JavaScript, XML, HTML, or CSS documents.\r\n\r\nManage your code by using different version control systems\r\n\r\nCLion is able to communicate with most popular revision control tools, such as Git, Mercurial, or Perforce. As a result, you can easily import projects from version control, work on them within the smart editor, and use the CLion analysis and debugging tools to fix issues or integrate new functions.\r\n\r\nNote that CLion comes with a code generator that offers you the possibility to save time: you can use keyboard shortcuts to add usual code lines. In addition, CLion can check your syntax in real time and underlines possible errors.\r\n\r\nStreamlined C and C++ IDE that can help you write high quality code\r\n\r\nCLion proposes efficient solutions that have the potential of improving your productivity while writing code: you can easily organize your projects, you have access to version control systems, you can use the built in smart editor and debugger to develop, analyze and correct code.\r\n\r\nAdditionally, you can expand the CLion capabilities by installing different plug-ins. To conclude, if you are looking for a well structured IDE for developing C or C++ projects, CLion can be a viable solution","last_updated":"2017-06-25T12:00:31.939Z","parsed":{"xt":"urn:btih:aaa1156d04e3827da250f096792183602ac9d899","dn":"CLion v2017.1.3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aaa1156d04e3827da250f096792183602ac9d899","infoHashBuffer":{"type":"Buffer","data":[170,161,21,109,4,227,130,125,162,80,240,150,121,33,131,96,42,201,216,153]},"name":"CLion v2017.1.3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}