{"title":"Written Out of History_ The Forgotten Founders Who Fought Big Go","magnet":"magnet:?xt=urn:btih:ab3d05c36cfb9c8ee57c034a6a38e1f20f6e29a4&dn=Written+Out+of+History_+The+Forgotten+Founders+Who+Fought+Big+Go&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"23424200","seeders":"1","leechers":"0","description":"xx\r\n\r\nWritten Out of History_ The Forgotten Founders Who Fought Big Government by Mike Lee 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nSome of America&apos;s most important founders have been erased from our history books. In the fight to restore the true meaning of the Constitution, their stories must be told.\r\n\r\nIn the earliest days of our nation, a handful of unsung heroes - including women, slaves, and an Iroquois chief - made crucial contributions to our republic. They pioneered the ideas that led to the Bill of Rights, the separation of powers, and the abolition of slavery. Yet their faces haven&apos;t been printed on our currency or carved into any cliffs. Instead they were marginalized, silenced, or forgotten - sometimes by an accident of history, sometimes by design.\r\n\r\nIn the thick of the debates over the Constitution, some founders warned about the dangers of giving too much power to the central government. Though they did not win every battle, these anti-Federalists and their allies managed to insert a system of checks and balances to protect the people from an intrusive federal government. Other forgotten figures were not politicians themselves but by their thoughts and actions influenced America&apos;s story. Yet successive generations have forgotten their message, leading to the creation of a vast federal bureaucracy that our founders would not recognize and did not want.\r\n\r\nSenator Mike Lee, one of the most consistent and impassioned opponents of an abusive federal government, tells the story of liberty&apos;s forgotten heroes. In this book you&apos;ll learn the true stories of founders such as:\r\n\r\nAaron Burr, who is depicted in the popular musical Hamilton and in history books as a villain, but in reality was a far more complicated figure who fought the abuse of executive power...\r\nMercy Otis Warren, one of the most prominent female writers in the Revolution and a prot&#xE9;g&#xE9; of John Adams, who engaged in vigorous debates against the encroachment of federal power and ultimately broke with Adams over her fears of the Constitution...\r\n\r\nCanasatego, an Iroquois chief whose words taught Benjamin Franklin the basic principles behind the separation of powers...\r\n\r\nThe popular movement that swept Republicans into power in 2010 and 2016 was led by Americans who rediscovered the majesty of the Constitution and knew the stories of Hamilton, Madison, and Washington. But we should also know the names of the contrarians who argued against them and who have been written out of history. If we knew of the heroic fights of these lost founders, we&apos;d never have ended up with a government too big, too powerful, and too unresponsive to its citizens. The good news is that it&apos;s not too late to remember and to return to our first principles. Restoring the memory of these lost individuals will strike a crippling blow against big government.\r\n\r\nxx","last_updated":"2017-08-19T12:01:57.195Z","parsed":{"xt":"urn:btih:ab3d05c36cfb9c8ee57c034a6a38e1f20f6e29a4","dn":"Written Out of History_ The Forgotten Founders Who Fought Big Go","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ab3d05c36cfb9c8ee57c034a6a38e1f20f6e29a4","infoHashBuffer":{"type":"Buffer","data":[171,61,5,195,108,251,156,142,229,124,3,74,106,56,225,242,15,110,41,164]},"name":"Written Out of History_ The Forgotten Founders Who Fought Big Go","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}