{"title":"Jim Henson_ The Biography by Brian Jay Jones EPUB","magnet":"magnet:?xt=urn:btih:ab85f9a53705a9caa3b7c62cbb883b1b7f8b776b&dn=Jim+Henson_+The+Biography+by+Brian+Jay+Jones+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3442185","seeders":"0","leechers":"0","description":"xx\r\n\r\nJim Henson_ The Biography by Brian Jay Jones EPUB\r\n\r\nFor the first time ever - a comprehensive biography of one of the 20th century&#x2019;s most innovative creative artists: the incomparable, irreplaceable Jim Henson\r\n\r\nHe was a gentle dreamer whose genial bearded visage was recognized around the world, but most people got to know him only through the iconic characters born of his fertile imagination: Kermit the Frog, Bert and Ernie, Miss Piggy, Big Bird. The Muppets made Jim Henson a household name, but they were just part of his remarkable story.\r\n\r\nThis extraordinary biography - written with the generous cooperation of the Henson family - covers the full arc of Henson&#x2019;s all-too-brief life: from his childhood in Leland, Mississippi, through the years of burgeoning fame in America, to the decade of international celebrity that preceded his untimely death at age 53. Drawing on hundreds of hours of new interviews with Henson&apos;s family, friends, and closest collaborators, as well as unprecedented access to private family and company archives, Brian Jay Jones explores the creation of the Muppets, Henson&#x2019;s contributions to Sesame Street and Saturday Night Live, and his nearly 10-year campaign to bring The Muppet Show to television. Jones provides the imaginative context for Henson&#x2019;s non-Muppet projects, including the richly imagined worlds of The Dark Crystal and Labyrinth - as well as fascinating misfires like Henson&#x2019;s dream of opening an inflatable psychedelic nightclub.\r\n\r\nAn uncommonly intimate portrait, Jim Henson captures all the facets of this American original: the master craftsman who revolutionized the presentation of puppets on television, the savvy businessman whose deal-making prowess won him a reputation as &quot;the new Walt Disney&quot;, and the creative team leader whose collaborative ethos earned him the undying loyalty of everyone who worked for him. Here also is insight into Henson&#x2019;s intensely private personal life: his Christian Science upbringing, his love of fast cars and expensive art, and his weakness for women. Though an optimist by nature, Henson was haunted by the notion that he would not have time to do all the things he wanted to do in life - a fear that his heartbreaking final hours would prove all too well founded.\r\n\r\nAn up-close look at the charmed life of a legend, Jim Henson gives the full measure to a man whose joyful genius transcended age, language, geography, and culture - and continues to beguile audiences worldwide.\r\n\r\nxx","last_updated":"2017-11-07T12:01:18.527Z","parsed":{"xt":"urn:btih:ab85f9a53705a9caa3b7c62cbb883b1b7f8b776b","dn":"Jim Henson_ The Biography by Brian Jay Jones EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ab85f9a53705a9caa3b7c62cbb883b1b7f8b776b","infoHashBuffer":{"type":"Buffer","data":[171,133,249,165,55,5,169,202,163,183,198,44,187,136,59,27,127,139,119,107]},"name":"Jim Henson_ The Biography by Brian Jay Jones EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}