{"title":"1994 - Hellboy","magnet":"magnet:?xt=urn:btih:abc28c96f3c9bab8957f4ee3a773b9cc07636ed8&dn=1994+-+Hellboy&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Eleganza","categoryP":"other","categoryS":"comics","size":"2325963110","seeders":"0","leechers":"5","description":"The Hellboy series made its first appearance as a four-page, black and white comic by Mike Mignola with a script by John Byrne published by Dark Horse Comics in San Diego Comic-Con Comics #2 (19 August 1993), distributed at the San Diego Comic-Con. This piece was used to promotional piece for Hellboy&apos;s debut miniseries Seed of Destruction.\r\n\r\nAfter the conclusion of Seed of Destruction, Mike Mignola took over scripting duties on the comics and has since written every Hellboy story himself, with the exception of They That Go Down to the Sea in Ships which he co-wrote with Joshua Dysart.\r\n\r\nThe series is usually released as a series of one-shots or miniseries, some of these advancing the ongoing storyline, others being more stand-alone tales, although there are also numerous short stories that have been published in a wide variety of publications, including digital publications.\r\n\r\nMike Mignola was the sole artist on Hellboy until Makoma in February 2006, drawn by Richard Corben with a framing sequence by Mike Mignola. Since then, a Hellboy story with Mike Mignola as artist has become somewhat of a rarity, usually with a single Mignola-drawn issue coming out over a two year period. However, the output has increased, as Mignola has invited other artists to work on his comic including P. Craig Russell, Scott Hampton, Kevin Nowlan, Jason Shawn Alexander and Duncan Fegredo, who took over the ongoing storyline for the miniseries Darkness Calls until The Fury.\r\n\r\nNovember 2011 saw the publication of the first Hellboy original graphic novel, House of the Living Dead. This story was roughly two-issues of content released as a hard cover and was colllected along with related stories in Hellboy in Mexico. In 2013 a second graphic novel was released, The Midnight Circus, which has remained uncollected in the trade paperback form. Into the Silent Sea, with art by Gary Gianni, is another story in this format which is scheduled for release in April 2017.\r\n\r\nBeginning December 2012, Mike Mignola will return as the ongoing artist for Hellboy in Hell. Hellboy in Hell marks a departure for the comic series, since it is not a miniseries or one-shot, but an ongoing series. Despite plans for this series to continue into four trade paperbacks, Mignola decided to cut the series short with the tenth issue, For Whom the Bell Tolls","last_updated":"2017-11-21T12:04:18.819Z","parsed":{"xt":"urn:btih:abc28c96f3c9bab8957f4ee3a773b9cc07636ed8","dn":"1994 - Hellboy","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"abc28c96f3c9bab8957f4ee3a773b9cc07636ed8","infoHashBuffer":{"type":"Buffer","data":[171,194,140,150,243,201,186,184,149,127,78,227,167,115,185,204,7,99,110,216]},"name":"1994 - Hellboy","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}