{"title":"Jerusalem by Alan Moore EPUB","magnet":"magnet:?xt=urn:btih:ac0781f6ec539613fb9b492cb55c2ef8c87f32bf&dn=Jerusalem+by+Alan+Moore+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2100465","seeders":"58","leechers":"3","description":"xx\r\n\r\nJerusalem by Alan Moore EPUB\r\n\r\nFierce in its imagining and stupefying in its scope, Jerusalem is the tale of everything, told from a vanished gutter.\r\n\r\nIn the epic novel Jerusalem, Alan Moore channels both the ecstatic visions of William Blake and the theoretical physics of Albert Einstein through the hardscrabble streets and alleys of his hometown of Northampton, UK. In the half a square mile of decay and demolition that was England&apos;s Saxon capital, eternity is loitering between the firetrap housing projects. Embedded in the grubby amber of the district&apos;s narrative, among its saints, kings, prostitutes, and derelicts, a different kind of human time is happening, a soiled simultaneity that does not differentiate between the petrol-colored puddles and the fractured dreams of those who navigate them.\r\n\r\nEmploying a kaleidoscope of literary forms and styles that range from brutal social realism to extravagant children&apos;s fantasy, from modern stage drama to the extremes of science fiction, Jerusalem&apos;s dizzyingly rich cast of characters includes the living, the dead, the celestial, and the infernal in an intricately woven tapestry that presents a vision of an absolute and timeless human reality in all of its exquisite, comical, and heartbreaking splendor.\r\n\r\nIn these minutes lurk demons from the second-century Book of Tobit and angels with golden blood who reduce fate to a snooker tournament. Vagrants, prostitutes, and ghosts rub shoulders with Oliver Cromwell; Samuel Beckett; James Joyce&apos;s tragic daughter, Lucia; and Buffalo Bill, among many others. There is a conversation in the thunderstruck dome of St. Paul&apos;s Cathedral, childbirth on the cobblestones of Lambeth Walk, an estranged couple sitting all night on the cold steps of a Gothic church front, and an infant choking on a cough drop for 11 chapters. An art exhibition is in preparation, and above the world a naked old man and a beautiful dead baby race along the Attics of the Breath toward the heat death of the universe.\r\n\r\nAn opulent mythology for those without a pot to piss in, through the labyrinthine streets and minutes of Jerusalem tread ghosts that sing of wealth, poverty, and our threadbare millennium. They discuss English as a visionary language from John Bunyan to James Joyce, hold forth on the illusion of mortality post-Einstein, and insist upon the meanest slum as Blake&apos;s eternal holy city.\r\n\r\nxx","last_updated":"2017-11-25T12:59:39.161Z","parsed":{"xt":"urn:btih:ac0781f6ec539613fb9b492cb55c2ef8c87f32bf","dn":"Jerusalem by Alan Moore EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ac0781f6ec539613fb9b492cb55c2ef8c87f32bf","infoHashBuffer":{"type":"Buffer","data":[172,7,129,246,236,83,150,19,251,155,73,44,181,92,46,248,200,127,50,191]},"name":"Jerusalem by Alan Moore EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}