{"title":"Prairie Fires by Caroline Fraser EPUB","magnet":"magnet:?xt=urn:btih:ac589cd05f2638ca3bd223c0d75794fa439002b2&dn=Prairie+Fires+by+Caroline+Fraser+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"21509428","seeders":"23","leechers":"2","description":"xx\r\n\r\nPrairie Fires by Caroline Fraser EPUB\r\n\r\nThe first comprehensive historical biography of Laura Ingalls Wilder, the beloved author of the Little House on the Prairie book series\r\n\r\nMillions of fans of Little House on the Prairie believe they know Laura Ingalls - the pioneer girl who survived blizzards and near-starvation on the Great Plains, and the woman who wrote the famous autobiographical books. But the true story of her life has never been fully told. Now, drawing on unpublished manuscripts, letters, diaries, and land and financial records, Caroline Fraser - the editor of the Library of America edition of the Little House series - masterfully fills in the gaps in Wilder&apos;s biography, setting the record straight regarding charges of ghostwriting that have swirled around the books and uncovering the grown-up story behind the most influential childhood epic of pioneer life.\r\n\r\nSet against nearly a century of epochal change, from the Homestead Act and the Indian Wars to the Dust Bowl and the Great Depression, Wilder&apos;s dramatic life provides a unique perspective on American history and our national mythology of self-reliance. Offering fresh insight and new discoveries about Wilder&apos;s life and times, Prairie Fires is the definitive book about Wilder and her world.\r\n\r\nCaroline Fraser is the editor of the Library of America edition of Laura Ingalls Wilder&apos;s Little House books, and the author of Rewilding the World and God&apos;s Perfect Child. Her writing has appeared in The New York Review of Books, The New Yorker, The Atlantic, the Los Angeles Times, and the London Review of Books, among other publications. She lives in New Mexico.\r\n\r\nxx","last_updated":"2017-11-25T13:17:42.861Z","parsed":{"xt":"urn:btih:ac589cd05f2638ca3bd223c0d75794fa439002b2","dn":"Prairie Fires by Caroline Fraser EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ac589cd05f2638ca3bd223c0d75794fa439002b2","infoHashBuffer":{"type":"Buffer","data":[172,88,156,208,95,38,56,202,59,210,35,192,215,87,148,250,67,144,2,178]},"name":"Prairie Fires by Caroline Fraser EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}