{"title":"\nAbsolver-Razor1911","magnet":"magnet:?xt=urn:btih:ac6e3c313925ebb18ad013a71baa8045febe0597&dn=Absolver-Razor1911&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"omigreen","categoryP":"games","categoryS":"pc","size":"127992418","seeders":"1","leechers":"0","description":"\r\n1 9 1 1 &lt;JED&gt;\r\n\r\nRazor 1911 proudly presents:\r\nAbsolver\r\n(C) Devolver Digital\r\n\r\nDate: 2017/08/29 Game Type: Action/Adventure/Indie\r\nSize: 1 Disc Protection:\r\n\r\nGame Notes\r\n\r\nIn the ruins of the fallen Adal Empire, you awaken with a mysterious mask on\r\nyour face, and faint recollections of an esoteric ceremony. Freeing you from\r\nhunger, thirst, and even death, the mask is the creation of the Guides, the\r\nrulers of these lands, who have placed you here to determine whether you are\r\nworthy of becoming part of the elite corps of Absolvers. As you wander these\r\nforsaken lands, encountering other Prospects like you, you will learn new\r\ncombat styles, acquire weapons, gear and armor, and build a team of warriors\r\nwith whom to fight side by side in Arenas of combat\r\n\r\nFluid Real-Time Combat: Position yourself in one of four tactical stances\r\nduring real-time battles and execute devastating attacks, dodges, and\r\nparries. Movement becomes your weapon as you engage in solo duels or intense\r\nmultiplayer melee battles\r\nCustomizable Style and Flow: Players will define their character&apos;s\r\nplaystyle by picking a combat style, a weapon of choice, and arranging\r\nattacks in their Combat Deck to design their unique and personal attack\r\nflow\r\nOnline Multiplayer Action and Narrative: Prospects and Absolvers will\r\nseamlessly encounter others in the world, generating unique stories that\r\nemerge through player interaction and choices. These moments are filled with\r\ntension as intentions to battle or befriend are never clear: trust is always\r\na leap of faith. Encounters will have lasting consequences and transform\r\ninto meaningful relationships as you make friends or enemies and find\r\nmentors or disciples\r\nPvP and PvE: Explore a rich and dynamic world including dedicated PvP\r\nbattle arenas where champions will receive spoils of victory and progress in\r\nthe ranks of the Absolvers, and PvE areas in which players cooperatively\r\nbattle to retrieve rare loot and equipment from the ruins of Adal\r\n\r\nLanguages: Chinese, English, French, German, Italian, Japanese, Polish\r\nPortuguese-Brazil, Russian, Spanish\r\n\r\nInstall Notes\r\n\r\n1. Extract RARs\r\n2. Install the game\r\n3. Play the game\r\n4. Have fun!","last_updated":"2017-09-29T12:14:08.632Z","parsed":{"xt":"urn:btih:ac6e3c313925ebb18ad013a71baa8045febe0597","dn":"Absolver-Razor1911","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ac6e3c313925ebb18ad013a71baa8045febe0597","infoHashBuffer":{"type":"Buffer","data":[172,110,60,49,57,37,235,177,138,208,19,167,27,170,128,69,254,190,5,151]},"name":"Absolver-Razor1911","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}