{"title":"Taming Toxic People David Gillespie","magnet":"magnet:?xt=urn:btih:acc17df616f92b9896c04343f494a0097d04f982&dn=Taming+Toxic+People+David+Gillespie&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"durx","categoryP":"other","categoryS":"e_books","size":"417852","seeders":"37","leechers":"6","description":"&quot;I didn&apos;t know how to deal with the poisonous and toxic people in my life or why they behaved the way they did, so I went looking for an answer. This book is what I found.&quot;\r\n\r\nBestselling author David Gillespie turns his attention to a phenomenon that damages businesses, seeds mental disease and discomfort and can bring civilisations to the brink of implosion- the psychopath.\r\n\r\nPsychopaths are often thought of as killers and criminals, but actually five to ten per cent of people are probably psychopathic without ever indulging in a single criminal act. These everyday psychopaths may be charming in the early stages of relationships or employment but, Gillespie argues, their presence in your life is at best disruptive, and at worst highly dangerous: they will leave you feeling cheated and humiliated, dominating and manipulating you to the point where you question your sanity. Worse, he caution, at a societal level their tendency to gravitate towards positions of power can be disastrous.\r\n\r\nTaming Toxic People is a practical guide to restraining that difficult person in your life, be it your boss, your spouse or a parent. But it is also a serious and meticulously researched warning: if we value a free and well-functioning society, we need to rebuild the sense of community that has historically kept the everyday psychopath in check, and we must understand and act to manage the psychopathic behaviour in our midst","last_updated":"2017-07-29T12:05:18.590Z","parsed":{"xt":"urn:btih:acc17df616f92b9896c04343f494a0097d04f982","dn":"Taming Toxic People David Gillespie","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"acc17df616f92b9896c04343f494a0097d04f982","infoHashBuffer":{"type":"Buffer","data":[172,193,125,246,22,249,43,152,150,192,67,67,244,148,160,9,125,4,249,130]},"name":"Taming Toxic People David Gillespie","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}