{"title":"Lonely Boy_ Tales from a Sex Pistol by Steve Jones EPUB","magnet":"magnet:?xt=urn:btih:accc9355e8bdd3eba41bc8859f47e04f946b9129&dn=Lonely+Boy_+Tales+from+a+Sex+Pistol+by+Steve+Jones+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"18862161","seeders":"15","leechers":"8","description":"xx\r\n\r\nLonely Boy_ Tales from a Sex Pistol by Steve Jones EPUB\r\n\r\nAsk anyone who knows about music, and they&apos;ll tell you: Without Steve Jones punk rock would not exist. This is not hyperbole. No Steve Jones, no punk rock. Period. The prototypical street urchin turned Sex Pistols guitarist was the sole inspiration and creator of the punk movement that began shaking the culture in late 1970s London and is just as strong today.\r\n\r\nA pervasive air of gloom and coal smoke hangs over Jones&apos; memoir, Lonely Boy, which is set mostly in working-class London of the &apos;60s and &apos;70s. For the first time ever, he&apos;ll illustrate a moment in time when the actions of a loose association of people became the full-fledged punk scene we know so well today. Legendary artist and trendsetter Malcolm McLaren took in the young Jones after noticing him hanging around the sex boutique McLaren owned with his then girlfriend, Vivienne Westwood, on Kings Road in Chelsea. By then Jones was basically homeless, stealing anything and everything to support himself and scratch his itch for theft. He would frequently pop in to McLaren&apos;s legendary shop. McLaren was so fascinated by Jones&apos; rough background, wardrobe choices, attitude toward authority, and general aura that he created a cultural movement around it. And so the Sex Pistols, and with them punk rock, was born.\r\n\r\nIncluded in the book are never before told stories of sexual abuse Steve suffered at the hands of his stepfather, stories of petty crime and acts of perversion he perpetrated as a young boy in London, the sadness of never knowing his real father (and then meeting him in a tale that bookends this narrative nicely), the early days as a Pistol, breaking into the music business, and how the hell a band with one album meant so much to so many people. Jones will also bring readers up to speed on his more recent exploits, such as hosting a legendary radio show on KROQ, Jonesy&apos;s Jukebox; beginning an acting career by playing Krull on Showtime&apos;s Californication; his recovery from both sexual and substance addictions; and his attempts to fall in with the hair metal crowd of the Sunset Strip in the 1980s.\r\n\r\n..\r\n\r\nxx","last_updated":"2017-10-28T12:03:29.413Z","parsed":{"xt":"urn:btih:accc9355e8bdd3eba41bc8859f47e04f946b9129","dn":"Lonely Boy_ Tales from a Sex Pistol by Steve Jones EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"accc9355e8bdd3eba41bc8859f47e04f946b9129","infoHashBuffer":{"type":"Buffer","data":[172,204,147,85,232,189,211,235,164,27,200,133,159,71,224,79,148,107,145,41]},"name":"Lonely Boy_ Tales from a Sex Pistol by Steve Jones EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}