{"title":"Jerome F Buting - Illusion of Justice 2017 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:ae03a6f9be25ffa51e880f408a97698e081636b4&dn=Jerome+F+Buting+-+Illusion+of+Justice+2017+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3253473","seeders":"34","leechers":"6","description":"Jerome F Buting - Illusion of Justice 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nInterweaving an insider&apos;s account of the true-crime saga and Netflix sensation Making a Murderer with other controversial cases from his career, this powerful memoir from Steven Avery&apos;s defense attorney reveals the flaws in America&apos;s criminal justice system and puts forth a provocative, persuasive call for reform.\r\n\r\nNot since The Thin Blue Line has there been a true-crime saga as engrossing as Making a Murderer. Captivating audiences across demographic lines, it made Steven Avery a household name and thrust defense attorney Jerome F. Buting - and his fight against America&apos;s dysfunctional criminal justice system - into the spotlight.\r\n\r\nIn Illusion of Justice, Buting uses the Avery case as a springboard to examine the shaky integrity of our law enforcement and legal systems, which he has witnessed firsthand for nearly four decades. From his early career as a public defender to his success overturning wrongful convictions, his story provides a compelling insider&apos;s view into the high-stakes world of criminal defense and suggests that while in principle the law presumes innocence, in practice it more often than not presumes guilt.\r\n\r\nCombining narrative reportage with critical commentary and personal reflection, Buting explores his professional motivations, the high-profile cases that defined his career, and the path to much-needed criminal justice reform. Taking its place beside acclaimed best sellers such as Just Mercy and The New Jim Crow, Illusion of Justice is a tour de force from a relentless and eloquent advocate for justice who is determined to fulfill his professional responsibility - and, in the face of overwhelming odds, make the judicial system work as it is designed to","last_updated":"2017-05-23T18:51:43.248Z","parsed":{"xt":"urn:btih:ae03a6f9be25ffa51e880f408a97698e081636b4","dn":"Jerome F Buting - Illusion of Justice 2017 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ae03a6f9be25ffa51e880f408a97698e081636b4","infoHashBuffer":{"type":"Buffer","data":[174,3,166,249,190,37,255,165,30,136,15,64,138,151,105,142,8,22,54,180]},"name":"Jerome F Buting - Illusion of Justice 2017 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}