{"title":"PSYCHO-PASS: Mandatory Happiness","magnet":"magnet:?xt=urn:btih:ae88e8f860c9301dec26f7a24b4ccb8327744f32&dn=PSYCHO-PASS%3A+Mandatory+Happiness&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Browse dauphong","categoryP":"games","categoryS":"pc","size":"2193732189","seeders":"22","leechers":"26","description":"In the new future, everyone&apos;s mental state and disposition can now be quantified.\r\nEverything from emotional tendencies to criminal behavior are recorded and utilized as a guideline to lead everyone to the good life: not only pursuing happiness, but attaining it. Needless to say, the public was excited to begin quantifying their everyday lives. The general term for this value, which determines the morality of an individual&apos;s heart and soul, is commonly known as the Psycho-Pass.\r\n\r\nOne component of this value is the Crime Coefficient, which is ultimately a number that represents an individual&apos;s potential to commit crime. In order to combat those who attempt to disrupt the status quo, detectives work in tandem to maintain peace and order, composed of Enforcers and Inspectors. The former is tasked with apprehending suspects, while the latter oversees and commands their subordinate colleagues. After all, Enforcers possess high Crime Coefficients. However, because of their criminal nature, they can better understand what makes other criminals tick, allowing them to sniff out suspects and arrest the true perpetrators. But because of their criminal background, Inspectors are needed to provide a calm and sound judgement to each case. Ultimately, all members of the MWPSB have to walk a fine line, maintaining their own mental health while facing the worst that society has to offer.\r\n\r\nWith justice in their hearts, the detectives of Division 1 tackle each case, confronting humanity&apos;s ugly truths.\r\n\r\nBut, what lies ahead?","last_updated":"2017-04-25T12:42:47.355Z","parsed":{"xt":"urn:btih:ae88e8f860c9301dec26f7a24b4ccb8327744f32","dn":"PSYCHO-PASS: Mandatory Happiness","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ae88e8f860c9301dec26f7a24b4ccb8327744f32","infoHashBuffer":{"type":"Buffer","data":[174,136,232,248,96,201,48,29,236,38,247,162,75,76,203,131,39,116,79,50]},"name":"PSYCHO-PASS: Mandatory Happiness","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}