{"title":"After the Fire by Henning Mankell EPUB","magnet":"magnet:?xt=urn:btih:ae9530524785d840e92aa6baee767d30cfce6cf9&dn=After+the+Fire+by+Henning+Mankell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2075029","seeders":"0","leechers":"0","description":"xx\r\n\r\nAfter the Fire by Henning Mankell EPUB\r\n\r\nHenning Mankell&apos;s last novel about an aging man whose quiet, solitary life on an isolated island off the coast of Sweden is turned upside down when his house catches fire.\r\n\r\nFredrik Welin is a former surgeon who retired in disgrace decades earlier to a tiny island on which he is the only resident. He has a daughter he rarely sees, and his mailman, Jansson, is the closest thing he has to a friend and to an adversary. He is perfectly content to live out his days in quiet solitude.\r\n\r\nOne autumn evening, he is startled awake by a blinding light - only to discover that his house is on fire. With the help of Jansson, he escapes the flames just in time wearing two left boots. Dawn reveals that everything he owns is now a smoldering pile of ash, and his house is destroyed - forcing him to move into an abandoned trailer on his island. A local journalist, Lisa Modin, who wants to write a story about the fire, comes into his life. In doing so, she awakens in him something that he thought was long dead. Soon after, his daughter comes to the island with surprising news of her own. Meanwhile, the police suspect Fredrik of arson because he had a sizable insurance claim on his house. When Fredrik is away from the archipelago, another house goes up in flames, and the community realizes they have an arsonist in their midst.\r\n\r\nAfter the Fire is an intimate portrait of an elderly recluse who is forced to open himself up to a world he&apos;d left behind.\r\n\r\nxx","last_updated":"2017-11-01T12:03:06.857Z","parsed":{"xt":"urn:btih:ae9530524785d840e92aa6baee767d30cfce6cf9","dn":"After the Fire by Henning Mankell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ae9530524785d840e92aa6baee767d30cfce6cf9","infoHashBuffer":{"type":"Buffer","data":[174,149,48,82,71,133,216,64,233,42,166,186,238,118,125,48,207,206,108,249]},"name":"After the Fire by Henning Mankell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}