{"title":"The Last Stand by Nathaniel Philbrick EPUB","magnet":"magnet:?xt=urn:btih:aeacd8ca12a96926c37fdd516908d2c07cb64cd8&dn=The+Last+Stand+by+Nathaniel+Philbrick+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1701010","seeders":"35","leechers":"4","description":"xx\r\n\r\nThe Last Stand by Nathaniel Philbrick EPUB\r\n\r\nThe best-selling author of Mayflower sheds new light on one of the iconic stories of the American West.\r\n\r\nLittle Bighorn and Custer are names synonymous in the American imagination with unmatched bravery and spectacular defeat. Mythologized as Custer&apos;s Last Stand, the June 1876 battle has been equated with other famous last stands, from the Spartans&apos; defeat at Thermopylae to Davy Crockett at the Alamo.\r\n\r\nIn his tightly structured narrative, Nathaniel Philbrick brilliantly sketches the two larger-than-life antagonists: Sitting Bull, whose charisma and political savvy earned him the position of leader of the Plains Indians, and George Armstrong Custer, one of the Union&apos;s greatest cavalry officers and a man with a reputation for fearless and often reckless courage.\r\n\r\nPhilbrick reminds readers that the Battle of the Little Bighorn was also, even in victory, the last stand for the Sioux and Cheyenne Indian nations. Increasingly outraged by the government&apos;s Indian policies, the Plains tribes allied themselves and held their ground in southern Montana. Within a few years of Little Bighorn, however, all the major tribal leaders would be confined to Indian reservations.\r\n\r\nThroughout, Philbrick beautifully evokes the history and geography of the Great Plains with his characteristic grace and sense of drama. The Last Stand is a mesmerizing account of the archetypal story of the American West, one that continues to haunt our collective imagination.\r\n\r\nxx","last_updated":"2017-12-26T12:05:17.423Z","parsed":{"xt":"urn:btih:aeacd8ca12a96926c37fdd516908d2c07cb64cd8","dn":"The Last Stand by Nathaniel Philbrick EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aeacd8ca12a96926c37fdd516908d2c07cb64cd8","infoHashBuffer":{"type":"Buffer","data":[174,172,216,202,18,169,105,38,195,127,221,81,105,8,210,192,124,182,76,216]},"name":"The Last Stand by Nathaniel Philbrick EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}