{"title":"Member of the Family by Dianne Lake MOBI","magnet":"magnet:?xt=urn:btih:aeb95b49d4fa7198c7fa6302daf8f3ea31e997cc&dn=Member+of+the+Family+by+Dianne+Lake+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12406991","seeders":"0","leechers":"0","description":"xx\r\n\r\nMember of the Family by Dianne Lake MOBI\r\n\r\nIn this poignant and disturbing memoir of lost innocence, coercion, survival, and healing, Dianne Lake chronicles her years with Charles Manson, revealing for the first time how she became the youngest member of his Family and offering new insights into one of the 20th century&apos;s most notorious criminals and life as one of his &quot;girls&quot;.\r\n\r\nAt age 14, Dianne Lake - with little more than a note in her pocket from her hippie parents granting her permission to leave them - became one of &quot;Charlie&apos;s girls&quot;, a devoted acolyte of cult leader Charles Manson. Over the course of two years, the impressionable teenager endured manipulation, psychological control, and physical abuse as the harsh realities and looming darkness of Charles Manson&apos;s true nature revealed itself. From Spahn ranch and the group acid trips to The Beatles&apos; White Album and Manson&apos;s dangerous messiah complex, Dianne tells the riveting story of the group&apos;s descent into madness as she lived it.\r\n\r\nThough she never participated in any of the group&apos;s gruesome crimes and was purposely insulated from them, Dianne was arrested with the rest of the Manson Family and eventually learned enough to join the prosecution&apos;s case against them. With the help of good Samaritans, including the cop who first arrested her and later adopted her, the courageous young woman eventually found redemption and grew up to lead an ordinary life.\r\n\r\nWhile much has been written about Charles Manson, this riveting account from an actual Family member is a chilling portrait that recreates in vivid detail one of the most horrifying and fascinating chapters in modern American history.\r\n\r\nxx","last_updated":"2017-10-27T12:07:39.986Z","parsed":{"xt":"urn:btih:aeb95b49d4fa7198c7fa6302daf8f3ea31e997cc","dn":"Member of the Family by Dianne Lake MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"aeb95b49d4fa7198c7fa6302daf8f3ea31e997cc","infoHashBuffer":{"type":"Buffer","data":[174,185,91,73,212,250,113,152,199,250,99,2,218,248,243,234,49,233,151,204]},"name":"Member of the Family by Dianne Lake MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}