{"title":"Standard Deviation_ A Novel by Katherine Heiny ePUB MOBI eBOOK-Z","magnet":"magnet:?xt=urn:btih:af16a7378688fa15815e4211c3cbd049f30104f7&dn=Standard+Deviation_+A+Novel+by+Katherine+Heiny+ePUB+MOBI+eBOOK-Z&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4052552","seeders":"0","leechers":"0","description":"xx\r\n\r\nStandard Deviation_ A Novel by Katherine Heiny ePUB MOBI eBOOK-ZAK\r\n\r\nA divinely funny novel from the celebrated author of Single, Carefree, Mellow about the challenges of a good marriage, the delight and heartache of raising children, and the irresistible temptation to wonder about the path not taken.\r\n\r\nWhen Graham Cavanaugh divorced his first wife, it was to marry his girlfriend, Audra, a woman as irrepressible as she is spontaneous and fun. But, Graham learns, life with Audra can also be exhausting, constantly interrupted by chatty phone calls, picky-eater houseguests, and invitations to weddings of people he&apos;s never met. Audra firmly believes that through the sheer force of her personality, she can overcome the most socially challenging interactions, shepherding her son through awkward playdates and origami club, and even deciding to establish a friendship with Graham&apos;s first wife, Elspeth. Graham isn&apos;t sure he understands why Audra longs to be friends with the woman he divorced. After all, former spouses are hard to categorize - are they enemies, old flames, or just people you know really, really well? And as Graham and Audra share dinners, holidays, and late glasses of wine with his first wife, he starts to wonder: how can anyone love two such different women? Did I make the right choice? Is there a right choice?\r\n\r\nA hilarious and rueful debut novel of love, marriage, infidelity, and origami, Standard Deviation never deviates from the superb.\r\n\r\nxx","last_updated":"2017-07-30T12:00:32.132Z","parsed":{"xt":"urn:btih:af16a7378688fa15815e4211c3cbd049f30104f7","dn":"Standard Deviation_ A Novel by Katherine Heiny ePUB MOBI eBOOK-Z","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"af16a7378688fa15815e4211c3cbd049f30104f7","infoHashBuffer":{"type":"Buffer","data":[175,22,167,55,134,136,250,21,129,94,66,17,195,203,208,73,243,1,4,247]},"name":"Standard Deviation_ A Novel by Katherine Heiny ePUB MOBI eBOOK-Z","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}