{"title":"\nMoscow 1941_ A City and Its People at War by Rodric Braithwaite ","magnet":"magnet:?xt=urn:btih:b02f4938080179f452c39506b8cc83d49beec42f&dn=Moscow+1941_+A+City+and+Its+People+at+War+by+Rodric+Braithwaite+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10844364","seeders":"1","leechers":"1","description":"xx\r\n\r\nMoscow 1941_ A City and Its People at War by Rodric Braithwaite by Rodric Braithwaite ePUB eBOOK-ZAK\r\n\r\nThe 1941 Battle of Moscow, unquestionably one of the most decisive battles of World War II, marked the first strategic defeat of the German armed forces in their seemingly unstoppable march across Europe. The Soviets lost many more people in this one battle than the British and Americans lost in the whole of the Second World War. Now, with authority and narrative power, Rodric Braithwaite tells the story in large part through the individual experiences of ordinary Russian men and women.\r\n\r\nThe narrative is set firmly against the background of Moscow and its people, beginning in early 1941, when the Soviet Union was still untouched by the war raging to the west. We hear how, despite a mass of secret intelligence, the breaching of the border by the Wehrmacht in June took the country by surprise, and how, when the Germans pushed to Moscow in November, the Red Army and the capital&apos;s inhabitants undertook to defend their city. Finally, in the winter of 1941-1942, they turned the Germans back on the city&apos;s very outskirts. Braithwaite&apos;s dramatic, richly illustrated narrative of the military action offers telling portraits of Stalin and his generals. By interweaving the personal remembrances of soldiers, politicians, writers, artists, workers, and schoolchildren, he gives us an unprecedented understanding of how the war affected the daily life of Moscow, and of the extraordinary bravery, endurance, and sacrifice, both voluntary and involuntary, that was required of its citizens.\r\n\r\nThis is a brilliantly researched and realized history, and an essential addition to the literature of World War II.\r\n\r\nxx","last_updated":"2017-09-23T12:03:26.128Z","parsed":{"xt":"urn:btih:b02f4938080179f452c39506b8cc83d49beec42f","dn":"Moscow 1941_ A City and Its People at War by Rodric Braithwaite ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b02f4938080179f452c39506b8cc83d49beec42f","infoHashBuffer":{"type":"Buffer","data":[176,47,73,56,8,1,121,244,82,195,149,6,184,204,131,212,155,238,196,47]},"name":"Moscow 1941_ A City and Its People at War by Rodric Braithwaite ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}