{"title":"Patrick Kingsley - The New Odyssey 2017 RETAiL ePUB eBOOK-DiSTRi","magnet":"magnet:?xt=urn:btih:b076c3948bcf47f4472d3be97057821c1d72f9f4&dn=Patrick+Kingsley+-+The+New+Odyssey+2017+RETAiL+ePUB+eBOOK-DiSTRi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"21444822","seeders":"0","leechers":"0","description":"xx\r\n\r\nPatrick Kingsley - The New Odyssey 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn the humane tradition of Katherine Boo&apos;s Behind the Beautiful Forevers comes a searing account of the international refugee crisis.\r\n\r\nOn the day of his son&apos;s 14th birthday, Hashem al-Souki lay somewhere in the Mediterranean, crammed in a wooden dinghy. His family was relatively safe - at least for the time being - in Egypt, where they had only just settled after fleeing their war-torn Damascus home three years prior. Traversing these unforgiving waters and the treacherous terrain that would follow was worth the slim chance of securing a safe home for his children in Sweden. If he failed, at least he would fail alone.\r\n\r\nHashem&apos;s story is tragically common, as desperate victims continue to embark on deadly journeys in search of freedom. Tracking the harrowing experiences of these brave refugees, The New Odyssey finally illuminates the shadowy networks that have facilitated the largest forced exodus since the end of World War II.\r\n\r\nThe Guardian&apos;s first-ever migration correspondent, Patrick Kingsley has traveled through 17 countries to put an indelible face on this overwhelming disaster. Embedding himself alongside the refugees, Kingsley reenacts their flight with hundreds of people across the choppy Mediterranean in the hopes of better understanding who helps or hinders their path to salvation. From the starving migrants who push through sandstorms with children strapped to their backs to the exploitive criminals who prey on them, from the smugglers who dangerously stretch the limits of their cargo space to the volunteers who uproot their own lives to hand out water bottles, what emerges is a kaleidoscope of humanity in the wake of tragedy. By simultaneously tracing the narrative of Hashem, who endured the trek not once but twice, Kingsley memorably creates a compassionate, visceral portrait of the mass migration in both its epic scope and its heartbreaking specificity.\r\n\r\nxx","last_updated":"2017-07-05T12:00:14.810Z","parsed":{"xt":"urn:btih:b076c3948bcf47f4472d3be97057821c1d72f9f4","dn":"Patrick Kingsley - The New Odyssey 2017 RETAiL ePUB eBOOK-DiSTRi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b076c3948bcf47f4472d3be97057821c1d72f9f4","infoHashBuffer":{"type":"Buffer","data":[176,118,195,148,139,207,71,244,71,45,59,233,112,87,130,28,29,114,249,244]},"name":"Patrick Kingsley - The New Odyssey 2017 RETAiL ePUB eBOOK-DiSTRi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}