{"title":"Eccentric Orbits_ The Iridium Story by John Bloom EPUB","magnet":"magnet:?xt=urn:btih:b0868ddc90906e702a2976567cb53d2e6e2744ba&dn=Eccentric+Orbits_+The+Iridium+Story+by+John+Bloom+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7319023","seeders":"58","leechers":"6","description":"xx\r\n\r\nEccentric Orbits_ The Iridium Story by John Bloom EPUB\r\n\r\nThe incredible story of Iridium - the most complex satellite system ever built, the cell phone of the future, and one of the largest corporate bankruptcies in American history - and one man&apos;s desperate race to save it.\r\n\r\nIn the early 1990s, Motorola, the legendary American technology company, developed a revolutionary satellite system called Iridium that promised to be its crowning achievement. Light-years ahead of anything previously put into space, and built on technology developed for Ronald Reagan&apos;s &quot;Star Wars&quot;, Iridium&apos;s constellation of 66 satellites in polar orbit meant that no matter where you were on Earth, at least one satellite was always overhead, and you could call Tibet from Fiji without a delay and without your call ever touching a wire.\r\n\r\nIridium the satellite system was a mind-boggling technical accomplishment, surely the future of communication. The only problem was that Iridium the company was a commercial disaster. Only months after launching service, it was $11 billion in debt, burning through $100 million a month, and crippled by baroque rate plans and agreements that forced calls through Moscow; Beijing; Fucino, Italy; and elsewhere. Bankruptcy was inevitable - the largest to that point in American history. And when no real buyers seemed to materialize, it looked like Iridium would go down as just a &quot;science experiment&quot;.\r\n\r\nThat is, until Dan Colussy got a wild idea. Colussy, a former head of Pan Am now retired and working on his golf game in Palm Beach, heard about Motorola&apos;s plans to &quot;de-orbit&quot; the system and decided he would buy Iridium and somehow turn around one of the biggest blunders in the history of business.\r\n\r\nIn Eccentric Orbits, John Bloom masterfully traces the conception, development, and launching of Iridium and Colussy&apos;s tireless efforts to stop it from being destroyed, from meetings with his motley investor group to the Clinton White House, the Pentagon, and the hunt for customers in special ops, shipping, aviation, mining, search and rescue - anyone who would need a durable phone at the end of the Earth. Impeccably researched and wonderfully told, Eccentric Orbits is a rollicking, unforgettable tale of technological achievement, business failure, the military-industrial complex, and one of the greatest deals of all time.\r\n\r\nxx","last_updated":"2017-12-09T12:08:43.206Z","parsed":{"xt":"urn:btih:b0868ddc90906e702a2976567cb53d2e6e2744ba","dn":"Eccentric Orbits_ The Iridium Story by John Bloom EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b0868ddc90906e702a2976567cb53d2e6e2744ba","infoHashBuffer":{"type":"Buffer","data":[176,134,141,220,144,144,110,112,42,41,118,86,124,181,61,46,110,39,68,186]},"name":"Eccentric Orbits_ The Iridium Story by John Bloom EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}