{"title":"Alien Skin Software Photo Bundle Collection May 2017 [Mac OSX]","magnet":"magnet:?xt=urn:btih:b2a714ac9aa0f2b3437795168986904af9144a86&dn=Alien+Skin+Software+Photo+Bundle+Collection+May+2017+%5BMac+OSX%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"mac","size":"582543785","seeders":"1","leechers":"0","description":"Alien Skin Software Photo Bundle Collection\r\n\r\nThe Photo Bundle includes all of our award-winning photography plug-ins: Blow Up, Exposure, Snap Art, Eye Candy. Each of these products enhances a professional workflow by improving image quality, saving time, and providing creative freedom. In combination, these products are even more effective.\r\n\r\nExposure X2\r\n\r\nExposure X2 is an advanced RAW photo editor and organizer that improves every step in your editing workflow. Use it to quickly organize your images, non destructively edit your photos, and apply gorgeous looks and special effects.\r\n\r\nExposure X Bundle\r\n\r\nThe Exposure X Bundle is a photo editor and organizer that integrates all of Alien Skin&#x2019;s award-winning photo editing apps into a single product.. The centerpiece of the bundle is Exposure X, the editing app that streamlines your workflow and provides a rich set of creative tools. Two additional apps expand the creative possibilities: Blow Up 3 enlarges your photos into large prints with the sharpest resizing technology available, and Snap Art 4 transforms your photos into gorgeous, handcrafted paintings.\r\n\r\nSnap Art\r\n\r\nExpand your palette of creative tools with Snap Art. Transforming your photographs into beautiful works of art has never been easier than with Snap Art 4. By analyzing the visual elements and techniques of artists through the centuries, we have designed Snap Art to produce images that look they were made by a human, not a computer.\r\n\r\nBlow Up\r\n\r\nSharp Enlargements at Any Size. Blow Up keeps photos crystal clear during enlargement. Especially in large prints hung on a wall, the difference between Blow Up and Photoshop is astounding. Version 3 makes pictures even sharper without computer artifacts","last_updated":"2017-05-25T10:08:22.960Z","parsed":{"xt":"urn:btih:b2a714ac9aa0f2b3437795168986904af9144a86","dn":"Alien Skin Software Photo Bundle Collection May 2017 [Mac OSX]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b2a714ac9aa0f2b3437795168986904af9144a86","infoHashBuffer":{"type":"Buffer","data":[178,167,20,172,154,160,242,179,67,119,149,22,137,134,144,74,249,20,74,134]},"name":"Alien Skin Software Photo Bundle Collection May 2017 [Mac OSX]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}