{"title":"Forest Dark_ A Novel by Nicole Krauss ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:b33f1b66d78969fd1ecc606a8dbd8f206ff2d9bf&dn=Forest+Dark_+A+Novel+by+Nicole+Krauss+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3329709","seeders":"0","leechers":"0","description":"xx\r\n\r\nForest Dark_ A Novel by Nicole Krauss ePUB eBOOK-ZAK\r\n\r\nThe award-winning, New York Times best-selling author of The History of Love conjures an achingly beautiful and breathtakingly original novel about personal transformation that interweaves the stories of two disparate individuals - an older lawyer and a young novelist - whose transcendental search leads them to the same Israeli desert.\r\n\r\nJules Epstein, a man whose drive, avidity, and outsize personality have, for 68 years, been a force to be reckoned with, is undergoing a metamorphosis. In the wake of his parents&apos; deaths, his divorce from his wife of more than 30 years, and his retirement from the New York legal firm where he was a partner, he&apos;s felt an irresistible need to give away his possessions, alarming his children and perplexing the executor of his estate. With the last of his wealth, he travels to Israel with a nebulous plan to do something to honor his parents. In Tel Aviv, he is sidetracked by a charismatic American rabbi planning a reunion for the descendants of King David who insists that Epstein is part of that storied dynastic line. He also meets the rabbi&apos;s beautiful daughter, who convinces Epstein to become involved in her own project - a film about the life of David being shot in the desert - with life-changing consequences.\r\n\r\nBut Epstein isn&apos;t the only seeker embarking on a metaphysical journey that dissolves his sense of self, place, and history. Leaving her family in Brooklyn, a young, well-known novelist arrives at the Tel Aviv Hilton, where she has stayed every year since birth. Troubled by writer&apos;s block and a failing marriage, she hopes that the hotel can unlock a dimension of reality - and her own perception of life - that has been closed off to her. But when she meets a retired literature professor who proposes a project she can&apos;t turn down, she&apos;s drawn into a mystery that alters her life in ways she could never have imagined.\r\n\r\nBursting with life and humor, Forest Dark is a profound, mesmerizing novel of metamorphosis and self-realization - of looking beyond all that is visible toward the infinite.\r\n\r\nxx","last_updated":"2017-09-19T12:17:03.103Z","parsed":{"xt":"urn:btih:b33f1b66d78969fd1ecc606a8dbd8f206ff2d9bf","dn":"Forest Dark_ A Novel by Nicole Krauss ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b33f1b66d78969fd1ecc606a8dbd8f206ff2d9bf","infoHashBuffer":{"type":"Buffer","data":[179,63,27,102,215,137,105,253,30,204,96,106,141,189,143,32,111,242,217,191]},"name":"Forest Dark_ A Novel by Nicole Krauss ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}