{"title":"The Spies of Winter: GHCQ Codebreakers Who Fought the Cold War","magnet":"magnet:?xt=urn:btih:b358729c0c5710db6b1526062eb092fabfc9d70b&dn=The+Spies+of+Winter%3A+GHCQ+Codebreakers+Who+Fought+the+Cold+War&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"6010124","seeders":"62","leechers":"9","description":"The Spies of Winter: The GHCQ Codebreakers Who Fought the Cold War - Sinclair McKay [epub]\r\n\r\nFollowing on from the enormous success of his bestseller, The Secret Life of Bletchley Park, renowned author Sinclair McKay uncovers the story of what happened after the end of the Second World War.\r\n\r\nOnce victory was declared, many of the individuals who had achieved the seemingly impossible at Bletchley Park by cracking the impenetrable Enigma codes and giving the Allies an invaluable insight directly into the Nazi war machine, moved on to GCHQ. This was the British government&#x2019;s new facility established to fight a different, but no less formidable foe &#x2013; Stalin and the KGB.\r\n\r\nFascinating and insightful revelations from deep within the archives of this secret organisation reveal the story of the tumultuous early years of GCHQ as it navigated its way through an era of double agents, deception and betrayals. From the defection of the Cambridge Five and the treachery of the atomic scientist Klaus Fuchs, to the collapse of the British Empire, the ascension of Chairman Mao and the emergence of the US as a superpower, McKay deftly explores the impact these events had on the fledgling organisation.\r\n\r\nDuring the years of the Cold War the men and women of GCHQ penetrated Soviet encryptions and gathered crucial intelligence from all over the world. The Spies of Winter tells the story of the codebreakers themselves and how they used new technology to expand the horizons of cryptography in order to defend the nation and maintain the fragile peace in a world now under the shadow of nuclear holocaust","last_updated":"2017-06-05T12:04:07.591Z","parsed":{"xt":"urn:btih:b358729c0c5710db6b1526062eb092fabfc9d70b","dn":"The Spies of Winter: GHCQ Codebreakers Who Fought the Cold War","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b358729c0c5710db6b1526062eb092fabfc9d70b","infoHashBuffer":{"type":"Buffer","data":[179,88,114,156,12,87,16,219,107,21,38,6,46,176,146,250,191,201,215,11]},"name":"The Spies of Winter: GHCQ Codebreakers Who Fought the Cold War","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}