{"title":"The Taking of K-129_ How the CIA Used Howard Hughes to Steal a R","magnet":"magnet:?xt=urn:btih:b3856f68603cf289d8554c33abd55c719f96d520&dn=The+Taking+of+K-129_+How+the+CIA+Used+Howard+Hughes+to+Steal+a+R&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12867381","seeders":"1","leechers":"9","description":"xx\r\n\r\nThe Taking of K-129_ How the CIA Used Howard Hughes to Steal a Russian Sub in the Most Daring Covert Operation in History by Josh Dean MOBI eBOOK-ZAK\r\n\r\nAn incredible true tale of espionage and engineering set at the height of the Cold War - a mix between The Hunt for Red October and Argo - about how the CIA, the US Navy, and America&apos;s most eccentric mogul spent six years and nearly a billion dollars to steal the nuclear-armed Soviet submarine K-129 after it had sunk to the bottom of the Pacific Ocean, all while the Russians were watching.\r\n\r\nIn the early hours of February 25, 1968, a Russian submarine armed with three nuclear ballistic missiles set sail from its base in Siberia on a routine combat patrol to Hawaii. Then it vanished.\r\n\r\nAs the Soviet navy searched in vain for the lost vessel, a small, highly classified American operation using sophisticated deep-sea spy equipment found it - wrecked on the sea floor at a depth of 16,800 feet, far beyond the capabilities of any salvage that existed. But the potential intelligence assets onboard the ship - the nuclear warheads, battle orders, and cryptological machines - justified going to extreme lengths to find a way to raise the submarine.\r\n\r\nSo began Project Azorian, a top-secret mission that took six years, cost an estimated $800 million, and would become the largest and most daring covert operation in CIA history.\r\n\r\nAfter the US Navy declared retrieving the sub &quot;impossible&quot;, the mission fell to the CIA&apos;s burgeoning Directorate of Science and Technology, the little-known division responsible for the legendary U-2 and SR-71 Blackbird spy planes. Working with Global Marine Systems, the country&apos;s foremost maker of exotic, deep-sea drilling vessels, the CIA commissioned the most expensive ship ever built and told the world that it belonged to the reclusive billionaire Howard Hughes, who would use the mammoth ship to mine rare minerals from the ocean floor. In reality, a complex network of spies, scientists, and politicians attempted a project even crazier than Hughes&apos; reputation: raising the sub directly under the watchful eyes of the Russians.\r\n\r\nThe Taking of K-129 is a riveting, almost unbelievable true-life tale of military history, engineering genius, and high-stakes spy craft set during the height of the Cold War, when nuclear annihilation was a constant fear and the opportunity to gain even the slightest advantage over your enemy was worth massive risk.\r\n\r\nxx","last_updated":"2017-09-06T12:01:01.010Z","parsed":{"xt":"urn:btih:b3856f68603cf289d8554c33abd55c719f96d520","dn":"The Taking of K-129_ How the CIA Used Howard Hughes to Steal a R","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b3856f68603cf289d8554c33abd55c719f96d520","infoHashBuffer":{"type":"Buffer","data":[179,133,111,104,96,60,242,137,216,85,76,51,171,213,92,113,159,150,213,32]},"name":"The Taking of K-129_ How the CIA Used Howard Hughes to Steal a R","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}