{"title":"CyberLink YouCam Deluxe 7.0.2827.0 Final + Patch - [SH]","magnet":"magnet:?xt=urn:btih:b3c37e09351b38e7f4946bfb01b1e758257c7ac0&dn=CyberLink+YouCam+Deluxe+7.0.2827.0+Final+%2B+Patch+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"473484439","seeders":"6","leechers":"6","description":"YouCam 7 delivers the functionality of a complete live video studio, to take full advantage of your webcam. It comes with face beautifier tools, over 200 fun effects for video chats and recordings, and a full set of capture tools. Additionally, it offers simple-to-use and efficient security tools, such as surveillance and face login. Transform your virtual presence with YouCam 7.Choose from over 200 fun and interesting effects that can be applied to your video chats and video recording projects, with thousands more available for download on DirectorZone. Both frames and scenes let you blend the image from your webcam with another image effect. Use them to spice up your video and compose the perfect portrait or an ultra cool profile picture. The many entertaining effects available in YouCam include colorful interactive particles, as well as many funhouse-like filter and distortion effects. Redefine your universe with particles filters and distortions. Choose face-tracking accessories that move when you do, and communicate how you really feel with hilarious animated emoticons. Emoticons can also be paired with other effects to double the fun! Enhance your webcam photos using a range of brush sizes and colors, or try freestyle drawing using your fingers on the touch-screen. Photo presets let you easily and quickly adjust the mood and artistic feel of your pictures. Rotate and crop webcam photos to extract the best parts for sharing","last_updated":"2017-05-31T12:06:29.278Z","parsed":{"xt":"urn:btih:b3c37e09351b38e7f4946bfb01b1e758257c7ac0","dn":"CyberLink YouCam Deluxe 7.0.2827.0 Final   Patch - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b3c37e09351b38e7f4946bfb01b1e758257c7ac0","infoHashBuffer":{"type":"Buffer","data":[179,195,126,9,53,27,56,231,244,148,107,251,1,177,231,88,37,124,122,192]},"name":"CyberLink YouCam Deluxe 7.0.2827.0 Final   Patch - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}