{"title":"Sometimes Brilliant by Larry Brilliant EPUB","magnet":"magnet:?xt=urn:btih:b40d43b3e3105cbb3741e3c7775c81fac9f76afc&dn=Sometimes+Brilliant+by+Larry+Brilliant+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9560013","seeders":"1","leechers":"0","description":"xx\r\n\r\nSometimes Brilliant by Larry Brilliant EPUB\r\n\r\nWhen a powerful mystic steps on the hand of a radical young hippie doctor from Detroit, it changes lives and the world. Sometimes Brilliant is the adventures of a philosopher, mystic, hippie, doctor, groundbreaking tech innovator, and key player in the eradication of one of the worst pandemics in human history. His story, of what happens when love, compassion and determination meet the right circumstances to effect positive change, is the kind that keeps hope and the sense of possibility alive.\r\n\r\nAfter sitting at the feet of Martin Luther King at the University of Michigan in 1963, Larry Brilliant was swept up into the civil rights movement, marching and protesting across America and Europe. As a radical young doctor he followed the hippie trail from London over the Khyber Pass with his wife Girija, Wavy Gravy and the Hog Farm commune to India. There, he found himself in a Himalayan ashram wondering whether he had stumbled into a cult. Instead, one of India&#x2019;s greatest spiritual teachers, Neem Karoli Baba, opened Larry&#x2019;s heart and told him his destiny was to work for the World Health Organization to help eradicate killer smallpox. He would never have believed he would become a key player in eliminating a 10,000-year-old disease that killed more than half a billion people in the 20th century alone.\r\n\r\nBrilliant&#x2019;s unlikely trajectory, chronicled in Sometimes Brilliant, has brought him into close proximity with political leaders, spiritual masters, cultural heroes, and titans of technology around the world&#x2014;from the Grateful Dead to Mikhail Gorbachev, from Ram Dass, the Dalai Lama, Lama Govinda, and Karmapa to Steve Jobs and the founders of Google, Salesforce,Microsoft and eBay and Presidents Carter, Clinton, Bush and Obama. Anchored by the engrossing account of the heroic efforts of the extraordinary people involved in smallpox eradication in India, this is a riveting and fascinating epidemiological adventure, an honest reckoning of an entire generation, and a deeply moving spiritual memoir. It is a testament to faith, love, service, and what it means to engage with life&#x2019;s most important questions in pursuit of a better, more brilliant existence.\r\n\r\nxx","last_updated":"2017-11-04T12:01:29.009Z","parsed":{"xt":"urn:btih:b40d43b3e3105cbb3741e3c7775c81fac9f76afc","dn":"Sometimes Brilliant by Larry Brilliant EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b40d43b3e3105cbb3741e3c7775c81fac9f76afc","infoHashBuffer":{"type":"Buffer","data":[180,13,67,179,227,16,92,187,55,65,227,199,119,92,129,250,201,247,106,252]},"name":"Sometimes Brilliant by Larry Brilliant EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}