{"title":"The Beatles - 1969-1970 - The End - DVD5","magnet":"magnet:?xt=urn:btih:b4e4892baeeb8448bd939548daab8bcf1c4baeb5&dn=The+Beatles+-+1969-1970+-+The+End+-+DVD5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"GRNS3","categoryP":"video","categoryS":"music_videos","size":"3757325344","seeders":"28","leechers":"15","description":"Here is an excellent Beatles compilation dvd with lots of very rare footage.\r\n\r\nPlease enjoy and share with friends (for FREE!). You can show your appreciation for all the great music i share with you by leaving your computer running for a few days or if possible weeks. Any seeding help welcome, no matter how small or big.\r\n==================================================================================\r\nThe Beatles - 1969/1970 The End\r\nLabel: Capitol Fake\r\nMenu: Yes\r\nChapters: Yes  <a href=\"\nhttps://imgur.com/nHEj5DP\" rel=\"nofollow\" target=\"_NEW\">\nhttps://imgur.com/nHEj5DP</a>\r\n\r\n\r\nNTSC\r\nAudio Codec: AC3\r\nAudio Bitrate: 256kb/s\r\nVideo Codec: MPEG2 720 x 480  29.97 fps\r\nVideo Bitrate: 3663 kb/s\r\n1 hours 59 minutes 40 seconds\r\n\r\n\r\n-1 Festival di Sanremo 1st February 1969 - Mary Hopkin sings her release of\r\n   &quot;Lontano Dagli Occhi&quot; in Italian 2:59  \r\n\r\n-2 Goodbye Released 28th March 1969 - This is a Mary Hopkin performance.\r\n   Seems to be from &quot;Beat Club News&quot; and is a promo featuring Paul. Tony\r\n   Bramwell of Apple attended the recording session and filmed some of it on\r\n   16mm film to be used as as a promo.\tThis is it, showing Paul and Mary\r\n   talking and working - not miming. Although it is in black-and-white, the\r\n   bits with Paul are repeated briefly in colour at the end. It was never\r\n   shown on British T.V. 2:20  \r\n\r\n-3 Goodbye 25th May 1969 - Mary Hopkin on the Ed Sullivan Show (Colour) 2:41  \r\n\r\n-4 George Gets Busted Silent Newsreel Footage - Extremely brief ! 12th March\r\n   1969 - George and Patti arrived late at Paul&apos;s wedding reception because\r\n   the notorious Sergeant Pilcher chose Paul&apos;s wedding day to raid George&apos;s\r\n   house for drugs, bringing a large piece of hashish with them (in case they\r\n    didn&apos;t find anything) which they then &quot;found&quot; on the floor. They were\r\n   taken to Esher Police Station and formally charged with possession of\r\n   cannabis resin. Pilcher was found guilty of police corruption in October\r\n   1972 and jailed for 6 years. 0:08  \r\n\r\n-5 Paul Marries Linda Newsreel Footage - Different sources spliced together.\r\n   Some are silent, some in colour, some the same but with different language\r\n   voice-overs. A Mess.12th March 1969 - Paul and Linda were married at\r\n   Marylebone Register Office, with his brother Michael and roadie Mal Evans\r\n   as witnesses. Afterwards they went to St John&apos;s Wood Church where their\r\n   marriage was blessed by the Rev. Noel Perry-Gore. There was a luncheon\r\n   reception afterwards at the Ritz Hotel attended by Princess Margaret and\r\n   Lord Snowdon. None of the other Beatles attended the wedding. 10:41\t\r\n\r\n-6 Paul at London Airport Interview with Paul and Linda  167th March 1969 -\r\n   Paul and Linda with Heather flew to New York to spend three weeks with her\r\n   family. 1:05  \r\n\r\n-7 John Marries Yoko Newsreel Footage 20th March 1969 - John and Yoko, still\r\n   in Paris, had tried to get married on the cross-channel ferry but were\r\n   refused permission to board The Dragon at Southampton because of\r\n   &quot;inconsistencies in their passports&quot;. Peter Brown at Apple found that they\r\n   could get married on the British-governed island of Gibraltar. John, Yoko,\r\n   Peter Brown and official photographer David Nutter flew to Gibraltar by\r\n   private jet. They arrived at 8.30am and were at the British Consulate when\r\n   it opened at 9am. There, registrar Cecil Wheeler married them with Peter\r\n   Brown and David Nutter as their witnesses. They remained in Gibraltar for\r\n   just 70 minutes before flying straight back to Paris and their luxury\r\n   suite. 0:56\t\r\n\r\n-8 John in Amsterdam Newsreel Footage 25th March 1969 - John and Yoko flew to\r\n   Amsterdam to begin a seven-day peace bed-in in room 902 of the Hilton\r\n   Hotel. 1:27\t\r\n\r\n-9 George After Court Newsreel Footage - Silent and extremely brief 31st\r\n   March 1969 - George and Patti were found guilty of possession of cannabis\r\n   at Esher and Walton Magistrates&apos; Court and were each fined &#xA3;250 with ten\r\n   guineas costs. 0:07\t\r\n\r\n-10 John at London Airport   John and Yoko - Newsreel Footage, initially\r\n    silent, then some interview 1st April 1969 - John and Yoko returned to\r\n    London and gave a press conference at Heathrow. 1:28  \r\n\r\n-11 Get Back Promo No.1 - Rooftop performance 2:53 \r\n\r\n-12 Don&apos;t Let Me Down Promo (seated in studio, plus rooftop performance) 3:19 \r\n\r\n-13 Get Back Promo No.2 (Excerpt from Let It Be) 3:10 \r\n\r\n-14 Ballad Of John And Yoko  Promo 3:06  \r\n\r\n-15 Ringo in Southampton Ringo with Peter Sellers - Newsreel Footage 16th May\r\n    1969 - Ringo and Maureen, Peter Sellers and his wife, director Joe\r\n    McGrath and producer Denis O&apos;Dell and their wives were given a free trip\r\n    to New York on the newly launched Queen Elizabeth II by Commonwealth\r\n    United, the backers of  The Magic Christian, as a reward for bringing in\r\n    the film on time and under budget. In this clip Ringo and Sellers are\r\n    seen dancing, then a brief interview 1:01  \r\n\r\n-16 John in Freeport John and Yoko in Freeport - Brief clip. 25th May 1969 -\r\n    Freeport is a city on the island of Grand Bahama. John and Yoko intended\r\n    to hold another bed-in for peace  at the Sheraton Oceanus Hotel but found\r\n    it too hot there to stay in bed and wanted to go elsewhere. In this clip\r\n    John is told that Air Canada will fly them and he breaks into song. 0:08  \r\n\r\n-17 John in Toronto Newsreel Footage (Silent) 26th May 1969 - They were held\r\n    at the airport for two and a half hours by the immigration authorities\r\n    but were eventually allowed  to enter the country where they spent the\r\n    night of 25th May in a Toronto motel, before flying out the next day.\r\n    0:51 \r\n\r\n-18 John in Montreal Rare Interview Footage 29th May 1969 - Footage from the\r\n    eight-day bed-in for peace in room 1742 of the Queen Elizabeth Hotel.\r\n    2:41 \r\n\r\n-19 Here Comes The Sun Home movie footage filmed at Esher 2:57 \r\n\r\n-20 Come Together Home movie footage filmed at Abbey Road 3:37 \r\n\r\n-21 Isle of Wight Newsreel Footage (Silent !) 31st August 1969 - John, George\r\n    and Ringo saw Bob Dylan &amp; The Band headline at the Isle of Wight rock\r\n    festival. In this brief clip John and Ringo are seen in the audience\r\n    while Dylan is on stage. 0:38 \r\n\r\n-22 John at Apple Interview Footage 15th September 1969 1:03  \r\n\r\n-23 The Music Scene 22nd September 1969 Music Scene report which goes into\r\n    the promo for Ballad Of John and Yoko (after the clip there is 15 seconds\r\n    of dead screen with 19/5/2000 on it) 4:15 \r\n\r\n-24 Is Paul Dead ? Newsreel Footage 22nd and 24th October 1969 7:23 \r\n\r\n-25 Paul in Campbeltown Newsreel Footage (colour) 24th October 1969 - Paul\r\n    was interviewed on his Scottish farm by BBC journalist Chris Drake who\r\n    was determined to put an end  to the absurd &quot;Paul is dead&quot; rumours coming\r\n    from the States. This clip though, just shows Paul wandering around with\r\n    Martha. 1:24 \r\n\r\n-26 Something Promo 2:59  1970 \r\n\r\n-27 John in Paris 26th January 1970 Trapped by fog, John is interviewed at\r\n    the Hilton and reveals his new short haircut 1:30 \r\n\r\n-28 John at Black Centre Interview Footage 4th February 1970 0:57 \r\n\r\n-29 Ringo on Laugh-In 23rd February 1970 - In colour Not the whole Rowan &amp;\r\n    Martin&apos;s show, but edited down to all the relevant Ringo parts 9:02 \r\n\r\n-30 Magic Christian Trailer Trailer for Ringo&apos;s movie 1:49 \r\n\r\n-31 Let It Be Ed Sullivan Show 1st March 1970 3:40 \r\n\r\n-32 Two Of Us Ed Sullivan presents the Beatles Songbook, followed by the full\r\n    promo&apos;s with the Apple Ident. Fades with Hey Jude. 4:32 \r\n\r\n-33 Let It Be 6:24 \r\n\r\n-34 The Beatles Break-up Derek Taylor talking in Italy 10th April 1970 - Paul\r\n    publicly announced the break-up of The Beatles 0:52 \r\n\r\n-35 The Break-up 12th April 1970 Newsreel footage outside Apple 18:10 \r\n\r\n-36 Let It Be Trailer for the film. 1:04 \r\n\r\n-37 For You Blue Film Excerpt with Apple ident 3:06 \r\n\r\n-38 The Break-up Interview December 1970 - I don&apos;t recognise the face ? 2:12 \r\n\r\n-39 Paul at the High Court Newsreel footage - Silent and very brief - blink\r\n    and you miss it.19th February 1971 - This is day one of  The Beatles High\r\n    Court Case 0:04 \r\n","last_updated":"2017-12-17T12:06:59.115Z","parsed":{"xt":"urn:btih:b4e4892baeeb8448bd939548daab8bcf1c4baeb5","dn":"The Beatles - 1969-1970 - The End - DVD5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b4e4892baeeb8448bd939548daab8bcf1c4baeb5","infoHashBuffer":{"type":"Buffer","data":[180,228,137,43,174,235,132,72,189,147,149,72,218,171,139,207,28,75,174,181]},"name":"The Beatles - 1969-1970 - The End - DVD5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}