{"title":"\nThe Ten Types of Human_ A New Understanding of Who We Are, and W","magnet":"magnet:?xt=urn:btih:b5a3d9103b38d6ee79bbcf775fac6091d159554e&dn=The+Ten+Types+of+Human_+A+New+Understanding+of+Who+We+Are%2C+and+W&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10843212","seeders":"24","leechers":"16","description":"xx\r\n\r\nThe Ten Types of Human_ A New Understanding of Who We Are, and Who We Can Be by Dexter Dias ePUB eBOOK-ZAK\r\n\r\nThis book will introduce you to ten people. In a way, you already know them. Only you don&apos;t - not really. In a sense, they are you. Only they&apos;re not entirely. They inform and shape the most important decisions in your life. But you&apos;re almost certainly unaware of their intervention.\r\n\r\nThey are the Ten Types of Human. Who are they? What are they for? How did they get into your head? We want to believe that there are some things we would never do. We want to believe that there are others we always would. But how can we be sure? What are our limits? Do we have limits? The answer lies with the Ten Types of Human: the people we become when we are faced with life&apos;s most difficult decisions. But who or what are these types? Where do they come from? How did they get into our heads?\r\n\r\nThe Ten Types of Human is a pioneering examination of human nature. It looks at the best and worst that human beings are capable of and asks why. It explores the frontiers of the human experience, excavating the forces that shape our thoughts and actions in extreme situations. It begins in a courtroom and journeys across four continents and through the lives of some exceptional people, in search of answers.\r\n\r\nMixing cutting-edge neuroscience, social psychology and human rights research, The Ten Types of Human is at once a provocation and a map to our hidden selves. It provides a new understanding of who we are - and who we can be.\r\n\r\nxx","last_updated":"2017-09-22T12:03:17.064Z","parsed":{"xt":"urn:btih:b5a3d9103b38d6ee79bbcf775fac6091d159554e","dn":"The Ten Types of Human_ A New Understanding of Who We Are, and W","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b5a3d9103b38d6ee79bbcf775fac6091d159554e","infoHashBuffer":{"type":"Buffer","data":[181,163,217,16,59,56,214,238,121,187,207,119,95,172,96,145,209,89,85,78]},"name":"The Ten Types of Human_ A New Understanding of Who We Are, and W","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}