{"title":"The Fall of the House of FIFA: The Multimillion-Dollar Corruptio","magnet":"magnet:?xt=urn:btih:b5c60eb5bf0d725f9f25c29b3b753b207ba16f5d&dn=The+Fall+of+the+House+of+FIFA%3A+The+Multimillion-Dollar+Corruptio&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roxanne278","categoryP":"other","categoryS":"e_books","size":"1877422","seeders":"51","leechers":"7","description":"The Fall of the House of FIFA: The Multimillion-Dollar Corruption at the Heart of Global Soccer/David Conn/2017/EPUB/\r\n\r\nEnglish|Non-Fiction|ISBN:1568585969|336pg|2MB \r\n\r\n\r\nFifa was founded in 1904 to unite the football-playing world, its first congress stating that &apos;no person should be allowed to arrange matches for personal profit&apos;. \r\n\r\nA little over a century later, a judge in a Brooklyn courtroom called Fifa a &apos;Racketeering Influenced Corrupt Organization (RICO) enterprise&apos; - a term originally coined for the mafia.\r\n\r\nIn 2015, FIFA-the multibillion dollar governing body of the world&apos;s most-loved sport-was brought down by allegations of industrial-scale bribes, kickbacks, money laundering, racketeering and tax evasion. \r\n\r\nBeginning with early morning raids in Zurich and the indictment of twenty-seven executives by the US Department of Justice, the rottenness at the core of FIFA seemed to extend throughout all of soccer, from the decision to send the 2018 and 2022 World Cups to Russia and Qatar to lesser known cases of embezzlement from Trinidad to South Africa.\r\n\r\nDavid Conn writes the definitive account of FIFA&apos;s rise and fall, covering in great detail the corruption allegations and the series of scandals that continued to shake the public&apos;s trust in the organization.\r\n\r\nThe Fall of the House of FIFA situates FIFA&apos;s unraveling amidst revealing human portraits of soccer legends such as Michel Platini and Franz Beckenbauer and features an exclusive interview with former president Sepp Blatter. \r\n\r\nEven as he chronicles the biggest sport scandal of all time, Conn infuses the book with a passionate love of the game, delivering an irresistible read.\r\n\r\nDavid Conn is Britain&apos;s foremost investigative sports journalist, writing primarily about soccer for the Guardian","last_updated":"2017-08-31T12:05:32.404Z","parsed":{"xt":"urn:btih:b5c60eb5bf0d725f9f25c29b3b753b207ba16f5d","dn":"The Fall of the House of FIFA: The Multimillion-Dollar Corruptio","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b5c60eb5bf0d725f9f25c29b3b753b207ba16f5d","infoHashBuffer":{"type":"Buffer","data":[181,198,14,181,191,13,114,95,159,37,194,155,59,117,59,32,123,161,111,93]},"name":"The Fall of the House of FIFA: The Multimillion-Dollar Corruptio","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}