{"title":"The Gentleman by Forrest Leo EPUB","magnet":"magnet:?xt=urn:btih:b636cd3a916bccefca5797db5ba571ac05c3d2f4&dn=The+Gentleman+by+Forrest+Leo+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2527009","seeders":"27","leechers":"3","description":"xx\r\n\r\nThe Gentleman by Forrest Leo EPUB\r\n\r\nA funny, fantastically entertaining debut novel, in the spirit of Wodehouse and Monty Python, about a famous poet who inadvertently sells his wife to the devil - then recruits a band of adventurers to rescue her.\r\n\r\nWhen Lionel Savage, a popular poet in Victorian London, learns from his butler that they&apos;re broke, he marries the beautiful Vivien Lancaster for her money, only to find that his muse has abandoned him. Distraught and contemplating suicide, Savage accidentally conjures the devil - the polite &quot;Gentleman&quot; of the title - who appears at one of the society parties Savage abhors. The two hit it off: The devil talks about his home, where he employs Dante as a gardener; Savage lends him a volume of Tennyson.\r\n\r\nBut when the party&apos;s over and Vivien has disappeared, the poet concludes in horror that he must have inadvertently sold his wife to the dark lord. Newly in love with Vivian, Savage plans a rescue mission to hell that includes Simmons, the butler; Tompkins, the bookseller; Ashley Lancaster, swashbuckling Buddhist; Will Kensington, inventor of a flying machine; and Savage&apos;s spirited kid sister, Lizzie, freshly booted from boarding school for a &quot;dalliance&quot;.\r\n\r\nThroughout, his cousin&apos;s quibbling footnotes to the text push the story into comedy nirvana. Lionel and his friends encounter trapdoors, duels, anarchist-fearing bobbies, the social pressure of not knowing enough about art history, and the poisonous wit of his poetical archenemy.\r\n\r\nFresh, action-packed, and very, very funny, The Gentleman is a giddy farce that recalls the masterful confections of P. G. Wodehouse and Herge&apos;s beautifully detailed Tintin adventures.\r\n\r\nxx","last_updated":"2017-12-09T12:08:45.251Z","parsed":{"xt":"urn:btih:b636cd3a916bccefca5797db5ba571ac05c3d2f4","dn":"The Gentleman by Forrest Leo EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b636cd3a916bccefca5797db5ba571ac05c3d2f4","infoHashBuffer":{"type":"Buffer","data":[182,54,205,58,145,107,204,239,202,87,151,219,91,165,113,172,5,195,210,244]},"name":"The Gentleman by Forrest Leo EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}