{"title":"Wallace and Gromit's Grand Adventures [GOG]","magnet":"magnet:?xt=urn:btih:b6ac645f3277b2bfed829890d306e002d564ce0e&dn=Wallace+and+Gromit%27s+Grand+Adventures+%5BGOG%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"TerminatorFan","categoryP":"games","categoryS":"pc","size":"1847581059","seeders":"0","leechers":"0","description":"Genre: Adventure / point-and-click / detective-mystery\r\nWorks on: Windows (XP, Vista, 7, 8 )\r\nLanguages: English, French, Italian, German, Spanish\r\nFeatures: single-player\r\nReleased: February 8, 2010\r\nSize: 1.4 GB\r\nCompany: Telltale Games / Telltale Games\r\n\r\nEpisode 1: Fright of the Bumblebees\r\n\r\nEnter the colorful world of West Wallaby Street in the first of four cracking adventures in Wallace &amp; Gromit Episode 1: Fright of the Bumblebees. In this first episode, the inventor and his loyal pooch are faced with a big problem. They need 50 gallons of honey by tonight - far more than their bees can handle. When Wallace&apos;s plans to step up production go horribly awry, it falls to Gromit to fight off the angry swarm. Featuring a brand new story with the same slapstick humour, cinematic visuals, and charm that fans of the Wallace &amp; Gromit films have come to love, Fright of the Bumblebees kicks off this four-episode series in cracking style.\r\n\r\nEpisode 2: The Last Resort\r\n\r\nJoin Wallace &amp; Gromit once again in Wallace &amp; Gromit Episode 2: The Last Resort, the second tale in their newest adventure series by Telltale! When unrelenting rain ruins their holiday plans, Wallace &amp; Gromit bring the beach to their basement and transform 62 West Wallaby into a makeshift resort. Keeping the customers satisfied is tricky business, especially after one of them is clocked on the head by an unknown assailant. Whodunnit? It&#x2019;s up to Gromit to find out &#x2026; with a little help from Wallace&#x2019;s latest invention, the Deduct-o-matic! Featuring a brand new story with the same slapstick humour, cinematic visuals, and British charm fans of the Wallace &amp; Gromit films have come to love, The Last Resort is the second game in the series that has everyone buzzing!\r\n\r\nEpisode 3: Muzzled!\r\n\r\nMonty Muzzle, a newcomer in town, is holding a grand fundraiser to rebuild the local dog shelter. Gromit soon realizes that Muzzle&apos;s intentions aren&apos;t exactly charitable and he must foil the huckster&apos;s plot to save the town&apos;s investment and rescue his canine friends.\r\n\r\nEpisode 4: The Bogey Man\r\n\r\nWallace has been admitted to Prickly Thicket, the oldest country club in Lancashire. Wallace and his faithful caddie Gromit get wrapped up in a decades-old club dispute that threatens to destroy their peaceful West Wallaby lifestyle, and the duo must fight to save the neighborhood they hold dear!\r\n\r\nNOTE: This game is no longer available for purchase on GOG.com so help seeding will be greatly appreciated and will prolong this torrent&apos;s life span","last_updated":"2017-11-29T12:00:38.602Z","parsed":{"xt":"urn:btih:b6ac645f3277b2bfed829890d306e002d564ce0e","dn":"Wallace and Gromit's Grand Adventures [GOG]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b6ac645f3277b2bfed829890d306e002d564ce0e","infoHashBuffer":{"type":"Buffer","data":[182,172,100,95,50,119,178,191,237,130,152,144,211,6,224,2,213,100,206,14]},"name":"Wallace and Gromit's Grand Adventures [GOG]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}