{"title":"Hunting Hitler_ New Scientific Evidence That Hitler Escaped Nazi","magnet":"magnet:?xt=urn:btih:b7df47d4b90665582a8c8c62f31a1dc326795c34&dn=Hunting+Hitler_+New+Scientific+Evidence+That+Hitler+Escaped+Nazi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7822153","seeders":"0","leechers":"0","description":"xx\r\n\r\nHunting Hitler_ New Scientific Evidence That Hitler Escaped Nazi Germany by Jerome Corsi 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn 2009, three US professors with access to Adolf Hitler&#x2019;s alleged remains startled the world with scientific DNA proof that the skull and bones that Russia had claimed since the end of World War II were Hitler&#x2019;s actually belonged to a middle-aged woman whose identity remains unknown.\r\n\r\nThis announcement has rekindled interest in the claim made by Joseph Stalin, maintained to the end of his life, that Hitler got away. The truth is that no one saw Hitler and Eva Braun die in the bunker in Berlin on April 30, 1945. No photographs were taken to document claims Hitler and Evan Braun committed suicide. Hitler&#x2019;s body was never recovered. No definitive physical evidence exists proving Hitler died in the bunker in Berlin.\r\n\r\nDr. Jerome Corsi explores the historical possibility that Hitler escaped Nazi Germany at the end of World War II. FBI and CIA records maintained at the National Archives indicate that the US government took seriously reports at the end of World War II that Hitler had escaped to Argentina. More recent evidence suggests Hitler may have fled to Indonesia, where he married and worked at a hospital in Sumbawa.\r\n\r\nEven the chief of the US trial counsel at Nuremburg, Thomas J. Dodd, was quoted as saying, No one for sure can say Adolf Hitler is dead.&#x201D;Putting massive amounts of evidence and research under a critical eye, Dr. Corsi shows that perhaps modern history&#x2019;s most tantalizing question has yet to be definitively answered: Did Hitler escaped Nazi Germany at the end of World War II to plot revenge and to plan the rise of the Fourth Reich?\r\n\r\nxx","last_updated":"2017-08-19T12:01:07.437Z","parsed":{"xt":"urn:btih:b7df47d4b90665582a8c8c62f31a1dc326795c34","dn":"Hunting Hitler_ New Scientific Evidence That Hitler Escaped Nazi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b7df47d4b90665582a8c8c62f31a1dc326795c34","infoHashBuffer":{"type":"Buffer","data":[183,223,71,212,185,6,101,88,42,140,140,98,243,26,29,195,38,121,92,52]},"name":"Hunting Hitler_ New Scientific Evidence That Hitler Escaped Nazi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}