{"title":"A Different Kind of Daughter by Maria Toorpakai EPUB","magnet":"magnet:?xt=urn:btih:b83a71acbc28a4de976650800ab685433954e185&dn=A+Different+Kind+of+Daughter+by+Maria+Toorpakai+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5946075","seeders":"28","leechers":"8","description":"xx\r\n\r\nA Different Kind of Daughter by Maria Toorpakai EPUB\r\n\r\nMaria Toorpakai hails from Pakistan&apos;s violently oppressive northwest tribal region, where the idea of women playing sports is considered haram - un-Islamic, forbidden - and girls rarely leave their homes. But she did, passing as a boy in order to play the sports she loved, thus becoming a lightning rod of freedom in her country&apos;s fierce battle over women&apos;s rights.\r\n\r\nA Different Kind of Daughter tells of Maria&apos;s harrowing journey to play the sport she knew was her destiny, first living as a boy and roaming the violent back alleys of the frontier city of Peshawar, rising to become the number-one female squash player in Pakistan. For Maria, squash was more than liberation - it was salvation. But it was also a death sentence, thrusting her into the national spotlight and the crosshairs of the Taliban, who wanted Maria and her family dead. Maria knew her only chance of survival was to flee the country.\r\n\r\nEnter Jonathon Power, the first North American to earn the title of top squash player in the world and the only person to heed Maria&apos;s plea for help. Recognizing her determination and talent, Jonathon invited Maria to train and compete internationally in Canada. After years of living on the run from the Taliban, Maria packed up and left the only place she had ever known to move halfway across the globe and pursue her dream. Now Maria is well on the way to becoming a world champion as she continues to be a voice for oppressed women everywhere.\r\n\r\nxx","last_updated":"2017-12-09T12:07:08.940Z","parsed":{"xt":"urn:btih:b83a71acbc28a4de976650800ab685433954e185","dn":"A Different Kind of Daughter by Maria Toorpakai EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b83a71acbc28a4de976650800ab685433954e185","infoHashBuffer":{"type":"Buffer","data":[184,58,113,172,188,40,164,222,151,102,80,128,10,182,133,67,57,84,225,133]},"name":"A Different Kind of Daughter by Maria Toorpakai EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}