{"title":"Erica Armstrong Dunbar - Never Caught 2017 RETAiL ePUB eBOOK-DiS","magnet":"magnet:?xt=urn:btih:b93a7d188fd64715c883d42f030d10daa257ee08&dn=Erica+Armstrong+Dunbar+-+Never+Caught+2017+RETAiL+ePUB+eBOOK-DiS&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"32518194","seeders":"1","leechers":"1","description":"Erica Armstrong Dunbar - Never Caught 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA startling and eye-opening look into America&apos;s first family, Never Caught is the powerful narrative of Ona Judge, George and Martha Washington&apos;s runaway slave who risked it all to escape the nation&apos;s capital and reach freedom.\r\n\r\nWhen George Washington was elected president, he reluctantly left behind his beloved Mount Vernon to serve in Philadelphia, the temporary seat of the nation&apos;s capital. In setting up his household, he took Tobias Lear, his celebrated secretary, and eight slaves, including Ona Judge, about which little has been written. As he grew accustomed to Northern ways, there was one change he couldn&apos;t get his arms around: Pennsylvania law required enslaved people be set free after six months of residency in the state. Rather than comply, Washington decided to circumvent the law. Every six months he sent the slaves back down south, just as the clock was about to expire.\r\n\r\nThough Ona Judge lived a life of relative comfort, the few pleasantries she was afforded were nothing compared to freedom, a glimpse of which she encountered firsthand in Philadelphia. So, when the opportunity presented itself one cold spring day in Philadelphia, Judge left everything she knew to escape to New England. Yet freedom would not come without its costs.\r\n\r\nAt just 22 years old, Ona became the subject of an intense manhunt led by George Washington, who used his political and personal contacts to recapture his property.\r\n\r\nImpeccably researched, historian Erica Armstrong Dunbar weaves a powerful tale and offers fascinating new scholarship on how one young woman risked it all to gain freedom from the famous founding father","last_updated":"2017-06-01T12:02:38.652Z","parsed":{"xt":"urn:btih:b93a7d188fd64715c883d42f030d10daa257ee08","dn":"Erica Armstrong Dunbar - Never Caught 2017 RETAiL ePUB eBOOK-DiS","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b93a7d188fd64715c883d42f030d10daa257ee08","infoHashBuffer":{"type":"Buffer","data":[185,58,125,24,143,214,71,21,200,131,212,47,3,13,16,218,162,87,238,8]},"name":"Erica Armstrong Dunbar - Never Caught 2017 RETAiL ePUB eBOOK-DiS","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}