{"title":"Any Dream Will Do_ A Novel by Debbie Macomber ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:b9763c02bb6b4bbcbe5f2542ddfde050e1cd7070&dn=Any+Dream+Will+Do_+A+Novel+by+Debbie+Macomber+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3059585","seeders":"0","leechers":"0","description":"xx\r\n\r\nAny Dream Will Do_ A Novel by Debbie Macomber ePUB eBOOK-ZAK\r\n\r\nBeloved and best-selling author Debbie Macomber returns with a powerful stand-alone novel about a woman forced to start her life anew, embarking on the most courageous journey of all - to a place where she learns what love and trust really mean.\r\n\r\nShay Benson adored her younger brother, Caden, and that got her into trouble. When he owed money, Shay realized she would do anything to help him avoid the men who were threatening him, and she crossed lines she never should have crossed. Now, determined to start fresh, she finds herself in search of a place to stay and wanders into a church to escape from the cold.\r\n\r\nPastor Drew Douglas adored his wife. But when he lost her, it was all he could do to focus on his two beautiful kids, and his flock came in a distant third. Now, as he, too, is thinking about a fresh start, he walks through his sanctuary and finds Shay sitting in a pew.\r\n\r\nThe pair strike up a friendship - Drew helps Shay get back on her feet, and she reignites his sense of purpose - that over time turns into something deeper, something soulful, spiritual, and possibly romantic. Even Drew&apos;s two children are taken with this woman who has brought light back into their lives. Perhaps most important, Shay learns to trust again as she, in turn, proves herself trustworthy to her adopted community.\r\n\r\nBut Caden&apos;s return to town and a disastrous secret threaten to undo the life Shay has tried so hard to rebuild. It will take the utmost courage and faith if she and Drew hope to find healing and open their hearts to a brighter future.\r\n\r\nxx","last_updated":"2017-08-14T12:01:07.643Z","parsed":{"xt":"urn:btih:b9763c02bb6b4bbcbe5f2542ddfde050e1cd7070","dn":"Any Dream Will Do_ A Novel by Debbie Macomber ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b9763c02bb6b4bbcbe5f2542ddfde050e1cd7070","infoHashBuffer":{"type":"Buffer","data":[185,118,60,2,187,107,75,188,190,95,37,66,221,253,224,80,225,205,112,112]},"name":"Any Dream Will Do_ A Novel by Debbie Macomber ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}