{"title":"Rome's Last Citizen by Rob Goodman, Jimmy Soni EPUB","magnet":"magnet:?xt=urn:btih:b9d6e8a74b6c91150e4d8fd13f0ec372b189b25e&dn=Rome%27s+Last+Citizen+by+Rob+Goodman%2C+Jimmy+Soni+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"577506","seeders":"79","leechers":"4","description":"xx\r\n\r\nRome&apos;s Last Citizen by Rob Goodman, Jimmy Soni EPUB\r\n\r\nMarcus Porcius Cato: aristocrat who walked barefoot and slept on the ground with his troops, political heavyweight who cultivated the image of a Stoic philosopher, a hardnosed defender of tradition who presented himself as a man out of the sacred Roman past-and the last man standing when Rome&apos;s Republic fell to tyranny. His blood feud with Caesar began in the chamber of the Senate, played out on the battlefields of a world war, and ended when he took his own life rather than live under a dictator.\r\n\r\nCenturies of thinkers, writers, and artists have drawn inspiration from Cato&apos;s Stoic courage. Saint Augustine and the early Christians were moved and challenged by his example. Dante, in his Divine Comedy, chose Cato to preside over the souls who arrive in Purgatory. George Washington so revered him that he staged a play on Cato&apos;s life to revive the spirit of his troops at Valley Forge. Now, in Rome&apos;s Last Citizen, Rob Goodman and Jimmy Soni deliver the first modern biography of this stirring figure.\r\n\r\nCato&apos;s life is a gripping tale that resonates deeply with our own turbulent times. He grappled with terrorists, a debt crisis, endemic political corruption, and a huge gulf between the elites and those they governed. In many ways, Cato was the ultimate man of principle-he even chose suicide rather than be used by Caesar as a political pawn. But Cato was also a political failure: his stubbornness sealed his and Rome&apos;s defeat, and his lonely end casts a shadow on the recurring hope that a singular leader can transcend the dirty business of politics.\r\n\r\nRome&apos;s Last Citizen is a timeless story of an uncompromising man in a time of crisis and his lifelong battle to save the Republic.\r\n\r\nxx","last_updated":"2017-12-10T12:07:34.815Z","parsed":{"xt":"urn:btih:b9d6e8a74b6c91150e4d8fd13f0ec372b189b25e","dn":"Rome's Last Citizen by Rob Goodman, Jimmy Soni EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b9d6e8a74b6c91150e4d8fd13f0ec372b189b25e","infoHashBuffer":{"type":"Buffer","data":[185,214,232,167,75,108,145,21,14,77,143,209,63,14,195,114,177,137,178,94]},"name":"Rome's Last Citizen by Rob Goodman, Jimmy Soni EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}