{"title":"Sherrilyn Kenyon - Deadmen Walking [ePub]","magnet":"magnet:?xt=urn:btih:ba387b1a45aa2476c2222d4f02027e68967120f3&dn=Sherrilyn+Kenyon+-+Deadmen+Walking+%5BePub%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Skyeater","categoryP":"other","categoryS":"e_books","size":"1427490","seeders":"4","leechers":"49","description":"Deadmen Walking by Sherrilyn Kenyon (Deadman&apos;s Cross Trilogy #1)\r\n\r\nEnglish | 2017 | Paranormal Romance| 1.3 MB\r\n\r\n\r\nWhen the Chthonians brought the primal gods to a truce at the end of their great war, part of the pact they forged was that the worst of the evil the gods had unleashed against each other and mankind would be forever banished. But forever is a long time. And nothing can contain those determined to find a way back. To catch evil, it takes evil... While Thorn is able to contain the demons unleashed on the ground, the ones who prey on the innocent sailors and sea faring travelers are beyond his reach. For the sake of humanity, he makes a shaky alliance with an old foe, Marcelina. In the form of the ship they sail upon, she assembles a team under the command of Captain Devlyn Nathaniel Bane, one of the most notorious and bloodthirsty pirates to ever sail the high seas. Damned and murdered by his own, Bane is out for revenge. With his own secret agenda, he agrees to take charge of the motley crew of pirates and brigands, and to protect the seas from the preternatural terrors that seek to devour every unwary soul they can take. Theirs is a sacred and deadly task, as they are hunted by their prey and human authorities alike. If they fail, the world will fall to the ancient gods of chaos, and anarchy will reign. Most of all, the Southern gate, where the greatest, most powerful darkness is imprisoned, will be opened and there will be no stopping it. It&#x2019;s yo ho ho and a bottle of high seas stakes where the souls of all humanity are the ultimate prize and bargaining chip","last_updated":"2017-05-10T12:27:47.232Z","parsed":{"xt":"urn:btih:ba387b1a45aa2476c2222d4f02027e68967120f3","dn":"Sherrilyn Kenyon - Deadmen Walking [ePub]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ba387b1a45aa2476c2222d4f02027e68967120f3","infoHashBuffer":{"type":"Buffer","data":[186,56,123,26,69,170,36,118,194,34,45,79,2,2,126,104,150,113,32,243]},"name":"Sherrilyn Kenyon - Deadmen Walking [ePub]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}