{"title":"\nDangerous Games by Danielle Steel ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:ba8337e74e4845ae58d7401a2426bb376e835e06&dn=Dangerous+Games+by+Danielle+Steel+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3477959","seeders":"0","leechers":"0","description":"xx\r\n\r\nDangerous Games by Danielle Steel ePUB eBOOK-ZAK\r\n\r\nBringing together a cast of fascinating characters in a riveting tale of ambition and corruption, politics, passion, and ultimate justice, Dangerous Games is a thrilling drama from number-one New York Times best-selling author Danielle Steel.\r\n\r\nTelevision correspondent Alix Phillips dodges bullets and breaks rules to bring the most important news to the world - from riots in America to protests on the streets of Tehran. With her daughter in college, and working alongside cameraman Ben Chapman, a deeply private ex-Navy SEAL, Alix revels in the risks and whirlwind pace of her work. But her latest assignment puts her at the center of an explosive story that will reshape many lives, including her own: investigating damning allegations involving the vice president of the United States, Tony Clark.\r\n\r\nAlix starts with a nationally revered woman who may be the key to exposing frightening secrets. Olympia Foster is the fragile, reclusive widow of America&apos;s most admired senator, who had been destined for the presidency before an assassin&apos;s bullet felled him. Since then Olympia has found emotional support from Clark, who once wanted her as his wife and now stands as her protector and confidant. When Alix begins to dig deeper, federal agents pick up the trail. Then the threats begin. As the stakes rise in this dangerous game, Alix needs Ben&apos;s help as never before. And soon they realize they are grappling with an adversary far more sinister than they had imagined.\r\n\r\nxx","last_updated":"2017-09-30T12:02:58.608Z","parsed":{"xt":"urn:btih:ba8337e74e4845ae58d7401a2426bb376e835e06","dn":"Dangerous Games by Danielle Steel ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ba8337e74e4845ae58d7401a2426bb376e835e06","infoHashBuffer":{"type":"Buffer","data":[186,131,55,231,78,72,69,174,88,215,64,26,36,38,187,55,110,131,94,6]},"name":"Dangerous Games by Danielle Steel ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}