{"title":"Janet Evanovich-Seven Up","magnet":"magnet:?xt=urn:btih:ba9a46b620612d38ade0abd67916d241b162c449&dn=Janet+Evanovich-Seven+Up&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"twocows","categoryP":"audio","categoryS":"audio_books","size":"243743002","seeders":"21","leechers":"2","description":" Janet Evanovich-Seven Up\r\n\r\n\r\nSemiretired mob guy Eddie DeCooch is caught trafficking contraband cigarettes through Trenton, New Jersey. When DeCooch fails to show for a court appearance, bond enforcement agent Stephanie Plum is assigned the task of finding him and dragging his decrepit ass back to jail. Not such an easy job, it turns out, since DeCooch has learned a lot of tricks over the years and isn&apos;t afraid to use his gun. He&apos;s already shot Loretta Ricci, an innocent old lady, and left her for worm food in his shed. He wouldn&apos;t mind shooting Stephanie next. Likeable losers (and Steph&apos;s former high school classmates) Walter &quot;MoonMan&quot; Dunphy and Dougie &quot;The Dealer&quot; Kruper have inadvertently become involved with DeCooch. They&apos;ve gotten sucked into an operation that is much more than simple cigarette smuggling and holds risks far greater than anyone could have imagined. When Dougie disappears, Steph goes into search mode. When Mooner disappears, she calls in the heavy artillery and asks master bounty hunter Ranger for help. Ranger&apos;s price for the job? One night with Stephanie, dusk to dawn. Not information she&apos;s wont to share with her sometime live-in roommate, vice cop Joe Morelli. A typical dilemma in the world of Plum. And on the homefront, Stephanie&apos;s &quot;perfect&quot; sister, Valerie, has decided to move back to Trenton, bringing her two kids from hell with her. Grandma Mazur is asking questions about being a lesbian, and Bob, the bulimic dog, is eating everything in sight&#x2014;including the furniture. Mud wrestling, motorcycles, fast cars, fast food, and fast men. It&apos;s Seven Up. Absolutely Janet Evanovich at her very best","last_updated":"2017-06-05T12:04:21.366Z","parsed":{"xt":"urn:btih:ba9a46b620612d38ade0abd67916d241b162c449","dn":"Janet Evanovich-Seven Up","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ba9a46b620612d38ade0abd67916d241b162c449","infoHashBuffer":{"type":"Buffer","data":[186,154,70,182,32,97,45,56,173,224,171,214,121,22,210,65,177,98,196,73]},"name":"Janet Evanovich-Seven Up","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}