{"title":"The Upstairs Wife_ An Intimate History of Pakistan by Rafia Zaka","magnet":"magnet:?xt=urn:btih:bae7c8a392ccc7e487572efefe25712e90a41f92&dn=The+Upstairs+Wife_+An+Intimate+History+of+Pakistan+by+Rafia+Zaka&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"anders","categoryS":"e_books","size":"4625770","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Upstairs Wife_ An Intimate History of Pakistan by Rafia Zakaria ePUB eBOOK-ZAK\r\n\r\nA memoir of Karachi through the eyes of its women.\r\n\r\nFor a brief moment on December 27, 2007, life came to a standstill in Pakistan. Benazir Bhutto, the country&apos;s former prime minister and the first woman ever to lead a Muslim country, had been assassinated at a political rally just outside Islamabad. Back in Karachi--Bhutto&apos;s birthplace and Pakistan&apos;s other great metropolis--Rafia Zakaria&apos;s family was suffering through a crisis of its own: her uncle Sohail, the man who had brought shame upon the family, was near death. In that moment these twin catastrophes--one political and public, the other secret and intensely personal--briefly converged. Zakaria uses that moment to begin her intimate exploration of the country of her birth. Her Muslim-Indian family immigrated to Pakistan from Bombay in 1962, escaping the precarious state in which the Muslim population in India found itself following the Partition. For them Pakistan represented enormous promise. And for some time, Zakaria&apos;s family prospered, and the city prospered. But in the 1980s, Pakistan&apos;s military dictators began an Islamization campaign designed to legitimate their rule--a campaign that particularly affected women&apos;s freedom and safety. The political became personal when her aunt Amina&apos;s husband, Sohail, did the unthinkable and took a second wife--a humiliating and painful betrayal of kin and custom that shook the foundation of Zakaria&apos;s family but was permitted under the country&apos;s new laws. The young Rafia grows up in the shadow of Amina&apos;s shame and fury while the world outside her home turns ever more chaotic and violent, the opportunities available to post-Partition immigrants are dramatically curtailed, and terrorism sows its seeds in Karachi. Telling the parallel stories of Amina&apos;s polygamous marriage and Pakistan&apos;s hopes and betrayals, The Upstairs Wife is an intimate exploration of the disjunction between exalted dreams and complicated realities.\r\n\r\nxx","last_updated":"2017-08-12T12:00:26.320Z","parsed":{"xt":"urn:btih:bae7c8a392ccc7e487572efefe25712e90a41f92","dn":"The Upstairs Wife_ An Intimate History of Pakistan by Rafia Zaka","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bae7c8a392ccc7e487572efefe25712e90a41f92","infoHashBuffer":{"type":"Buffer","data":[186,231,200,163,146,204,199,228,135,87,46,254,254,37,113,46,144,164,31,146]},"name":"The Upstairs Wife_ An Intimate History of Pakistan by Rafia Zaka","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}