{"title":"\nWorth It_ Your Life, Your Money, Your Terms by Amanda Steinberg ","magnet":"magnet:?xt=urn:btih:bb2b265dda6b4de1bb14dde905e5cecd83de3621&dn=Worth+It_+Your+Life%2C+Your+Money%2C+Your+Terms+by+Amanda+Steinberg+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2792079","seeders":"15","leechers":"10","description":"xx\r\n\r\nWorth It_ Your Life, Your Money, Your Terms by Amanda Steinberg ePUB eBOOK-ZAK\r\n\r\nThe founder and superstar CEO of DailyWorth.com - the go-to financial site for women with more than one million subscribers - reads this fresh approach that redefines the relationship between women, self-worth, and money. Worth It shows women how to view money as a source of personal power and freedom - and live life on their terms.\r\n\r\nMillions of women want to create financial stability and abundance in their lives, but they don&apos;t know how. They are stuck in overwhelming confusion and guilt, driven by internalized &quot;money stories&quot; that have nothing to do with what is really possible. As the founder of DailyWorth.com, a financial media and education platform, Amanda Steinberg encounters these smart, ambitious women every day. With this book she helps them face their money stories head on and wake up to the prosperity that awaits them.\r\n\r\nWorth It outlines the essential financial information women need - and everything the institutions and advisors don&apos;t spell out. Steinberg gets to the bottom of why women are stressed and anxious when it comes to their finances and teaches them to stay away from strict budgeting and other harsh austerity practices. Instead she makes money relatable while sharing strategies she uses herself to build confidence and ease in her own financial life. Through her firsthand experiences and the stories from other women who&apos;ve woken up, Steinberg&apos;s powerful and encouraging advice can help women of any age and income view money as a source of freedom and independence - and create bright financial futures.\r\n\r\nxx","last_updated":"2017-10-04T12:03:44.018Z","parsed":{"xt":"urn:btih:bb2b265dda6b4de1bb14dde905e5cecd83de3621","dn":"Worth It_ Your Life, Your Money, Your Terms by Amanda Steinberg ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb2b265dda6b4de1bb14dde905e5cecd83de3621","infoHashBuffer":{"type":"Buffer","data":[187,43,38,93,218,107,77,225,187,20,221,233,5,229,206,205,131,222,54,33]},"name":"Worth It_ Your Life, Your Money, Your Terms by Amanda Steinberg ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}