{"title":"The Brilliant Disaster_ JFK, Castro, and America's Doomed Invasi","magnet":"magnet:?xt=urn:btih:bb46f8d261f8faeeaddc8d8d80e8612e1a3bc301&dn=The+Brilliant+Disaster_+JFK%2C+Castro%2C+and+America%27s+Doomed+Invasi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6541219","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Brilliant Disaster_ JFK, Castro, and America&apos;s Doomed Invasion of Cuba&apos;s Bay of Pigs by Jim Rasenberger ePUB eBOOK-ZAK\r\n\r\nA remarkably gripping account of America&apos;s Bay of Pigs crisis, drawing on long-hidden CIA documents and delivering, as never before, the vivid truth - and consequences - of five pivotal days in April 1961.\r\n\r\nThe U.S.-backed military invasion of Cuba in 1961 remains one of the most ill-fated blunders in American history, with echoes of the event reverberating even today. Despite the Kennedy administration&#x2019;s initial public insistence that the United States had nothing to do with the invasion, it soon became clear that the complex operation had been planned and approved by the best and brightest minds at the highest reaches of Washington, including the Joint Chiefs of Staff and President John F. Kennedy himself.\r\n\r\nThe Cuban-born invaders were trained by CIA officers, supplied with American mat&#xE9;riel, and shadowed by the U.S. Navy. Landing by sea with fighter-plane support, they hoped to establish a military beachhead and spark a counterrevolution against Fidel Castro&#x2019;s regime. The gambit was a stupendous failure, resulting in the death or imprisonment of more than a thousand men.\r\n\r\nNow, journalist Jim Rasenberger takes a closer look at this darkly fascinating incident in American history. At the heart of the crisis stood President Kennedy, and Rasenberger traces what Kennedy knew, thought, and said as events unfolded. He examines whether Kennedy was manipulated by the CIA into approving a plan that would ultimately involve the American military. He also draws compelling portraits of the other figures who played key roles in the drama, including Fidel Castro.\r\n\r\nWritten with elegant clarity and narrative verve, The Brilliant Disaster is the most complete account of this event to date, providing not only a fast-paced chronicle of the disaster but an analysis of how it occurred&#x2014;a question as relevant today as then&#x2014;and how it profoundly altered the course of modern American history.\r\n\r\nxx","last_updated":"2017-09-17T12:01:52.902Z","parsed":{"xt":"urn:btih:bb46f8d261f8faeeaddc8d8d80e8612e1a3bc301","dn":"The Brilliant Disaster_ JFK, Castro, and America's Doomed Invasi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb46f8d261f8faeeaddc8d8d80e8612e1a3bc301","infoHashBuffer":{"type":"Buffer","data":[187,70,248,210,97,248,250,238,173,220,141,141,128,232,97,46,26,59,195,1]},"name":"The Brilliant Disaster_ JFK, Castro, and America's Doomed Invasi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}