{"title":"Big Data in Practice (mrkiven0).pdf","magnet":"magnet:?xt=urn:btih:bb83ac4e4182b6a9109c350fc090831aa087b725&dn=Big+Data+in+Practice+%28mrkiven0%29.pdf&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"mrkiven0","categoryP":"other","categoryS":"e_books","size":"2385271","seeders":"23","leechers":"8","description":"The bestselling author of Big Data is back, this time with a unique and indepth insight into how specific companies use big data. Big data is on the tip of everyone&apos;s tongue. Everyone understands its power and importance, but many fail to grasp the actionable steps and resources required to utilise it effectively. This book fills the knowledge gap by showing how major companies are using big data every day, from an upclose, ontheground perspective. From technology, media and retail, to sport teams, government agencies and financial institutions, learn the actual strategies and processes being used to learn about customers, improve manufacturing, spur innovation, improve safety and so much more. Organised for easy dipin navigation, each chapter follows the same structure to give you the information you need quickly. For each company profiled, learn what data was used, what problem it solved and the processes put it place to make it practical, as well as the technical details, challenges and lessons learned from each unique scenario. Learn how predictive analytics helps Amazon, Target, John Deere and Apple understand their customers Discover how big data is behind the success of Walmart, LinkedIn, Microsoft and more Learn how big data is changing medicine, law enforcement, hospitality, fashion, science and banking Develop your own big data strategy by accessing additional reading materials at the end of each chapter","last_updated":"2017-07-07T12:02:45.616Z","parsed":{"xt":"urn:btih:bb83ac4e4182b6a9109c350fc090831aa087b725","dn":"Big Data in Practice (mrkiven0).pdf","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bb83ac4e4182b6a9109c350fc090831aa087b725","infoHashBuffer":{"type":"Buffer","data":[187,131,172,78,65,130,182,169,16,156,53,15,192,144,131,26,160,135,183,37]},"name":"Big Data in Practice (mrkiven0).pdf","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}