{"title":"The Perfect Horse by Elizabeth Letts EPUB","magnet":"magnet:?xt=urn:btih:bbc4d2006ee30f52b23fc8c44f2853bbed5b4bdd&dn=The+Perfect+Horse+by+Elizabeth+Letts+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Erikson69","categoryP":"other","categoryS":"e_books","size":"34399511","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Perfect Horse by Elizabeth Letts EPUB\r\n\r\nFrom the number-one New York Times best-selling author of The Eighty-Dollar Champion, the remarkable story of the heroic rescue of priceless horses in the closing days of World War II.\r\n\r\nIn the chaotic last days of the war, a small troop of battle-weary American soldiers captures a German spy and makes an astonishing find - his briefcase is empty but for photos of beautiful white horses that have been stolen and kept on a secret farm behind enemy lines. Hitler has stockpiled the world&apos;s finest purebreds in order to breed the perfect military machine - an equine master race. But with the starving Russian army closing in, the animals are in imminent danger of being slaughtered for food.\r\n\r\nWith only hours to spare, one of the army&apos;s last great cavalrymen, American colonel Hank Reed, makes a bold decision - with General George Patton&apos;s blessing - to mount a covert rescue operation. Racing against time, Reed&apos;s small but determined force of soldiers, aided by several turncoat Germans, steals across enemy lines in a last-ditch effort to save the horses.\r\n\r\nPulling together this multistranded story, Elizabeth Letts introduces us to an unforgettable cast of characters: Alois Podhajsky, director of the famed Spanish Riding School of Vienna, a former Olympic medalist who is forced to flee the bomb-ravaged Austrian capital with his entire stable in tow; Gustav Rau, Hitler&apos;s imperious chief of horse breeding, a proponent of eugenics who dreams of genetically engineering the perfect warhorse for Germany; and Tom Stewart, a senator&apos;s son who makes a daring moonlight ride on a white stallion to secure the farm&apos;s surrender.\r\n\r\nA compelling account for animal lovers and World War II buffs alike, The Perfect Horse tells for the first time the full story of these events. Elizabeth Letts&apos; exhilarating tale of behind-enemy-lines adventure, courage, and sacrifice brings to life one of the most inspiring chapters in the annals of human valor.\r\n\r\nxx","last_updated":"2017-12-25T12:07:29.928Z","parsed":{"xt":"urn:btih:bbc4d2006ee30f52b23fc8c44f2853bbed5b4bdd","dn":"The Perfect Horse by Elizabeth Letts EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bbc4d2006ee30f52b23fc8c44f2853bbed5b4bdd","infoHashBuffer":{"type":"Buffer","data":[187,196,210,0,110,227,15,82,178,63,200,196,79,40,83,187,237,91,75,221]},"name":"The Perfect Horse by Elizabeth Letts EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}