{"title":"[ManyVids] Missbehavin26 - Mommy mother Wants to make a Baby  ","magnet":"magnet:?xt=urn:btih:bc7f44a30a72cc31bfb8bbbbe8d1adee10a6e314&dn=%5BManyVids%5D+Missbehavin26+-+Mommy+mother+Wants+to+make+a+Baby++&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dawgknutz","categoryP":"porn","categoryS":"hd___movies","size":"359611448","seeders":"0","leechers":"0","description":"[ManyVids] Missbehavin26 - Mommy mother Wants to make a Baby  1080p\r\n\r\nIncest, Dirty Talk, MILF, Mom, Son, Taboo, Virtual, POV\r\n\r\n <a href=\"\nhttp://imgdawgknuttz.com/img-5a3101f7955c7.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdawgknuttz.com/img-5a3101f7955c7.html</a>  <a href=\"\nhttp://imgdawgknuttz.com/img-5a31020e32dfa.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imgdawgknuttz.com/img-5a31020e32dfa.html</a> \r\n\r\n\r\nYou are a single mom to one son, but you want a daughter as well. You enter your son&apos;s room wearing a sexy nighty with a lace thong on underneath . You tell your son that there is something you want to talk to him about. Sit on the bed cross legged, &apos;accidentally&apos; giving your son a view of your panties. You talk to your son about how much you appreciate him helping you out after his dad left all those years ago. But you ask him if he feels a bit lonely, just mom and son; you tell him that you do. You ask if he would like a sister? You talk about how it would be extra work, but it would make you and your son feel more like a family. He agrees. Now you start to act a bit teasing. You say you have something else to ask him, but you want him to promise not to freak out. You try to hint at it first, and play with your clothes around your tits, and fidget to move your hips and draw attention between your legs. You realise he isnt getting it so you just tell your son: you want him to be the one who gets you pregnant. He is a feels a little odd about it but you notice him get hard talking about it. You tease him more, maybe flash him and say &apos;it seems like you have thought about mommy before, huh, &apos;oedipus&apos;&apos;! At this point you pretty much start to dirty talk to your son, mentioning breeding and how it turns you on, while stripping. Suck your sons cock a little, to get it super hard, and then fuck him with lots of dirty t talk. At some point say &apos;This is what mommy did with daddy to make you&apos;, and ask &apos;so you like the idea of inbreeding your mommy?&apos; I dont know if you like the word &apos;cunt&apos; so I wont insist, but it would be hot if you use it. Again this is up to if you are willing, but I would love to see you riding reverse cowgirl, and slip a finger into your ass while dirty talking about son fucking it, saying stuff like &apos;maybe next time&apos;. It would also be hot if you talk about maybe having a threesome with mom, son and daughter when she is grown up. Ill pretty much leave this up to you though, you are the queen of dirty talk","last_updated":"2017-12-13T12:02:08.565Z","parsed":{"xt":"urn:btih:bc7f44a30a72cc31bfb8bbbbe8d1adee10a6e314","dn":"[ManyVids] Missbehavin26 - Mommy mother Wants to make a Baby  ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bc7f44a30a72cc31bfb8bbbbe8d1adee10a6e314","infoHashBuffer":{"type":"Buffer","data":[188,127,68,163,10,114,204,49,191,184,187,187,232,209,173,238,16,166,227,20]},"name":"[ManyVids] Missbehavin26 - Mommy mother Wants to make a Baby  ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}