{"title":"Diane Chamberlain 30 bks (EPUB)","magnet":"magnet:?xt=urn:btih:bc8c7a503c2318316728a9fe8cb8e60e080fe2ed&dn=Diane+Chamberlain+30+bks+%28EPUB%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"twocows","categoryP":"other","categoryS":"e_books","size":"23248302","seeders":"0","leechers":"0","description":" Diane Chamberlain is the New York Times, USA Today and Sunday Times [1] bestselling author of 25 novels published in more than twenty languages. Some of her most popular books include Necessary Lies, The Silent Sister, The Secret Life of CeeCee Wilkes, and TheKeeper of the Light Trilogy. Diane likes to write complex stories about relationships between men and women, parents and children, brothers and sisters, and friends.Although the thematic focus of her books often revolves around family, love,compassion and forgiveness, her stories usually feature a combination of drama,mystery, secrets and intrigue. Diane&#x2019;s background in psychology has given her akeen interest in understanding the way people tick, as well as the backgroundnecessary to create her realistic characters.\r\n\r\nDiane was born and raised in Plainfield, New Jersey and spent her summers at the Jersey Shore. She also lived for many years in San Diego and northern Virginia before making North Carolina her home.\r\n\r\nDiane received her bachelor&apos;s and master&apos;s degrees in clinical social work from San Diego State University. Prior to her writing career, Diane worked in hospitals in San Diego and Washington, D.C. before opening a private psychotherapy practice in Alexandria Virginia specializing in adolescents. All the while Diane was writing on the side. Her first book, Private Relations was published in 1989 and it earned the RITA award for Best Single Title Contemporary Novel","last_updated":"2017-12-03T12:00:58.856Z","parsed":{"xt":"urn:btih:bc8c7a503c2318316728a9fe8cb8e60e080fe2ed","dn":"Diane Chamberlain 30 bks (EPUB)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bc8c7a503c2318316728a9fe8cb8e60e080fe2ed","infoHashBuffer":{"type":"Buffer","data":[188,140,122,80,60,35,24,49,103,40,169,254,140,184,230,14,8,15,226,237]},"name":"Diane Chamberlain 30 bks (EPUB)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}