{"title":"Proceedings from the Ninth International Zeolite Conference","magnet":"magnet:?xt=urn:btih:bcf035cdf3c6fc186b76b18bbd8870f88d058d66&dn=Proceedings+from+the+Ninth+International+Zeolite+Conference&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"66016031","seeders":"14","leechers":"3","description":"Proceedings from the Ninth International Zeolite Conference - Montreal 1992 - R. von Ballmoos et al. (BH, 1993).pdf\r\n\r\nProceedings from the Ninth International Zeolite Conference, Volume I contains the proceedings of the Ninth International Zeolite Conference held in Montreal, Canada, on July 5-10, 1992. The conference provided a forum for reviewing the state of the art in zeolites and tackled topics ranging from advances and perspectives in the synthesis of molecular sieves to Raman spectroscopic studies in zeolite synthesis. The insertion of vanadium in the silicalite framework and the crystallization of aluminophosphate microporous compounds in an alcoholic system are also discussed.\r\n\r\nComprised of 71 chapters, this volume first deals with the discovery of a subclass of tectosilicate minerals now known as zeolites, followed by a detailed account of host/guest chemistry and catalysis in zeolites. The reader is then introduced to sodalite supralattices and a high-silica, large-pore aluminosilicate zeolite dubbed NCL-1. Subsequent chapters explore zeolite synthesis in ammonia and aqueous ammonia solvents; preparation of zeolite film using cellulose molding; molecular design of layered zirconium phosphonate catalysts; and the effect of hydrogen bonds on the aluminosilicate framework of ammonium-natrolite.\r\n\r\nThis book will appeal not only to experts but also to students and researchers entering the field of zeolites","last_updated":"2017-06-18T12:06:52.288Z","parsed":{"xt":"urn:btih:bcf035cdf3c6fc186b76b18bbd8870f88d058d66","dn":"Proceedings from the Ninth International Zeolite Conference","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bcf035cdf3c6fc186b76b18bbd8870f88d058d66","infoHashBuffer":{"type":"Buffer","data":[188,240,53,205,243,198,252,24,107,118,177,139,189,136,112,248,141,5,141,102]},"name":"Proceedings from the Ninth International Zeolite Conference","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}