{"title":"Solitude_ In Pursuit of a Singular Life in a Crowded World by Mi","magnet":"magnet:?xt=urn:btih:bd0165902309e002d4b5a556790f8eb63a4a2133&dn=Solitude_+In+Pursuit+of+a+Singular+Life+in+a+Crowded+World+by+Mi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"3376046","seeders":"18","leechers":"10","description":"xx\r\n\r\nSolitude_ In Pursuit of a Singular Life in a Crowded World by Michael Harris ePUB eBOOK-ZAK\r\n\r\nWith a foreword by Nicholas Carr, author of the Pulitzer Prize finalist The Shallows.\r\n\r\nToday, society embraces sharing like never before. Fueled by our dependence on mobile devices and social media, we have created an ecosystem of obsessive connection. Many of us now lead lives of strangely crowded isolation: We are always linked, but only shallowly so.\r\n\r\nThe capacity to be alone, properly alone, is one of life&apos;s subtlest skills. Real solitude is a powerful resource we can call upon - a crucial ingredient for a rich interior life. It inspires reflection, allows creativity to flourish, and improves our relationships with ourselves and, unexpectedly, with others. Idle hands can, in fact, produce the extraordinary. In living bigger and faster, we have forgotten the joys of silence and undervalued how profoundly it can revolutionize our lives.\r\n\r\nThis book is about discovering stillness inside the city, inside the crowd, inside our busy lives. With wit and energy, award-winning author Michael Harris weaves captivating true stories with reporting from the world&apos;s foremost brain researchers, psychologists, and tech entrepreneurs to guide us toward a state of measured connectivity that balances quiet and companionship. Solitude is a beautiful and convincing statement on the transformative power of being alone.\r\n\r\nxx","last_updated":"2017-08-07T12:02:14.137Z","parsed":{"xt":"urn:btih:bd0165902309e002d4b5a556790f8eb63a4a2133","dn":"Solitude_ In Pursuit of a Singular Life in a Crowded World by Mi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bd0165902309e002d4b5a556790f8eb63a4a2133","infoHashBuffer":{"type":"Buffer","data":[189,1,101,144,35,9,224,2,212,181,165,86,121,15,142,182,58,74,33,51]},"name":"Solitude_ In Pursuit of a Singular Life in a Crowded World by Mi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}