{"title":"RIDE-RELOADED","magnet":"magnet:?xt=urn:btih:bd0529f9c212e7b193003a847b79e9a3ae1c7d11&dn=RIDE-RELOADED&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"_sterling99","categoryP":"games","categoryS":"pc","size":"339765266","seeders":"0","leechers":"0","description":"\r\nnERv\r\n\r\nRIDE (c) Milestone S.r.l\r\n\r\n03/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n1 :.......... DISC(S) .. GAME.TYPE ........: Racing, Simulation\r\nSports\r\n\r\nAbout This Game Bikes from the world&apos;s most beloved motorcycle manufacturers,\r\nbreathtaking races, and a round-the-world trip taking in 15 different\r\nlocations: all this and more in the new videogame: RIDE.\r\n\r\nChoose from over 100 bikes from the manufacturers that have made motorcycling\r\nhistory, and set off on the World Tour. Challenge rivals at Motorcycle\r\nFestivals divided into three different track typologies: from the thrills of\r\nthe GP Tracks, through the beautiful landscapes of the Country Tracks, and\r\nall the way to the challenge of the City Tracks. Race after race, customise\r\nand improve your bike in order to work your way up the World Rankings and\r\nbecome the fastest biker in RIDE . As well as the World Tour, players can\r\ncompete in a variety of different game modes: Quick Race, Time Trial, Split\r\nScreen, and online with up to 12 players in the Quick Race and in the\r\nChampionship.\r\n\r\nWORLD TOUR:\r\n\r\nThe World Tour is RIDE&apos;s main game mode, where you can participate in various\r\nFestivals around the world, divided into various categories: Superbike 1000,\r\nSupersport 600, Historic Championships, and so on. Each Motorcycle Festival\r\nfeatures a variety of race modes: single race, championship, time trial,\r\ntrack day, drag race, and endurance. Each race influences your reputation,\r\nand therefore your position in the World Ranking of RIDE players.\r\n\r\nMULTIPLAYER:\r\n\r\nUp to 12 players can compete in the online game modes, including quick race\r\nand championship you&apos;ll be able to challenge a friend with the split screen\r\nfeature, and all the results of every race will be recorded on the\r\nLeaderboards.\r\n\r\nBIKES:\r\n\r\nChoose from a roster of the most beautiful bikes currently in production, and\r\nfrom the models that have made motorcycling history, with bikes from 14 of","last_updated":"2017-09-05T12:02:02.510Z","parsed":{"xt":"urn:btih:bd0529f9c212e7b193003a847b79e9a3ae1c7d11","dn":"RIDE-RELOADED","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bd0529f9c212e7b193003a847b79e9a3ae1c7d11","infoHashBuffer":{"type":"Buffer","data":[189,5,41,249,194,18,231,177,147,0,58,132,123,121,233,163,174,28,125,17]},"name":"RIDE-RELOADED","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}