{"title":"The Spy by Paulo Coelho EPUB","magnet":"magnet:?xt=urn:btih:bdb6bb0c36270993c83d1b55cdb1b74cd6ab62b1&dn=The+Spy+by+Paulo+Coelho+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3306160","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Spy by Paulo Coelho EPUB\r\n\r\nIn his new novel, Paulo Coelho, best-selling author of The Alchemist and Adultery, brings to life one of history&apos;s most enigmatic women: Mata Hari. The story of her celebrated yet mysterious life as an exotic dancer and courtesan, and her controversial execution as a spy during the First World War, unfolds as a fascinating first-person narrative of self-creation and bravery.\r\n\r\nHer only crime was to be an independent woman: &quot;I do not know if the future will remember me, but if it should, may no one ever view me as a victim but as someone who moved forward with courage and paid the price she had to pay.&quot;\r\n\r\nOn the occasion of the centenary of Mata Hari&apos;s execution for espionage in 1917, Paulo Coelho reconsiders her life and character in a fictional memoir. In a series of letters written from prison on the eve of her death, Mata Hari reflects on the choices she has made to always pursue her own truth - from her childhood in a small Dutch town to unhappy years as the wife of an alcoholic diplomat in Java to her calculated and self-fashioned rise to celebrity in Paris and across Europe as an exotic dancer and confidante to the most powerful men of the time. Though there was little evidence to incriminate her, Mata Hari was unable to escape persecution and prosecution by French military intelligence, and at the novel&apos;s end Coelho re-creates a final letter, written by Mata Hari&apos;s lawyer, Edouard Clunet, that offers a captivating view of Europe at war and the fatal price of suspicion.\r\n\r\nxx","last_updated":"2017-10-30T12:01:51.364Z","parsed":{"xt":"urn:btih:bdb6bb0c36270993c83d1b55cdb1b74cd6ab62b1","dn":"The Spy by Paulo Coelho EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bdb6bb0c36270993c83d1b55cdb1b74cd6ab62b1","infoHashBuffer":{"type":"Buffer","data":[189,182,187,12,54,39,9,147,200,61,27,85,205,177,183,76,214,171,98,177]},"name":"The Spy by Paulo Coelho EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}