{"title":"Tommy Bolin 1975 Teaser (vinyl)","magnet":"magnet:?xt=urn:btih:be2abf7f03ae6db2db0ef29a74ad8156a8851087&dn=Tommy+Bolin+1975+Teaser+%28vinyl%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wwino","categoryP":"audio","categoryS":"flac","size":"441579392","seeders":"5","leechers":"7","description":"Tommy Bolin ~ Teaser ~ 1975\r\n24/48 vinyl rip. Nemperor Records ATL 50 208. LP made in W.-Germany.\r\n <a href=\"\nhttp://i6.imageban.ru/out/2017/06/04/6f326908ce092695bdcb523c5f9d2e52.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i6.imageban.ru/out/2017/06/04/6f326908ce092695bdcb523c5f9d2e52.jpg</a> <a href=\"\nhttp://i1.imageban.ru/out/2017/06/04/6ed5bef1a244443e64e564cb5e68d935.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i1.imageban.ru/out/2017/06/04/6ed5bef1a244443e64e564cb5e68d935.jpg</a>\r\n\r\nSide 1\r\n1. The Grind 3:26\r\n2. Homeward Strut 3:55\r\n3. Dreamer 5:08\r\n4. Savannah Woman 2:45\r\n5. Teaser 4:27\r\n\r\nSide 2\r\n1. People, People 4:55\r\n2. Marching Powder 4:14\r\n3. Wild Dogs 4:40\r\n4. Lotus 3:57\r\n\r\nAfter performing in a variety of bands since the late &apos;60s, Bolin finally released his first solo album in 1975. Teaser is an impressive display of the guitarist&apos;s prowess and range, and is a natural progression from the previous Bolin-dominated James Gang albums Bang and Miami, and his work with drummer Billy Cobham. Teaser includes several period piece rock &amp; roll tracks, the foremost among them being the opener &quot;The Grind,&quot; with its strolling piano, taut basslines, and Bolin&apos;s guitar strutting the line between boogie and glam. In addition to his prowess as a guitarist, this track also showcases his considerable ability as a vocalist. On &quot;Homeward Strut,&quot; the first of two instrumentals here, Bolin&apos;s guitar takes center stage, centering on funky jazz-rock fusion. Both his rhythm playing and his lead work (single-string and slide) are paint peelers. Bolin was always equally adept at subtleties, as the ballads &quot;Dreamer&quot; and the Latin-tinged &quot;Savannah Woman&quot; (with percussion from Phil Collins) attest. That said, the album might have been better served had they not been sequenced back to back. The latter features Bolin showcasing the influence of Wes Montgomery&apos;s late style, as well giving a passing nod to Peter Green, yet with utterly original phrasing. The title track returns the &apos;70s boogie back to prominence, with its easy stroll countered by tasty fills and playful, sexy signing. &quot;People, People&quot; showcases the guitarist&apos;s love of reggae and his ability to seamlessly wed it to hard rock, Latin percussion (courtesy of Sammy Figueroa), and soul-jazz. Saxophonist David Sanborn and keyboardist Jan Hammer also play key roles in this standout. Those three also go head to head with Bolin on the scorching jazz-rock instrumental &quot;Marching Powder,&quot; which also includes drummer Narada Michael Walden. The other instrumental here, &quot;Homeward Strut,&quot; focuses on the harder-edged funky side of jazz-rock fusion. The set closes with two power ballads central to Bolin&apos;s legend, &quot;Wild Dogs&quot; and &quot;Lotus.&quot; Each tune has sparse elements of country rock that give way to molten power chords, labyrinthine fills, and eventually, roaring hard rock, and in the latter, reggae makes its return for a climactic finish. In 36-and-a-half minutes, Teaser is as near a rock classic as exists. It survives as Bolin&apos;s signature work. - Rob Caldwell, AMG","last_updated":"2017-06-04T12:01:08.447Z","parsed":{"xt":"urn:btih:be2abf7f03ae6db2db0ef29a74ad8156a8851087","dn":"Tommy Bolin 1975 Teaser (vinyl)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"be2abf7f03ae6db2db0ef29a74ad8156a8851087","infoHashBuffer":{"type":"Buffer","data":[190,42,191,127,3,174,109,178,219,14,242,154,116,173,129,86,168,133,16,135]},"name":"Tommy Bolin 1975 Teaser (vinyl)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}