{"title":"From the Depths v2.0","magnet":"magnet:?xt=urn:btih:be5a263fa1833423761871cd5397d2c1f9318627&dn=From+the+Depths+v2.0&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"544179047","seeders":"0","leechers":"0","description":"SummaryIn From the Depths you can build and take first-person command of battleships, planes, submarines, space ships, hot air balloons and more! The game is currently in alpha and contains a wide range of single player content including: A creative mode allowing you to push your designs to the limit and ensure the total annihilation of your opponents.  A campaign waged over hundreds of islands against eight unique factions.  A Story Mode where you can (eventually!) play 15 missions as each of the eight factions - a fantastic mixture of strategy, design and wild battles! Defend your fleet against waves of enemy forces in a series of extremely tough challenges that unlock new components.   An expansive multiplayer and co-op element is planned for the coming months!Key FeaturesDesign and build your fleet, fortresses and structures however you want. The alpha currently has over 400 unique components blocks, not including 29 different components for making missiles, torpedoes, depth charges and bombs. The sky&apos;s the limit, you can equip your vehicle with - cannons, lasers, mines, bombs, missiles, torpedoes, propellers, rudders, jet engines, wings, hydrofoils, hot air balloons, anchors, fire control computers, blueprint spawners, repair bots, air pumps, automated control blocks and many, many more!Realistic physics - every block destroyed or added affects the vehicle&apos;s functionality, physics and control. Drag, inertia tensors, buoyancy and sealed compartments are all updated based on the design of your vehicle and the damage sustained.  Be part of a fantastic","last_updated":"2017-07-22T12:00:26.841Z","parsed":{"xt":"urn:btih:be5a263fa1833423761871cd5397d2c1f9318627","dn":"From the Depths v2.0","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"be5a263fa1833423761871cd5397d2c1f9318627","infoHashBuffer":{"type":"Buffer","data":[190,90,38,63,161,131,52,35,118,24,113,205,83,151,210,193,249,49,134,39]},"name":"From the Depths v2.0","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}