{"title":"The Road to Jonestown by Jeff Guinn 2017 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:bfb52ac898b83c691f72feb822fc1d4499ce47a8&dn=The+Road+to+Jonestown+by+Jeff+Guinn+2017+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"64031915","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Road to Jonestown by Jeff Guinn 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the New York Times best-selling author of Manson comes the comprehensive, authoritative, and tragic story of preacher Jim Jones, who was responsible for the Jonestown Massacre - the largest murder-suicide in American history.\r\n\r\nIn the 1950s a young Indianapolis minister named Jim Jones preached a curious blend of the Gospel and Marxism. His congregation was racially integrated, and he was a much-lauded leader in the contemporary civil rights movement. Eventually Jones moved his church, Peoples Temple, to Northern California. He became involved in electoral politics and soon was a prominent Bay Area leader.\r\n\r\nIn this riveting narrative, Jeff Guinn examines Jones&apos; life, from his extramarital affairs, drug use, and fraudulent faith healing to the fraught decision to move almost 1,000 of his followers to a settlement in the jungles of Guyana in South America. Guinn provides stunning new details of the events leading to the fatal day in November 1978 when more than 900 people died - including almost 300 infants and children - after being ordered to swallow a cyanide-laced drink.\r\n\r\nGuinn examined thousands of pages of FBI files on the case, including material released during the course of his research. He traveled to Jones&apos; Indiana hometown, where he spoke to people never previously interviewed and uncovered fresh information from Jonestown survivors. He even visited the Jonestown site with the same pilot who flew there the day that Congressman Leo Ryan was murdered on Jones&apos; orders. The Road to Jonestown is the definitive book about Jim Jones and the events that led to the tragedy at Jonestown.\r\n\r\nxx","last_updated":"2017-08-23T12:00:23.816Z","parsed":{"xt":"urn:btih:bfb52ac898b83c691f72feb822fc1d4499ce47a8","dn":"The Road to Jonestown by Jeff Guinn 2017 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bfb52ac898b83c691f72feb822fc1d4499ce47a8","infoHashBuffer":{"type":"Buffer","data":[191,181,42,200,152,184,60,105,31,114,254,184,34,252,29,68,153,206,71,168]},"name":"The Road to Jonestown by Jeff Guinn 2017 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}