{"title":"The Chemist by Stephenie Meyer epub RtR","magnet":"magnet:?xt=urn:btih:bfee3ab287d9ecfbf7491443d4c901f80e7d10fe&dn=The+Chemist+by+Stephenie+Meyer+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3225689","seeders":"1","leechers":"2","description":"xx\r\n\r\nThe Chemist by Stephenie Meyer epub RtR\r\n\r\nIn this gripping thriller, an ex-agent on the run from her former employers must take one more case to clear her name and save her life.\r\n\r\nShe used to work for the US government, but very few people ever knew that. An expert in her field, she was one of the darkest secrets of an agency so clandestine it doesn&apos;t even have a name. And when they decided she was a liability, they came for her without warning.\r\n\r\nNow she rarely stays in the same place or uses the same name for long. They&apos;ve killed the only other person she trusted, but something she knows still poses a threat. They want her dead, and soon.\r\n\r\nWhen her former handler offers her a way out, she realizes it&apos;s her only chance to erase the giant target on her back. But it means taking one last job for her ex-employers. To her horror, the information she acquires only makes her situation more dangerous.\r\n\r\nResolving to meet the threat head-on, she prepares for the toughest fight of her life but finds herself falling for a man who can only complicate her likelihood of survival. As she sees her choices being rapidly whittled down, she must apply her unique talents in ways she never dreamed of.\r\n\r\nIn this tautly plotted novel, Meyer creates a fierce and fascinating new heroine with a very specialized skill set. And she shows once again why she&apos;s one of the world&apos;s best-selling authors.\r\n\r\nxx","last_updated":"2017-07-17T12:01:12.251Z","parsed":{"xt":"urn:btih:bfee3ab287d9ecfbf7491443d4c901f80e7d10fe","dn":"The Chemist by Stephenie Meyer epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"bfee3ab287d9ecfbf7491443d4c901f80e7d10fe","infoHashBuffer":{"type":"Buffer","data":[191,238,58,178,135,217,236,251,247,73,20,67,212,201,1,248,14,125,16,254]},"name":"The Chemist by Stephenie Meyer epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}