{"title":"The Man of Legends by Kenneth Johnson ePUB MOBI eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:c0154901401d84df50ed5af316c5b5831e527027&dn=The+Man+of+Legends+by+Kenneth+Johnson+ePUB+MOBI+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3754949","seeders":"1","leechers":"0","description":"xx\r\n\r\nThe Man of Legends by Kenneth Johnson ePUB MOBI eBOOK-ZAK\r\n\r\nAward-winning science-fiction mastermind Kenneth Johnson blends epic adventure, romance, and evocative drama into an intense supernatural thriller rooted in one of the great untold legends of human history.\r\n\r\nNew York City, New Year&apos;s weekend, 2001. Jillian Guthrie, a troubled young journalist, stumbles onto a tantalizing mystery: the same man, unaged, stands alongside Ulysses S. Grant, Theodore Roosevelt, and Gandhi in three different photographs spanning eighty-five years of history.\r\n\r\nIn another part of town, Will - an enigmatic thirty-three-year-old of immense charm, wit, and intelligence - looks forward to the new year with hope and trepidation. Haunted by his secret past and shadowed by a dangerous stranger, he finds himself the object of an intense manhunt spearheaded by an ambitious Vatican emissary and an elderly former UN envoy named Hanna.\r\n\r\nDuring the next forty-eight hours, a catastrophic event unites Will, Jillian, and Hanna - and puts them in the crosshairs of a centuries-old international conspiracy. Together, the three must unravel an ancient curse that stretches back two millennia and beyond, and face a primal evil that threatens their lives and thousands more.\r\n\r\nThe full list of narrators includes: Eric Pierpoint, Emily Adams, Stephen Mendel, Alexis Evans, Kerrie Keane, Jackson White, Terri Treas, Francesca Ling, Jackie Mah, Jeff Marcus, Kenneth Johnson, Nelson Estevez, and Susan Appling.\r\n\r\nxx","last_updated":"2017-08-02T12:01:08.538Z","parsed":{"xt":"urn:btih:c0154901401d84df50ed5af316c5b5831e527027","dn":"The Man of Legends by Kenneth Johnson ePUB MOBI eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0154901401d84df50ed5af316c5b5831e527027","infoHashBuffer":{"type":"Buffer","data":[192,21,73,1,64,29,132,223,80,237,90,243,22,197,181,131,30,82,112,39]},"name":"The Man of Legends by Kenneth Johnson ePUB MOBI eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}