{"title":"\nA Kind of Freedom_ A Novel by Margaret Wilkerson Sexton ePUB eBO","magnet":"magnet:?xt=urn:btih:c046a8e933b5d7d957db8b49e8176502229a1480&dn=A+Kind+of+Freedom_+A+Novel+by+Margaret+Wilkerson+Sexton+ePUB+eBO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4962224","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Kind of Freedom_ A Novel by Margaret Wilkerson Sexton ePUB eBOOK-ZAK\r\n\r\nEvelyn is a Creole woman who comes of age in New Orleans at the height of World War II. Her family inhabits the upper echelon of black society, and when she falls for no-name Renard, she is forced to choose between her life of privilege and the man she loves.\r\n\r\nIn 1982, Evelyn&apos;s daughter Jackie is a frazzled single mother grappling with her absent husband&apos;s drug addiction. Just as she comes to terms with his abandoning the family, he returns, ready to resume their old life. Jackie must decide if the promise of her husband is worth the near certainty that he will leave again.\r\n\r\nJackie&apos;s son T. C. loves the creative process of growing marijuana more than the weed itself. He finds something hypnotic about training the seedlings, testing the levels, trimming the leaves, and drying the buds. He was a square before Hurricane Katrina, but the New Orleans he knew didn&apos;t survive the storm, and in its wake he was changed too. Now, fresh out of a four-month stint for possession with the intent to distribute, he decides to start over - until an old friend convinces him to stake his new beginning on one last deal.\r\n\r\nFor Evelyn, Jim Crow is an ongoing reality, and in its wake, new threats spring up to haunt her descendants. A Kind of Freedom is an urgent novel that explores the legacy of racial disparity in the South through a poignant and redemptive family history.\r\n\r\nxx","last_updated":"2017-09-28T12:01:04.178Z","parsed":{"xt":"urn:btih:c046a8e933b5d7d957db8b49e8176502229a1480","dn":"A Kind of Freedom_ A Novel by Margaret Wilkerson Sexton ePUB eBO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c046a8e933b5d7d957db8b49e8176502229a1480","infoHashBuffer":{"type":"Buffer","data":[192,70,168,233,51,181,215,217,87,219,139,73,232,23,101,2,34,154,20,128]},"name":"A Kind of Freedom_ A Novel by Margaret Wilkerson Sexton ePUB eBO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}