{"title":"Avorion v0.12.4","magnet":"magnet:?xt=urn:btih:c05eb6fda9ef6a3be7c53ab037620b45e6b9a15f&dn=Avorion+v0.12.4&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"329052678","seeders":"10","leechers":"2","description":"Avorion is currently in Early Access, and under active development. If you want to know more about that, please read the Early Access disclaimer at the top of the page.Several hundred years ago, a cataclysmic catastrophe nearly ripped your galaxy apart - an insurmountable ring of torn hyperspace fabric appeared in the center of the galaxy, which normal hyperspace engines can&#x2019;t overcome.Since this event nobody has managed to get near the central regions of the galaxy. All you know is that this event also spawned multiple insurmountable hyperspace rifts throughout the entire galaxy, and that a strange race of aliens, the Xsotan, has appeared in the center. It looks like these aliens have found a way to surpass the torn hyperspace fabric, but so far nobody has managed to establish contact with them.There are also rumors about a strange new metal called &#x2018;Avorion&#x2019;, which has appeared in the center of the galaxy, around the same time as the Xsotan arrived. Apparently the aliens use this material to build their ships.Start out as a nobody at the edge of the galaxy and work your way to the center of a galaxy that gets more dangerous, but also more rewarding the closer you get to its core. Avorion takes sandbox aspects from games like X or Freelancer, throws in co-op multiplayer and lets you build your own ships. It features ships made of freely scalable blocks that can be procedurally generated and that break into pieces where they&apos;re hit in space fights.CombatEquip your ship with chainguns, lasers and other weaponry to take on your enemies and enjoy the sight of completely","last_updated":"2017-07-02T12:06:17.720Z","parsed":{"xt":"urn:btih:c05eb6fda9ef6a3be7c53ab037620b45e6b9a15f","dn":"Avorion v0.12.4","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c05eb6fda9ef6a3be7c53ab037620b45e6b9a15f","infoHashBuffer":{"type":"Buffer","data":[192,94,182,253,169,239,106,59,231,197,58,176,55,98,11,69,230,185,161,95]},"name":"Avorion v0.12.4","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}