{"title":"Helen Rothberg - The Perfect Mix_ Everything I Know About Leader","magnet":"magnet:?xt=urn:btih:c0aa4da5f1a4c543bc00748aeaaa883aee9b3d95&dn=Helen+Rothberg+-+The+Perfect+Mix_+Everything+I+Know+About+Leader&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4006843","seeders":"0","leechers":"0","description":"xx\r\n\r\nHelen Rothberg - The Perfect Mix_ Everything I Know About Leadership I Learned as a Bartender 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn the tradition of the popular business classics Leadership Is an Art and What They Don&apos;t Teach You at Harvard Business School, Dr. Helen Rothberg, a sought-after consultant to CEOs and entrepreneurs, reveals memorable insights about leadership developed while she worked as a bartender and restaurant manager.\r\n\r\nGood managers and good leaders are not always the same. Dr. Helen Rothberg trains leaders, from Fortune 500 executives to start-up entrepreneurs, with her particular brand of ADVICE - Action, Determination, Vision, Integrity, Communication, Empathy. Based on the management and life lessons she learned from working as a bartender while getting graduate business and behavioral science degrees, each aspect of ADVICE helps leaders hone their vision - of themselves and their business. You will explore who you are and who you need to become, analyze what has worked in the past and what might work better in the future, and realize ways to continually adapt - with courage and grace - to the unpredictable, uncertain business environment.\r\n\r\nThrough the book&apos;s colorful stories of barroom brawls and boardroom bravado, competition and cooperation, conflict and other challenges, you&apos;ll conceive of new ways to develop working relationships with colleagues and customers, keep things running smoothly, and manage infuriating, delightful, and sometimes dangerous clients as well as temperamental and talented employees, and owners or bosses with brilliant ideas who may not communicate well.\r\n\r\nLeading an organization is knowing when to stir or shake things up, blend or serve neat, and Dr. Rothberg finishes each chapter with the recipe for a creative cocktail that embodies a lesson, to mix perfectly, contemplate, and savor.\r\n\r\nxx","last_updated":"2017-08-09T12:01:00.862Z","parsed":{"xt":"urn:btih:c0aa4da5f1a4c543bc00748aeaaa883aee9b3d95","dn":"Helen Rothberg - The Perfect Mix_ Everything I Know About Leader","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0aa4da5f1a4c543bc00748aeaaa883aee9b3d95","infoHashBuffer":{"type":"Buffer","data":[192,170,77,165,241,164,197,67,188,0,116,138,234,170,136,58,238,155,61,149]},"name":"Helen Rothberg - The Perfect Mix_ Everything I Know About Leader","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}