{"title":"Unleashing the Innovators_ How Mature Companies Find New Life wi","magnet":"magnet:?xt=urn:btih:c0b67a11e8942652c40b3ae17982bc044a176db3&dn=Unleashing+the+Innovators_+How+Mature+Companies+Find+New+Life+wi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7482791","seeders":"3","leechers":"5","description":"xx\r\n\r\nUnleashing the Innovators_ How Mature Companies Find New Life with Startups by Jim Stengel and Tom Post ePUB eBOOK-ZAK\r\n\r\nToday&apos;s established companies must find new ways to reignite their entrepreneurial DNA and jump-start revenues - or risk losing their way. By working with startup companies, says Jim Stengel, renowned consultant to Fortune 500 companies and the former global marketing officer for Procter &amp; Gamble, legacy companies can renew themselves: by acquiring new technology and creating new business lines, relearning the need for speed, sparking innovation, and learning from failures.\r\n\r\nAt P&amp;G Stengel saw the importance of establishing partnerships with the startup world in order to learn how to better innovate. Relying on extensive interviews with innovation leaders at enterprise companies and startups, Stengel&apos;s Unleashing the Innovators takes readers inside such storied companies as GE and Wells Fargo, IBM and Target, Motorola Solutions and Toyota to see what they are learning from their alliances with entrepreneurs. Stengel also explores how even 20- and 30-year-old &quot;startups&quot; like Amazon, Google, andcan reinvent themselves - and what managers at legacy companies everywhere can learn from them.\r\n\r\nDrawing on a specially commissioned global study of over 200 established corporations and startups conducted by research consultancy OgilvyRED, Stengel found that companies with successful startup partnerships are three times more likely to change their cultures to be more innovative.\r\n\r\nFilled with in-depth stories from the front lines of today&apos;s most forward-looking companies, Unleashing the Innovators shows how companies of all sizes can better navigate today&apos;s changing landscape, accelerate innovation, increase revenues, and improve their customer relationships.\r\n\r\nxx","last_updated":"2017-09-16T12:02:17.762Z","parsed":{"xt":"urn:btih:c0b67a11e8942652c40b3ae17982bc044a176db3","dn":"Unleashing the Innovators_ How Mature Companies Find New Life wi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0b67a11e8942652c40b3ae17982bc044a176db3","infoHashBuffer":{"type":"Buffer","data":[192,182,122,17,232,148,38,82,196,11,58,225,121,130,188,4,74,23,109,179]},"name":"Unleashing the Innovators_ How Mature Companies Find New Life wi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}