{"title":"XnViewMP 0.88 (x64) Multilingual Portable - ArmaanPC","magnet":"magnet:?xt=urn:btih:c0ea84cc0a18b18be75ae3ca765eba98fce3400d&dn=+XnViewMP+0.88+%28x64%29+Multilingual+Portable+-+ArmaanPC&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"armaanpc","categoryP":"applications","categoryS":"windows","size":"57263855","seeders":"3","leechers":"2","description":" XnViewMP 0.88 (x64) Multilingual Portable - ArmaanPC\r\n\r\n\r\nFile Size: 54.8 MB\r\nXnView MP is an advanced version of Xn5View, which is a powerful and reliable multimedia viewer, manager and converter. It offers the same stylish and easy to use interface that makes it almost fun to rate, sort and catalog files while still being practical. The files are displayed in the central area of the main window and you are able to choose the type of view you want for them.\r\n\r\nThe surroundings of that central browser can be fitted with a bunch of other tools. You can dock and rearrange the windows for the folder browser, document info and file preview. This comes in very handy when you want to create your own layout and speed up your workflow.\r\n\r\nJust like its counterpart, XnView MP provides a wide range of ways to view files. You can change the size of the preview thumbnails, compare images and even edit them. Double clicking a picture automatically opens it in the editor. Here, you are able to analyze its histogram, resize and crop it, as well as apply various enhancement filters.\r\n\r\nAll the images you edit, as well as others that are simply chosen can be converted to popular formats such as JPEG, GIF, PNG, TIFF, BMP, PCX and TGA. This can be done using single files, or multiple ones in batch mode.\r\n\r\nThe biggest difference between XnView and XnView MP is that the latter is optimized for improved performance in loading times and caching. And since XnView MP is capable of working with large amounts of files, this means that you can save plenty of time when it comes to organizing your files.\r\n\r\nWith the above to consider and much more to discover about what XnView MP can offer, it&#x2019;s safe to say that it is indeed a feature packed media viewing and cataloging application.\r\n\r\nUnrivaled Compatibility\r\nXnView MP supports more than 500 image formats (including Multipage and animated still formats APNG, TIFF, GIF, ICO, etc..) and export to about 70 different file formats.\r\n\r\nBatch Conversion\r\nXnView MP comes with an easy to use yet powerful batch conversion module. This same module also powers XnConvert\r\n\r\nAnd much more&#x2026;\r\nVirtually all of standard XnView&#x2019;s much loved features have been preserved in XnView MP and many features have actually been tweaked and enhanced","last_updated":"2017-11-04T12:07:15.484Z","parsed":{"xt":"urn:btih:c0ea84cc0a18b18be75ae3ca765eba98fce3400d","dn":" XnViewMP 0.88 (x64) Multilingual Portable - ArmaanPC","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c0ea84cc0a18b18be75ae3ca765eba98fce3400d","infoHashBuffer":{"type":"Buffer","data":[192,234,132,204,10,24,177,139,231,90,227,202,118,94,186,152,252,227,64,13]},"name":" XnViewMP 0.88 (x64) Multilingual Portable - ArmaanPC","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}