{"title":"\nA Torch Kept Lit_ Great Lives of the Twentieth Century by Willia","magnet":"magnet:?xt=urn:btih:c1382495fd55041d037f7ca85b1e711660dcf11d&dn=A+Torch+Kept+Lit_+Great+Lives+of+the+Twentieth+Century+by+Willia&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6116879","seeders":"0","leechers":"0","description":"xx\r\n\r\nA Torch Kept Lit_ Great Lives of the Twentieth Century by William F Buckley ePUB eBOOK-ZAK\r\n\r\nA unique collection of eulogies of the 20th century&apos;s greatest figures, written by conservative icon William F. Buckley Jr. and compiled by National Review and Fox News White House correspondent James Rosen.\r\n\r\nIn a half century on the national stage, William F. Buckley Jr. achieved unique stature as a polemicist and the undisputed godfather of modern American conservatism. He knew everybody, hosted everybody at his East 73rd Street maisonette, skewered everybody who needed skewering, and in general lived life on a scale, and in a swashbuckling manner, that captivated and inspired countless young conservatives across that half century.\r\n\r\nAmong all of his distinctions, which include founding the conservative magazine National Review and serving as host on the long-running talk show Firing Line, Buckley was a master of that most elusive of art forms: the eulogy. Buckley drew on his unrivaled gifts in what he liked to call &quot;the controversial arts&quot; to mourn, celebrate, or seek eternal mercy for the men and women who touched his life and the nation; to conjure their personalities, recall memorable moments, herald their greatness; or to remind us why a given individual, even with the grace that death can uniquely confer, should be remembered as evil.\r\n\r\nAt all points these remembrances reflect Buckley&apos;s singular voice, with its elegant touch and mordant humor, and lend to the lives departed final tributes consistent with their own careers, lives, and accomplishments. Of the more than 100 eulogies located in Buckley&apos;s vast archive of published works, A Torch Kept Lit collects the very best, those remembering the most consequential lives (Kennedy, Nixon, Reagan), the most famous to today&apos;s readers (Elvis Presley, John Lennon, Jacqueline Kennedy Onassis, Princess Diana), those who loomed largest in the conservative movement (Barry Goldwater, Milton Friedman), the most accomplished in the literary world (William Shawn, Norman Mailer), the most mysterious (Soviet spy Alger Hiss, CIA spymaster Richard Helms), and those most dear to Buckley (his mother and father).\r\n\r\nxx","last_updated":"2017-09-21T12:03:36.500Z","parsed":{"xt":"urn:btih:c1382495fd55041d037f7ca85b1e711660dcf11d","dn":"A Torch Kept Lit_ Great Lives of the Twentieth Century by Willia","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c1382495fd55041d037f7ca85b1e711660dcf11d","infoHashBuffer":{"type":"Buffer","data":[193,56,36,149,253,85,4,29,3,127,124,168,91,30,113,22,96,220,241,29]},"name":"A Torch Kept Lit_ Great Lives of the Twentieth Century by Willia","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}