{"title":"Photo Fusion. A Wedding Photographers Guide to Mixing Digital Ph","magnet":"magnet:?xt=urn:btih:c1621ed3734f86d41f741b0dc936991554cc896b&dn=Photo+Fusion.+A+Wedding+Photographers+Guide+to+Mixing+Digital+Ph&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"BanchMon2","categoryP":"other","categoryS":"e_books","size":"9189179","seeders":"30","leechers":"2","description":"Photo Fusion: A Wedding Photographers Guide to Mixing Digital Photography and Video\r\n\r\nPDF\r\nISBN: 978-0-470-59776-7\r\n8,76 MB ( 9 189 179 bytes)\r\nno dvd in torent\r\n\r\n\r\nWe&apos;ve followed the amazing work of the Bebbs for some time - both Jennifer and Steve Bebb have been doing some amazing weddings for years (including being placed in the top 10 wedding photographers in the world by American Photo in 2007), but they picked up a couple of Canon EOS 5D Mark II cameras and have been even more creative. Now, Jen Bebb has released this new book and DVD called &quot;Photo Fusion&quot; - A Wedding Photographer&apos;s Guide to Mixing Digital Photography and Video. If you&apos;re a wedding (or even a family or senior portrait photographer) then you should be at least thinking of adding Fusion to your business. It will become one of the products that will make or break a studio (if you ask me) in the near future. And, you need some good help getting up to speed. Sure, you&apos;re a great still photographer or videographer, but what does it take to get involved in fusion quickly and by doing so, set yourself apart from the others in your area trying to get your business? First, you buy this book. Not only does it start you out with the simplicity of defining the terms and making it easy to understand, but it also provides a DVD with the Bebbs teaching you the details as well as giving you some wonderful examples to learn from. And, while this book is mainly aimed at weddings, there&apos;s a whole market of folks wanting family or senior portraits as well and you could apply many of these lessons to that market too (and they&apos;re even covered in chapter 10!) With the companion DVD, you can&apos;t really ask for much more INFOrmation about doing Fusion. Negatives? I couldn&apos;t really find too much negative to say. There were a couple of typos and I kinda dislike the coloration of the processing in the training section of the DVD. There were also a couple of sections in the DVD that seemed to be repeats, but it wasn&apos;t too annoying. None of these nitpicks detract at all from the overall knowledge that is shared and therefore I give it 5 stars. My overall summary: this book and DVD are worth much more than the $39.95 list price - you&apos;d pay a ton more for a Fusion training class so pick this book up","last_updated":"2017-06-19T12:03:14.330Z","parsed":{"xt":"urn:btih:c1621ed3734f86d41f741b0dc936991554cc896b","dn":"Photo Fusion. A Wedding Photographers Guide to Mixing Digital Ph","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c1621ed3734f86d41f741b0dc936991554cc896b","infoHashBuffer":{"type":"Buffer","data":[193,98,30,211,115,79,134,212,31,116,27,13,201,54,153,21,84,204,137,107]},"name":"Photo Fusion. A Wedding Photographers Guide to Mixing Digital Ph","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}