{"title":"Fallout d40 - Tabletop RPG w/ Errata 11/4/17","magnet":"magnet:?xt=urn:btih:c1db65e1f4db3c968e0b1d5c41d0a27bc92fda38&dn=Fallout+d40+-+Tabletop+RPG+w%2F+Errata+11%2F4%2F17&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"CFA321","categoryP":"games","categoryS":"other","size":"32620034","seeders":"1","leechers":"0","description":"Hello!\r\n\t\t\r\n\tThis is a pen and paper roleplaying game I created based on Fallout. This is a complete, first edition Player&apos;s Handbook with its&apos; own unique ruleset - a ruleset that will be instantly recognizable to anyone who has played Dungeons and Dragons. I have been working on it for some time and I feel it is finally ready to be released. The game is also called Fallout d40 as in addition to the normal dice sizes that D&amp;D uses, this game also utilizes the d24, d30 and d40 (suggested links on where to obtain these are included below). In a nutshell, you start off by rolling the d20 for your attack rolls the same as D&amp;D but at a certain level you can select a perk that allows you to use the d24 for your attack rolls instead, then at a later level you can use the d30 and then finally the d40. Explosive attacks can only reach the d24 at most for their attack rolls. These dice have also been incorporated into other rolls in the game such as damage and recovering HP in certain instances. Armor Class ranges have also been greatly extended with a character that has base 5 in their stats wearing the most powerful armor listed (Enclave Hellfire Power Armor with matching Helmet) would have AC 38. I also recommend using a Bag-O-Dice or Pound-O-Dice as there are lots of dice that need to be rolled at times. Although this may seem a little wild, balance is the #1 most important aspect to me in designing a game and I have done my best to make it so.\r\n\tCustom character sheets, 6 in total (Character Front, Character Back, Weapons, Armor, Chems and Perks) are included in the rulebook (pgs. 10-15). I had to set their size to 97% when printing to get them to print properly but it may have just been the printer I was using. \r\n\tThe torrent includes the rulebook, the character sheets as well as a copy of the original Reddit post with links to buy the d24, d30 and d40. I will try to seed it as often as I can. If you like the game and are able to seed, host or otherwise distribute it please do so!\r\n\tAs mentioned in the rulebook, I am looking for as much honest, critical feedback on this project as possible and I also very much would like to hear stories and recaps from your sessions if you try the game out. Questions, critiques, reviews, recaps and comments of all kind can be sent to me at\r\n\r\n\tI hope you enjoy the game and have fun playing it. Let me know what you think. Thank you!\r\n\r\n-Chris","last_updated":"2017-11-05T12:09:56.622Z","parsed":{"xt":"urn:btih:c1db65e1f4db3c968e0b1d5c41d0a27bc92fda38","dn":"Fallout d40 - Tabletop RPG w/ Errata 11/4/17","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c1db65e1f4db3c968e0b1d5c41d0a27bc92fda38","infoHashBuffer":{"type":"Buffer","data":[193,219,101,225,244,219,60,150,142,11,29,92,65,208,162,123,201,47,218,56]},"name":"Fallout d40 - Tabletop RPG w/ Errata 11/4/17","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}