{"title":"Inferior_ How Science Got Women Wrong ... and the New Research T","magnet":"magnet:?xt=urn:btih:c217915247bba2b594932e5439f563d4f8f1f697&dn=Inferior_+How+Science+Got+Women+Wrong+...+and+the+New+Research+T&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3942903","seeders":"0","leechers":"0","description":"xx\r\n\r\nInferior_ How Science Got Women Wrong &#x2013; and the New Research That&#x2019;s Rewriting the Story by Angela Saini ePUB MOBI eBOOK-ZAK\r\n\r\nWhat science has gotten so shamefully wrong about women and the fight, by both female and male scientists, to rewrite what we thought we knew.\r\n\r\nFor hundreds of years, it was common sense: Women were the inferior sex. Their bodies were weaker, their minds feebler, their role subservient. No less a scientist than Charles Darwin asserted that women were at a lower stage of evolution, and for decades scientists - most of them male, of course - claimed to find evidence to support this.\r\n\r\nWhether looking at intelligence or emotion, cognition or behavior, science has continued to tell us that men and women are fundamentally different. Biologists claim that women are better suited to raising families or are, more gently, uniquely empathetic. Men, on the other hand, continue to be described as excelling at tasks that require logic, spatial reasoning, and motor skills. But a huge wave of research is now revealing an alternative version of what we thought we knew. The new woman revealed by this scientific data is as strong, strategic, and smart as anyone else.\r\n\r\nIn Inferior, acclaimed science writer Angela Saini weaves together a fascinating - and sorely necessary - new science of women. As Saini takes readers on a journey to uncover science&apos;s failure to understand women, she finds that we&apos;re still living with the legacy of an establishment that&apos;s just beginning to recover from centuries of entrenched exclusion and prejudice. Sexist assumptions are stubbornly persistent: even in recent years, researchers have insisted that women are choosy and monogamous while men are naturally promiscuous or that the way men&apos;s and women&apos;s brains are wired confirms long-discredited gender stereotypes.\r\n\r\nxx","last_updated":"2017-07-31T12:01:28.342Z","parsed":{"xt":"urn:btih:c217915247bba2b594932e5439f563d4f8f1f697","dn":"Inferior_ How Science Got Women Wrong ... and the New Research T","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c217915247bba2b594932e5439f563d4f8f1f697","infoHashBuffer":{"type":"Buffer","data":[194,23,145,82,71,187,162,181,148,147,46,84,57,245,99,212,248,241,246,151]},"name":"Inferior_ How Science Got Women Wrong ... and the New Research T","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}