{"title":"The Crown of Leaves v0.7.4","magnet":"magnet:?xt=urn:btih:c2b6337079b5e81ef3032dbed2baf6a49a3d2047&dn=The+Crown+of+Leaves+v0.7.4&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"189107875","seeders":"7","leechers":"6","description":"Crown of Leaves is a visual, non-linear fantasy novel about mysticism, riddles, constellations, anthro beings, beasts, and ghosts!PlotRoui, a resilient city dandy, a decipherer, a half-educated jeweler and the author of scientific magic articles, met with a Big Failure, AND has to return to his gypsy homeland, Latori. Ciphers aren&apos;t a thing here, and local shoddy mystical beliefs are really irritating and dejecting to Roui. He dreams to come back to his old life... But how can it be possible if you have no money? In search of quick earnings, Roui&apos;s picking up his old jewelry tools once more and finds the customer himself. The customer encharges Roui with a task to make a bracelet from a special wood for his bride inside of a month. But, as soon as Roui get to work, strange and unpleasant things start to appear all of sudden. Which, due to the superstition of the local people, became much more horrific and absurd than they actually are. Roui isn&apos;t meant to finish the work on the bracelet... because it was stolen! And the unexpected helper says that the bracelet was taken by the legendary Latorian spirit - the Mad Rook. Is the Rook real or this is just her sick imagination? Roui has no time to figure out the details - he has to believe the helper and start looking for the bracelet as soon as possible, incidentally deciphering the mysterious cryptograms he&apos;ll be facing on his way. Will Roui succeed and get the bracelet back","last_updated":"2017-07-02T12:01:18.245Z","parsed":{"xt":"urn:btih:c2b6337079b5e81ef3032dbed2baf6a49a3d2047","dn":"The Crown of Leaves v0.7.4","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c2b6337079b5e81ef3032dbed2baf6a49a3d2047","infoHashBuffer":{"type":"Buffer","data":[194,182,51,112,121,181,232,30,243,3,45,190,210,186,246,164,154,61,32,71]},"name":"The Crown of Leaves v0.7.4","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}