{"title":"Lonely Boy -Tales from a Sex Pistol (2017) (Epub)","magnet":"magnet:?xt=urn:btih:c31cb83904fc05623f41e3739714380432af91da&dn=Lonely+Boy+-Tales+from+a+Sex+Pistol+%282017%29+%28Epub%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"lionheart500","categoryP":"other","categoryS":"e_books","size":"44339229","seeders":"0","leechers":"0","description":"Publisher: William Heinemann (17 Nov. 2016)\r\nAuthor: Steve Jones\r\nLanguage: English\r\nISBN-10: 1785150685\r\nISBN-13: 9781785150685\r\nASIN: B01GR49BXO\r\n\r\nForeword by Chrissie Hynde\r\n\r\nWithout the Sex Pistols there would be no Punk. And without Steve Jones there would be no Sex Pistols. It was Steve who formed Kutie Jones and his Sex Pistols, the band that eventually went on to become the Sex Pistols, with his schoolmate Paul Cook and who was its original leader. As the world celebrates the 40th anniversary of Punk &#x2013; the influence and cultural significance of which is felt in music, fashion and the visual arts to this day &#x2013; Steve tells his story for the very first time. \r\n\r\nSteve&#x2019;s modern Dickensian tale begins in the streets of Hammersmith and Shepherd&#x2019;s Bush, West London, where as a lonely, neglected boy living off his wits and petty thievery he is given purpose by the glam art rock of David Bowie and Roxy Music and becomes one of the first generation of ragamuffin punks taken under the wings of Malcolm McLaren and Vivienne Westwood. For the very first time Steve describes the sadness of never having known his dad, the neglect and abuse he suffered at the hands of his step father, and how his interest in music and fashion saved him from a potential life of crime spent in remand centres and prison. From the Kings Road of the early seventies, through the years of the Sex Pistols, Punk Rock and the recording of Never Mind the Bollocks (ranked number 41 in Rolling Stone magazine&#x2019;s Best Albums of All Time), to his self-imposed exile in New York and Los Angeles where he battled with alcohol, heroin and sex addiction &#x2013; caught in a cycle of rehab and relapse &#x2013; Lonely Boy, written with music journalist and author Ben Thompson, is the story of an unlikely guitar hero who, with the Sex Pistols, changed history.\r\n\r\nPublication coincides with the 40th anniversary of the release of the Sex Pistols first record, &#x2018;Anarchy in the UK&#x2019;, and of Steve&#x2019;s infamous confrontation on Bill Grundy&#x2019;s Today programme &#x2013; that interview ushered in the &#x2018;Filth and the Fury&#x2019; headlines that catapulted Punk into the national consciousness","last_updated":"2017-05-29T13:15:27.503Z","parsed":{"xt":"urn:btih:c31cb83904fc05623f41e3739714380432af91da","dn":"Lonely Boy -Tales from a Sex Pistol (2017) (Epub)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c31cb83904fc05623f41e3739714380432af91da","infoHashBuffer":{"type":"Buffer","data":[195,28,184,57,4,252,5,98,63,65,227,115,151,20,56,4,50,175,145,218]},"name":"Lonely Boy -Tales from a Sex Pistol (2017) (Epub)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}