{"title":"Icecream Screen Recorder Pro 4.94 + Patch [CracksNow]","magnet":"magnet:?xt=urn:btih:c335c27719cd265083183c7140d5dc386c0a01d4&dn=Icecream+Screen+Recorder+Pro+4.94+%2B+Patch+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"55353810","seeders":"9","leechers":"2","description":"Icecream Screen Recorder Pro - easy to use program for recording video from your computer screen (recording games, Skype, webinars, and more), as well as how to create screenshots of all windows, and the selected area. The app has a complete set of tools required for professional video capture from the screen. Screen Recorder allows you to capture the selection of any screen size. If you need to allocate a portion of the screenshot or add text comments to him, this program has the drawing tools. They allow you to draw on the screenshot shapes, lines and text overlay. \r\n\r\nA screenshot of the program can immediately copied to the clipboard, or upload to a server IceCream Apps and give a short direct link to it. Using IceCream Screen Recorder, you can record high-quality video with sound. It is possible to adjust the microphone volume and system sounds. The program keeps a history of all records. shortcut keys can be used to use the functions of the program. \r\n\r\nFeatures: \r\n&#x2022; Choose the area to create a video screenshot or right on the screen of your computer with a single click. \r\n&#x2022; Draw, tracing, show arrows or print text on the future of the screenshot or video directly while shooting. \r\n&#x2022; Quick access to all the recorded video from the screen or a screenshot. \r\n&#x2022; Adjust the microphone volume and system sounds. \r\n&#x2022; Save a screenshot to the clipboard to send on Skype or e-mail. \r\n&#x2022; You decide: whether to remove the mouse, turn off the screensaver there, whether to hide the icons on the desktop, etc. \r\n&#x2022; One-click to send a screenshot Icecream Apps server to receive and send short links to friends or partners. \r\n&#x2022; Use hot keys to control the video recording process with the screen and create screenshots","last_updated":"2017-08-25T12:04:47.615Z","parsed":{"xt":"urn:btih:c335c27719cd265083183c7140d5dc386c0a01d4","dn":"Icecream Screen Recorder Pro 4.94   Patch [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c335c27719cd265083183c7140d5dc386c0a01d4","infoHashBuffer":{"type":"Buffer","data":[195,53,194,119,25,205,38,80,131,24,60,113,64,213,220,56,108,10,1,212]},"name":"Icecream Screen Recorder Pro 4.94   Patch [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}