{"title":"The Room of White Fire by T Jefferson Parker ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:c390d9e10e7ef8dca3e7a35618a22ed1bed56bb8&dn=The+Room+of+White+Fire+by+T+Jefferson+Parker+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5509264","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Room of White Fire by T Jefferson Parker ePUB eBOOK-ZAK\r\n\r\nFor fans of Michael Connelly and CJ Box, a stirring thriller from New York Times best seller and award winner T. Jefferson Parker: The Room of White Fire is the tale of a private investigator tasked with hunting down a returned soldier broken and made dangerous by his experiences at war.\r\n\r\nA young soldier shattered by war, on the run from a mental institute.\r\n\r\nA PI carrying his own vicious wounds hired to track that soldier down.\r\n\r\nA race against the clock to bring the soldier home before he reveals the secret that haunts him.\r\n\r\nRoland Ford - once a cop, then a marine, now a private investigator - is good at finding people. But when he&apos;s asked to locate air force veteran Clay Hickman, he realizes he&apos;s been drawn into something deep and dark. He knows the weight of war, having served as a marine in First Fallujah; he also knows the nightmare of indescribable personal pain, as only two years have passed since his young wife&apos;s sudden death. What he doesn&apos;t know is why a shroud of secrecy hangs over the disappearance of Clay Hickman - and why he&apos;s getting a different story from everyone involved.\r\n\r\nTo begin with, there&apos;s the teenage woman who helped Clay escape: She&apos;s smart enough to fend off Ford&apos;s questions but impetuous enough to be on the run with an armed and dangerous man. Then there&apos;s Clay&apos;s attractive doctor, who clearly cares deeply for his welfare but is impossible to read, even as she inspires in Ford the first desire he has felt since his wife&apos;s death. And there&apos;s the proprietor of the mental institute who is as enigmatic as he is brash, and ambitious to the point of being ruthless; what could Clay possibly know to make this search so desperate?\r\n\r\nSoon, what began as just a job becomes a life-and-death obsession for Ford, pitting him against immensely powerful and treacherous people and forcing him to contend with chilling questions about truth, justice, and the American way.\r\n\r\nxx","last_updated":"2017-09-02T12:01:08.331Z","parsed":{"xt":"urn:btih:c390d9e10e7ef8dca3e7a35618a22ed1bed56bb8","dn":"The Room of White Fire by T Jefferson Parker ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c390d9e10e7ef8dca3e7a35618a22ed1bed56bb8","infoHashBuffer":{"type":"Buffer","data":[195,144,217,225,14,126,248,220,163,231,163,86,24,162,46,209,190,213,107,184]},"name":"The Room of White Fire by T Jefferson Parker ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}