{"title":"Aven Colony v0.1.18889","magnet":"magnet:?xt=urn:btih:c3c3194c55fad0759cd2c92106f5886e731be2b4&dn=Aven+Colony+v0.1.18889&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"7845967963","seeders":"3","leechers":"30","description":"Build a new home for humanity with Aven Colony.Discover Aven Prime - an alien planet of deserts, tundras, and jungles light years from earth. Aven Colony puts you in charge of humanity&apos;s first extrasolar settlement, where you build and expand your small colonies into massive, sprawling cities while dealing with the challenges faced when settling on a new world.Build your colony&apos;s infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity against the backdrop of the harsh and often dangerous realities of the exotic world of Aven Prime.KEY FEATURES:COLONIZE AN ALIEN WORLD: Build a new home for humanity on a world with a low-oxygen atmosphere, extreme electrical storms, shard storms, dust devils, deadly toxic gas eruptions from geothermal vents, and days so long they have their own seasons. Explore a variety of biomes, from the lush wetlands environment to the much less habitable desert and arctic.MEET THE LOCALS: Encounter a variety of alien life forms, including giant sandworms, deadly plague spores, and a vicious fungal infection known as &#x201C;The Creep.&#x201D;SUPERVISE YOUR COLONISTS: Settling a new world can be stressful. As a new Colony Governor, you&#x2019;ll need to work overtime to help your colonists deal with their new environment. Using the 12 distinct &quot;overlay&quot; modes, you can mange your colony&apos;s","last_updated":"2017-07-01T12:03:20.208Z","parsed":{"xt":"urn:btih:c3c3194c55fad0759cd2c92106f5886e731be2b4","dn":"Aven Colony v0.1.18889","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c3c3194c55fad0759cd2c92106f5886e731be2b4","infoHashBuffer":{"type":"Buffer","data":[195,195,25,76,85,250,208,117,156,210,201,33,6,245,136,110,115,27,226,180]},"name":"Aven Colony v0.1.18889","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}