{"title":"Evolution of the Brain Cog and Em in Vertebrates (2017)","magnet":"magnet:?xt=urn:btih:c4a1aa7ff58a5f23144106c9bff1fbb4db4dd1b1&dn=Evolution+of+the+Brain+Cog+and+Em+in+Vertebrates+%282017%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"propbay2","categoryP":"other","categoryS":"e_books","size":"9968122","seeders":"47","leechers":"6","description":"Evolution of the Brain, Cognition, and Emotion in Vertebrates (2017)\r\n\r\nThis book presents a new view on the evolution of the brain, cognition, and emotion. Around a half-century ago, Professor Harry Jerison published a seminal book entitled Evolution of the Brain and Intelligence. Since then, there has been a series of dramatic methodological and conceptual changes which have led to many new insights into the understanding of brain evolution and cognition.\r\nThis book is particularly focused on three significant aspects of such changes. First, taking advantage of a new integrated approach called evolutionary developmental biology or Evo/Devo, researchers have started to look into vertebrate brain evolution from the developmental perspective. Second, comparative neuroanatomists have accumulated a large amount of information about the brains of diverse animal groups to refute the old-fashioned idea that vertebrate brains evolved linearly from non-mammals to mammals. Third, comparative behavioral studies have demonstrated that sophisticated cognition and emotion are not unique to some primates but are also found in many non-primate and even non-mammalian species. This work will appeal to a wide readership in such fields as neuroscience, cognitive science, and behavioral science","last_updated":"2017-09-06T12:06:10.815Z","parsed":{"xt":"urn:btih:c4a1aa7ff58a5f23144106c9bff1fbb4db4dd1b1","dn":"Evolution of the Brain Cog and Em in Vertebrates (2017)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c4a1aa7ff58a5f23144106c9bff1fbb4db4dd1b1","infoHashBuffer":{"type":"Buffer","data":[196,161,170,127,245,138,95,35,20,65,6,201,191,241,251,180,219,77,209,177]},"name":"Evolution of the Brain Cog and Em in Vertebrates (2017)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}