{"title":"Catastrophic Care_ How American Health Care Killed My Father ...","magnet":"magnet:?xt=urn:btih:c5269d9fd60eef9d9015beb58cb899f3bef73f7e&dn=Catastrophic+Care_+How+American+Health+Care+Killed+My+Father+...&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4943968","seeders":"0","leechers":"0","description":"xx\r\n\r\nCatastrophic Care_ How American Health Care Killed My Father ... and How We Can Fix It by David Goldhill ePUB eBOOK-ZAK\r\n\r\nA visionary investigation that will change the way we think about health care: how and why it is failing, why expanding coverage will actually make things worse, and how our health care can be transformed into a transparent, affordable, successful system.\r\n\r\nIn 2007, David Goldhill&#x2019;s father died from infections acquired in a hospital - one of more than two hundred thousand avoidable deaths per year caused by medical error. The bill was enormous - and Medicare paid it. These circumstances left Goldhill angry and determined to understand how world-class technology and personnel could coexist with such carelessness - and how a business that failed so miserably could be paid in full. Catastrophic Care is the eye-opening result.\r\n\r\nBlending personal anecdotes and extensive research, Goldhill presents us with cogent, biting analysis that challenges the basic preconceptions that have shaped our thinking for decades. Contrasting the Island of health care with the Mainland of our economy, he demonstrates that high costs, excess medicine, terrible service, and medical error are the inevitable consequences of our insurance-based system. He explains why policy efforts to fix these problems have invariably produced perverse results, and how the new Affordable Care Act is more likely to deepen than to solve these issues.\r\n\r\nGoldhill steps outside the incremental and wonkish debates to question the conventional wisdom blinding us to more fundamental issues. He proposes a comprehensive new way, where the customer (the patient) is first - a system focused on health and maintaining it, a system strong and vibrant enough for our future.\r\n\r\nIf you think health care is interesting only to institutes and politicians, think again: Catastrophic Care is surprising, engaging, and brimming with insights born of questions nobody has thought to ask. Above all it is a book of new ideas that can transform the way we understand a subject we often take for granted.\r\n\r\nxx","last_updated":"2017-09-03T12:00:18.438Z","parsed":{"xt":"urn:btih:c5269d9fd60eef9d9015beb58cb899f3bef73f7e","dn":"Catastrophic Care_ How American Health Care Killed My Father ...","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c5269d9fd60eef9d9015beb58cb899f3bef73f7e","infoHashBuffer":{"type":"Buffer","data":[197,38,157,159,214,14,239,157,144,21,190,181,140,184,153,243,190,247,63,126]},"name":"Catastrophic Care_ How American Health Care Killed My Father ...","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}