{"title":"A History of the Modern Middle East: Rulers, Rebels and Rogues","magnet":"magnet:?xt=urn:btih:c543d05ab152bfac98930699abf7ad0c49fdcd37&dn=A+History+of+the+Modern+Middle+East%3A+Rulers%2C+Rebels+and+Rogues&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"10411011","seeders":"83","leechers":"10","description":"A History of the Modern Middle East: Rulers, Rebels, and Rogues - Betty S. Anderson [epub]\r\n\r\nA History of the Modern Middle East offers a comprehensive assessment of the region, stretching from the fourteenth century and the founding of the Ottoman and Safavid empires through to the present-day protests and upheavals.\r\n\r\nThe textbook focuses on Turkey, Iran, and the Arab countries of the Middle East, as well as areas often left out of Middle East history &#x2015; such as the Balkans and the changing roles that Western forces have played in the region for centuries &#x2015; to discuss the larger contexts and influences on the region&apos;s cultural and political development.\r\n\r\nEnriched by the perspectives of workers and professionals; urban merchants and provincial notables; slaves, students, women, and peasants, as well as political leaders, the book maps the complex social interrelationships and provides a pivotal understanding of the shifting shapes of governance and trajectories of social change in the Middle East.\r\n\r\nExtensively illustrated with drawings, photographs, and maps, this text skillfully integrates a diverse range of actors and influences to construct a narrative that is at once sophisticated and lucid. A History of the Modern Middle East highlights the region&apos;s complexity and variation, countering easy assumptions about the Middle East, those who governed, and those they governed&#x2015;the rulers, rebels, and rogues who shaped a region","last_updated":"2017-05-24T11:47:18.848Z","parsed":{"xt":"urn:btih:c543d05ab152bfac98930699abf7ad0c49fdcd37","dn":"A History of the Modern Middle East: Rulers, Rebels and Rogues","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c543d05ab152bfac98930699abf7ad0c49fdcd37","infoHashBuffer":{"type":"Buffer","data":[197,67,208,90,177,82,191,172,152,147,6,153,171,247,173,12,73,253,205,55]},"name":"A History of the Modern Middle East: Rulers, Rebels and Rogues","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}