{"title":"A History of the United States in Five Crashes by Scott Nations ","magnet":"magnet:?xt=urn:btih:c59015d4496b391aa0287cdf4d520f8470d27655&dn=A+History+of+the+United+States+in+Five+Crashes+by+Scott+Nations+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3077545","seeders":"0","leechers":"0","description":"xx\r\n\r\nA History of the United States in Five Crashes by Scott Nations ePUB eBOOK-ZAK\r\n\r\nIn this absorbing, smart, and accessible blend of economic and cultural history in the vein of the works of Michael Lewis and Andrew Ross Sorkin, a financial executive and CNBC contributor examines the five most significant stock market crashes in the United States over the past century, revealing how they have defined the nation today.\r\n\r\nThe Panic of 1907; Black Tuesday (1929); Black Monday (1987); the Great Recession (2008); the Flash Crash (2010): Each of these financial implosions that caused a catastrophic drop in the American stock market is a remarkable story in its own right. But taken together, they offer a unique financial history of the American century. In A History of the United States in Five Crashes, financial executive and CNBC contributor Scott Nations examines these precipitous dips, revealing how each played a role in America&apos;s political and cultural fabric, one building upon the next to create the nation we know today.\r\n\r\nScott Nations identifies the factors behind the disastrous runs on banks that led to the Panic of 1907, the first great scare of the 20th century. He explains why 1920s America adopted investment trusts - a practice that helped post-World War I Britain - and how they were a primary catalyst of the 1929 crash. He explores America&apos;s love affair with an expanding stock market in the 1980s - which spawned the birth of portfolio insurance that significantly contributed to the 1987 crash. And he examines the factors that led to the 2008 global meltdown and the rise of algorithmic trading, the modern financial technology that sparked the 2010 Flash Crash when American stocks lost a trillion dollars in minutes.\r\n\r\nA History of the United States in Five Crashes clearly and compellingly illustrates the connections between these financial collapses and examines the solid, clear-cut lessons they offer for preventing the next one.\r\n\r\nxx","last_updated":"2017-08-17T12:03:13.626Z","parsed":{"xt":"urn:btih:c59015d4496b391aa0287cdf4d520f8470d27655","dn":"A History of the United States in Five Crashes by Scott Nations ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c59015d4496b391aa0287cdf4d520f8470d27655","infoHashBuffer":{"type":"Buffer","data":[197,144,21,212,73,107,57,26,160,40,124,223,77,82,15,132,112,210,118,85]},"name":"A History of the United States in Five Crashes by Scott Nations ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}