{"title":"Everything Is Awful by Matt Bellassai EPUB","magnet":"magnet:?xt=urn:btih:c592ba36e334c6f2862d4a8d397d17d3a3b701be&dn=Everything+Is+Awful+by+Matt+Bellassai+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1174338","seeders":"11","leechers":"4","description":"xx\r\n\r\nEverything Is Awful by Matt Bellassai EPUB\r\n\r\nFrom the break-out star of BuzzFeed and the People&apos;s Choice Award-winning comedian behind the web series Whine About It and To Be Honest comes a collection of hilariously anguished essays chronicling awful moments from his life so far, the humiliations of being an adult, and other little indignities.\r\n\r\nMatt Bellassai has no idea what he&apos;s doing. Well, to be fair, he did become semi-Internet famous by getting drunk at work, making him a socially-acceptable - nay - professional alcoholic. He&apos;s got some things figured out. But the rest is all just a terrible, disgusting mess.\r\n\r\nThis is Matt&apos;s book. Just to clarify, though, it is absolutely not a memoir; Matt is far too young to have done anything worth remembering (though he did win an actual People&apos;s Choice Award for his BuzzFeed web series, Whine About It, which is pretty good, if you ask his mother). This is also most certainly not a book of advice; he is too woefully ill-prepared for life to offer anything in the way of counsel (though that won&apos;t stop him from talking). Call this a collection of awful moments that led to his grumbling, blundering adulthood - a chronicle of little indignities that, when taken together, amount to a life of hilarious anguish.\r\n\r\nWith keen wit and plenty of self-deprecation, Matt reveals how hard it is to shed his past as the Midwest&apos;s biggest nerd, that one time a taquito nearly murdered him at his brother&apos;s surprise birthday party, and the time he came out to his friends and family (the closet was a bit messy). Matt also wrestles with the humiliations of adulthood, like giving up on love in New York City, living alone with no one to heat his microwave dinners, and combating the inner voice that tells him to say aloud all the things the rest of us are smart enough to keep to ourselves.\r\n\r\nYou probably don&apos;t need this book, but, let&apos;s be honest - you do. Since you&apos;re already here, you might as well pull up a chair, grab your glass(es) of wine, and enjoy.\r\n\r\nxx","last_updated":"2017-12-01T12:02:45.350Z","parsed":{"xt":"urn:btih:c592ba36e334c6f2862d4a8d397d17d3a3b701be","dn":"Everything Is Awful by Matt Bellassai EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c592ba36e334c6f2862d4a8d397d17d3a3b701be","infoHashBuffer":{"type":"Buffer","data":[197,146,186,54,227,52,198,242,134,45,74,141,57,125,23,211,163,183,1,190]},"name":"Everything Is Awful by Matt Bellassai EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}