{"title":"Chris Forhan - My Father Before Me 2016 RETAiL ePUB eBOOK-DiSTRi","magnet":"magnet:?xt=urn:btih:c5b879bd4f0c1d5a1394f092fe9d6f1a25a6424d&dn=Chris+Forhan+-+My+Father+Before+Me+2016+RETAiL+ePUB+eBOOK-DiSTRi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6499995","seeders":"25","leechers":"1","description":"Chris Forhan - My Father Before Me 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn award-winning poet offers a multigenerational portrait of an American family - weaving together the lives of his ancestors and his parents and his own coming of age in the &apos;60s and &apos;70s in the wake of his father&apos;s suicide - in this superbly written, &quot;fiercely honest&quot; (Nick Flynn) memoir.\r\n\r\nThe fifth of eight children, Chris Forhan was born into a family of silence. He and his siblings learned, without being told, that certain thoughts and feelings were not to be shared. On the evenings his father didn&apos;t come home, the rest of the family would eat dinner without him, his whereabouts unknown, his absence pronounced but not mentioned. And on a cold night in 1973, just before Christmas, Forhan&apos;s father killed himself in the carport.\r\n\r\nForty years later Forhan &quot;bravely considers the way he is and is not his father&apos;s son&quot; (Larry Watson), digging into his family&apos;s past and finding within each generation the same abandonment, loss, and silence in which he was raised. Like Ian Frazier in Family or Frank McCourt in Angela&apos;s Ashes, Forhan shows his family members as both parts and products of their times. My Father Before Me is a family history, an investigation into a death, and a stirring portrait of an Irish Catholic childhood, all set against a backdrop of America from the Great Depression to the Ramones.\r\n\r\nMarrying the literary scope of memoirists Geoffrey Wolff and J. R. Moehringer with the intensity of family novels like The Corrections and We Are Not Ourselves, My Father Before Me is the kind of epic, immersive memoir that comes along once in a decade","last_updated":"2017-05-23T19:04:37.640Z","parsed":{"xt":"urn:btih:c5b879bd4f0c1d5a1394f092fe9d6f1a25a6424d","dn":"Chris Forhan - My Father Before Me 2016 RETAiL ePUB eBOOK-DiSTRi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c5b879bd4f0c1d5a1394f092fe9d6f1a25a6424d","infoHashBuffer":{"type":"Buffer","data":[197,184,121,189,79,12,29,90,19,148,240,146,254,157,111,26,37,166,66,77]},"name":"Chris Forhan - My Father Before Me 2016 RETAiL ePUB eBOOK-DiSTRi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}