{"title":"Ken Follett - A Column of Fire [eBook]","magnet":"magnet:?xt=urn:btih:c5e740f4e4c06ceb9e4c94711f9b0e046ab9ef5c&dn=Ken+Follett+-+A+Column+of+Fire+%5BeBook%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wobbleXXX","categoryP":"other","categoryS":"e_books","size":"2818054","seeders":"0","leechers":"0","description":"SYNOPSIS\r\nThe saga that has enthralled the millions of readers of The Pillars of the Earth and World Without End now continues with Ken Follett&apos;s magnificent, gripping A Column of Fire.\r\n\r\nChristmas 1558, and young Ned Willard returns home to Kingsbridge to find his world has changed.\r\n\r\nThe ancient stones of Kingsbridge Cathedral look down on a city torn by religious hatred. Europe is in turmoil as high principles clash bloodily with friendship, loyalty and love, and Ned soon finds himself on the opposite side from the girl he longs to marry, Margery Fitzgerald.\r\n\r\nThen Elizabeth Tudor becomes queen and all of Europe turns against England. The shrewd, determined young monarch sets up the country&#x2019;s first secret service to give her early warning of assassination plots, rebellions and invasion plans.\r\n\r\nElizabeth knows that alluring, headstrong Mary Queen of Scots lies in wait in Paris. Part of a brutally ambitious French family, Mary has been proclaimed the rightful ruler of England, with her own supporters scheming to get rid of the new queen.\r\n\r\nOver a turbulent half-century, the love between Ned and Margery seems doomed, as extremism sparks violence from Edinburgh to Geneva. With Elizabeth clinging precariously to her throne and her principles, protected by a small, dedicated group of resourceful spies and courageous secret agents, it becomes clear that the real enemies &#x2013; then as now &#x2013; are not the rival religions.\r\n\r\nThe true battle pitches those who believe in tolerance and compromise against the tyrants who would impose their ideas on everyone else &#x2013; no matter the cost","last_updated":"2017-12-13T12:01:16.816Z","parsed":{"xt":"urn:btih:c5e740f4e4c06ceb9e4c94711f9b0e046ab9ef5c","dn":"Ken Follett - A Column of Fire [eBook]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c5e740f4e4c06ceb9e4c94711f9b0e046ab9ef5c","infoHashBuffer":{"type":"Buffer","data":[197,231,64,244,228,192,108,235,158,76,148,113,31,155,14,4,106,185,239,92]},"name":"Ken Follett - A Column of Fire [eBook]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}