{"title":"\nThe Rosetta Stone and the Rebirth of Ancient Egypt","magnet":"magnet:?xt=urn:btih:c60f8bdea95d4bac156cf67bfb912f1870f62e46&dn=The+Rosetta+Stone+and+the+Rebirth+of+Ancient+Egypt&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"4610488","seeders":"39","leechers":"9","description":"The Rosetta Stone and the Rebirth of Ancient Egypt - John Ray [epub]\r\n\r\nThe Rosetta Stone is one of the world&apos;s great wonders, attracting awed pilgrims by the tens of thousands each year. This book tells the Stone&apos;s story, from its discovery by Napoleon&apos;s expedition to Egypt to its current--and controversial-- status as the single most visited object on display in the British Museum.\r\n\r\nA pharaoh&apos;s forgotten decree, cut in granite in three scripts--Egyptian hieroglyphs, Egyptian demotic, and ancient Greek--the Rosetta Stone promised to unlock the door to the language of ancient Egypt and its 3,000 years of civilization, if only it could be deciphered.\r\n\r\nCapturing the drama of the race to decode this key to the ancient past, John Ray traces the paths pursued by the British polymath Thomas Young and Jean-Francois Champollion, the &quot;father of Egyptology&quot; ultimately credited with deciphering Egyptian hieroglyphs. He shows how Champollion &quot;broke the code&quot; and explains more generally how such deciphering is done, as well as its critical role in the history of Egyptology. Concluding with a chapter on the political and cultural controversy surrounding the Stone, the book also includes an appendix with a full translation of the Stone&apos;s text.\r\n\r\nRich in anecdote and curious lore, The Rosetta Stone and the Rebirth of Ancient Egypt is a brilliant and frequently amusing guide to one of history&apos;s great mysteries and marvels.\r\n\r\nPaperback: 208 pages\r\nPublisher: Harvard University Press (April 2, 2012)","last_updated":"2017-10-07T12:05:11.166Z","parsed":{"xt":"urn:btih:c60f8bdea95d4bac156cf67bfb912f1870f62e46","dn":"The Rosetta Stone and the Rebirth of Ancient Egypt","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c60f8bdea95d4bac156cf67bfb912f1870f62e46","infoHashBuffer":{"type":"Buffer","data":[198,15,139,222,169,93,75,172,21,108,246,123,251,145,47,24,112,246,46,70]},"name":"The Rosetta Stone and the Rebirth of Ancient Egypt","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}