{"title":"The Crisis of Islam_ Holy War and Unholy Terror by Bernard Lewis","magnet":"magnet:?xt=urn:btih:c68b83e634632f2127a895e0793c263668a41b84&dn=The+Crisis+of+Islam_+Holy+War+and+Unholy+Terror+by+Bernard+Lewis&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3933626","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Crisis of Islam_ Holy War and Unholy Terror by Bernard Lewis ePUB eBOOK-ZAK\r\n\r\nBernard Lewis examines the historical roots of the frustrations and resentments that dominate the Islamic world today and that are increasingly being expressed in acts of terrorism. He looks at the theological origins of political Islam and tells us what the Islamic doctrine of jihad has meant at different times in history. And he takes us, as only he can, through the rise of militant Islam in Iran, Egypt, and Saudi Arabia, examining the impact of radical Wahabi proselytizing and Saudi oil money on the rest of the Islamic world.\r\n\r\nCrisis of Islam ranges widely through 13 centuries of history, but in particular it charts the key events of the 20th century leading up to the bitter and violent confrontations of today. The Second World War, the creation of the state of Israel, the Cold War, the Iranian Revolution, the Soviet defeat in Afghanistan, the Gulf War, and the September 11th attacks on the United States have all shaped Muslim perceptions in important ways.\r\n\r\nWhile hostility toward the West has a long and varied history in the lands of Islam, its current concentration on America is new. So too is the cult of the suicide bomber. Bernard Lewis helps us understand the reasons for the increasingly dogmatic rejection of modernity by many in the Muslim world in favor of a return to a sacred past. Based on his George Polk Award-winning article for The New Yorker, The Crisis of Islam is essential reading for anyone who wants to know what Osama bin Ladin represents and why his murderous message resonates so widely in the Islamic world.\r\n\r\nxx","last_updated":"2017-09-05T12:00:28.657Z","parsed":{"xt":"urn:btih:c68b83e634632f2127a895e0793c263668a41b84","dn":"The Crisis of Islam_ Holy War and Unholy Terror by Bernard Lewis","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c68b83e634632f2127a895e0793c263668a41b84","infoHashBuffer":{"type":"Buffer","data":[198,139,131,230,52,99,47,33,39,168,149,224,121,60,38,54,104,164,27,132]},"name":"The Crisis of Islam_ Holy War and Unholy Terror by Bernard Lewis","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}