{"title":"\nThanks, Obama_ My Hopey Changey White House Years by David Litt ","magnet":"magnet:?xt=urn:btih:c7a50b320c6da3c2c075b36a0c1d8e51531f5084&dn=Thanks%2C+Obama_+My+Hopey+Changey+White+House+Years+by+David+Litt+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3216765","seeders":"24","leechers":"13","description":"xx\r\n\r\nThanks, Obama_ My Hopey Changey White House Years by David Litt ePUB eBOOK-ZAK\r\n\r\nRemember when presidents spoke in complete sentences instead of in unhinged tweets? David Litt does. In his comic coming-of-age memoir, he takes us back to the Obama years - and charts a path forward in the age of Trump.\r\n\r\nMore than any other presidency, Barack Obama&apos;s eight years in the White House were defined by young people - 20-somethings who didn&apos;t have much experience in politics (or anything else, for that matter) yet suddenly found themselves in the most high-stakes office building on earth. David Litt was one of those 20-somethings. After graduating from college in 2008, he went straight to the Obama campaign. In 2011 he became one of the youngest White House speechwriters in history. Until leaving the White House in 2016, he wrote on topics from health care to climate change to criminal justice reform. As President Obama&apos;s go-to comedy writer, he also took the lead on the White House Correspondents&apos; Dinner, the so-called &quot;State of the Union of jokes&quot;.\r\n\r\nNow, in this refreshingly honest memoir, Litt brings us inside Obamaworld. With a humorist&apos;s eye for detail, he describes what it&apos;s like to accidentally trigger an international incident or nearly set a president&apos;s hair aflame. He answers questions you never knew you had: Which White House men&apos;s room is the classiest? What do you do when the commander in chief gets your name wrong? Where should you never, under any circumstances, change clothes on Air Force One? With nearly a decade of stories to tell, Litt makes clear that politics is completely, hopelessly absurd.\r\n\r\nBut it&apos;s also important. For all the moments of chaos, frustration, and, yes, disillusionment, Litt remains a believer in the words that first drew him to the Obama campaign: &quot;People who love this country can change it&quot;. In telling his own story, Litt sheds fresh light on his former boss&apos; legacy. And he argues that, despite the current political climate, the politics championed by Barack Obama will outlive the presidency of Donald Trump.\r\n\r\nxx","last_updated":"2017-09-26T12:06:56.490Z","parsed":{"xt":"urn:btih:c7a50b320c6da3c2c075b36a0c1d8e51531f5084","dn":"Thanks, Obama_ My Hopey Changey White House Years by David Litt ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c7a50b320c6da3c2c075b36a0c1d8e51531f5084","infoHashBuffer":{"type":"Buffer","data":[199,165,11,50,12,109,163,194,192,117,179,106,12,29,142,81,83,31,80,132]},"name":"Thanks, Obama_ My Hopey Changey White House Years by David Litt ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}