{"title":"Jane Austen the Secret Radical by Helena Kelly 2017 RETAiL ePUB ","magnet":"magnet:?xt=urn:btih:c7d585d4ebb8798794d81284b1e17e88eab28bfa&dn=Jane+Austen+the+Secret+Radical+by+Helena+Kelly+2017+RETAiL+ePUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10274470","seeders":"0","leechers":"0","description":"xx\r\n\r\nJane Austen the Secret Radical by Helena Kelly 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA brilliant, illuminating reassessment of the life and work of Jane Austen that makes clear how Austen has been misread for the past two centuries and that shows us how she intended her books to be read, revealing as well how subversive and daring - how truly radical - a writer she was.\r\n\r\nIn this fascinating, revelatory work, Helena Kelly - dazzling Jane Austen authority - looks past the grand houses, the pretty young women, past the demure drawing room dramas and witty commentary on the narrow social worlds of her time that became the hallmark of Austen&apos;s work to bring to light the serious, ambitious, deeply subversive nature of this beloved writer. Kelly illuminates the radical subjects - slavery, poverty, feminism, the church, evolution among them - considered treasonous at the time, that Austen deftly explored in the six novels that have come to embody an age. The author reveals just how in the novels we find the real Jane Austen: a clever, clear-sighted woman &quot;of information&quot;, fully aware of what was going on in the world and sure about what she thought of it. We see a writer who understood that the novel - until then seen as mindless &quot;trash&quot; - could be a great art form and who, perhaps more than any other writer up to that time, imbued it with its particular greatness.\r\n\r\nxx","last_updated":"2017-08-25T12:00:28.949Z","parsed":{"xt":"urn:btih:c7d585d4ebb8798794d81284b1e17e88eab28bfa","dn":"Jane Austen the Secret Radical by Helena Kelly 2017 RETAiL ePUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c7d585d4ebb8798794d81284b1e17e88eab28bfa","infoHashBuffer":{"type":"Buffer","data":[199,213,133,212,235,184,121,135,148,216,18,132,177,225,126,136,234,178,139,250]},"name":"Jane Austen the Secret Radical by Helena Kelly 2017 RETAiL ePUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}