{"title":"Never Call Me a Hero_ A Legendary American Dive-Bomber Pilot Rem","magnet":"magnet:?xt=urn:btih:c80f4eab0179ad18ac1690bfd4997e4d606cc04f&dn=Never+Call+Me+a+Hero_+A+Legendary+American+Dive-Bomber+Pilot+Rem&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7206332","seeders":"0","leechers":"0","description":"xx\r\n\r\nNever Call Me a Hero_ A Legendary American Dive-Bomber Pilot Remembers the Battle of Midway by N Jack Dusty Kleiss ePUB eBOOK-ZAK\r\n\r\nAn extraordinary firsthand account of the Battle of Midway by one of its key participants, timed to the 75th anniversary: American dive-bomber pilot &quot;Dusty&quot; Kleiss helped sink three Japanese warships (including two aircraft carriers), received the Navy Cross, and is credited with playing a decisive individual role in determining the outcome of a battle that is considered a turning point in World War II.\r\n\r\nIn Never Call Me a Hero, Captain Kleiss (USN, ret.), a US Navy SBD Dauntless dive-bomber pilot with the USS Enterprise&apos;s Scouting Squadron Six, tells his full story for the first time, offering an unprecedentedly intimate look at the battle that reversed America&apos;s fortunes after the tragedy of Pearl Harbor. Kleiss is notable for being the only pilot from either fleet on those battle-scarred days of legend, June 4-7, 1942, to land hits on three different enemy ships. On the first day of the Battle of Midway, Kleiss planted bombs on two Japanese carriers - Kaga and Hiryu - sinking both, and later, on June 6, he scored a direct hit on a Japanese cruiser, the Mikuma, which also sank.\r\n\r\nIn his 1967 book Incredible Victory, Walter Lord asserted that the margins of US victory at Midway were so thin that individual participants could rightfully say that their actions turned the tide. Given the amount of destruction inflicted upon the Japanese that day, Kleiss may have been the most important pilot in the air. It is no stretch to say that without him, the Battle of Midway may not have been won, altering the course of the conflict and history itself, for according the US Navy&apos;s historians, &quot;The Battle of Midway was far more than an epic WWII clash somewhere far away at sea. It was an American victory that forever changed the course of world history. This is the battle that turned the tide of the war.&quot;\r\n\r\nBut this is not only the memoir of one man; it is the history of this battle and its legacy. In only five minutes, 48 American dive-bomber pilots and their gunners destroyed the pride of the Japanese carrier fleet and exacted retribution on the carrier force that had attacked Pearl Harbor. Never Call Me a Hero is also a story about humility and pushing limits. Throughout his life Kleiss had always looked toward the heavens for spiritual guidance and to serve his country. Throughout his life this humble man considered himself blessed with incredible luck and did his job without complaint. Whenever others referred to his actions as &quot;heroic&quot;, he quickly corrected them: &quot;I&apos;m no hero. Never call me a hero.&quot;\r\n\r\nxx","last_updated":"2017-09-02T12:00:23.964Z","parsed":{"xt":"urn:btih:c80f4eab0179ad18ac1690bfd4997e4d606cc04f","dn":"Never Call Me a Hero_ A Legendary American Dive-Bomber Pilot Rem","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c80f4eab0179ad18ac1690bfd4997e4d606cc04f","infoHashBuffer":{"type":"Buffer","data":[200,15,78,171,1,121,173,24,172,22,144,191,212,153,126,77,96,108,192,79]},"name":"Never Call Me a Hero_ A Legendary American Dive-Bomber Pilot Rem","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}