{"title":"\nThe Aztecs_ A Very Short Introduction by David Carrasco ePUB eBO","magnet":"magnet:?xt=urn:btih:c842159d0b271fb0a476fe9bb8eb88bb69a4c8b8&dn=The+Aztecs_+A+Very+Short+Introduction+by+David+Carrasco+ePUB+eBO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5286941","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Aztecs_ A Very Short Introduction by David Carrasco ePUB eBOOK-ZAK\r\n\r\nThis Very Short Introduction employs the disciplines of history, religious studies, and anthropology as it illuminates the complexities of Aztec life. Readers meet a people highly skilled in sculpture, astronomy, city planning, poetry, and philosophy, who were also profoundly committed to cosmic regeneration through the thrust of the ceremonial knife and through warfare. Dav&#xED;d Carrasco looks beyond Spanish accounts that have colored much of the Western narrative to let Aztec voices speak about their origin stories, the cosmic significance of their capital city, their methods of child rearing, and the contributions women made to daily life and the empire.\r\n\r\nCarrasco discusses the arrival of the Spaniards, contrasts Aztec mythical traditions about the origins of their city with actual urban life in Mesoamerica, and outlines the rise of the Aztec empire. He also explores Aztec religion, which provided both justification for and alternatives to warfare, sacrifice, and imperialism, and he sheds light on Aztec poetry, philosophy, painting, and especially monumental sculpture and architecture. He concludes by looking at how the Aztecs have been portrayed in Western thought, art, film, and literature as well as in Latino culture and arts.\r\n\r\nxx","last_updated":"2017-09-22T12:00:51.813Z","parsed":{"xt":"urn:btih:c842159d0b271fb0a476fe9bb8eb88bb69a4c8b8","dn":"The Aztecs_ A Very Short Introduction by David Carrasco ePUB eBO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c842159d0b271fb0a476fe9bb8eb88bb69a4c8b8","infoHashBuffer":{"type":"Buffer","data":[200,66,21,157,11,39,31,176,164,118,254,155,184,235,136,187,105,164,200,184]},"name":"The Aztecs_ A Very Short Introduction by David Carrasco ePUB eBO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}