{"title":"Digital Cop A Digital Cop's Guide to Cyber Security (gnv64)","magnet":"magnet:?xt=urn:btih:c95cade35ee996d9961021fd9f8a5ebdffcef0d7&dn=Digital+Cop+A+Digital+Cop%27s+Guide+to+Cyber+Security+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"24017679","seeders":"128","leechers":"12","description":"Digital Cop: A Digital Cop&apos;s Guide to Cyber Security\r\nby Arun Soni, Sahil Baghla\r\nNotion Press | March 2017 | ISBN: 978-93-5206-128-0 | ePUB/MOBI | 14.4/7.75 mb\r\n\r\nAuthors who are ardent techies, share their innate wisdom on protecting yourself and your family from certain vices of technology. They also show us how to make the most of it! With just a little help from our trusty computers and smart phones, the duo educate us on a variety of practical applications and online safeguards to help us get the best out of technology and not get beat down by it.\r\n\r\nCONTENTS\r\n1. The benefits of purchasing an antivirus software   \r\n2. Scanning a file with multiple genuine antivirus software free of cost   \r\n3. Find out what other people are doing on your computer in your absence  \r\n4. Storing and accessing your data anywhere and at anytime without requiring physical storage media devices like pen drives or CDs/DVDs  \r\n5. How to send a self-destructing email  \r\n6. How to escape from a situation by using your smartphone smartly  \r\n7. How to detect a hidden spy camera around you \r\n8. Securing your family by tracking them using GPS  \r\n9. How to recover data from a formatted pen drive/hard disk   \r\n10. How to permanently delete data so that it is not recoverable  \r\n11. Protecting your child from pornographic and non-family friendly websites  \r\n12. Internet time machine to view old web pages  \r\n13. How to genuinely earn money online   \r\n14. How to block annoying Ads on a webpage   \r\n15. OMG! Do you know what Google records about you and what you have searched for in the past?   \r\n16. How to stop Google recording your search history\r\n17. How to use your saved bookmarks on the Chrome browser on your other PC   \r\n18. How to know if a website you are visiting is safe or not   \r\n19. How to know your internet identity: The Public IP Address   \r\n20. How to track the source location of any email   \r\n21. How to know that the recipient has read your email   \r\n22. How to know if anybody is reading your confidential emails   \r\n23. How to make your email hack proof with your mobile phone  \r\n24. How to make youraccount hack proof by your mobile phone  \r\n25. Reporting tofor violations like fake accounts, abusive comments and spam   \r\n26. How to block particular websites on a computer   \r\n27. How to secure your website from being hacked      \r\n28. How to secure your Wi-Fi network at home and at the office    \r\n29. Do you want to trace your lost or stolen smartphone/laptop?    \r\n30. How to make your Android smartphone hack proof for using on any public Wi-Fi connection    \r\n31. Securing ATM banking transactions    \r\n32. Protecting you from online credit or debit card(s) hacking\r\n33. Final tips to secure your virtual life to be a Digital Cop\r\n34. Best security apps which every woman should install in her smartphone   \r\n35. Reporting a Cyber Crime by contacting the Internet Police or Cyber Crime cell\r\n <a href=\"\nhttps://s9.postimg.org/57515ggr3/Digital_Cop_-_A_Digital_Cop_s_Guide_to_Cyber_Security.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s9.postimg.org/57515ggr3/Digital_Cop_-_A_Digital_Cop_s_Guide_to_Cyber_Security.jpg</a>","last_updated":"2017-12-25T12:03:47.874Z","parsed":{"xt":"urn:btih:c95cade35ee996d9961021fd9f8a5ebdffcef0d7","dn":"Digital Cop A Digital Cop's Guide to Cyber Security (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"c95cade35ee996d9961021fd9f8a5ebdffcef0d7","infoHashBuffer":{"type":"Buffer","data":[201,92,173,227,94,233,150,217,150,16,33,253,159,138,94,189,255,206,240,215]},"name":"Digital Cop A Digital Cop's Guide to Cyber Security (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}