{"title":"Art Of Atari","magnet":"magnet:?xt=urn:btih:ca99919a1116dc85fe76af8c275ee4a50b01103e&dn=Art+Of+Atari&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"kbgcuba","categoryP":"other","categoryS":"e_books","size":"953086162","seeders":"0","leechers":"0","description":"DOWNLOADED FROM:\r\n\r\n\r\n\r\nw w w . K B G C U B A . W O R D P R E S S . c o m\r\n\r\n\r\n\r\n\r\nThis website is where i keep my personal collection of Official Strategy Guides and Artbooks.\r\n\r\n\r\n\r\n\r\nEnjoy.\r\nATARI is one of the most recognized names in the world. Since its formation in 1972, the company pioneered hundreds of iconic titles including Asteroids, Centipede and Missile Command. In addition to hundreds of games created for arcades, home video systems, and computers, original artwork was specially commissioned to enhance the Atari experience, further enticing children and adults to embrace and enjoy the new era of electronic entertainment. ART OF ATARI is the first official collection of such artwork. Sourced from museums and private collections worldwide, this book spans over 40 years of the company&apos;s unique illustrations used in packaging, advertisements, catalogs, and more! ART OF ATARI includes behind-the-scenes details on how dozens of games featured within were conceived of, illustrated, approved (or rejected), and brought to life. Whether you&apos;re a fan, collector, enthusiast, or new to the world of video games, this book offers the most complete collection of ATARI artwork ever produced! Includes a special Foreword by New York Times bestseller Ernest Cline, author of Armada and Ready Player One, soon to be a motion picture directed by Steven Spielberg: &quot;For me, revisiting the beautiful artwork presented in this book is almost as good as taking a trip in Doc Brown&apos;s time machine back to that halcyon era at the dawn of the digital age. But be warned, viewing these images may leave you with an overwhelming desire to revisit the ancient pixelated battlefields they each depict as well.&quot; -- from the Foreword by Ernest Cline. &quot;Having worked in the entertainment field as a consultant in Pop Culture, I have seen with my own eyes the destruction of original assets in favor of digital conversions to save corporations time and money on long-term storage. Therefore, I naturally assumed the original Atari artwork fell prey to similar disposal or theft or had simply been forgotten about all together. Thanks to ART OF ATARI, not any more!&quot; -- from the Afterword by Robert V. Conte","last_updated":"2017-07-31T12:02:29.027Z","parsed":{"xt":"urn:btih:ca99919a1116dc85fe76af8c275ee4a50b01103e","dn":"Art Of Atari","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ca99919a1116dc85fe76af8c275ee4a50b01103e","infoHashBuffer":{"type":"Buffer","data":[202,153,145,154,17,22,220,133,254,118,175,140,39,94,228,165,11,1,16,62]},"name":"Art Of Atari","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}