{"title":"Death in the City of Light by David King EPUB","magnet":"magnet:?xt=urn:btih:caceb9bec543edf1e6ed4d3b11a7bdac52b6fb1a&dn=Death+in+the+City+of+Light+by+David+King+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5874509","seeders":"0","leechers":"0","description":"xx\r\n\r\nDeath in the City of Light by David King EPUB\r\n\r\nDeath in the City of Light is the gripping, true story of a brutal serial killer who unleashed his own reign of terror in Nazi-Occupied Paris. As decapitated heads and dismembered body parts surfaced in the Seine, Commissaire Georges-Victor Massu, head of the Brigade Criminelle, was tasked with tracking down the elusive murderer in a twilight world of Gestapo, gangsters, resistance fighters, pimps, prostitutes, spies, and other shadowy figures of the Parisian underworld.\r\n\r\nThe main suspect was Dr. Marcel Petiot, a handsome, charming physician with remarkable charisma. He was the &#x201C;People&#x2019;s Doctor,&#x201D; known for his many acts of kindness and generosity, not least in providing free medical care for the poor. Petiot, however, would soon be charged with twenty-seven murders, though authorities suspected the total was considerably higher, perhaps even as many as 150.\r\n\r\nWho was being slaughtered, and why? Was Petiot a sexual sadist, as the press suggested, killing for thrills? Was he allied with the Gestapo, or, on the contrary, the French Resistance? Or did he work for no one other than himself? Trying to solve the many mysteries of the case, Massu would unravel a plot of unspeakable deviousness. When Petiot was finally arrested, the French police hoped for answers.\r\n\r\nBut the trial soon became a circus. Attempting to try all twenty-seven cases at once, the prosecution stumbled in its marathon cross-examinations, and Petiot, enjoying the spotlight, responded with astonishing ease. His attorney, Ren&#xE9; Floriot, a rising star in the world of criminal defense, also effectively, if aggressively, countered the charges. Soon, despite a team of prosecuting attorneys, dozens of witnesses, and over one ton of evidence, Petiot&#x2019;s brilliance and wit threatened to win the day.\r\n\r\nDrawing extensively on many new sources, including the massive, classified French police file on Dr. Petiot, Death in the City of Light is a brilliant evocation of Nazi-Occupied Paris and a harrowing exploration of murder, betrayal, and evil of staggering proportions.\r\n\r\nxx","last_updated":"2017-10-24T12:03:34.778Z","parsed":{"xt":"urn:btih:caceb9bec543edf1e6ed4d3b11a7bdac52b6fb1a","dn":"Death in the City of Light by David King EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"caceb9bec543edf1e6ed4d3b11a7bdac52b6fb1a","infoHashBuffer":{"type":"Buffer","data":[202,206,185,190,197,67,237,241,230,237,77,59,17,167,189,172,82,182,251,26]},"name":"Death in the City of Light by David King EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}