{"title":"Supra A feast of Georgian cooking(2017) - EPUB - zeke23","magnet":"magnet:?xt=urn:btih:cb141b616182702872bc990e6728db737e53d037&dn=Supra+A+feast+of+Georgian+cooking%282017%29+-+EPUB+-+zeke23&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"6753571","seeders":"2","leechers":"1","description":"\nSupra A feast of Georgian cooking(2017) - EPUB - zeke23\r\nEnglish | ISBN: 1911216163 | 2017 | EPUB | 208 Pages | 6,5 MB\r\nBordered by Russia, Turkey, Azerbaijan and Armenia, and situated at a crossroads on an ancient East-West trading route, Georgia&apos;s rich and diverse history is nowhere more evident than through its cuisine and legendary hospitality. Central and unique to the culinary tradition of Georgia is the &apos;supra&apos;, a coming together of family and friends to share heart-warming toasts, great conversation, free-flowing drink and, most importantly, dish upon dish of mouth-watering food. In this, her first book, Tiko Tuskadze, chef-owner of London&apos;s celebrated Little Georgia restaurant, opens her kitchen to share her love for the food of her home country and the recipes and stories that have been passed down through her family for generations. The book opens with an introduction to the delicious, yet little-known, food of Georgia and an exploration and explanation of the traditions and cultural significance of the supra. Tiko shares over 100 of the dishes that come together to make Georgian cuisine a true celebration of its country&apos;s unique climate, history and culture. Recipes follow the authentic procession of dishes, starting with pates and sauces then salads, which are traditionally laid out on the table before guests arrive; moving on to sections on soups, bread and cheese, meat dishes, poultry dishes, fish dishes, vegetable dishes and ending with a few fruity treats. The recipes range from the iconic Khachapuri (cheese bread), Kebabi (lamb kebabs) and Khinkali (dumplings), to lesser-known classics, such as Ajapsandali (aubergine stew) and Ckmeruli (poussin in garlic and walnut sauce). With wonderful stories and beautiful illustrations throughout, this book is the ultimate resource for anyone interested in discovering this unique and varied cuisine with the dual values of family and celebration firmly at its heart","last_updated":"2017-07-18T12:01:26.578Z","parsed":{"xt":"urn:btih:cb141b616182702872bc990e6728db737e53d037","dn":"Supra A feast of Georgian cooking(2017) - EPUB - zeke23","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cb141b616182702872bc990e6728db737e53d037","infoHashBuffer":{"type":"Buffer","data":[203,20,27,97,97,130,112,40,114,188,153,14,103,40,219,115,126,83,208,55]},"name":"Supra A feast of Georgian cooking(2017) - EPUB - zeke23","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}