{"title":"Shadow Warrior 2: Deluxe Edition (2016) PC | RePack by xatab","magnet":"magnet:?xt=urn:btih:cb4ed86bb97694918abd81b293afeab86432596e&dn=Shadow+Warrior+2%3A+Deluxe+Edition+%282016%29+PC+%7C+RePack+by+xatab&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"friephtua","categoryP":"games","categoryS":"pc","size":"11394859008","seeders":"2","leechers":"4","description":"About This Game\r\nShadow Warrior 2 is the stunning evolution of Flying Wild Hog&#x2019;s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world. Battle alongside allies online in four-player co-op or go it alone in spectacular procedurally-generated landscapes to complete daring missions and collect powerful new weapons, armor, and arcane relics of legend.\r\nSTORY\r\nFive years have passed since Lo Wang shattered the alliance between his deceitful former boss and the ancient gods of the shadow realm. Despite noble intentions, Lo Wang&#x2019;s efforts to annihilate the darkness corrupted the world, creating a strange and savage new order where humans and demons live side by side.\r\nThe once feared warrior now lives in the shifting wildlands outside the reach of his enemies and the neon glow of Zilla&#x2019;s cybernetic metropolis, scratching out a meager existence as a hired sword for the local Yakuza clans. When a simple mission goes wrong, Lo Wang is drawn into a volatile conflict between a brilliant young scientist, his nemesis Orochi Zilla, and the demonic forces that have become unsettled in our world. The sharp-tongued hero must once again wield lethal blades, staggering firepower, and archaic magic to purge the world of evil.\r\n\r\nInstallation notes:\r\n-Burn\r\n-Install\r\n-Play","last_updated":"2017-11-22T12:01:42.583Z","parsed":{"xt":"urn:btih:cb4ed86bb97694918abd81b293afeab86432596e","dn":"Shadow Warrior 2: Deluxe Edition (2016) PC | RePack by xatab","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cb4ed86bb97694918abd81b293afeab86432596e","infoHashBuffer":{"type":"Buffer","data":[203,78,216,107,185,118,148,145,138,189,129,178,147,175,234,184,100,50,89,110]},"name":"Shadow Warrior 2: Deluxe Edition (2016) PC | RePack by xatab","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}