{"title":"Comprehensive Medicinal Chemistry [II,III]","magnet":"magnet:?xt=urn:btih:cbb99ff3c7b2d74fcbd08822a9e0e374c08a506c&dn=Comprehensive+Medicinal+Chemistry+%5BII%2CIII%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"249475411","seeders":"37","leechers":"11","description":"Description\r\nComprehensive Medicinal Chemistry III, Third Edition provides a contemporary and forward looking critical analysis and summary of recent developments, emerging trends, and recently identified new areas where medicinal chemistry is having an impact. The discipline of medicinal chemistry continues to evolve as it adapts to new opportunities and strives to solve new challenges. These include drug targeting, biomolecular therapeutics, development of chemical biology tools, data collection and analysis, in silico models as predictors for biological properties, identification and validation of new targets, approaches to quantify target engagement, new methods for synthesis of drug candidates such as green chemistry, development of novel scaffolds for drug discovery, and the role of regulatory agencies in drug discovery.\r\n\r\nKey Features\r\nReviews the strategies, technologies, principles, and applications of modern medicinal chemistry\r\nProvides a global and current perspective of today&apos;s drug discovery process and discusses the major therapeutic classes and targets\r\nIncludes a unique collection of case studies and personal assays reviewing the discovery and development of key drugs\r\nReadership\r\nGraduate and postgraduate drug discovery scientists in research organizations engaged in the discipline, primarily but not exclusively medicinal chemists. Computational chemists, therapeutic area biologists and pharmacologists, ADME scientists as well as process chemists. A medicinal chemist at any point in his/her career who desires an up-to-date source of information on not only the latest trends in the discipline, but also specifics on the newest information in a particular field such as biologics and specific discovery targets such as kinase inhibitors in cancer","last_updated":"2017-06-19T12:03:51.036Z","parsed":{"xt":"urn:btih:cbb99ff3c7b2d74fcbd08822a9e0e374c08a506c","dn":"Comprehensive Medicinal Chemistry [II,III]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cbb99ff3c7b2d74fcbd08822a9e0e374c08a506c","infoHashBuffer":{"type":"Buffer","data":[203,185,159,243,199,178,215,79,203,208,136,34,169,224,227,116,192,138,80,108]},"name":"Comprehensive Medicinal Chemistry [II,III]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}