{"title":"Sea Power_ The History and Geopolitics of the World's Oceans by ","magnet":"magnet:?xt=urn:btih:cd6218e612e21cf398ba26b128b5ea32a44cdef3&dn=Sea+Power_+The+History+and+Geopolitics+of+the+World%27s+Oceans+by+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"27290205","seeders":"53","leechers":"4","description":"xx\r\n\r\nSea Power_ The History and Geopolitics of the World&apos;s Oceans by James Stavridis ePUB eBOOK-ZAK\r\n\r\nFrom one of the most admired admirals of his generation - and the only admiral to serve as supreme allied commander at NATO - comes a remarkable voyage through all of the world&apos;s most important bodies of water, providing the story of naval power as a driver of human history and a crucial element in our current geopolitical path.\r\n\r\nFrom the time of the Greeks and the Persians clashing in the Mediterranean, sea power has determined world power. To an extent that is often underappreciated, it still does. No one understands this better than Admiral Jim Stavridis. In Sea Power, Admiral Stavridis takes us with him on a tour of the world&apos;s oceans from the admiral&apos;s chair, showing us how the geography of the oceans has shaped the destinies of nations and how naval power has in a real sense made the world we live in today and will shape the world we live in tomorrow.\r\n\r\nNot least, Sea Power is marvelous naval history, giving us fresh insight into great naval engagements from the battles of Salamis and Lepanto through to Trafalgar, the Battle of the Atlantic, and submarine conflicts of the Cold War. It is also a keen-eyed reckoning with the likely sites of our next major naval conflicts, particularly the Arctic Ocean, the Eastern Mediterranean, and the South China Sea. Finally, Sea Power steps back to take a holistic view of the plagues to our oceans that are best seen that way, from piracy to pollution.\r\n\r\nWhen most of us look at a globe, we focus on the shape of the seven continents. Admiral Stavridis sees the shapes of the seven seas. After reading Sea Power, you will, too. Not since Alfred Thayer Mahan&apos;s legendary The Influence of Sea Power upon History have we had such a powerful reckoning with this vital subject.\r\n\r\nxx","last_updated":"2017-08-30T12:05:53.928Z","parsed":{"xt":"urn:btih:cd6218e612e21cf398ba26b128b5ea32a44cdef3","dn":"Sea Power_ The History and Geopolitics of the World's Oceans by ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cd6218e612e21cf398ba26b128b5ea32a44cdef3","infoHashBuffer":{"type":"Buffer","data":[205,98,24,230,18,226,28,243,152,186,38,177,40,181,234,50,164,76,222,243]},"name":"Sea Power_ The History and Geopolitics of the World's Oceans by ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}