{"title":"Sysinternals Desktops Windows Workspace v2 - xsukax","magnet":"magnet:?xt=urn:btih:cdd1af88fbcf14d9b0685c2aa769b1347615c727&dn=Sysinternals+Desktops+Windows+Workspace+v2+-+xsukax&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xsukax","categoryP":"programma's","categoryS":"windows","size":"116824","seeders":"9","leechers":"2","description":"Introduction \r\nSysinternals Desktops Windows Workspace v2 allows you to organize your applications on up to four virtual desktops. Read email on one, browse the web on the second, and do work in your productivity software on the third, without the clutter of the windows you&apos;re not using. After you configure hotkeys for switching desktops, you can create and switch desktops either by clicking on the tray icon to open a desktop preview and switching window, or by using the hotkeys. \r\n\r\nUsing Desktops \r\nUnlike other virtual desktop utilities that implement their desktops by showing the windows that are active on a desktop and hiding the rest, Sysinternals Desktops uses a Windows desktop object for each desktop. Application windows are bound to a desktop object when they are created, so Windows maintains the connection between windows and desktops and knows which ones to show when you switch a desktop. That making Sysinternals Desktops very lightweight and free from bugs that the other approach is prone to where their view of active windows becomes inconsistent with the visible windows. \r\nDesktops reliance on Windows desktop objects means that it cannot provide some of the functionality of other virtual desktop utilities, however. For example, Windows doesn&apos;t provide a way to move a window from one desktop object to another, and because a separate Explorer process must run on each desktop to provide a taskbar and start menu, most tray applications are only visible on the first desktop. Further, there is no way to delete a desktop object, so Desktops does not provide a way to close a desktop, because that would result in orphaned windows and processes. The recommended way to exit Desktops is therefore to logoff","last_updated":"2017-08-15T12:05:25.778Z","parsed":{"xt":"urn:btih:cdd1af88fbcf14d9b0685c2aa769b1347615c727","dn":"Sysinternals Desktops Windows Workspace v2 - xsukax","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cdd1af88fbcf14d9b0685c2aa769b1347615c727","infoHashBuffer":{"type":"Buffer","data":[205,209,175,136,251,207,20,217,176,104,92,42,167,105,177,52,118,21,199,39]},"name":"Sysinternals Desktops Windows Workspace v2 - xsukax","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}