{"title":"Organic Nanoreactors - From Molecular to Supramolecular Organic ","magnet":"magnet:?xt=urn:btih:ce0a3582893f896e7a45f4a70e2adfe18cf56fd7&dn=Organic+Nanoreactors+-+From+Molecular+to+Supramolecular+Organic+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"51263217","seeders":"0","leechers":"0","description":"Organic Nanoreactors - From Molecular to Supramolecular Organic Compounds - Samahe Sadjadi (AP, 2016).pdf\r\n\r\nOrganic Nanoreactors: From Molecular to Supramolecular Organic Compounds provides a unique overview of synthetic, porous organic compounds containing a cavity which can encapsulate one or more guest(s). Confined space within a nanoreactor can isolate the guest(s) from the bulk and effectively influence the reaction inside the nanoreactor. Naturally occurring enzymes are compelling catalysts for selective reactions as their three-dimensional structures build up clefts, caves, or niches in which the active site is located. Additionally, reactive sites carrying special functional groups allow only specific reagents to react in a particular way, to lead to specific enantiomers as products. Equipped with suitable functional groups, then, nanoreactors form a new class of biomimetic compounds, which have multiple important applications in the synthesis of nanomaterials, catalysis, enzyme immobilization, enzyme therapy, and more. This book addresses various synthetic, organic nanoreactors, updating the previous decade of research and examining recent advances in the topic for the first comprehensive overview of this exciting group of compounds, and their practical applications. Bringing in the Editor&#x2019;s experience in both academic research and industrial applications, Organic Nanoreactors focuses on the properties and applications of well-known as well as little-examined nanoreactor compounds and materials and includes brief overviews of synthetic routes and characterization methods.\r\n\r\nFocuses on organic nanoreactor compounds for greater depth\r\nCovers the molecular, supramolecular, and macromolecular perspectives\r\nCompiles previous and current sources from this growing field in one unique reference\r\nProvides brief overviews of synthetic routes and characterization methods","last_updated":"2017-06-08T12:00:18.046Z","parsed":{"xt":"urn:btih:ce0a3582893f896e7a45f4a70e2adfe18cf56fd7","dn":"Organic Nanoreactors - From Molecular to Supramolecular Organic ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce0a3582893f896e7a45f4a70e2adfe18cf56fd7","infoHashBuffer":{"type":"Buffer","data":[206,10,53,130,137,63,137,110,122,69,244,167,14,42,223,225,140,245,111,215]},"name":"Organic Nanoreactors - From Molecular to Supramolecular Organic ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}