{"title":"His Final Battle by Joseph Lelyveld 2016 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:ce16b5b6e2117e2db642ee723c529ec952e2d582&dn=His+Final+Battle+by+Joseph+Lelyveld+2016+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"anders","categoryS":"e_books","size":"22765433","seeders":"0","leechers":"0","description":"xx\r\n\r\nHis Final Battle by Joseph Lelyveld 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\n&quot;By far the most enigmatic leading figure&quot; of World War II. That&apos;s how the British military historian John Keegan described Franklin D. Roosevelt, who frequently left his contemporaries guessing, never more so than at the end of his life. Here, in a hugely insightful account, a prizewinning author and journalist untangles the narrative threads of Roosevelt&apos;s final months, showing how he juggled the strategic, political, and personal choices he faced as the war, his presidency, and his life raced in tandem to their climax.\r\n\r\nThe story has been told piecemeal but never like this, with a close focus on Roosevelt himself and his hopes for a stable international order after the war, and how these led him into a prolonged courtship of Joseph Stalin, the Soviet dictator, involving secret, arduous journeys to Tehran and the Crimea. In between, as the war entered its final phase, came the thunderbolt of a dire medical diagnosis, raising urgent questions about the ability of the longest-serving president to stand for a fourth term at a time when he had little choice. Neither his family nor top figures in his administration were informed of his diagnosis, let alone the public or his closest ally, Winston Churchill. With D-day looming, Roosevelt took a month off on a plantation in the South where he was examined daily by a navy cardiologist, then waited two more months before finally announcing, on the eve of his party&apos;s convention, that he&apos;d be a candidate. A political grand master still, he manipulated the selection of a new running mate, with an eye to a possible succession, displaying some of his old vigor and wit in a winning campaign.\r\n\r\nWith precision and compassion, Joseph Lelyveld examines the choices Roosevelt faced, shining new light on his state of mind, preoccupations, and motives both as leader of the wartime alliance and in his personal life. Confronting his own mortality, Roosevelt operated in the belief that he had a duty to see the war through to the end, telling himself he could always resign if he found he couldn&apos;t carry on.\r\n\r\nLelyveld delivers an incisive portrait of this deliberately inscrutable man, a consummate leader to the very last.\r\n\r\nxx","last_updated":"2017-08-21T12:06:05.927Z","parsed":{"xt":"urn:btih:ce16b5b6e2117e2db642ee723c529ec952e2d582","dn":"His Final Battle by Joseph Lelyveld 2016 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce16b5b6e2117e2db642ee723c529ec952e2d582","infoHashBuffer":{"type":"Buffer","data":[206,22,181,182,226,17,126,45,182,66,238,114,60,82,158,201,82,226,213,130]},"name":"His Final Battle by Joseph Lelyveld 2016 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}