{"title":"Door to Door by Edward Humes EPUB","magnet":"magnet:?xt=urn:btih:ce39869a76e06d2257bfbd14a80632c43c2bb412&dn=Door+to+Door+by+Edward+Humes+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"656462","seeders":"1","leechers":"1","description":"xx\r\n\r\nDoor to Door by Edward Humes EPUB\r\n\r\nThe Pulitzer Prize-winning journalist and author of Garbology explores the hidden and costly wonders of our buy-it-now, get-it-today world of transportation, revealing the surprising truths, mounting challenges, and logistical magic behind every trip we take and every click we make.\r\n\r\nTransportation dominates our daily existence. Thousands, even millions of miles are embedded in everything we do and touch. We live in a door-to-door universe that works so well, most Americans are scarcely aware of it.\r\n\r\nThe grand ballet in which we move ourselves and our stuff is equivalent to building the Great Pyramid, the Hoover Dam, and the Empire State Building all in a day. Every day. And yet, in the one highly visible part of the transportation world - the part we drive - we suffer grinding commutes, a violent death every 15 minutes, a dire injury every 12 seconds, and crumbling infrastructure.\r\n\r\nNow, the way we move ourselves and our stuff is on the brink of great change, as a new mobility revolution upends the car culture that, for better and worse, built modern America. This unfolding revolution will disrupt lives and global trade, transforming our commutes, our vehicles, our cities, our jobs, and every aspect of culture, commerce, and the environment. We are, quite literally, at a fork in the road, though whether it will lead us to Carmageddon or Carmaheaven has yet to be determined.\r\n\r\n..\r\n..\r\n\r\nxx","last_updated":"2018-01-05T12:01:17.770Z","parsed":{"xt":"urn:btih:ce39869a76e06d2257bfbd14a80632c43c2bb412","dn":"Door to Door by Edward Humes EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ce39869a76e06d2257bfbd14a80632c43c2bb412","infoHashBuffer":{"type":"Buffer","data":[206,57,134,154,118,224,109,34,87,191,189,20,168,6,50,196,60,43,180,18]},"name":"Door to Door by Edward Humes EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}