{"title":"Ned Kelly: The Story of Australia's Most Notorious Legend","magnet":"magnet:?xt=urn:btih:cea8d6641e86ffbdcce4362edac2ecb98eac418c&dn=Ned+Kelly%3A+The+Story+of+Australia%27s+Most+Notorious+Legend&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"2868142","seeders":"22","leechers":"0","description":"Ned Kelly: The Story of Australia&apos;s Most Notorious Legend - Peter FitzSimons [epub]\r\n\r\nLove him or loathe him, Ned Kelly has been at the heart of Australian culture and identity since he and his gang were tracked down in bushland by the Victorian police and came out fighting, dressed in bulletproof iron armor made from farmers&apos; ploughs.\r\n\r\nHistorians still disagree over virtually every aspect of the eldest Kelly boy&apos;s brushes with the law. Did he or did he not shoot Constable Fitzpatrick at their family home? Was he a lawless thug or a noble Robin Hood, a remorseless killer or a crusader against oppression and discrimination? Was he even a political revolutionary, an Australian republican channeling the spirit of Eureka?\r\n\r\nPeter FitzSimons, bestselling chronicler of many of the great defining moments and people of the Australia&apos;s history, is the perfect person to tell this most iconic of all Australian stories, from Kelly&apos;s early days in Beveridge, Victoria, in the mid-1800s, to the Felons&apos; Apprehension Act, which made it possible for anyone to shoot the Kelly gang, to Ned&apos;s appearance in his now-famous armor, prompting the shocked and bewildered police to exclaim &quot;He is the devil!&quot;\r\n\r\nPeter FitzSimons is a journalist with the Sun-Herald and the Sydney Morning Herald, and the author of more than 20 books, including Gallipoli.\r\n\r\nPaperback: 800 pages\r\nPublisher: Random House Australia; Reprint edition (April 1, 2016)","last_updated":"2017-08-30T12:01:24.466Z","parsed":{"xt":"urn:btih:cea8d6641e86ffbdcce4362edac2ecb98eac418c","dn":"Ned Kelly: The Story of Australia's Most Notorious Legend","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cea8d6641e86ffbdcce4362edac2ecb98eac418c","infoHashBuffer":{"type":"Buffer","data":[206,168,214,100,30,134,255,189,204,228,54,46,218,194,236,185,142,172,65,140]},"name":"Ned Kelly: The Story of Australia's Most Notorious Legend","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}