{"title":"Steve Hackett-Blues with a Feeling (electric blues guitar)","magnet":"magnet:?xt=urn:btih:cf1027296a2e56575e878dcea2e8cfa515f0f766&dn=Steve+Hackett-Blues+with+a+Feeling+%28electric+blues+guitar%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"322055240","seeders":"28","leechers":"10","description":"Blues With A Feeling&quot; came out at a time when several hard rock guitarists flirted with blues albums with various degrees of success. Steve Hackett is best known as the guitarist for progressive rockers Genesis and his own prog oriented solo career. A blues album was something completely out of left field for most of his fans and remains a disc that divides Hackett&apos;s loyal fan base. Personally I like the album a lot, but I do understand the criticisms that Hackett is no where close to a natural blues man. The album is a mix of covers and original material. The covers include cool renditions of &quot;Born In Chicago&quot; and &quot;The Stumble&quot;. One surprising aspect of this album is how good Hackett is on the harmonica. He plays the instrument a lot here and is quite adept with it. I had no idea. Of course Hackett&apos;s guitar is what most people want to here and there are plenty of tasty guitar licks to be found all over this album. The style may be different, but the solos are patented Hackett. The vocals are a mixed bag as Hackett&apos;s voice fits some of the material quite well, but not quite everything works at the same level. Fans of Hackett&apos;s progressive rock work won&apos;t find much of that on this album, although the 9th track &quot;Big Dallas Sky&quot; does stray away from the blues into prog territory for a few minutes. Hackett fans seem to either really like this album, or completely write it off. I find myself in the former category as I think there is a lot of tasty stuff to be found here","last_updated":"2017-05-27T08:55:34.082Z","parsed":{"xt":"urn:btih:cf1027296a2e56575e878dcea2e8cfa515f0f766","dn":"Steve Hackett-Blues with a Feeling (electric blues guitar)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cf1027296a2e56575e878dcea2e8cfa515f0f766","infoHashBuffer":{"type":"Buffer","data":[207,16,39,41,106,46,86,87,94,135,141,206,162,232,207,165,21,240,247,102]},"name":"Steve Hackett-Blues with a Feeling (electric blues guitar)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}