{"title":"It's A Beautiful Day (1969 self titled psychedelic rock album)","magnet":"magnet:?xt=urn:btih:cf693ec7390b8228890e21b33622868c7ff8463b&dn=It%27s+A+Beautiful+Day+%281969+self+titled+psychedelic+rock+album%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"234160648","seeders":"55","leechers":"17","description":"Although they are not one of the better-known San Francisco bands to have emerged from the ballroom circuit of the late &apos;60s and early &apos;70s, It&apos;s a Beautiful Day were no less memorable for their unique progressive rock style that contrasted well with the Bay Area psychedelic scene. Led by David LaFlamme (flute/violin/vocals) and his wife, Linda LaFlamme (keyboards), the six-piece unit on this album vacillates between light and ethereal pieces such as the lead-off cut, &quot;White Bird,&quot; to the heavier, prog rock-influenced &quot;Bombay Calling.&quot; One of the most distinct characteristics of It&apos;s a Beautiful Day is their instrumentation. The prominence of David LaFlamme -- former violin soloist with the Utah Symphony and original member of Dan Hicks &amp; His Hot Licks -- adds a refinement to It&apos;s a Beautiful Day&apos;s sound. Likewise, the intricate melodies -- mostly composed by the LaFlammes -- are structured around the band&apos;s immense virtuosity, a prime example being the exquisitely haunting harpsichord-driven &quot;Girl With No Eyes.&quot; The noir framework, as well as lyrics such as &quot;...she&apos;s just a reflection of all of the time I&apos;ve been high,&quot; point rather candidly to the hallucinogenic nature of the song&apos;s -- if not the band&apos;s -- influences. The same can be said of the languidly eerie &quot;Bulgaria.&quot; The almost chant-like quality of the track slowly crescendos into an hypnotic and dreamlike sonic journey -- led by LaFlamme&apos;s brilliant violin work. By virtue of being a Bay Area fixture in the late &apos;60s, It&apos;s a Beautiful Day could also easily double as a hippie dance band -- which they can also execute with great aplomb -- as the wildly up-tempo &quot;Time Is&quot; amply proves. It&apos;s a Beautiful Day remains as a timepiece and evidence of how sophisticated rock &amp; roll had become in the fertile environs of the San Francisco music scene. (AllMusic Review\r\n\r\n\r\nListen to &apos;Bombay Calling&apos; and guess which better known band ripped this off","last_updated":"2017-11-19T12:08:46.471Z","parsed":{"xt":"urn:btih:cf693ec7390b8228890e21b33622868c7ff8463b","dn":"It's A Beautiful Day (1969 self titled psychedelic rock album)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cf693ec7390b8228890e21b33622868c7ff8463b","infoHashBuffer":{"type":"Buffer","data":[207,105,62,199,57,11,130,40,137,14,33,179,54,34,134,140,127,248,70,59]},"name":"It's A Beautiful Day (1969 self titled psychedelic rock album)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}