{"title":"\nThe Templars: The Rise and Fall of God's Holy Warriors","magnet":"magnet:?xt=urn:btih:cff2e33eb4ca37efd86a0ca62f9e3ae9940968ca&dn=The+Templars%3A+The+Rise+and+Fall+of+God%27s+Holy+Warriors&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"7184013","seeders":"26","leechers":"11","description":"The Templars: The Rise and Spectacular Fall of God&apos;s Holy Warriors - Dan Jones [epub]\r\n\r\nJerusalem 1119. A small group of knights seeking a purpose in the violent aftermath of the First Crusade decides to set up a new order. These are the first Knights Templar, a band of elite warriors prepared to give their lives to protect Christian pilgrims to the Holy Land. Over the next two hundred years, the Templars would become the most powerful religious order of the medieval world. Their legend has inspired fervent speculation ever since. \r\n\r\nIn this groundbreaking narrative history, Dan Jones tells the true story of the Templars for the first time in a generation, drawing on extensive original sources to build a gripping account of these Christian holy warriors whose heroism and alleged depravity have been shrouded in myth. The Templars were protected by the pope and sworn to strict vows of celibacy. They fought the forces of Islam in hand-to-hand combat on the sun-baked hills where Jesus lived and died, finding their nemesis in Saladin, who vowed to drive all Christians from the lands of Islam. Experts at channeling money across borders, they established the medieval world&#x2019;s banking network and waged private wars against anyone who threatened their interests.\r\n\r\nA vindictive King of France set his sights on their fortune. He instructed his lawyers to mount a damning case against them, built on deliberate lies and false testimony. Then on Friday October 13, 1307, hundreds of brothers were arrested, imprisoned and tortured, and the order was disbanded amid lurid accusations of sexual misconduct and heresy. They were tried by the Pope in secret proceedings and publicly humiliated. But were they heretics or victims of a ruthlessly repressive state? Dan Jones goes back to the sources to bring their dramatic tale, so relevant to our own times, in a book that is at once authoritative and compulsively readable.\r\n\r\nHardcover: 448 pages\r\nPublisher: Viking (September 19, 2017)","last_updated":"2017-10-07T12:05:18.001Z","parsed":{"xt":"urn:btih:cff2e33eb4ca37efd86a0ca62f9e3ae9940968ca","dn":"The Templars: The Rise and Fall of God's Holy Warriors","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"cff2e33eb4ca37efd86a0ca62f9e3ae9940968ca","infoHashBuffer":{"type":"Buffer","data":[207,242,227,62,180,202,55,239,216,106,12,166,47,158,58,233,148,9,104,202]},"name":"The Templars: The Rise and Fall of God's Holy Warriors","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}