{"title":"Beyond the Northlands: Viking Voyages and the Old Norse Sagas","magnet":"magnet:?xt=urn:btih:d2dc5f9ca9bcf49021558e61aca3925a711861ca&dn=Beyond+the+Northlands%3A+Viking+Voyages+and+the+Old+Norse+Sagas&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"5739384","seeders":"69","leechers":"5","description":"Beyond the Northlands: Viking Voyages and the Old Norse Sagas - E.R. Barraclough [epub]\r\n\r\nIn the dying days of the eighth century, the Vikings erupted onto the international stage with brutal raids and slaughter. The medieval Norsemen may be best remembered as monk murderers and village pillagers, but this is far from the whole story. Throughout the Middle Ages, long-ships transported hairy northern voyagers far and wide, where they not only raided but also traded, explored and settled new lands, encountered unfamiliar races, and embarked on pilgrimages and crusades.\r\n\r\nBut the depiction of the Viking world in the Old Norse-Icelandic sagas goes far beyond historical facts. What emerges from these tales is a mixture of realism and fantasy, quasi-historical adventures and exotic wonder-tales that rocket far beyond the horizon of reality. On the crackling brown pages of saga manuscripts, trolls, dragons and outlandish tribes jostle for position with explorers, traders, and kings.\r\n\r\nTo explore the sagas and the world that produced them, Eleanor Rosamund Barraclough now takes her own trip through the dramatic landscapes that they describe. Along the way, she illuminates the rich but often confusing saga accounts with a range of other evidence: archaeological finds, rune-stones, medieval world maps, encyclopedic manuscripts, and texts from as far away as Byzantium and Baghdad. As her journey across the Old Norse world shows, by situating the sagas against the revealing background of this other evidence, we can begin at least to understand just how the world was experienced, remembered, and imagined by this unique culture from the outermost edge of Europe so many centuries ago.\r\n\r\nHardcover: 320 pages\r\nPublisher: Oxford University Press; 1st edition (December 1, 2016)","last_updated":"2018-01-01T12:04:34.597Z","parsed":{"xt":"urn:btih:d2dc5f9ca9bcf49021558e61aca3925a711861ca","dn":"Beyond the Northlands: Viking Voyages and the Old Norse Sagas","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d2dc5f9ca9bcf49021558e61aca3925a711861ca","infoHashBuffer":{"type":"Buffer","data":[210,220,95,156,169,188,244,144,33,85,142,97,172,163,146,90,113,24,97,202]},"name":"Beyond the Northlands: Viking Voyages and the Old Norse Sagas","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}