{"title":"Britains Got Talent Season 11","magnet":"magnet:?xt=urn:btih:d2ecf4faf8e5ad7996aa8ff16b592d7f44a7ad9a&dn=Britains+Got+Talent+Season+11&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Invader97","categoryP":"video","categoryS":"hd___tv_shows","size":"41745852941","seeders":"0","leechers":"10","description":"Britain&apos;s Got Talent (often shortened to BGT) is a British television talent show competition which started in June 2007 and originated from the Got Talent franchise. The show is a Thames production (formerly Talkback Thames) distributed by FremantleMedia and is produced in association with Syco TV. The show is broadcast on ITV and its sister show Britain&apos;s Got More Talent is broadcast on ITV2. Anyone of any age with some sort of talent can audition for the show. Acts compete against each other in order to gain the audience support while trying to win the title of &quot;The winner of Britain&apos;s Got Talent&quot;. The original judging panel consisted of the show&apos;s creator Simon Cowell, Amanda Holden and Piers Morgan. Kelly Brook was brought in as a fourth judge in series 3, but was axed after one audition site. Morgan did not return for series 5 and Cowell was only present during the live shows, while David Hasselhoff and Michael McIntyre joined the panel. Alesha Dixon and David Walliams joined the panel in series 6 as replacements for McIntyre and Hasselhoff.\r\n\r\nThe eleventh series of Britain&apos;s Got Talent premiered on 15 April 2017 and concluded on 3 June 2017. Ant &amp; Dec returned to present the main show on ITV, whilst Stephen Mulhern returned to present the spin-off show Britain&apos;s Got More Talent on ITV2. Simon Cowell and Amanda Holden returned for their eleventh series on the judging panel and Alesha Dixon as well as David Walliams returned for their sixth series. It was the first series that AO.com have sponsored the show, and the first series to have its live shows filmed at Elstree Studios, following the closure of Fountain Studios. Enjoy!","last_updated":"2017-06-06T12:04:59.776Z","parsed":{"xt":"urn:btih:d2ecf4faf8e5ad7996aa8ff16b592d7f44a7ad9a","dn":"Britains Got Talent Season 11","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d2ecf4faf8e5ad7996aa8ff16b592d7f44a7ad9a","infoHashBuffer":{"type":"Buffer","data":[210,236,244,250,248,229,173,121,150,170,143,241,107,89,45,127,68,167,173,154]},"name":"Britains Got Talent Season 11","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}