{"title":"Nanoscience in Dermatology - Michael R. Hamblin et al.","magnet":"magnet:?xt=urn:btih:d360a1290f6543bdae4fa20b22bfe5996c8629f5&dn=Nanoscience+in+Dermatology+-+Michael+R.+Hamblin+et+al.&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"47020349","seeders":"0","leechers":"0","description":"Nanoscience in Dermatology - Michael R. Hamblin et al. (AP, 2016).pdf\r\n\r\nNanoscience in Dermatology covers one of the two fastest growing areas within dermatological science, nanoscience and nanotechnology in dermatology. Recently, great progress has been made in the research and development of nanotechnologies and nanomaterials related to various applications in medicine and, in general, the life sciences. There is increasing enthusiasm for nanotechnology applications in dermatology (drug delivery, diagnostics, therapeutics, imaging, sensors, etc.) for understanding skin biology, improving early detection and treatment of skin diseases, and in the design and optimization of cosmetics.\r\n\r\nLight sensitive nanoparticles have recently been explored, opening a new era for the combined applications of light with nanotechnology, also called photonanodermatology. However, concerns have been raised regarding the adverse effects of intentional and unintentional nanoparticle exposure and their toxicity.\r\n\r\nWritten by experts working in these exciting fields, this book extensively covers nanotechnology applications, together with the fundamentals and toxicity aspects. It not only addresses current applications of nanotechnology, but also discusses future trends of these ever-growing and rapidly changing fields, providing scientists and dermatologists with a clear understanding of the advantages and challenges of nanotechnology in skin medicine.\r\n\r\nProvides knowledge of current and future applications of nanoscience and nanotechnology in dermatology\r\nOutlines the fundamentals, methods, toxicity aspects, and other relevant aspects for nanotechnology based applications in dermatology\r\nCoherently structured book written by experts working in the fields covered","last_updated":"2017-06-08T12:00:33.972Z","parsed":{"xt":"urn:btih:d360a1290f6543bdae4fa20b22bfe5996c8629f5","dn":"Nanoscience in Dermatology - Michael R. Hamblin et al.","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d360a1290f6543bdae4fa20b22bfe5996c8629f5","infoHashBuffer":{"type":"Buffer","data":[211,96,161,41,15,101,67,189,174,79,162,11,34,191,229,153,108,134,41,245]},"name":"Nanoscience in Dermatology - Michael R. Hamblin et al.","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}