{"title":"Radian 2016 On Dark Silent Off","magnet":"magnet:?xt=urn:btih:d36482bd6fd13082be77ab23c4c081dc0a832081&dn=Radian+2016+On+Dark+Silent+Off&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"wwino","categoryP":"audio","categoryS":"flac","size":"228872572","seeders":"2","leechers":"4","description":"Radian ~ On Dark Silent Off ~ 2016\r\nThrill Jockey Records thrill 424.\r\n <a href=\"\nhttp://i1.imageban.ru/out/2017/06/04/67a90486749d2e0f1053a67bc6f118b7.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttp://i1.imageban.ru/out/2017/06/04/67a90486749d2e0f1053a67bc6f118b7.jpg</a>\r\n\r\n1 \tPickup Pickout \t5:45\r\n2 \tOn Dark Silent Off \t9:23\r\n3 \tScary Objects \t5:30\r\n4 \tRecreate Loved Objects \t3:43\r\n5 \tBlue Noise, Black Lake \t6:23\r\n6 \tCodes And Sounds \t3:14\r\n7 \tRusty Machines, Dusty Carpets \t13:46\r\n\r\nJohn Norman: bass\r\nMartin Brandlmayr: drums, vibraphone, electronics\r\nMartin Siewert: guitar, lap steel guitar, electronics, guitarr&#xF3;n\r\n\r\nSince the 2009 release of their fourth-full length, Chimeric, Austrian experimental trio Radian swapped a bandmember (co-founder Stefan N&#xE9;meth was replaced by Martin Siewert) and collaborated with Giant Sand&apos;s Howe Gelb for an album released on Radian&apos;s own label in 2014. On Dark Silent Off is the group&apos;s return to longtime home Thrill Jockey, and while it essentially doesn&apos;t differ too much from their previous recordings in terms of how they capture and arrange sounds, there&apos;s far more clarity to these compositions than the group&apos;s more spaced-out early work. Radian still construct their recordings from edited bits of extended improvisations, with jagged bursts of feedback and incidental noises amplified and incorporated as musical elements. Their work still seems barren and alienated, yet somehow this one seems more explosive and charged-up than usual for them. Calling it more &quot;accessible&quot; would be a stretch, but the drums (played by Martin Brandlmayr, also a member of Trapist along with Siewert) seem way more up-front than before, and some of the guitar textures are more atmospheric. Highlights such as &quot;Scary Objects&quot; and &quot;Recreate Loved Objects&quot; fashion harsh, distorted, quasi-industrial clangs into unexpectedly funky rhythms. Tracks like opener &quot;Pickup Pickout&quot; also bury some dreamy guitar melodies under the heavy, fractured grooves. The album&apos;s title track is another stunner, starting out frayed, glitchy, and minimal before gradually cohering, and then switching to a heavier, more suspenseful part midway through. It ends up much more calm and spacious, but still seems threaded together by a faint rhythmic pulse. The group amps up the guitar noise near the end of &quot;Blue Noise, Black Lake,&quot; which sports a chilling cinematic melody along with its crunchy, nearly galloping drums. With On Dark Silent Off, Radian sharpen their difficult sound into something more urgent and alarming than it ever was before. - Paul Simpson, AMG","last_updated":"2017-06-04T12:01:00.860Z","parsed":{"xt":"urn:btih:d36482bd6fd13082be77ab23c4c081dc0a832081","dn":"Radian 2016 On Dark Silent Off","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d36482bd6fd13082be77ab23c4c081dc0a832081","infoHashBuffer":{"type":"Buffer","data":[211,100,130,189,111,209,48,130,190,119,171,35,196,192,129,220,10,131,32,129]},"name":"Radian 2016 On Dark Silent Off","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}