{"title":"A Mind of Your Own_ The Truth About Depression and How Women Can","magnet":"magnet:?xt=urn:btih:d3c9bcc114df9f30a68e1067555679e3cf47f80a&dn=A+Mind+of+Your+Own_+The+Truth+About+Depression+and+How+Women+Can&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3232014","seeders":"42","leechers":"5","description":"xx\r\n\r\nA Mind of Your Own_ The Truth About Depression and How Women Can Heal Their Bodies to Reclaim Their Lives by Kelly Brogan ePUB eBOOK-ZAK\r\n\r\nDepression is not a disease. It is a symptom.\r\n\r\nRecent years have seen a shocking increase in antidepressant use the world over, with one in four women starting her day with medication. These drugs have steadily become the panacea for everything from grief, irritability, and panic attacks to insomnia, PMS, and stress. But the truth is, what women really need can&apos;t be found at a pharmacy.\r\n\r\nAccording to Dr. Kelly Brogan, antidepressants not only overpromise and underdeliver, but their use may permanently disable the body&apos;s self-healing potential. We need a new paradigm: The best way to heal the mind is to heal the whole body.\r\n\r\nIn this groundbreaking science-based and holistic approach, Dr. Brogan shatters the mythology conventional medicine has built around the causes and treatment of depression. Based on her expert interpretation of published medical findings combined with years of experience from her clinical practice, Dr. Brogan illuminates the true cause of depression: It is not simply a chemical imbalance but a lifestyle crisis that demands a reset. It is a signal that the interconnected systems in the body are out of balance - from blood sugar to gut health to thyroid function - and inflammation is at the root.\r\n\r\nA Mind of Your Own offers an achievable, step-by-step 30-day action plan - including powerful dietary interventions, targeted nutrient support, detoxification, sleep, and stress reframing techniques - women can use to heal their bodies, alleviate inflammation, and feel like themselves again without a single prescription.\r\n\r\nBold, brave, and revolutionary, A Mind of Your Own takes readers on a journey of self-empowerment for radical transformation that goes far beyond symptom relief.\r\n\r\nxx","last_updated":"2017-09-02T12:06:57.843Z","parsed":{"xt":"urn:btih:d3c9bcc114df9f30a68e1067555679e3cf47f80a","dn":"A Mind of Your Own_ The Truth About Depression and How Women Can","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d3c9bcc114df9f30a68e1067555679e3cf47f80a","infoHashBuffer":{"type":"Buffer","data":[211,201,188,193,20,223,159,48,166,142,16,103,85,86,121,227,207,71,248,10]},"name":"A Mind of Your Own_ The Truth About Depression and How Women Can","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}