{"title":"Cardinal S01","magnet":"magnet:?xt=urn:btih:d45639f16137ef2f4f9f11476a121859a2bc2958&dn=Cardinal+S01&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"RoaElson","categoryP":"video","categoryS":"other","size":"4465724007","seeders":"18","leechers":"55","description":"Cardinal S01 complete (720p HD, soft Eng subs)\r\n\r\nS01E01 Cardinal \r\nDemoted for a hunch about a case that he wouldn&apos;t let go, Cardinal is brought back to the homicide unit when the body of missing 13-year-old Katie Pine is discovered, proving his instincts correct. Back on the case, his search for her murderer soon becomes an all-consuming race to stay ahead of a serial killer.\r\n\r\n\r\nS01E02 Delorme \r\nThe Algonquin Bay Police Department attempts to make amends with the community for the botched investigation into Katie Pine&apos;s disappearance. Detective Lise Delorme risks exposure of her investigation in an attempt to catch Detective John Cardinal in the act of a crime. Meanwhile, the killer zeroes in on his next victim.\r\n\r\nS01E03 Edie and Eric \r\nConcerned that Cardinal is on to her, Delorme digs into the reasons behind her secret investigation. Meanwhile a dangerous, sadistic couple are roaming the streets for a victim.\r\n\r\nS01E04 Woody \r\nWoody Baldwin, a small-time thief, gets caught in the centre of Eric and Edie&apos;s sadistic world when he breaks into their basement dungeon and finds Keith. Meanwhile, Cardinal and Delorme&apos;s personal issues threaten their new partnership and Cardinal takes big risks in the investigation that put him at odds with Dyson.\r\n\r\nS01E05 Keith \r\nWhen Woody Baldwin&apos;s body is found hastily disposed of, Cardinal and Delorme are able to connect it to Eric Fraser, and Eric to Katie Pine and Todd Curry. They know they have their killer - now it&apos;s a mad dash to find him before he murders Keith. Meanwhile, Cardinal meets his daughter Kelly when she makes a surprise trip home to visit her mother Catherine - but where is she?\r\n\r\nS01E06 Catherine \r\nCardinal wonders if he and Delorme are still missing a piece of the puzzle. He digs deeper and goes to the pharmacy where Edie works and finds something very disturbing. Delorme concludes her investigation of Cardinal and it&apos;s not good.\r\n\r\n(with soft subtitles)","last_updated":"2017-06-18T12:06:17.068Z","parsed":{"xt":"urn:btih:d45639f16137ef2f4f9f11476a121859a2bc2958","dn":"Cardinal S01","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d45639f16137ef2f4f9f11476a121859a2bc2958","infoHashBuffer":{"type":"Buffer","data":[212,86,57,241,97,55,239,47,79,159,17,71,106,18,24,89,162,188,41,88]},"name":"Cardinal S01","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}