{"title":"Runnin' with the Devil_ A Backstage Pass to the Wild Times ... T","magnet":"magnet:?xt=urn:btih:d4fb03f04d08bca663153fe4670480628e616ae9&dn=Runnin%27+with+the+Devil_+A+Backstage+Pass+to+the+Wild+Times+...+T&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14197053","seeders":"0","leechers":"0","description":"xx\r\n\r\nRunnin&apos; with the Devil_ A Backstage Pass to the Wild Times ... Truth Behind the Making of Van Halen by Joe Layden and Noel Monk ePUB eBOOK-ZAK\r\n\r\nThe manager who shepherded Van Halen from obscurity to rock stardom goes behind the scenes to tell the complete, unadulterated story of David Lee Roth, Eddie Van Halen, and the legendary band that changed rock music.\r\n\r\nVan Halen&apos;s rise in the 1980s was one of the most thrilling the music world had ever seen - their mythos an epic party, a sweaty, sexy, never-ending rock extravaganza. During this unparalleled run of success, debauchery, and drama, no one was closer to the band than Noel Monk. A man who&apos;d worked with some of rock&apos;s biggest and most notorious names, Monk spent seven years with Van Halen, serving first as their tour manger, then as their personal manager until 1985, when both he and David Lee Roth exited as controversy, backstabbing, and disappointment consumed the band.\r\n\r\nThroughout Van Halen&apos;s meteoric rise and abrupt halt, this confidant, fixer, friend, and promoter saw it all and lived to tell. Now, for the first time, he shares the most outrageous escapades - from their coming of age to their most shocking behavior on the road; from Eddie&apos;s courtship and high-profile wedding to Valerie Bertinelli to the incredible drug use that would ultimately lead to everyone&apos;s demise. Sharing never-before-told stories, Monk paints a compelling portrait of Eddie Van Halen, bringing into focus the unique combination of talent, vision, hardship, and naivet&#xE9; that shaped one of the greatest rock guitarists of all time - and made him and his brother vulnerable to the trappings and failings of fame.\r\n\r\nRunnin&apos; with the Devil is manna from rock heaven no Van Halen fan can miss.\r\n\r\nxx","last_updated":"2017-08-27T12:03:29.173Z","parsed":{"xt":"urn:btih:d4fb03f04d08bca663153fe4670480628e616ae9","dn":"Runnin' with the Devil_ A Backstage Pass to the Wild Times ... T","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d4fb03f04d08bca663153fe4670480628e616ae9","infoHashBuffer":{"type":"Buffer","data":[212,251,3,240,77,8,188,166,99,21,63,228,103,4,128,98,142,97,106,233]},"name":"Runnin' with the Devil_ A Backstage Pass to the Wild Times ... T","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}