{"title":"Football Manager 2017 + Football Manager Touch (2017)","magnet":"magnet:?xt=urn:btih:d50972e476c6b1f93c765d5242c2c90d038019ee&dn=Football+Manager+2017+%2B+Football+Manager+Touch+%282017%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"snitschers","categoryP":"games","categoryS":"pc","size":"3071279104","seeders":"0","leechers":"0","description":"Languages: RUS | ENG | MULTi16\r\nReleased: 4 November 2016\r\n\r\nFootball Manager 2017\r\n\r\nManage your favorite football team in Football Manager 2017, the most realistic and exciting football manager. The game closest to the real work of the coach!\r\nAt your disposal - more than 2500 real football clubs, more than 500 000 real players and coaching staff. In Football Manager 2017 you will be in the control center of a huge football world.\r\nYou have to control the transfers and decide for yourself who plays and who is left in the reserve. It is you who determine the tactics of the match, conduct conversations with the team, give instructions from the edge of the field and watch the game with the help of a magnificent three-dimensional engine. In addition, you have to work with the sports press and deal with the personal problems of the players, and the club&apos;s management will follow your every step.\r\n\r\nFootball Manager Touch 2017\r\n\r\nManage your favorite team in the new Football Manager Touch 2017. This is a dynamic way to manage a football club in the style of &quot;transfers and tactics.&quot;\r\nAt your disposal are more than 2500 real clubs and 190 000 real football players and coaching staff. Football Manager Touch 2017 uses the vast bases of players and clubs from Football Manager, but offers a more dynamic game, allowing you to focus only on the basic coaching duties.\r\nYou have to control the transfers and decide for yourself who plays and who is left in the reserve. It is you who determine the tactics of the match and watch the game with the help of a magnificent three-dimensional engine. The most busy coaches can calculate the outcome of a match in the Touch at the touch of a button and without stopping to go to fame in the season finale.\r\n\r\nRelease info:\r\nBased on the release of STEAMPUNKS\r\nDo not cut / Do not recoded\r\nGame archives are not opened\r\nGame version: 17.3.1\r\nInstallation time 4 minutes on the HDD (Depends on the computer)\r\n\r\nESET-NOD32 swears at the tablet (and possibly others), add a folder with the game in exceptions!\r\nRun the game as administrator","last_updated":"2017-06-28T12:01:19.411Z","parsed":{"xt":"urn:btih:d50972e476c6b1f93c765d5242c2c90d038019ee","dn":"Football Manager 2017   Football Manager Touch (2017)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d50972e476c6b1f93c765d5242c2c90d038019ee","infoHashBuffer":{"type":"Buffer","data":[213,9,114,228,118,198,177,249,60,118,93,82,66,194,201,13,3,128,25,238]},"name":"Football Manager 2017   Football Manager Touch (2017)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}