{"title":"SKY FORCE RELOADED (2017) (ISO) [MULTI]","magnet":"magnet:?xt=urn:btih:d5475a59b40f9d379a806f3994cc3ba03c14b728&dn=SKY+FORCE+RELOADED+%282017%29+%28ISO%29+%5BMULTI%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"HARBETH","categoryP":"applications","categoryS":"windows","size":"530049024","seeders":"8","leechers":"7","description":"[img]https://i.imgur.com/5O2i80v.jpg[/img]\r\n\r\nSKY FORCE RELOADED (2017) (ISO) [MULTI]\r\n\r\nTitle: Sky Force Reloaded\r\nGenre: Action, Indie\r\nDeveloper: &#x201C;Infinite Dreams&#x201D;\r\nPublisher: &#x201C;Infinite Dreams&#x201D;\r\nRelease Date: 29 Nov, 2017\r\nSize : 505 MB <a href=\"\nhttps://www.gry-online.pl/S016.asp?ID=30412\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.gry-online.pl/S016.asp?ID=30412</a>\r\n\r\nky Force Reloaded is the spirit of the classic arcade shoot &#x2018;em ups, captured with modern visuals and design. New entry in the series will keep you entertained with all the things you&#x2019;ve came to love in scrolling shooters. Meaty explosions, incinerating lasers, collosal bosses and diverse aircrafts to pilot.\r\n\r\nSky Force Reloaded is not your average scrolling shooter. It will draw you in with its beautiful environments and intense effects. It will keep you with its superb gameplay mechanics, progression system and in-game collectibles. It will leave you wishing for more, once it&#x2019;s over. Fortunately, there&#x2019;s a lot to do before that happens.\r\n\r\nMaster 15 beautiful and immersive stages with challenging missions to complete.\r\nBattle enormous and intimidating bosses, laugh when they explode and cry when you explode.\r\nUnlock new difficulty modes, all the way from Normal to Nightmare.\r\nPut yourself in danger to rescue missing operatives from the battlefield.\r\nAssemble and test 9 different aircrafts. Pick your favorite, with its unique features and play style.\r\nHunt down 30 elusive bonus cards to add even more depth to the gameplay. Some of them will grant permanent benefits, while others will boost your abilities only temporarily.\r\nInstall hundreds of upgrades to your weapons, shields and other equipment. Turn your plane into a flying tank.\r\nComplete in-game objectives to unlock 8 assisting technicians. Choose one of them to help you with their special skill.\r\nSpot the wrecks of your fallen friends and get rewards for picking them up.\r\nEnter the Weekend Tournaments to challenge your friends on one of 5 specially crafted infinite stages.\r\nAppreciate highly polished gameplay and well balanced difficulty curve, whether you consider yourself a casual gamer or a die-hard shmup fanatic.\r\nEnjoy professional voiceover and incredible electronic soundtrack.\r\nSet the fun level to eleven by inviting your friends to play with you in local cooperative mode! Find the planes that best suit you both and challenge the hardest bosses, too fearsome to be faced alone.\r\n1.Instal\r\n2.Copy crack\r\n3.Play\r\n\r\nSS:\r\n\r\nTrailer","last_updated":"2017-12-13T12:08:39.563Z","parsed":{"xt":"urn:btih:d5475a59b40f9d379a806f3994cc3ba03c14b728","dn":"SKY FORCE RELOADED (2017) (ISO) [MULTI]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d5475a59b40f9d379a806f3994cc3ba03c14b728","infoHashBuffer":{"type":"Buffer","data":[213,71,90,89,180,15,157,55,154,128,111,57,148,204,59,160,60,20,183,40]},"name":"SKY FORCE RELOADED (2017) (ISO) [MULTI]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}