{"title":"The Ministry of Utmost Happiness_ A Novel by Arundhati Roy ePUB ","magnet":"magnet:?xt=urn:btih:d56048decda6a3a066b2021b50c53392f55922b8&dn=The+Ministry+of+Utmost+Happiness_+A+Novel+by+Arundhati+Roy+ePUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4158171","seeders":"8","leechers":"4","description":"xx\r\n\r\nThe Ministry of Utmost Happiness_ A Novel by Arundhati Roy ePUB eBOOK-ZAK\r\n\r\nA richly moving new novel - the first since the author&apos;s Booker Prize-winning, internationally celebrated debut, The God of Small Things, went on to become a beloved best seller and an enduring classic.\r\n\r\nThe Ministry of Utmost Happiness transports us across a subcontinent on a journey of many years. It takes us deep into the lives of its gloriously rendered characters, each of them in search of a place of safety - in search of meaning and of love.\r\n\r\nIn a graveyard outside the walls of Old Delhi, a resident unrolls a threadbare Persian carpet. On a concrete sidewalk, a baby suddenly appears just after midnight. In a snowy valley, a bereaved father writes a letter to his five-year-old daughter about the people who came to her funeral. In a second-floor apartment, a lone woman chain-smokes as she reads through her old notebooks. At the Jannat Guest House, two people who have known each other all their lives sleep with their arms wrapped around each other, as though they have just met.\r\n\r\nA braided narrative of astonishing force and originality, The Ministry of Utmost Happiness is at once a love story and a provocation - a novel as inventive as it is emotionally engaging. It is told with a whisper, in a shout, through joyous tears, and sometimes with a bitter laugh. Its heroes, both present and departed, have been broken by the world we live in - and then mended by love. For this reason they will never surrender.\r\n\r\nHow to tell a shattered story?\r\n\r\nBy slowly becoming everybody.\r\n\r\nNo.\r\n\r\nBy slowly becoming everything.\r\n\r\nHumane and sensuous, beautifully told, this extraordinary novel demonstrates the miracle of Arundhati Roy&apos;s storytelling gifts.\r\n\r\nxx","last_updated":"2017-08-29T12:05:15.713Z","parsed":{"xt":"urn:btih:d56048decda6a3a066b2021b50c53392f55922b8","dn":"The Ministry of Utmost Happiness_ A Novel by Arundhati Roy ePUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d56048decda6a3a066b2021b50c53392f55922b8","infoHashBuffer":{"type":"Buffer","data":[213,96,72,222,205,166,163,160,102,178,2,27,80,197,51,146,245,89,34,184]},"name":"The Ministry of Utmost Happiness_ A Novel by Arundhati Roy ePUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}