{"title":"Jerald Walker - The World in Flames 2016 RETAiL ePUB eBOOK-DiSTR","magnet":"magnet:?xt=urn:btih:d564f697a6b76d3952fa0f9849c396de7fa19611&dn=Jerald+Walker+-+The+World+in+Flames+2016+RETAiL+ePUB+eBOOK-DiSTR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3085909","seeders":"0","leechers":"0","description":"xx\r\n\r\nJerald Walker - The World in Flames 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA memoir of growing up with blind African American parents in a segregated cult preaching the imminent end of the world...\r\n\r\nWhen The World in Flames begins in 1970, Jerry Walker is six years old. His consciousness revolves around being a member of a church whose beliefs he finds not only confusing but terrifying. Composed of a hodgepodge of requirements and restrictions (including a prohibition against doctors and hospitals), the underpinning tenet of Herbert W. Armstrong&apos;s Worldwide Church of God is that its members are divinely chosen, and all others will soon perish in rivers of flames.\r\n\r\nThe substantial membership is ruled by fear, intimidation, and threats. Anyone who dares leave the church will endure hardship for the remainder of this life and eternal suffering in the next. The next life, according to Armstrong, will arrive in 1975, three years after the start of the &quot;Great Tribulation&quot;. Jerry will be 11 years old.\r\n\r\nJerry&apos;s parents were particularly vulnerable to the promise of relief from the world&apos;s hardships. When they joined the church in 1960, they were living in a two-room apartment in a dangerous Chicago housing project with the first four of their seven children. Most significantly, they both were blind, having lost their sight to childhood accidents. They took comfort in the belief that they had been chosen for a special afterlife, even if it meant following a religion with a white supremacist ideology. They dutifully sent tithes to Armstrong, whose church boasted more than 100,000 members and more than $80 million in annual revenues at its height.\r\n\r\nWhen the prophecy of the 1972 Great Tribulation does not materialize, Jerry is considerably less disappointed than relieved. When the 1975 end-time prophecy also fails, he finally begins to question his faith and imagines the possibility of choosing a destiny of his own.\r\n\r\nxx","last_updated":"2017-08-18T12:00:29.335Z","parsed":{"xt":"urn:btih:d564f697a6b76d3952fa0f9849c396de7fa19611","dn":"Jerald Walker - The World in Flames 2016 RETAiL ePUB eBOOK-DiSTR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d564f697a6b76d3952fa0f9849c396de7fa19611","infoHashBuffer":{"type":"Buffer","data":[213,100,246,151,166,183,109,57,82,250,15,152,73,195,150,222,127,161,150,17]},"name":"Jerald Walker - The World in Flames 2016 RETAiL ePUB eBOOK-DiSTR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}