{"title":"\nAl Capone_ His Life, Legacy, and Legend by Deirdre Bair 2016 RET","magnet":"magnet:?xt=urn:btih:d59544d60ef7ee3ecc321df04783322bf784a4ed&dn=Al+Capone_+His+Life%2C+Legacy%2C+and+Legend+by+Deirdre+Bair+2016+RET&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"14442391","seeders":"12","leechers":"12","description":"xx\r\n\r\nAl Capone_ His Life, Legacy, and Legend by Deirdre Bair 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom a National Book Award-winning biographer, the first complete life of legendary gangster Al Capone to be produced with the cooperation of his family, who provided the author with exclusive access to personal testimony and archival documents.\r\n\r\nFrom his heyday to the present moment, Al Capone - Public Enemy Number One - has gripped popular imagination. Rising from humble Brooklyn roots, Capone went on to become the most infamous gangster in American history. At the height of Prohibition, his multimillion-dollar Chicago bootlegging, prostitution, and gambling operation dominated the organized-crime scene. His competition with rival gangs was brutally violent, a long-running war that crested with the shocking St. Valentine&apos;s Day Massacre of 1929. Law enforcement and the media elite seemed powerless to stop the growth of his empire. And then the fall: a legal noose tightened by the FBI, a conviction on tax evasion, Alcatraz. After his release he returned to his family in Miami a much diminished man, living quietly until the ravages of his neurosyphilis took their final toll. But the slick mobster persona endures, immortalized in countless novels and movies.\r\n\r\nThe true flesh-and-blood man behind the legend has long remained a mystery. Unscrupulous newspaper accounts and Capone&apos;s own tall tales perpetuated his mystique, but through dogged research Deirdre Bair debunks the most outrageous of these myths. With the help of Capone&apos;s descendants, she discovers his essential humanity, uncovering a complex character that was flawed and sometimes cruel but also capable of nobility. And while revealing the private Al Capone, a genuine family man as remembered by those who knew him best, Bair relates how his descendants have borne his weighty legacy.\r\n\r\nRigorous and intimate, Al Capone provides new answers to the enduring questions about this fascinating figure, who was equal parts charismatic gangster, devoted patriarch, and calculating monster.\r\n\r\nxx","last_updated":"2017-09-22T12:03:31.675Z","parsed":{"xt":"urn:btih:d59544d60ef7ee3ecc321df04783322bf784a4ed","dn":"Al Capone_ His Life, Legacy, and Legend by Deirdre Bair 2016 RET","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d59544d60ef7ee3ecc321df04783322bf784a4ed","infoHashBuffer":{"type":"Buffer","data":[213,149,68,214,14,247,238,62,204,50,29,240,71,131,50,43,247,132,164,237]},"name":"Al Capone_ His Life, Legacy, and Legend by Deirdre Bair 2016 RET","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}