{"title":"Why the West Rules - for Now by Ian Morris EPUB","magnet":"magnet:?xt=urn:btih:d5d46a7fa2f5a8392d16996d16a156cbb2de5fcd&dn=Why+the+West+Rules+-+for+Now+by+Ian+Morris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3061548","seeders":"21","leechers":"8","description":"xx\r\n\r\nWhy the West Rules - for Now by Ian Morris EPUB\r\n\r\nSometime around 1750, English entrepreneurs unleashed the astounding energies of steam and coal, and the world was forever changed. The emergence of factories, railroads, and gunboats propelled the West&#x2019;s rise to power in the nineteenth century, and the development of computers and nuclear weapons in the 20th century secured its global supremacy.\r\n\r\nNow, at the beginning of the 21st century, many worry that the emerging economic power of China and India spells the end of the West as a superpower. In order to understand this possibility, we need to look back in time. Why has the West dominated the globe for the past 200 years, and will its power last? Describing the patterns of human history, the archaeologist and historian Ian Morris offers surprising new answers to both questions. It is not, he reveals, differences of race or culture, or even the strivings of great individuals that explain Western dominance. It is the effects of geography on the everyday efforts of ordinary people as they deal with crises of resources, disease, migration, and climate. As geography and human ingenuity continue to interact, the world will change in astonishing ways, transforming Western rule in the process.\r\n\r\nDeeply researched and brilliantly argued, Why the West Rules - for Now spans 50,000 years of history and offers fresh insights on nearly every page. The book brings together the latest findings across disciplines - from ancient history to neuroscience - not only to explain why the West came to rule the world but also to predict what the future will bring in the next hundred years.\r\n\r\nxx","last_updated":"2017-11-05T12:01:32.371Z","parsed":{"xt":"urn:btih:d5d46a7fa2f5a8392d16996d16a156cbb2de5fcd","dn":"Why the West Rules - for Now by Ian Morris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d5d46a7fa2f5a8392d16996d16a156cbb2de5fcd","infoHashBuffer":{"type":"Buffer","data":[213,212,106,127,162,245,168,57,45,22,153,109,22,161,86,203,178,222,95,205]},"name":"Why the West Rules - for Now by Ian Morris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}