{"title":"Default Folder X v5.1.5","magnet":"magnet:?xt=urn:btih:d5d626e44905c2366040599b8323f50dcc95b3fe&dn=Default+Folder+X+v5.1.5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"kopch","categoryP":"applications","categoryS":"mac","size":"6801009","seeders":"0","leechers":"0","description":"Default Folder X v5.1.5\r\n\r\nA status bar menu application for macOS designed to streamline the saving and opening files processes for any Mac-native utility\r\n\r\nThe default Open and Save dialogs included by default in Mac OS X don&#x2019;t have too many customization options. Default Folder X is a small utility that can help you personalize the entire experience by adding new locations, Spotlight tags, comments, and many more options.\r\n\r\nAccess favorite folders from the status bar and create your own folders lists\r\n\r\nThe Default Folder X status bar menu offers you the possibility to navigate to your default, favorite, and recent folders. At the same time, the menu also allows you to view all opened Finder windows and bring any of them forward.\r\n\r\nThe Default Folder X preferences can be adjusted via a Preferences Pane that will be added to your Systems Preferences. Here you can add specific directories to be used by default with certain applications. Furthermore, you can create your own Favorite Folders list.\r\n\r\nOpen and Save toolbar\r\n\r\nIf Default Folder X is running, each time you want to save or open a file in an OS X native  utility, the application will add a toolbar that provides all these options in a more easily accessible manner.\r\n\r\nTo navigate between the different menus, simply put your mouse on top of them. However, you can also make use of the keyboard shortcuts assigned by default to frequently used functions.\r\n\r\nIntegrated Spotlight and QuickLook options\r\n\r\nTo make sure that you can always find your files as fast as possible, Default Folder X enables you to add Spotlight keywords, tags, comments, or labels within the Save dialog.\r\n\r\nOn the other hand, when you are opening files, Default Folder X allows you to preview the documents in a thumbnail and even zoom to full size.\r\n\r\nIntuitive solution for customizing the default Save and Open dialog\r\n\r\nDefault Folder X is proposing simple solutions for personalizing your experience when opening or saving files. The app is focused on efficiency and will certainly improve your workflow","last_updated":"2017-08-20T12:01:24.372Z","parsed":{"xt":"urn:btih:d5d626e44905c2366040599b8323f50dcc95b3fe","dn":"Default Folder X v5.1.5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d5d626e44905c2366040599b8323f50dcc95b3fe","infoHashBuffer":{"type":"Buffer","data":[213,214,38,228,73,5,194,54,96,64,89,155,131,35,245,13,204,149,179,254]},"name":"Default Folder X v5.1.5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}