{"title":"Behind Closed Doors by B. A. Paris EPUB","magnet":"magnet:?xt=urn:btih:d6851840b5d3807b0eec2c2384dcd62b923aa9e5&dn=Behind+Closed+Doors+by+B.+A.+Paris+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"384711","seeders":"0","leechers":"0","description":"xx\r\n\r\nBehind Closed Doors by B. A. Paris EPUB\r\n\r\nThe instant New York Times and USA Today bestselling debut psychological thriller you can&apos;t miss!\r\n\r\nThe perfect marriage? Or the perfect lie?\r\n\r\n&quot;A hair-raising debut, both unsettling and addictive...A chilling thriller that will keep you reading long into the night.&quot; &#x2014;Mary Kubica, New York Times and USA Today bestselling author of The Good Girl\r\n\r\n&quot;This debut is guaranteed to haunt you...Warning: brace yourself.&quot; &#x2014;Bustle (10 New Thrillers to Read This Summer)\r\n\r\n&quot;The sense of believably and terror that engulfs Behind Closed Doors doesn&apos;t waver.&quot; &#x2014;The Associated Press, picked up by The Washington Post\r\n\r\nEveryone knows a couple like Jack and Grace. He has looks and wealth; she has charm and elegance. He&apos;s a dedicated attorney who has never lost a case; she is a flawless homemaker, a masterful gardener and cook, and dotes on her disabled younger sister. Though they are still newlyweds, they seem to have it all. You might not want to like them, but you do. You&apos;re hopelessly charmed by the ease and comfort of their home, by the graciousness of the dinner parties they throw. You&#x2019;d like to get to know Grace better.\r\n\r\nBut it&apos;s difficult, because you realize Jack and Grace are inseparable.\r\n\r\nSome might call this true love. Others might wonder why Grace never answers the phone. Or why she can never meet for coffee, even though she doesn&apos;t work. How she can cook such elaborate meals but remain so slim. Or why she never seems to take anything with her when she leaves the house, not even a pen. Or why there are such high-security metal shutters on all the downstairs windows.\r\n\r\nSome might wonder what&apos;s really going on once the dinner party is over, and the front door has closed.\r\n\r\nFrom bestselling author B. A. Paris comes the gripping thriller and international phenomenon Behind Closed Doors.\r\n\r\nxx","last_updated":"2017-12-13T12:00:54.919Z","parsed":{"xt":"urn:btih:d6851840b5d3807b0eec2c2384dcd62b923aa9e5","dn":"Behind Closed Doors by B. A. Paris EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d6851840b5d3807b0eec2c2384dcd62b923aa9e5","infoHashBuffer":{"type":"Buffer","data":[214,133,24,64,181,211,128,123,14,236,44,35,132,220,214,43,146,58,169,229]},"name":"Behind Closed Doors by B. A. Paris EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}