{"title":"Alexandra Wolfe - Valley of the Gods 2017 RETAiL ePUB eBOOK-DiST","magnet":"magnet:?xt=urn:btih:d700a2ec6592025d0939435b91a288258c0f4f8b&dn=Alexandra+Wolfe+-+Valley+of+the+Gods+2017+RETAiL+ePUB+eBOOK-DiST&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3625537","seeders":"0","leechers":"0","description":"Alexandra Wolfe - Valley of the Gods 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn a riveting, hilarious account, reporter Alexandra Wolfe exposes a world that is not flat but bubbling - the men and women of Silicon Valley, whose hubris and ambition are changing the world.\r\n\r\nEach year, young people from around the world go to Silicon Valley to hatch an idea, start a company, strike it rich, and become powerful and famous. In The Valley of the Gods, Wolfe follows three of these upstarts who have &quot;stopped out&quot; of college and real life to live and work in Silicon Valley in the hopes of becoming the next Mark Zuckerberg or Elon Musk. No one has yet documented the battle for the brightest kids, kids whose goals are no less than making billions of dollars - and the fight they wage in turn to make it there. They embody an American cultural transformation: A move away from the East Coast hierarchy of Ivy Leagues and country clubs toward the startup life and a new social order.\r\n\r\nMeet the billionaires who go to training clubs for 30-minute &quot;body slams&quot; designed to fit in with the start-up schedule; attend parties where people devour peanut butter-and-jelly sushi rolls; and date and seduce in a romantic culture in which thick glasses, baggy jeans, and a t-shirt is the costume of any sex symbol (and where a jacket and tie symbolize mediocrity). Through Wolfe&apos;s eyes, we discover how they date and marry, how they dress and live, how they plot and dream, and how they have created a business world and an economic order that has made us all devotees of them.\r\n\r\nA blistering, brilliant, and hysterical examination of this new ruling class, The Valley of the Gods presents tomorrow&apos;s strange new normal where the only outward signs of tech success are laptops and ideas","last_updated":"2017-06-07T12:00:28.851Z","parsed":{"xt":"urn:btih:d700a2ec6592025d0939435b91a288258c0f4f8b","dn":"Alexandra Wolfe - Valley of the Gods 2017 RETAiL ePUB eBOOK-DiST","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d700a2ec6592025d0939435b91a288258c0f4f8b","infoHashBuffer":{"type":"Buffer","data":[215,0,162,236,101,146,2,93,9,57,67,91,145,162,136,37,140,15,79,139]},"name":"Alexandra Wolfe - Valley of the Gods 2017 RETAiL ePUB eBOOK-DiST","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}