{"title":"Straight Flush_ The True Story of Six College Friends Who Dealt ","magnet":"magnet:?xt=urn:btih:d7070dc30439bf427d99fc3968855f636a7725c8&dn=Straight+Flush_+The+True+Story+of+Six+College+Friends+Who+Dealt+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2937192","seeders":"21","leechers":"13","description":"xx\r\n\r\nStraight Flush_ The True Story of Six College Friends Who Dealt Their Way to a Billion-Dollar Online Poker Empire ... by Ben Mezrich MOBI eBOOK-ZAK\r\n\r\nFrom the New York Times best-selling author of The Accidental Billionaires and Bringing Down the House - the sources for the films The Social Network and 21 - comes the larger-than-life true tale of a group of American college buddies who brilliantly built a billion-dollar online poker colossus based out of the hedonistic paradise of Costa Rica.\r\n\r\nOne problem: the U.S. Department of Justice was gunning for them....\r\n\r\nBased on extensive insider interviews and participation, acclaimed author Ben Mezrich&apos;s Straight Flush tells the captivating rags-to-riches tale of a group of University of Montana frat brothers who turned a weekly poker game in the basement of a local dive bar into AbsolutePoker.com, one of the largest online companies in the world, on par with some of the behemoths of the Internet. At its height, Absolute Poker was an online empire earning more than a million dollars a day, following savvy business strategy and even better luck. Its founders set up their operations in the exotic jungle paradise of Costa Rica, embracing an outrageous lifestyle of girls, parties, and money.\r\n\r\nMeanwhile, the gray area of U.S. and international law in which the company operated was becoming a lot more risky, and soon the U.S. Department of Justice had placed a bull&apos;s-eye on Absolute Poker. Should they fold - or double down and ride their hot hand? Straight Flush is an exclusive, never-before-seen look behind the headlines of one of the wildest business stories of the past decade.\r\n\r\nxx","last_updated":"2017-09-19T12:42:40.906Z","parsed":{"xt":"urn:btih:d7070dc30439bf427d99fc3968855f636a7725c8","dn":"Straight Flush_ The True Story of Six College Friends Who Dealt ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d7070dc30439bf427d99fc3968855f636a7725c8","infoHashBuffer":{"type":"Buffer","data":[215,7,13,195,4,57,191,66,125,153,252,57,104,133,95,99,106,119,37,200]},"name":"Straight Flush_ The True Story of Six College Friends Who Dealt ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}