{"title":"Tasha Eurich - Insight_ The Power of Self-Awareness in a Self-De","magnet":"magnet:?xt=urn:btih:d70fdf0a666cdc88da763f15220bee1b8f568d35&dn=Tasha+Eurich+-+Insight_+The+Power+of+Self-Awareness+in+a+Self-De&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13884160","seeders":"0","leechers":"0","description":"xx\r\n\r\nTasha Eurich - Insight_ The Power of Self-Awareness in a Self-Deluded World 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nDo you understand who you really are? Or how others really see you? We all know people with a stunning lack of self-awareness - but how often do we consider whether we might have the same problem?\r\n\r\nResearch shows that self-awareness is the meta-skill of the 21st century - the foundation for high performance, smart choices, and lasting relationships. Unfortunately we are remarkably poor judges of ourselves and how we come across, and it&apos;s rare to get candid, objective feedback from colleagues, employees, and even friends and family.\r\n\r\nIntegrating hundreds of studies with her own research and work in the Fortune 500 world, organizational psychologist Tasha Eurich shatters conventional assumptions about what it takes to truly know ourselves - like why introspection isn&apos;t a bullet train to insight, how experience is the enemy of self-knowledge, and just how far others will go to avoid telling us the truth about ourselves. Through stories of people who&apos;ve made dramatic self-awareness gains, she offers surprising secrets, techniques and strategies to help readers do the same - and therefore improve their work performance, career satisfaction, leadership potential, relationships and more.\r\n\r\nAt a time when self-awareness matters more than ever, Insight is the essential playbook for surviving and thriving in an unaware world.\r\n\r\nxx","last_updated":"2017-08-01T12:00:37.935Z","parsed":{"xt":"urn:btih:d70fdf0a666cdc88da763f15220bee1b8f568d35","dn":"Tasha Eurich - Insight_ The Power of Self-Awareness in a Self-De","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d70fdf0a666cdc88da763f15220bee1b8f568d35","infoHashBuffer":{"type":"Buffer","data":[215,15,223,10,102,108,220,136,218,118,63,21,34,11,238,27,143,86,141,53]},"name":"Tasha Eurich - Insight_ The Power of Self-Awareness in a Self-De","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}