{"title":"Cherie Deville, Gina Valentina 19 year Old Slut Teaches Anal Fia","magnet":"magnet:?xt=urn:btih:d7ba5088aadaa9e30d27e0b2ba629f907a329d89&dn=Cherie+Deville%2C+Gina+Valentina+19+year+Old+Slut+Teaches+Anal+Fia&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dawgknutz","categoryP":"porn","categoryS":"hd___movies","size":"3040102052","seeders":"9","leechers":"15","description":"Cherie Deville, Gina Valentina 19 year Old Slut Teaches Anal Fiance How to Serve Daddy / 42533 HD 720p\r\n\r\nRough Sex, Anal, Deep Throating, Hardcore, BDSM, Public\r\n\r\n <a href=\"\nhttp://imageshtorm.com/img-59af978b29f9d.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59af978b29f9d.html</a>  <a href=\"\nhttp://imageshtorm.com/img-59af97a06268b.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://imageshtorm.com/img-59af97a06268b.html</a> \r\n\r\n\r\n\r\nRoman Nomar find himself in a serious bind when his sexy new bombshell girlfriend Cherie DeVille and tiny little 19 year old slut step-daughter end up in the vacation house at the same time. Cherie is a gorgeous MILF ready to get engaged, but is shocked to find out Ramon is secretly domming his little undisciplined step daughter with hard cock, tight rope suspension, and a strict flogging hand. After spying on Ramon fucking the laziness out of Gina and beating her with her science book in the guest house she reveals her dismay and find herself on the right end of Ramon&apos;s dominant hand. Turns out she was as turned on as she was shocked and wants to take a turn as the submissive. Face fucking, hardcore anal, electro punishment, and a strict spanking solidify her commitment to Ramon and builds her jealousy torwards Gina. She confronts the little whore and when she gets sass, drags that little brat into the basement rips her dress off, gives her a good hard spanking, and makes her lick her daddy&apos;s cum out of Cherie&apos;s ass. Unfortunately for this newly minted mommy dommy, Ramon catches her doling out discipline that isn&apos;t hers to give and hands Gina a flogger to get her revenge. Clipping Cherie&apos;s greedy cunt shit he fucks her ass good while her teen rival beats her red and then shoves her fist into her new step-mother&apos;s gaping ass while her Daddy fucks both their cunts. When it&apos;s Gina&apos;s turn, bondage, cattle prod and a cream pie finish the session, with Cherie sucking the cum out of her future step-daughter&apos;s used up pussy. Double penetration, anal fisting, and ATM seal the new bond between Gina and Cherie","last_updated":"2017-09-06T12:02:06.633Z","parsed":{"xt":"urn:btih:d7ba5088aadaa9e30d27e0b2ba629f907a329d89","dn":"Cherie Deville, Gina Valentina 19 year Old Slut Teaches Anal Fia","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d7ba5088aadaa9e30d27e0b2ba629f907a329d89","infoHashBuffer":{"type":"Buffer","data":[215,186,80,136,170,218,169,227,13,39,224,178,186,98,159,144,122,50,157,137]},"name":"Cherie Deville, Gina Valentina 19 year Old Slut Teaches Anal Fia","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}