{"title":"Richard Kluger - Indelible Ink 2016 RETAiL ePUB eBOOK-DiSTRiBUTi","magnet":"magnet:?xt=urn:btih:d843723dd00cd76b7900f092aeb7eb55aa3016f6&dn=Richard+Kluger+-+Indelible+Ink+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5403231","seeders":"0","leechers":"0","description":"Richard Kluger - Indelible Ink 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe untold story of the battle to legalize free expression in America by the Pulitzer Prize-winning author of Ashes to Ashes.\r\n\r\nThe liberty of written and spoken expression has been fixed in the firmament of our social values since our nation&apos;s beginning - the government of the United States was the first to legalize free speech and a free press as fundamental rights. But when the British began colonizing the New World, strict censorship was the iron rule of the realm; any words, true or false, that were thought to disparage the government were judged a criminally subversive - and duly punishable - threat to law and order. Even after Parliament lifted press censorship late in the 17th century, printers published what they wished at their peril.\r\n\r\nSo when in 1733 a small newspaper, the New York Weekly Journal, printed scathing articles assailing the new British governor, William Cosby, as corrupt and abusive, colonial New York was scandalized. The paper&apos;s publisher, an impoverished printer named John Peter Zenger with a wife and six children, in fact had no hand in the paper&apos;s vitriolic editorial content - he was only a front man for Cosby&apos;s adversaries, New York Supreme Court Chief Justice Lewis Morris and the shrewd attorney James Alexander. Zenger nevertheless became the endeavor&apos;s courageous fall guy when Cosby brought the full force of his high office down upon it. Jailed for the better part of a year, Zenger faced a jury on August 4, 1735, in a proceeding matched in importance during the colonial period only by the Salem Witch Trials.\r\n\r\nIn Indelible Ink, acclaimed social historian Richard Kluger recreates in rich detail this dramatic clash of powerful antagonists that marked the beginning of press freedom in America and its role in vanquishing colonial tyranny. Here is an enduring lesson that resounds to this day on the vital importance of free public expression as the underpinning of democracy","last_updated":"2017-06-14T12:00:38.043Z","parsed":{"xt":"urn:btih:d843723dd00cd76b7900f092aeb7eb55aa3016f6","dn":"Richard Kluger - Indelible Ink 2016 RETAiL ePUB eBOOK-DiSTRiBUTi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d843723dd00cd76b7900f092aeb7eb55aa3016f6","infoHashBuffer":{"type":"Buffer","data":[216,67,114,61,208,12,215,107,121,0,240,146,174,183,235,85,170,48,22,246]},"name":"Richard Kluger - Indelible Ink 2016 RETAiL ePUB eBOOK-DiSTRiBUTi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}