{"title":"Maynard James Keenan - A Perfect Union of Contrary Things 2016 R","magnet":"magnet:?xt=urn:btih:d8708bf07e4d2b49dce36bd1e2c9827055f96deb&dn=Maynard+James+Keenan+-+A+Perfect+Union+of+Contrary+Things+2016+R&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"12830992","seeders":"32","leechers":"1","description":"Maynard James Keenan - A Perfect Union of Contrary Things 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThis is the official authorized biography of musician and vintner Maynard James Keenan, the enigmatic vocalist for Tool, A Perfect Circle, and Puscifer. Co-author Sarah Jensen&apos;s 30-year friendship with Keenan gives her unique insight into his history and career trajectory. The book traces Keenan&apos;s journey from his Midwest childhood to his years in the army to his time in art school, from his stint at a Boston pet shop to his place in the international spotlight and his influence on contemporary music and regional winemaking.\r\n\r\nA comprehensive portrayal of a versatile and dedicated artist, A Perfect Union of Contrary Things pays homage to the people and places that shaped the man and his art. Until now, Maynard&apos;s fans have had access to only an abridged version of his story. A Perfect Union of Contrary Things presents the outtakes, the scenes of disappointment and triumph, and the events that led him to take one step after the next, to change direction, to explore sometimes surprising opportunities. Included are sidebars in his own words, often humorous anecdotes that illuminate the narrative, as well as commentary by his family members, friends, instructors, and industry colleagues. The book also features a foreword by Alex Grey, an American visionary artist and longtime friend of Keenan. Maynard&apos;s story is a metaphor for the listener&apos;s own evolution and an encouragement to follow one&apos;s dreams, hold fast to individual integrity, and work ceaselessly to fulfill our creative potential","last_updated":"2017-05-27T09:03:50.061Z","parsed":{"xt":"urn:btih:d8708bf07e4d2b49dce36bd1e2c9827055f96deb","dn":"Maynard James Keenan - A Perfect Union of Contrary Things 2016 R","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d8708bf07e4d2b49dce36bd1e2c9827055f96deb","infoHashBuffer":{"type":"Buffer","data":[216,112,139,240,126,77,43,73,220,227,107,209,226,201,130,112,85,249,109,235]},"name":"Maynard James Keenan - A Perfect Union of Contrary Things 2016 R","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}