{"title":"\nThe Woulda Coulda Shoulda Guide to Canadian Inventions (gnv64)","magnet":"magnet:?xt=urn:btih:d87ec591bd85132763cf7a18249f9154c7fdb24e&dn=The+Woulda+Coulda+Shoulda+Guide+to+Canadian+Inventions+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"22660188","seeders":"0","leechers":"0","description":"The Woulda Coulda Shoulda Guide to Canadian Inventions\r\nby Red Green\r\nDoubleday Canada | October  2017 | ISBN-10: 0385687397 | ePUB | 19 mb\r\n\r\nOne of Canada&apos;s greatest inventors appraises his peers, with mixed results.\r\n \r\n     The author of How to Do Everything and Red Green&apos;s Beginner&apos;s Guide to Women has never been afraid to take on jobs doomed to failure. This latest project is perhaps the nearest he has come to a triumph. In The Woulda Coulda Shoulda Guide to Canadian Inventions Red surveys, analyzes, critiques and in some cases tells you how to recreate at home, the best Canadian inventions, from the Wonderbra to the hard-cup jockstrap, by way of insulin, the walkie-talkie, synchronized swimming and more world-changing innovations than you can wave a Canadarm at. \r\n     And speaking of the Canadarm, Red shows how by simply combining common household items such as a cordless drill, metal tape measure, broomstick, ice tongs, bungee cord, fishing reel and, of course, the handyman&apos;s secret weapon&#x2014;duct tape&#x2014;you will in no time at all be lifting oranges out of the fruit bowl like a trained astronaut. Elsewhere, Red explains definitively the difference between the alkaline battery and Al Kaline, who played right field for the Detroit Tigers. And he reveals how Lodge Member Dennis Holmsworth&apos;s test-run of magnetic shoes along the underside of the Mercury Creek Railway Bridge literally came undone as a result of poor lace-tying skills.\r\n     A rallying call to handymen and handywomen everywhere to aim high, and however badly you might miss, this book is a reminder that you are not alone.\r\n\r\nAbout the Author\r\nRED GREEN is the star of The Red Green Show. He has been called the world&#x2019;s handiest man, though mostly by himself. He spends most of his time in Possum Lodge, Chapter 11, a northern Ontario eyesore\r\nRed Green&apos;s motto: Quando omni flunkus moritati (When all else fails, play dead)\r\n <a href=\"\nhttps://s1.postimg.org/1ye4dal3zz/The_Woulda_Coulda_Shoulda_Guide_to_Canadian_Inventions.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s1.postimg.org/1ye4dal3zz/The_Woulda_Coulda_Shoulda_Guide_to_Canadian_Inventions.jpg</a>","last_updated":"2017-10-21T12:01:31.472Z","parsed":{"xt":"urn:btih:d87ec591bd85132763cf7a18249f9154c7fdb24e","dn":"The Woulda Coulda Shoulda Guide to Canadian Inventions (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d87ec591bd85132763cf7a18249f9154c7fdb24e","infoHashBuffer":{"type":"Buffer","data":[216,126,197,145,189,133,19,39,99,207,122,24,36,159,145,84,199,253,178,78]},"name":"The Woulda Coulda Shoulda Guide to Canadian Inventions (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}