{"title":"Zona 2.0.0.6 + Portable [CracksNow]","magnet":"magnet:?xt=urn:btih:d885d7e35f68063c10e25b6d6fcbca8db83cfa56&dn=Zona+2.0.0.6+%2B+Portable+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"178644477","seeders":"0","leechers":"0","description":"Zona - it is easy to use software to search, display and download any movies, TV series available on request. You no longer need to run the sites, torrent tracker in the search for new products in good quality films. Opening the program Zona just start to watch and download anything you want. All great films cataloged, you can select the required quality, good selection of very large (about 20-25 options on a single picture). Zona - this is an excellent alternative to uTorrent, especially considering the fact that there&apos;s no rating system, both on torrent trackers. Work in the program is very simple. Also, there are three skins to choose from, so you can easily change the overall look of the program. \r\n\r\nFeatures : \r\n90 000 Movies \r\nBlockbusters and fresh releases, art house, animated films &#x2014; we have movies to fit every taste and mood. Watch high-quality movies online now or download them to watch later. Zona always finds the best variant but you can choose quality, size, audio and subtitles. \r\n\r\n10 000 Series \r\nAll popular TV series. From Santa Barbara to the Big Bang Theory. The episodes are allocated to the seasons so it&#x2019;s easy to find required episode. Zona memorizes the moment where you stopped watching the episode last time and starts from this moment when you come back. \r\n\r\n1400 Games \r\nOnly the best modern games. Download and play. \r\nTrailers, screenshots, descriptions and install instructions are included. \r\n\r\n150 TV Channels \r\nTV Channels are broadcasted by Zona in real-time. No additional devices needed. Channels are subdivided into categories: from news and education to kidvid and adult. The line-up is also shown here","last_updated":"2017-08-27T12:03:24.990Z","parsed":{"xt":"urn:btih:d885d7e35f68063c10e25b6d6fcbca8db83cfa56","dn":"Zona 2.0.0.6   Portable [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d885d7e35f68063c10e25b6d6fcbca8db83cfa56","infoHashBuffer":{"type":"Buffer","data":[216,133,215,227,95,104,6,60,16,226,91,109,111,203,202,141,184,60,250,86]},"name":"Zona 2.0.0.6   Portable [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}