{"title":"Virtual Audio Cable A and B","magnet":"magnet:?xt=urn:btih:d8d16bc251e175031625c245413a05eabae03c81&dn=Virtual+Audio+Cable+A+and+B&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"nat69999","categoryP":"applications","categoryS":"windows","size":"2147902","seeders":"15","leechers":"1","description":"Virtual Audio Cable A and B \r\n\r\nVirtual Audio Cable software allows you to transfer audio (wave) streams between applications and/or devices. It creates a set of virtual audio devices named &quot;Virtual Cables&quot;, each of them consists of a pair of the waveform input/output devices. Any application can send audio stream to an output side of a cable, and any other application can receive this stream from an input side. All transfers are made digitally, providing NO sound quality loss (a bitperfect streaming).\r\n\r\nVAC behavior is similar to &quot;What You Hear&quot; (or &quot;What U Hear&quot;, &quot;Stereo Mix&quot;) feature of Sound Blaster Live! and Audigy cards. But it is only similar, not equivalent. If you simply need a function like &quot;Stereo Mix&quot; under Vista/Win7/Win8, there could be better to try to enable it in your audio adapter.\r\n\r\nIf more than one applications are sending audio to Virtual Cable device, VAC mixes all streams together. If more than one applications are receiving audio from Virtual Cable device, VAC distributes the same audio data among all targets.\r\n\r\nVAC is useful to record application&apos;s audio output in real time (audio player, instant messenger or software synthesizer), or transfer a sound stream to another application processing it. You can, for example, use two or more software audio players/generators/synthesizers/sequencers to produce audio streams, sending them to Virtual Cablet device and record a mixed stream from the same Virtual Cable device, using any recording software - Windows Sound Recorder, Audacity, Sound Forge, WaveLab, Adobe Audition (formerly Cool Edit Pro), Gold Wave, Cakewalk/Sonar, Cubase/Nuendo etc.\r\n\r\nWith an ASIO wrapper like ASIO4ALL from Michael Tippach, you can use VAC in ASIO supporting applications.\r\n\r\nIf you use an audio encoder application that encodes a stream coming from a sound card, you can use VAC to supply such encoder with a stream produced by other application.\r\n\r\nYou can use VAC to capture an output sound stream from the application that doesn&apos;t allow to write it into WAV file directly. Unlike Total Recorder allowing you to simply save audio stream, VAC allows to route it in real time.\r\n\r\nIf you are using some Voice Over IP (VoIP) and/or Internet Telephony applications like Skype, you can use VAC to record your calls and conversations.\r\n\r\nVAC needs no hardware audio card; it is a &quot;virtual audio card&quot; itself.\r\n\r\n\r\n\r\nInstallation\r\n\r\n        UnZip and Install\r\n\r\n\r\n\r\n\r\n\r\n          &#x2022;  That&apos;s it! Done","last_updated":"2017-06-19T12:04:37.998Z","parsed":{"xt":"urn:btih:d8d16bc251e175031625c245413a05eabae03c81","dn":"Virtual Audio Cable A and B","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d8d16bc251e175031625c245413a05eabae03c81","infoHashBuffer":{"type":"Buffer","data":[216,209,107,194,81,225,117,3,22,37,194,69,65,58,5,234,186,224,60,129]},"name":"Virtual Audio Cable A and B","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}