{"title":"CodeTyphon615","magnet":"magnet:?xt=urn:btih:d9d00c603ec130c438fcbf5cc4849679a3c9c5bf&dn=CodeTyphon615&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"OpenSrcCoder","categoryP":"other","categoryS":"other","size":"686942005","seeders":"4","leechers":"3","description":"CodeTyphon Studio 6.15 - installation zip file for all OSes.\r\n\r\nRelease date: 21-Apr-2017 \r\n\r\n---------------------\r\n\r\nCodeTyphon is the Free &quot;Pascal Visual Programming Studio&quot;, for Cross-Platform Native Development, with Multi-OS, Multi-CPU, Multi-Platform and Cross-Build abilities.\r\n\r\nYes, it&apos;s a Free and Open-Source, &quot;Tera&quot; Programming Studio, which offers you the ability to build any kind of application, Commercial or Non-Commercial without any restrictions.\r\n\r\nCodeTyphon has Typhon V-IDE (Visual Integrated Development Environment)+\r\nFreePascal compiler+Tools+Free Components packages+Free Libraries+\r\ntons of samples and all these are Free and Open-Source.\r\n\r\nCodeTyphon Programming Studio is completely free of cost for you to develop, enjoy and share. \r\nWe believe we should use and distribute the software and it&apos;s content, we promote to accomplish our mission of advancing free software.\r\nWe provide free alternatives to proprietary code and content to make CodeTyphon completely free and redistributable for everyone.\r\nThis way, anyone can use our work for their own purposes, without legal hassles, to further spread free software.\r\n\r\nCodeTyphon has been designed to be simple to operate yet powerful enough to fulfill all your professional and industrial programming needs.\r\nWe&apos;ve added many new features to CodeTyphon over the course of its development.\r\nOur focus is on delivering power and usability at the same time and making your software development enjoyable without overloading your senses.\r\n\r\nWe intend to continue improving and stabilizing CodeTyphon to give you the best programming experience possible.\r\nWe hope you will have a good time using CodeTyphon.\r\n\r\nIf not, please help us make it better by reporting bugs and suggestions to our Forums.\r\n\r\n\r\nCodeTyphon is licensed as: Freeware","last_updated":"2017-06-13T12:05:43.063Z","parsed":{"xt":"urn:btih:d9d00c603ec130c438fcbf5cc4849679a3c9c5bf","dn":"CodeTyphon615","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d9d00c603ec130c438fcbf5cc4849679a3c9c5bf","infoHashBuffer":{"type":"Buffer","data":[217,208,12,96,62,193,48,196,56,252,191,92,196,132,150,121,163,201,197,191]},"name":"CodeTyphon615","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}