{"title":"The Sandbox Evolution - Craft a 2D Pixel Universe! v1.3.1.8","magnet":"magnet:?xt=urn:btih:d9e9a44da86a5f6dfa722d567e0386b08b5ff32d&dn=The+Sandbox+Evolution+-+Craft+a+2D+Pixel+Universe%21+v1.3.1.8&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"196514953","seeders":"4","leechers":"3","description":"Use your godly powers to craft amazing pixel worlds or destroy the universe! Welcome to The Sandbox Evolution, the #1 pixel art world creation game.Play with physics, over 200 elements and controllable heroes. Make your own games or levels, and then share your creations online. There are no limits to your creativity and imagination!- Click to drop elements, use your keyboard and mouse to zoom and scroll, control heroes with your gaming controller or keyboard. - Create or destroy with your mouse!- Amazing HD pixel art graphics featuring multiple visual effects, parallax scrolling and more - Build worlds up to 10x bigger than in the previous Sandbox game- Draw original art or fanboy tributes to your favorite retro characters with over 100 colors- Create your own levels using Blocks and other Platforming elements- Compose chiptune melodies and become a retro maestro- Share your creations in the Online Gallery- Save and Sync your progress online with Steam or Email- Follow your favorite Players and Top Creators via the Social Menu- Full support for the Steam Controller to create worlds and control the heroes characters inside levels made by others playersCREATE YOUR WORLD PIXEL AFTER PIXEL!- Build a 2D pixel world by mixing and matching over 200 elements to discover their interactions- Use predefined templates or start from scratch: Music, Pixel Art, Sandbox, Caveman or Avatar- Manipulate Natural elements: Mud, Water, Sand, Fire, Metal, Electricity","last_updated":"2017-07-04T12:02:56.963Z","parsed":{"xt":"urn:btih:d9e9a44da86a5f6dfa722d567e0386b08b5ff32d","dn":"The Sandbox Evolution - Craft a 2D Pixel Universe! v1.3.1.8","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d9e9a44da86a5f6dfa722d567e0386b08b5ff32d","infoHashBuffer":{"type":"Buffer","data":[217,233,164,77,168,106,95,109,250,114,45,86,126,3,134,176,139,95,243,45]},"name":"The Sandbox Evolution - Craft a 2D Pixel Universe! v1.3.1.8","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}