{"title":"The Bad Food Bible by Aaron Carroll EPUB","magnet":"magnet:?xt=urn:btih:da17ca5edf9dba90318e5e7e4533dfcaf12053bc&dn=The+Bad+Food+Bible+by+Aaron+Carroll+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2918275","seeders":"16","leechers":"11","description":"xx\r\n\r\nThe Bad Food Bible by Aaron Carroll EPUB\r\n\r\nPhysician and popular New York Times Upshot contributor Aaron Carroll mines the latest evidence to show that many &quot;bad&quot; ingredients actually aren&apos;t unhealthy, and in some cases are essential to our well-being.\r\n\r\nAdvice about food can be confusing. There&apos;s usually only one thing experts can agree on: some ingredients - often the most enjoyable ones - are bad for you, full stop. But as Aaron Carroll explains, these oversimplifications are both wrong and dangerous: if we stop consuming some of our most demonized ingredients altogether, it may actually hurt us. In The Bad Food Bible, Carroll examines the scientific evidence, showing among other things that you can:\r\n\r\nEat red meat several times a week: The health effects are negligible for most people, and actually positive if you&apos;re 65 or older.\r\nHave a drink or two a day: As long as it&apos;s in moderation, it will protect you against cardiovascular disease without much risk.\r\nEnjoy a gluten-loaded bagel from time to time: It has less fat and sugar, fewer calories, and more fiber than a gluten-free one.\r\nEat more salt: If your blood pressure is normal, you should be more worried about getting too little sodium than having too much.\r\n\r\nFull of counterintuitive lessons about food we hate to love, The Bad Food Bible is for anyone who wants to forge eating habits that are sensible, sustainable, and occasionally indulgent.\r\n\r\nxx","last_updated":"2017-11-07T12:02:39.357Z","parsed":{"xt":"urn:btih:da17ca5edf9dba90318e5e7e4533dfcaf12053bc","dn":"The Bad Food Bible by Aaron Carroll EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"da17ca5edf9dba90318e5e7e4533dfcaf12053bc","infoHashBuffer":{"type":"Buffer","data":[218,23,202,94,223,157,186,144,49,142,94,126,69,51,223,202,241,32,83,188]},"name":"The Bad Food Bible by Aaron Carroll EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}