{"title":"Iron Wings Air Combat (MuLTi-5)-SKiDRoW","magnet":"magnet:?xt=urn:btih:dc0ab577c1479d0d86cb230e08d10ac659156076&dn=Iron+Wings+Air+Combat+%28MuLTi-5%29-SKiDRoW&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"MattClack37","categoryP":"games","categoryS":"pc","size":"1312879171","seeders":"7","leechers":"11","description":"Iron Wings Air Combat (MuLTi-5)-SKiDRoW\r\n\r\nLANGUAGES:\r\n\r\nEnglish\t\t\t\r\nFrench\t\t\t\r\nItalian\t\t\t\r\nSpanish\t\t\t\r\nRussian\r\n\r\n\r\nABOUT THIS GAME\r\n\r\nARCADE-ACTION WWII air combat - \r\nPlayer takes on the role of the two pilots, Jack and Amelia, as they attempt to take down Nazi aerial menace across a rich campaign of missions, each with numerous objectives and enemies as well as side objectives. While fast paced action goes you will also have to consider some strategy, assigning your partner primary objectives to shoot down, in order to succeed. \r\n\r\nIron Wings is primarily and arcade game, a flying shooter, where shooting won&apos;t be enough, where each weapon or tool mounted on each of the two planes will have its role on completing each mission, and you&apos;ll have to deal with the decision on what to do and how to do it. \r\n\r\nDuring flight, you will control both pilots and their plane, switching between them anytime you need, and assigning orders to the other one. Each of the two planes you will pick will carry different extra tools to be used during the mission. \r\n\r\nExtra tools as Chaffs and Magnetron as radar countermeasures, Photo Camera to report detailed visuals of some objectives, Search Light to discover and focus targets on night scenarios and more to discover. \r\n\r\nWise choice of camouflages will also influence your visibility to enemies, and consequentially will help you avoid some damages. \r\n\r\nIron Wings follows the story of two childhood friends who join the war in a special air force squadron. Under the guidance of Colonel David Ruse, their objective is to locate and stop the general Adler ahead of the &apos;Ahnenerbe&apos;, a secret team of Nazi archaeologists and scientists. \r\n\r\nGame starts during a fund raising in NY and rapidly moving into war operations with the Operation Husky (the invasion of Sicily) following the real events in the search for Adler. \r\n\r\nPilots will face aerial and ground missions from NY, rebuilt in deep detail as in the &#x2018;40s, and other USA locations as Black Canyon, to many of the real battlefields along Europe, from Sicily to Naples passing through Poland and Germany.\r\n\r\nSYSTEM REQUIREMENTS:\r\n\r\nMINIMUM:\r\nOS: Windows 7, Windows 8 or Windows 10\r\nProcessor: AMD or Intel Dual-Core processor running at ~3.3 GHz (minimum AMD Phenom II X4 810 or Intel Core i5 650).\r\nMemory: 4 GB RAM\r\nGraphics: DirectX 9 compatible NVIDIA, ATI/AMD graphic card with 2GB of dedicated VRAM (and Shader Model 3.0 support).\r\nDirectX: Version 9.0c\r\nStorage: 2 GB available space\r\nSound Card: Any\r\nAdditional Notes: Keyboard Supported - Steam Controller, XBox Controller or compatible Recommended\r\n\r\nRECOMMENDED:\r\nOS: Windows 7, Windows 8 or Windows 10\r\nProcessor: AMD Quad-Core running at ~2.7 GHz or Intel Quad-Core with HT processor running at ~3.3 GHz (Intel Core i7 or AMD APU A6 3670 and newer architectures are recommended).\r\nMemory: 6 GB RAM\r\nGraphics: DirectX 11 compatible NVIDIA, ATI/AMD graphic card with 4GB of dedicated VRAM (and Shader Model 4.0 support).\r\nDirectX: Version 9.0c\r\nStorage: 2 GB available space\r\nSound Card: Any\r\nAdditional Notes: Keyboard Supported - Steam Controller, XBox Controller or compatible Recommended","last_updated":"2017-06-17T12:03:41.034Z","parsed":{"xt":"urn:btih:dc0ab577c1479d0d86cb230e08d10ac659156076","dn":"Iron Wings Air Combat (MuLTi-5)-SKiDRoW","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dc0ab577c1479d0d86cb230e08d10ac659156076","infoHashBuffer":{"type":"Buffer","data":[220,10,181,119,193,71,157,13,134,203,35,14,8,209,10,198,89,21,96,118]},"name":"Iron Wings Air Combat (MuLTi-5)-SKiDRoW","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}