{"title":"\n[MissaX / Clips4sale] Alexis Fawx (Close your Eyes)","magnet":"magnet:?xt=urn:btih:dca2cc92ae5c3a2147030fe07c9d044632c239e0&dn=%5BMissaX+%2F+Clips4sale%5D+Alexis+Fawx+%28Close+your+Eyes%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Vikcy41","categoryP":"porn","categoryS":"movie_clips","size":"295586374","seeders":"37","leechers":"20","description":"[MissaX / Clips4sale] Alexis Fawx (Close your Eyes)\r\n\r\nMy girlfriend Sarah broke it off with me. I&apos;m pretty heartbroken about it, I thought she was the one. Sarah doesn&apos;t want to date a guy with a broken dick, and she didn&apos;t outright say it, but we both know that&apos;s why she doesn&apos;t want to screw around anymore.\r\nMy Uncle Paul is a urologist, but he&apos;s the top urologist in the country, and he&apos;s a huge deal in my hometown Chicago. I&apos;m having an issue where I need to see a doctor like him, and I figure since he&apos;s my uncle he&apos;ll keep my visit to him on the down-low. I still have to pay him, but he promised to give me a break.\r\nI see my beautiful mother on the couch and I ask her, &quot;can I borrow your car?&quot; She lifts up, &quot;sure, where are we going?&quot; Mom is so used to me bringing her around on errands, to appointments, and even out with friends, she&apos;s a cool mom.. mot like those stuffy, bloated high-waisted soccer moms that you&apos;re used to seeing. She shines her smile at me and doesn&apos;t buy my whole &quot;gotta hang out with the guys and do guy stuff&quot; line. I hate to lie to her so I give her a half truth, &quot;I&apos;m going to hang out with Uncle Paul.&quot;\r\nMom raised her eyebrow, and I knew she was suspicious. Her brother doesn&apos;t hang around our family much, he&apos;s all about business first, family second. Mom hates that he has a new hottie girlfriend every week, she thinks his collection of sports cars are ridiculous, and his Penthouse Condo downtown is &quot;a bit much.&quot; She&apos;s got a way of wiggling the truth out of me and I confess to her the most embarrassing secret of my entire life. &quot;I cannot keep an erection during sex,&quot; and her jaw drops in shock and pity, &quot;it&apos;s why Sarah broke it off with me.&quot; I see the gears turning in my mother&apos;s head, she thinks she can solve every problem, especially if it involves me. She tells me that all I need to do is find a woman who will build my confidence with patience and love. Mom&apos;s beautiful lips part, and she tells me, &quot;close your eyes.&quot;\r\nI hate to think that she&apos;ll touch me, would she? I mean.. a part of me really wants her to, but I know it&apos;s wrong. I search my brain to tell me what to do, what&apos;s right? It&apos;s my mom telling me to do something for her, and I should obey her, you should always obey your mother.. but oh God, would she touch me inappropriately? I don&apos;t think she has that in her. We&apos;ve always been close, but not &quot;that kind of close.&quot; My mom is stunning and if I wasn&apos;t her son, I would give in to whatever she wanted, but it&apos;s not right by law, by nature, to.. &quot;CLOSE YOUR EYES,&quot; she interrupts my inner-voice with her strict instruction, and oh God-- I do it. I closed my eyes and waited with the hairs standing up on the back of my neck, my blood pumping through my body, my senses were all heightened with anticipation.\r\n <a href=\"\nhttp://ximagehost.org/img-59c7475651b03.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59c7475651b03.html</a>\r\n <a href=\"\nhttp://ximagehost.org/img-59c747309c60c.html\" rel=\"nofollow\" target=\"_NEW\">\nhttp://ximagehost.org/img-59c747309c60c.html</a>","last_updated":"2017-09-24T12:08:48.541Z","parsed":{"xt":"urn:btih:dca2cc92ae5c3a2147030fe07c9d044632c239e0","dn":"[MissaX / Clips4sale] Alexis Fawx (Close your Eyes)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dca2cc92ae5c3a2147030fe07c9d044632c239e0","infoHashBuffer":{"type":"Buffer","data":[220,162,204,146,174,92,58,33,71,3,15,224,124,157,4,70,50,194,57,224]},"name":"[MissaX / Clips4sale] Alexis Fawx (Close your Eyes)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}