{"title":"The Confusion by Neal Stephenson epub RtR","magnet":"magnet:?xt=urn:btih:dcd01c33b8b1b8be40de5cd6c4b199b95c99e339&dn=The+Confusion+by+Neal+Stephenson+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3373507","seeders":"0","leechers":"0","description":"The Confusion by Neal Stephenson epub RtR\r\n\r\nIn the year 1689, a cabal of Barbary galley slaves, including one &#x201C;Half-Cocked Jack&#x201D; Shaftoe, devises a daring plan to win freedom and fortune. A great adventure ensues that will place the intrepid band at odds with the mighty and the mad, with alchemists, Jesuits, great navies, pirate queens, and vengeful despots across vast oceans and around the globe.\r\n\r\nBack in Europe, the exquisite and resourceful Eliza, Countess de la Zeur, master of markets, pawn and confidante of enemy kings, onetime Turkish harem virgin, is stripped of her immense personal fortune by France&#x2019;s most dashing privateer. Penniless and at risk from those who desire either her or her head (or both), she is caught up in a web of international intrigue, even as she desperately seeks the return of her most precious possession -- her child.Meanwhile, Newton and Leibniz continue to propound their grand theories as their infamous rivalry intensifies. And Daniel Waterhouse seeks passage to the Massachusetts colony in hopes of escaping the madness into which his world has descended.\r\n\r\nThe Baroque Cycle, Neal Stephenson&#x2019;s award-winning series, spans the late 17th and early 18th centuries, combining history, adventure, science, invention, piracy, and alchemy into one sweeping tale. It is a gloriously rich, entertaining, and endlessly inventive historical epic populated by the likes of Isaac Newton, William of Orange, Benjamin Franklin, and King Louis XIV, along with some of the most inventive literary characters in modern fiction","last_updated":"2017-07-02T12:00:35.541Z","parsed":{"xt":"urn:btih:dcd01c33b8b1b8be40de5cd6c4b199b95c99e339","dn":"The Confusion by Neal Stephenson epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dcd01c33b8b1b8be40de5cd6c4b199b95c99e339","infoHashBuffer":{"type":"Buffer","data":[220,208,28,51,184,177,184,190,64,222,92,214,196,177,153,185,92,153,227,57]},"name":"The Confusion by Neal Stephenson epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}