{"title":"\nSearching for Sharing Heritage and Multimedia in Africa (gnv64)","magnet":"magnet:?xt=urn:btih:dcf0d895d3b72a8e30c24aa33901757642400017&dn=Searching+for+Sharing+Heritage+and+Multimedia+in+Africa+%28gnv64%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gnv65","categoryP":"other","categoryS":"e_books","size":"143626752","seeders":"0","leechers":"0","description":"Searching for Sharing: Heritage and Multimedia in Africa (World Oral Literature Series)\r\nby Daniela Merolla and Mark Turin\r\nOpen Book Publishers | May  2017 | ISBN-10: 1783743182 | True PDF | 160 Pages | 136 mb\r\n\r\nIn a world where new technologies are being developed at a dizzying pace, how can we best approach oral genres that represent heritage? Taking an innovative and interdisciplinary approach, this volume explores the idea of sharing as a model to construct and disseminate the knowledge of literary heritage with the people who are represented by and in it.\r\nExpert contributors interweave sociological analysis with an appraisal of the transformative impact of technology on literary and cultural production. Does technology restrict, constraining the experience of an oral performance, or does it afford new openings for different aesthetic experiences? Topics explored include the Mara Cultural Heritage Digital Library, the preservation of Ewe heritage material, new eresources for texts in Manding languages, and the possibilities of technauriture.\r\n\r\n\r\nAbout the Authors\r\nMark Turin is an anthropologist, linguist and broadcaster. He is Associate Professor of Anthropology at the University of British Columbia and serves as Chair of the First Nations and Endangered Languages Program and Acting Co-Director of the University&#x2019;s new Institute for Critical Indigenous Studies.\r\nDaniela Merolla is Professor in Berber Literature and Art at the Institut National des Langues et Civilisations Orientales, Sorbonne Paris-Cit&#xE9; (INALCO) and member of the research group LACNAD (Langues et Cultures du Nord de l&#x2019;Afrique et Diasporas). She taught and researched African Literatures and Media at Leiden University from 2003 to 2015.\r\n\r\nCONTENTS\r\nNotes on Contributors\r\nIntroduction - Daniela Merolla\r\n1. The Mara Cultural Heritage Digital Library: The Implications of the Digital Return of Oral Tradition\r\nJan Bender Shetler\r\n2. Technauriture as a Platform to Create an Inclusive Environment for the Sharing of Research\r\nRussell H. Kaschula\r\n3. From Restitution to Redistribution of Ewe Heritage: Challenges and Prospects\r\nKofi Dorvlo\r\n4. YouTube in Academic Teaching: A Multimedia Documentation of Siramori Diabat&#xE9;&#x2019;s Song &quot;Nanyuman&#x201D;\r\nBrahima Camara, Graeme Counsel and Jan Jansen\r\n5. New Electronic Resources for Texts in Manding Languages\r\nValentin Vydrin\r\n6. Questioning &quot;Restitution&#x201D;: Oral Literature in Madagascar\r\nBrigitte Rasoloniaina and Andriamanivohasina Rakotomalala\r\nAfterword: Sharing Located - Mark Turin\r\n <a href=\"\nhttps://s1.postimg.org/6cgcynsu27/Searching_for_Sharing.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s1.postimg.org/6cgcynsu27/Searching_for_Sharing.jpg</a>","last_updated":"2017-10-07T12:08:02.307Z","parsed":{"xt":"urn:btih:dcf0d895d3b72a8e30c24aa33901757642400017","dn":"Searching for Sharing Heritage and Multimedia in Africa (gnv64)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dcf0d895d3b72a8e30c24aa33901757642400017","infoHashBuffer":{"type":"Buffer","data":[220,240,216,149,211,183,42,142,48,194,74,163,57,1,117,118,66,64,0,23]},"name":"Searching for Sharing Heritage and Multimedia in Africa (gnv64)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}