{"title":"Selfie: How We Became So Self-obsessed And What It's Doing To Us","magnet":"magnet:?xt=urn:btih:dd5758d75b5c32e8c3dfde0faeb5c4eb6492c713&dn=Selfie%3A+How+We+Became+So+Self-obsessed+And+What+It%27s+Doing+To+Us&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"2773761","seeders":"0","leechers":"0","description":"Selfie: How We Became So Self-obsessed And What It&apos;s Doing To Us/Will Storr/2017/ EPUB/\r\n\r\nEnglish|Non-Fiction|ISBN-10: 1468315897|416pg|\r\n\r\nBy the author of The Unpersuadables, this thrilling and ambitious book explores the mysterious power of the self and reveals the danger of our modern obsession with it.\r\n\r\nWe live in the age of the individual. Every day, we&#x2019;re bombarded with depictions of the beautiful, successful, slim, socially conscious, and extroverted individual that our culture has decided is the perfect self, and we berate ourselves when we don&#x2019;t measure up.\r\n\r\nThis model of the perfect self and the impossibly high standards it sets can be extremely dangerous. People are suffering under the torture of this impossible fantasy, and unprecedented social pressure is leading to increases in depression and suicide.\r\n\r\nJournalist and novelist Will Storr began to wonder about this perfect self that torments so many of us: Where does this ideal come from? Why is it so powerful? Is there any way to break its spell?\r\n\r\nTo answer these questions, Storr takes the reader on a journey from the shores of Ancient Greece, through the Christian Middle Ages, to the self-esteem evangelists of 1980s California, the rise of narcissism and the &#x201C;selfie&#x201D; generation, and right up to the era of hyper-individualism in which we live now. Selfie tells the epic tale of the person we all know so intimately&#x2015;because it&#x2019;s us.\r\n\r\n\r\nWill Storr is an award-winning novelist and long-form journalist. He has reported from refugee camps in Africa, war-torn rural Colombia, and remote Aboriginal communities in Australia. He is a contributing editor at Esquire, and his work has appeared in The New Yorker, The Observer, The Sunday Times, and The Guardian","last_updated":"2017-07-02T12:00:26.392Z","parsed":{"xt":"urn:btih:dd5758d75b5c32e8c3dfde0faeb5c4eb6492c713","dn":"Selfie: How We Became So Self-obsessed And What It's Doing To Us","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dd5758d75b5c32e8c3dfde0faeb5c4eb6492c713","infoHashBuffer":{"type":"Buffer","data":[221,87,88,215,91,92,50,232,195,223,222,15,174,181,196,235,100,146,199,19]},"name":"Selfie: How We Became So Self-obsessed And What It's Doing To Us","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}