{"title":"Prisoner of Trebekistan_ A Decade in Jeopardy! by Bob Harris ePU","magnet":"magnet:?xt=urn:btih:ddd7267d177f22bfba2c6ace00ccd015b32e4e5e&dn=Prisoner+of+Trebekistan_+A+Decade+in+Jeopardy%21+by+Bob+Harris+ePU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1898575","seeders":"0","leechers":"0","description":"xx\r\n\r\nPrisoner of Trebekistan_ A Decade in Jeopardy! by Bob Harris ePUB MOBI eBOOK-ZAK\r\n\r\nA.: This is the story of a working-class guy from Ohio with little real knowledge of Ambidextrous Presidents, Things Made from Rubber, and hundreds of other categories, but who nonetheless plunges so far into cramming for Jeopardy! that it changes his relationships, bends his worldview, and literally leads him to the ends of the earth, trying to understand it all.\r\n\r\nQ.: What is Prisoner of Trebekistan?\r\n\r\nWelcome to a world where obscure information is crucial to survival, vast sums of cash are at stake, and milliseconds can change not just a game but the course of your entire life. (Plus, you could win two Camaros and enough Bon Ami cleanser to scrub a small nation.)\r\n\r\nPrisoner of Trebekistan is Bob Harris&apos;s hilarious, insightful account of one man&apos;s unlikely epic journey through Jeopardy!, gleefully exploring triumph and failure, the nature of memory, and how knowledge itself can transform you in unpredictable ways - all against the backdrop of the most popular quiz show in history.\r\n\r\nIn Prisoner of Trebekistan, Bob chronicles his transformation from a struggling stand-up comic who repeatedly fails the Jeopardy! audition test into an elite player competing against the show&apos;s most powerful brains. To get there, he embarks on a series of intense study sessions, using his sense of humor to transform conventional memory skills into a refreshingly playful approach to learning that&apos;s as amusing as it is powerful. What follows is not only a captivating series of high-stakes wins and losses on Jeopardy!, but also a growing appreciation of a borderless world that Bob calls Trebekistan, where a love of learning reigns and the smarter you get the more you realize how much you don&apos;t yet know.\r\n\r\nFilled with secrets that only a veteran contestant could share - from counterintuitive game strategies to Jedi-like tactics with the Jeopardy! signaling device - Prisoner of Trebekistan also gives you the chance to play along with the actual clues that led to victory or defeat in high-level tournaments, plus candid, moving reflections on how the games affected Bob&apos;s offstage life - and vice versa.\r\n\r\nNot only an irresistible treat for Jeopardy! fans, Prisoner of Trebekistan is a delight for anyone who loves a rollicking tale that celebrates the unpredictability of life and the sneaky way it has of teaching us the things that really matter.\r\n\r\nxx","last_updated":"2017-08-07T12:01:37.560Z","parsed":{"xt":"urn:btih:ddd7267d177f22bfba2c6ace00ccd015b32e4e5e","dn":"Prisoner of Trebekistan_ A Decade in Jeopardy! by Bob Harris ePU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ddd7267d177f22bfba2c6ace00ccd015b32e4e5e","infoHashBuffer":{"type":"Buffer","data":[221,215,38,125,23,127,34,191,186,44,106,206,0,204,208,21,179,46,78,94]},"name":"Prisoner of Trebekistan_ A Decade in Jeopardy! by Bob Harris ePU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}