{"title":"\nAmerican Gods The Tenth Anniversary Edition Neil Gaiman","magnet":"magnet:?xt=urn:btih:de3945eb9897d1cd97266de56884a5ae4c719478&dn=American+Gods+The+Tenth+Anniversary+Edition+Neil+Gaiman&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"TopShelfBook","categoryP":"other","categoryS":"e_books","size":"643844","seeders":"23","leechers":"6","description":"American Gods The Tenth Anniversary Edition Neil Gaiman\r\n\r\nFirst published in 2001, American Gods became an instant classic&#x2014;an intellectual and artistic benchmark from the multiple-award-winning master of innovative fiction, Neil Gaiman. Now discover the mystery and magic of American Gods in this tenth anniversary edition. Newly updated and expanded with the author&#x2019;s preferred text, this commemorative volume is a true celebration of a modern masterpiece by the one, the only, Neil Gaiman.\r\n\r\nA storm is coming . . .\r\n\r\nLocked behind bars for three years, Shadow did his time, quietly waiting for the magic day when he could return to Eagle Point, Indiana. A man no longer scared of what tomorrow might bring, all he wanted was to be with Laura, the wife he deeply loved, and start a new life.\r\n\r\nBut just days before his release, Laura and Shadow&#x2019;s best friend are killed in an accident. With his life in pieces and nothing to keep him tethered, Shadow accepts a job from a beguiling stranger he meets on the way home, an enigmatic man who calls himself Mr. Wednesday. A trickster and rogue, Wednesday seems to know more about Shadow than Shadow does himself.\r\n\r\nLife as Wednesday&#x2019;s bodyguard, driver, and errand boy is far more interesting and dangerous than Shadow ever imagined&#x2014;it is a job that takes him on a dark and strange road trip and introduces him to a host of eccentric characters whose fates are mysteriously intertwined with his own. Along the way Shadow will learn that the past never dies; that everyone, including his beloved Laura, harbors secrets; and that dreams, totems, legends, and myths are more real than we know. Ultimately, he will discover that beneath the placid surface of everyday life a storm is brewing&#x2014;an epic war for the very soul of America&#x2014;and that he is standing squarely in its path.\r\n\r\nRelevant and prescient, American Gods has been lauded for its brilliant synthesis of &#x201C;mystery, satire, sex, horror, and poetic prose&#x201D; (Michael Dirda, Washington Post Book World) and as a modern phantasmagoria that &#x201C;distills the essence of America&#x201D; (Seattle Post-Intelligencer). It is, quite simply, an outstanding work of literary imagination that will endure for generations","last_updated":"2017-09-24T12:10:47.484Z","parsed":{"xt":"urn:btih:de3945eb9897d1cd97266de56884a5ae4c719478","dn":"American Gods The Tenth Anniversary Edition Neil Gaiman","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"de3945eb9897d1cd97266de56884a5ae4c719478","infoHashBuffer":{"type":"Buffer","data":[222,57,69,235,152,151,209,205,151,38,109,229,104,132,165,174,76,113,148,120]},"name":"American Gods The Tenth Anniversary Edition Neil Gaiman","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}