{"title":"\nThe Holocaust_ A New History by Laurence Rees ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:de9e4232b124e1218c4aec15553882d91a59aae9&dn=The+Holocaust_+A+New+History+by+Laurence+Rees+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5091496","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Holocaust_ A New History by Laurence Rees ePUB eBOOK-ZAK\r\n\r\nOn June 1944, Freda Wineman and her family arrived at Auschwitz-Birkenau, the infamous Nazi concentration and death camp. After a cursory look from an SS doctor, Freda&apos;s life was spared and her mother was sent to the gas chambers. Freda only survived because the Allies won the war - the Nazis ultimately wanted every Jew to die. Her mother was one of millions who lost their lives because of a racist regime that believed that some human beings simply did not deserve to live - not because of what they had done, but because of who they were.\r\n\r\nLaurence Rees has spent 25 years meeting the survivors and perpetrators of the Third Reich and the Holocaust. In this sweeping history, he combines this testimony with the latest academic research to investigate how history&apos;s greatest crime was possible. Rees argues that while hatred of the Jews was at the epicenter of Nazi thinking, we cannot fully understand the Holocaust without considering Nazi plans to kill millions of non-Jews as well. He also reveals that there was no single overarching blueprint for the Holocaust. Instead, a series of escalations compounded into the horror. Though Hitler was most responsible for what happened, the blame is widespread, Rees reminds us, and the effects are enduring.\r\n\r\nThe Holocaust: A New History is an accessible yet authoritative account of this terrible crime. A chronological, intensely readable narrative, this is a compelling exposition of humanity&apos;s darkest moment.\r\n\r\nxx","last_updated":"2017-10-02T12:00:48.065Z","parsed":{"xt":"urn:btih:de9e4232b124e1218c4aec15553882d91a59aae9","dn":"The Holocaust_ A New History by Laurence Rees ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"de9e4232b124e1218c4aec15553882d91a59aae9","infoHashBuffer":{"type":"Buffer","data":[222,158,66,50,177,36,225,33,140,74,236,21,85,56,130,217,26,89,170,233]},"name":"The Holocaust_ A New History by Laurence Rees ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}