{"title":"On Fire by John O'Leary EPUB","magnet":"magnet:?xt=urn:btih:de9e28510f5b806067435975121dbe0b9b4dee6d&dn=On+Fire+by+John+O%27Leary+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5202903","seeders":"25","leechers":"3","description":"xx\r\n\r\nOn Fire by John O&apos;Leary EPUB\r\n\r\nIn the best-selling tradition of Brene Brown&apos;s Daring Greatly and Nick Vujicic&apos;s Life Without Limits comes a rousing seven-step plan for living a life on fire, filled with hope and possibility - from an inspirational speaker who survived a near-fatal fire at the age of nine and now runs a successful business inspiring people all around the world.\r\n\r\nWhen John O&apos;Leary was nine years old, he was almost killed in a devastating house fire. With burns on 100 percent of his body, O&apos;Leary mustered an almost unimaginable amount of inner strength just to survive the ordeal. The insights he gained through this experience and the heroes who stepped into his life to help him through the journey - his family, the medical staff, and total strangers - changed his life. Now he is committed to living life to the fullest and inspiring others to do the same.\r\n\r\nAn incredible and emotionally honest account of triumph over tragedy, On Fire contains O&apos;Leary&apos;s reflections on being that little boy, the life-giving choices made then, and the resulting lessons he learned. O&apos;Leary very clearly shares that without the right people providing the right guidance at the right time, he never would have made it through those five months in the hospital, let alone the years that followed as he struggled to regain mobility, embrace his story, and ignite clarity of his life&apos;s purpose.\r\n\r\nOn Fire encourages us to seize the power to choose our paths and transform our lives from mundane to extraordinary. Once we stop thinking solely on the big moments in our lives, we can begin to focus on those smaller opportunities that tend to pass us by. These are the events - the inflection points in our lives - that can determine how we feel about life now, where we are headed in the future, and how many lives we can impact along the way. We can&apos;t always choose the paths we walk, but we can choose how we walk them. Empowering, inspiring, remarkably honest, and heartfelt, O&apos;Leary&apos;s strength and incredible spirit shine through in every minute.\r\n\r\nxx","last_updated":"2017-12-10T12:07:35.330Z","parsed":{"xt":"urn:btih:de9e28510f5b806067435975121dbe0b9b4dee6d","dn":"On Fire by John O'Leary EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"de9e28510f5b806067435975121dbe0b9b4dee6d","infoHashBuffer":{"type":"Buffer","data":[222,158,40,81,15,91,128,96,103,67,89,117,18,29,190,11,155,77,238,109]},"name":"On Fire by John O'Leary EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}