{"title":"Return of the Primitive_ The Anti-Industrial Revolution by Ayn R","magnet":"magnet:?xt=urn:btih:debdcd53e3a8e1ddeb786d51c8a692839080204c&dn=Return+of+the+Primitive_+The+Anti-Industrial+Revolution+by+Ayn+R&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"anders","categoryS":"e_books","size":"2848526","seeders":"0","leechers":"0","description":"xx\r\n\r\nReturn of the Primitive_ The Anti-Industrial Revolution by Ayn Rand and Peter Schwartz ePUB eBOOK-ZAK\r\n\r\nIn the 1960s and early &apos;70s, the most prominent, vocal cultural movement was the New Left, a movement that condemned America and everything it stood for: individualism, material wealth, science, technology, capitalism.\r\n\r\nWhile the New Left achieved limited political success, it brought about vast cultural changes that remain with us to this day. The reason is that while its representatives faced some political opposition, they faced little-to-no fundamental intellectual opposition.\r\n\r\nAyn Rand was the exception. In her essays from this period, anthologized in The New Left: The Anti-Industrial Revolution, she opposed the New Left as no one else did. The audience for the book, she wrote, is &quot;all those who are concerned about college students and about the state of modern education&quot; and who are seeking &quot;a voice of reason to turn to&quot;.\r\n\r\nIn her essays, Ayn Rand identified the essential evils of the New Left and their cause. Where most viewed the New Left and its violent college protests, its worship of untouched nature, and its orgiastic mob celebrations as some sort of inexplicable, youthful rebellion against the &quot;establishment&quot;, Ayn Rand identified these &quot;rebels&quot; as in fact dutiful, consistent practitioners of the ideas taught to them by their teachers.\r\n\r\nReturn of the Primitive is an expanded edition of The New Left. It features the entire contents of the original edition authorized by Ayn Rand, plus two of her other essays, &quot;Racism&quot; and &quot;Global Balkanization&quot;, which are highly relevant to today&apos;s campuses and world. Additionally, it features three essays written after her death by Peter Schwartz, analyzing some of the ideologies that the New Left helped spawn, such as multiculturalism and environmentalism.\r\n\r\nFor those who seek to understand the state of American culture today, Return of the Primitive is required reading.\r\n\r\nxx","last_updated":"2017-09-08T12:00:40.324Z","parsed":{"xt":"urn:btih:debdcd53e3a8e1ddeb786d51c8a692839080204c","dn":"Return of the Primitive_ The Anti-Industrial Revolution by Ayn R","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"debdcd53e3a8e1ddeb786d51c8a692839080204c","infoHashBuffer":{"type":"Buffer","data":[222,189,205,83,227,168,225,221,235,120,109,81,200,166,146,131,144,128,32,76]},"name":"Return of the Primitive_ The Anti-Industrial Revolution by Ayn R","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}