{"title":"The Terranauts_ A Novel by T. C. Boyle EPUB","magnet":"magnet:?xt=urn:btih:dee95675bb177237172afdf1d4cc7acc7b695eef&dn=The+Terranauts_+A+Novel+by+T.+C.+Boyle+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"919429","seeders":"11","leechers":"3","description":"xx\r\n\r\nThe Terranauts_ A Novel by T. C. Boyle EPUB\r\n\r\nA deep dive into human behavior in an epic story of science, society, sex, and survival, from one of the greatest American novelists today, T. C. Boyle, the acclaimed best-selling author of the PEN/Faulkner Award-winning World&apos;s End and The Harder They Come.\r\n\r\nIt is 1994, and in the desert near Tillman, Arizona, 40 miles from Tucson, a grand experiment involving the future of humanity is underway. As climate change threatens the Earth, eight scientists, four men and four women dubbed the Terranauts, have been selected to live under glass in E2, a prototype of a possible off-Earth colony. Their sealed three-acre compound comprises five biomes - rain forest, savanna, desert, ocean, and marsh - and enough wildlife, water, and vegetation to sustain them.\r\n\r\nClosely monitored by an all-seeing Mission Control, this New Eden is the brainchild of ecovisionary Jeremiah Reed, aka G. C. - God the Creator - for whom the project is both an adventure in scientific discovery and a momentous publicity stunt. In addition to their roles as medics, farmers, biologists, and survivalists, his young, strapping Terranauts must impress watchful visitors and a skeptical media curious to see if E2&apos;s environment will somehow be compromised, forcing the ecosphere&apos;s seal to be broken - and ending the mission in failure. As the Terranauts face increased scrutiny and a host of disasters both natural and of their own making, their mantra, &quot;nothing in, nothing out&quot;, becomes a dangerously ferocious rallying cry.\r\n\r\n..\r\n\r\nxx","last_updated":"2017-11-07T12:02:41.527Z","parsed":{"xt":"urn:btih:dee95675bb177237172afdf1d4cc7acc7b695eef","dn":"The Terranauts_ A Novel by T. C. Boyle EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dee95675bb177237172afdf1d4cc7acc7b695eef","infoHashBuffer":{"type":"Buffer","data":[222,233,86,117,187,23,114,55,23,42,253,241,212,204,122,204,123,105,94,239]},"name":"The Terranauts_ A Novel by T. C. Boyle EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}