{"title":"\nMy Glory Was I Had Such Friends_ A Memoir by Amy Silverstein 201","magnet":"magnet:?xt=urn:btih:df4a3061da1cee6aa539e8a80460b148ffc0c4e5&dn=My+Glory+Was+I+Had+Such+Friends_+A+Memoir+by+Amy+Silverstein+201&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3114680","seeders":"2","leechers":"2","description":"xx\r\n\r\nMy Glory Was I Had Such Friends_ A Memoir by Amy Silverstein 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn this moving memoir about the power of friendship and the resilience of the human spirit, Amy Silverstein tells the story of the extraordinary group of women who supported her as she waited on the precipice for a life-saving heart transplant.\r\n\r\nNearly 26 years after receiving her first heart transplant, Amy Silverstein&apos;s donor heart plummeted into failure. If she wanted to live, she had to take on the grueling quest for a new heart - immediately.\r\n\r\nA shot at survival meant uprooting her life and moving across the country to California. When her friends heard of her plans, there was only one reaction: &quot;I&apos;m there.&quot; Nine remarkable women - Joy, Jill, Leja, Jody, Lauren, Robin, Valerie, Ann, and Jane - put demanding jobs and pressing family obligations on hold to fly across the country and be by Amy&apos;s side. Creating a calendar spreadsheet, the women - some of them strangers to one another - passed the baton of friendship, one to the next, and headed straight and strong into the battle to help save Amy&apos;s life.\r\n\r\nEmpowered by the kind of empathy that can only grow with age, these women, each knowing Amy from different stages of her life, banded together to provide her with something that medicine alone could not. Sleeping on a cot beside her bed, they rubbed her back and feet when the pain was unbearable, adorned her room with death-distracting decorations, and engaged in their &quot;best talks ever&quot;. They saw the true measure of their friend&apos;s strength, and they each responded in kind.\r\n\r\nMy Glory Was I Had Such Friends is a tribute to these women and the intense hours they spent together - hours of heightened emotion and self-awareness, where everything was laid bare. Candid and heartrending, this once-in-a-lifetime story of connection and empathy is a powerful reminder of the ultimate importance of &quot;showing up&quot; for those we love.\r\n\r\nxx","last_updated":"2017-09-24T12:01:50.042Z","parsed":{"xt":"urn:btih:df4a3061da1cee6aa539e8a80460b148ffc0c4e5","dn":"My Glory Was I Had Such Friends_ A Memoir by Amy Silverstein 201","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"df4a3061da1cee6aa539e8a80460b148ffc0c4e5","infoHashBuffer":{"type":"Buffer","data":[223,74,48,97,218,28,238,106,165,57,232,168,4,96,177,72,255,192,196,229]},"name":"My Glory Was I Had Such Friends_ A Memoir by Amy Silverstein 201","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}