{"title":"\nRichard Nixon_ The Life by John A Farrell ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:dfac8d484c4ecda831b7b460d8206b1c1cb38723&dn=Richard+Nixon_+The+Life+by+John+A+Farrell+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"109279054","seeders":"0","leechers":"0","description":"xx\r\n\r\nRichard Nixon_ The Life by John A Farrell ePUB eBOOK-ZAK\r\n\r\nBrilliantly researched, authoritatively crafted by a prize-winning biographer, this is the Nixon we&apos;ve been waiting for.\r\n\r\nRichard Nixon opens with young navy lieutenant &quot;Nick&quot; Nixon returning from the Pacific and setting his cap at Congress, an idealistic dreamer seeking to build a better world. Yet amid the turns of that now legendary 1946 campaign, Nixon&apos;s finer attributes quickly gave way to unapologetic ruthlessness. It is a stunning overture to John A. Farrell&apos;s magisterial portrait of a man who embodied postwar American cynicism.\r\n\r\nWithin four years of that first win, Nixon would be a US senator, in six the vice president of the United States of America. &quot;Few came so far, so fast, and so alone,&quot; Farrell writes. Finally president, Nixon&apos;s staff was full of bright young men who devised forward-thinking reforms addressing health care, poverty, civil rights, and protection of the environment. It was a fine legacy, but Nixon cared little for it. He aspired to make his mark on the world stage instead, and his 1972 opening to China was the first great crack in the Cold War.\r\n\r\nNixon had another legacy, too: an America divided and polarized. It was Nixon who launched the McCarthy era, who set South against North, and who spurred the silent majority to despise and distrust the country&apos;s elites. He persuaded Americans to gnaw, as he did, on grievances - and to look at one another as enemies. Finally, in August 1974, after two years of the mesmerizing intrigue and scandal known as Watergate, Nixon became the only president to resign in disgrace.\r\n\r\nRichard Nixon is an enthralling tour de force biography of our darkest president, one that reviewers will hail as a defining portrait, and the full life of Nixon readers have awaited.\r\n\r\nxx","last_updated":"2017-09-22T12:00:49.961Z","parsed":{"xt":"urn:btih:dfac8d484c4ecda831b7b460d8206b1c1cb38723","dn":"Richard Nixon_ The Life by John A Farrell ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dfac8d484c4ecda831b7b460d8206b1c1cb38723","infoHashBuffer":{"type":"Buffer","data":[223,172,141,72,76,78,205,168,49,183,180,96,216,32,107,28,28,179,135,35]},"name":"Richard Nixon_ The Life by John A Farrell ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}