{"title":"My Lai: Vietnam, 1968, and the Descent into Darkness/Howard Jone","magnet":"magnet:?xt=urn:btih:dfccbcaba7148e53de126570150518c76c812146&dn=My+Lai%3A+Vietnam%2C+1968%2C+and+the+Descent+into+Darkness%2FHoward+Jone&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"22215871","seeders":"6","leechers":"3","description":"My Lai: Vietnam, 1968, and the Descent into Darkness/Howard Jones/2017/PDF/\r\n\r\n\r\nEnglish|Non-Fiction|ISBN-10:0195393600|504pg|21MB\r\n\r\nOn the early morning of March 16, 1968, American soldiers from three platoons of Charlie Company (1st Battalion, 20th Infantry Regiment, 11th Brigade, 23rd Infantry Division), entered a group of hamlets located in the Son Tinh district of South Vietnam, located near the Demilitarized Zone and known as &quot;Pinkville&quot; because of the high level of Vietcong infiltration.\r\n\r\nThe soldiers, many still teenagers who had been in the country for three months, were on a &quot;search and destroy&quot; mission. The Tet Offensive had occurred only weeks earlier and in the same area and had made them jittery; so had mounting losses from booby traps and a seemingly invisible enemy.\r\n\r\nThree hours after the GIs entered the hamlets, more than five hundred unarmed villagers lay dead, killed in cold blood. The atrocity took its name from one of the hamlets, known by the Americans as My Lai 4.\r\n\r\nMilitary authorities attempted to suppress the news of My Lai, until some who had been there, in particular a helicopter pilot named Hugh Thompson and a door gunner named Lawrence Colburn, spoke up about what they had seen.\r\n\r\nThe official line was that the villagers had been killed by artillery and gunship fire rather than by small arms. That line soon began to fray. Lieutenant William Calley, one of the platoon leaders, admitted to shooting the villagers but insisted that he had acted upon orders.\r\n\r\nAn expos&#xE9; of the massacre and cover-up by journalist Seymour Hersh, followed by graphic photographs, incited international outrage, and Congressional and U.S. Army inquiries began.\r\n\r\nCalley and nearly thirty other officers were charged with war crimes, though Calley alone was convicted and would serve three and a half years under house arrest before being paroled in 1974.\r\n\r\nMy Lai polarized American sentiment. Many saw Calley as a scapegoat, the victim of a doomed strategy in an unwinnable war. Others saw a war criminal. President Nixon was poised to offer a presidential pardon.\r\n\r\nThe atrocity intensified opposition to the war, devastating any pretense of American moral superiority. Its effect on military morale and policy was profound and enduring. The Army implemented reforms and began enforcing adherence to the Hague and Geneva conventions.\r\n\r\nBefore launching an offensive during Desert Storm in 1991, one general warned his brigade commanders, &quot;No My Lais in this division--do you hear me?&quot;\r\n\r\nCompelling, comprehensive, and haunting, based on both exhaustive archival research and extensive interviews, Howard Jones&apos;s My Lai will stand as the definitive book on one of the most devastating events in American military history","last_updated":"2017-07-04T12:01:19.768Z","parsed":{"xt":"urn:btih:dfccbcaba7148e53de126570150518c76c812146","dn":"My Lai: Vietnam, 1968, and the Descent into Darkness/Howard Jone","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dfccbcaba7148e53de126570150518c76c812146","infoHashBuffer":{"type":"Buffer","data":[223,204,188,171,167,20,142,83,222,18,101,112,21,5,24,199,108,129,33,70]},"name":"My Lai: Vietnam, 1968, and the Descent into Darkness/Howard Jone","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}