{"title":"Ben Macintyre - Rogue Heroes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:dfd7054c1f009430945033465c8525641a359085&dn=Ben+Macintyre+-+Rogue+Heroes+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"80781821","seeders":"0","leechers":"0","description":"Ben Macintyre - Rogue Heroes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe incredible untold story of WWII&apos;s greatest secret fighting force, as told by our great modern master of wartime intrigue.\r\n\r\nBritain&apos;s Special Air Service - or SAS - was the brainchild of David Stirling, a young, gadabout aristocrat whose aimlessness in early life belied a remarkable strategic mind. Where most of his colleagues looked at a battlefield map of World War II&apos;s African theater and saw a protracted struggle with Rommel&apos;s desert forces, Stirling saw an opportunity: Given a small number of elite, well-trained men, he could parachute behind enemy lines and sabotage their airplanes and war mat&#xE9;riel.\r\n\r\nPaired with his constitutional opposite, the disciplined martinet Jock Lewes, Stirling assembled a revolutionary fighting force that would upend not just the balance of the war but the nature of combat itself. He faced no little resistance from those who found his tactics ungentlemanly or beyond the pale, but in the SAS&apos; remarkable exploits facing the Nazis in Africa and then on the continent can be found the seeds of nearly all special forces units that would follow.\r\n\r\nBringing his keen eye for psychological detail to a riveting wartime narrative, Ben Macintyre uses his unprecedented access to SAS archives to shine a light inside a legendary unit long shrouded in secrecy. The result is not just a tremendous war story but a fascinating group portrait of men of whom history and country asked the most","last_updated":"2017-06-05T12:00:51.305Z","parsed":{"xt":"urn:btih:dfd7054c1f009430945033465c8525641a359085","dn":"Ben Macintyre - Rogue Heroes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"dfd7054c1f009430945033465c8525641a359085","infoHashBuffer":{"type":"Buffer","data":[223,215,5,76,31,0,148,48,148,80,51,70,92,133,37,100,26,53,144,133]},"name":"Ben Macintyre - Rogue Heroes 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}