{"title":"Rabbit_ The Autobiography of Ms. Pat by Jeannine Amber and Patri","magnet":"magnet:?xt=urn:btih:e010949e0c30e1c2941b383c21c70c9028087fb1&dn=Rabbit_+The+Autobiography+of+Ms.+Pat+by+Jeannine+Amber+and+Patri&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5371393","seeders":"0","leechers":"0","description":"xx\r\n\r\nRabbit_ The Autobiography of Ms. Pat by Jeannine Amber and Patricia Williams ePUB eBOOK-ZAK\r\n\r\nA remarkably bold and inspiring story of crime, motherhood, and redemption - not since Cupcake Brown&apos;s A Piece of Cake has there been a memoir this unforgettable.\r\n\r\nYou want to know about the struggle of growing up poor, black, and female? Ask any girl from any &apos;hood. You want to know what it takes to rise above your circumstances when all the cards are stacked against you? Ask me.\r\n\r\nComedian Patricia Williams, who, for years, went by her street name, Rabbit, was born and raised in Atlanta&apos;s most troubled neighborhood at the height of the crack epidemic.\r\n\r\nOne of five children, Pat watched as her alcoholic mother struggled to get by on charity, cons, and petty crimes. At age seven, Pat was taught to roll drunks for money. At 12, she was targeted for sex by a man eight years her senior; by 13, she was pregnant. By 15, Pat was a mother of two.\r\n\r\nAlone at 16, Pat was determined to make a better life for her children. But with no job skills and an eighth-grade education, her options were limited. She learned quickly that hustling and humor were the only tools she had to survive.\r\n\r\nRabbit is an unflinching memoir of cinematic scope and unexpected humor that offers a rare glimpse into the harrowing reality of life on America&apos;s margins - a powerful true story of resilience, determination, and the transformative power of love.\r\n\r\nxx","last_updated":"2017-08-25T12:01:03.634Z","parsed":{"xt":"urn:btih:e010949e0c30e1c2941b383c21c70c9028087fb1","dn":"Rabbit_ The Autobiography of Ms. Pat by Jeannine Amber and Patri","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e010949e0c30e1c2941b383c21c70c9028087fb1","infoHashBuffer":{"type":"Buffer","data":[224,16,148,158,12,48,225,194,148,27,56,60,33,199,12,144,40,8,127,177]},"name":"Rabbit_ The Autobiography of Ms. Pat by Jeannine Amber and Patri","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}