{"title":"Dr. No (1962)","magnet":"magnet:?xt=urn:btih:e02076188dafbd10b32e52169ce8dfb801b63931&dn=Dr.+No+%281962%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"hadi08","categoryP":"video","categoryS":"movies","size":"468737028","seeders":"0","leechers":"1","description":"Dr. No is a 1962 British spy film, starring Sean Connery, with Ursula Andress and Joseph Wiseman, filmed in Jamaica and England. It is the first James Bond film. Based on the 1958 novel of the same name by Ian Fleming, it was adapted by Richard Maibaum, Johanna Harwood, and Berkely Mather and was directed by Terence Young. The film was produced by Harry Saltzman and Albert R. Broccoli, a partnership that would continue until 1975.\r\n\r\nIn the film, James Bond is sent to Jamaica to investigate the disappearance of a fellow British agent. The trail leads him to the underground base of Dr. No, who is plotting to disrupt an early American space launch with a radio beam weapon. Although the first of the Bond books to be made into a film, Dr. No was not the first of Fleming&apos;s novels, Casino Royale being the debut for the character; the film makes a few references to threads from earlier books. This film also introduced the criminal organisation SPECTRE, which would also appear in six subsequent films.\r\n\r\nDr. No was produced on a low budget and was a financial success. While critical reaction was mixed upon release, over time the film has gained a reputation as one of the series&apos; best instalments. The film was the first of a successful series of 24 Bond films. Dr. No also launched a genre of &quot;secret agent&quot; films that flourished in the 1960s. The film also spawned a spin-off comic book and soundtrack album as part of its promotion and marketing.\r\n\r\nMany of the iconic aspects of a typical James Bond film were established in Dr. No: the film begins with an introduction to the character through the view of a gun barrel and a highly stylised main title sequence, both created by Maurice Binder. Production designer Ken Adam established an elaborate visual style that is one of the hallmarks of the film series","last_updated":"2017-06-18T12:01:14.844Z","parsed":{"xt":"urn:btih:e02076188dafbd10b32e52169ce8dfb801b63931","dn":"Dr. No (1962)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e02076188dafbd10b32e52169ce8dfb801b63931","infoHashBuffer":{"type":"Buffer","data":[224,32,118,24,141,175,189,16,179,46,82,22,156,232,223,184,1,182,57,49]},"name":"Dr. No (1962)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}