{"title":"Cleopatra_ A Life by Stacy Schiff epub RtR","magnet":"magnet:?xt=urn:btih:e045856e46950e9fe60de3ec0ab608d0c9c0bbb3&dn=Cleopatra_+A+Life+by+Stacy+Schiff+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2952179","seeders":"0","leechers":"0","description":"xx\r\n\r\nCleopatra_ A Life by Stacy Schiff epub RtR\r\n\r\nHer palace shimmered with onyx, garnets, and gold, but was richer still in political and sexual intrigue. Above all else, Cleopatra was a shrewd strategist and an ingenious negotiator.\r\n\r\nThough her life spanned fewer than 40 years, it reshaped the contours of the ancient world. She was married twice, each time to a brother. She waged a brutal civil war against the first when both were teenagers. She poisoned the second. Ultimately she dispensed with an ambitious sister as well; incest and assassination were family specialties.\r\n\r\nCleopatra appears to have had sex with only two men. They happen, however, to have been Julius Caesar and Mark Antony, among the most prominent Romans of the day. Both were married to other women. Cleopatra had a child with Caesar and - after his murder - three more with his Antony. Already she was the wealthiest ruler in the Mediterranean; the relationship with Antony confirmed her status as the most influential woman of the age. The two would together attempt to forge a new empire, in an alliance that spelled their ends. Cleopatra has lodged herself in our imaginations ever since.\r\n\r\nFamous long before she was notorious, Cleopatra has gone down in history for all the wrong reasons. Shakespeare and Shaw put words in her mouth. Michelangelo, Tiepolo, and Elizabeth Taylor put a face to her name. Along the way, Cleopatra&apos;s supple personality and the drama of her circumstances have been lost.\r\n\r\nIn a masterly return to the classical sources, Stacy Schiff here boldly separates fact from fiction to rescue the magnetic queen whose death ushered in a new world order. Rich in detail, epic in scope, Schiff &apos;s is a luminous, deeply original reconstruction of a dazzling life.\r\n\r\nxx","last_updated":"2017-07-16T12:00:27.355Z","parsed":{"xt":"urn:btih:e045856e46950e9fe60de3ec0ab608d0c9c0bbb3","dn":"Cleopatra_ A Life by Stacy Schiff epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e045856e46950e9fe60de3ec0ab608d0c9c0bbb3","infoHashBuffer":{"type":"Buffer","data":[224,69,133,110,70,149,14,159,230,13,227,236,10,182,8,208,201,192,187,179]},"name":"Cleopatra_ A Life by Stacy Schiff epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}