{"title":"Bleeding Edge by Thomas Pynchon epub RtR","magnet":"magnet:?xt=urn:btih:e19ba175a78eb498515e79086bc554970127ac11&dn=Bleeding+Edge+by+Thomas+Pynchon+epub+RtR&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3309447","seeders":"0","leechers":"0","description":"xx\r\n\r\nBleeding Edge by Thomas Pynchon epub RtR\r\n\r\nThomas Pynchon brings us to New York in the early days of the Internet. It is 2001 in New York City, in the lull between the collapse of the dot-com boom and the terrible events of September 11th. Silicon Alley is a ghost town, Web 1.0 is having adolescent angst, Google has yet to IPO, Microsoft is still considered the Evil Empire. There may not be quite as much money around as there was at the height of the tech bubble, but there&apos;s no shortage of swindlers looking to grab a piece of what&apos;s left.\r\n\r\nMaxine Tarnow is running a nice little fraud investigation business on the Upper West Side, chasing down different kinds of small-scale con artists. She used to be legally certified but her license got pulled a while back, which has actually turned out to be a blessing because now she can follow her own code of ethics - carry a Beretta, do business with sleazebags, hack into people&apos;s bank accounts - without having too much guilt about any of it. Otherwise, just your average working mom - two boys in elementary school, an off-and-on situation with her sort of semi-ex-husband Horst, life as normal as it ever gets in the neighborhood - till Maxine starts looking into the finances of a computer-security firm and its billionaire geek CEO, whereupon things begin rapidly to jam onto the subway and head downtown. She soon finds herself mixed up with a drug runner in an art deco motorboat, a professional nose obsessed with Hitler&apos;s aftershave, a neoliberal enforcer with footwear issues, plus elements of the Russian mob and various bloggers, hackers, code monkeys, and entrepreneurs, some of whom begin to show up mysteriously dead. Foul play, of course.\r\n\r\nWith occasional excursions into the Deep Web and out to Long Island, Thomas Pynchon, channeling his inner Jewish mother, brings us a historical romance of New York in the early days of the Internet, not that distant in calendar time but galactically remote from where we&apos;ve journeyed to since.\r\n\r\nWill perpetrators be revealed, forget about brought to justice? Will Maxine have to take the handgun out of her purse? Will she and Horst get back together? Will Jerry Seinfeld make an unscheduled guest appearance? Will accounts secular and karmic be brought into balance?\r\n\r\nHey. Who wants to know?\r\n\r\nxx","last_updated":"2017-07-20T12:00:56.508Z","parsed":{"xt":"urn:btih:e19ba175a78eb498515e79086bc554970127ac11","dn":"Bleeding Edge by Thomas Pynchon epub RtR","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e19ba175a78eb498515e79086bc554970127ac11","infoHashBuffer":{"type":"Buffer","data":[225,155,161,117,167,142,180,152,81,94,121,8,107,197,84,151,1,39,172,17]},"name":"Bleeding Edge by Thomas Pynchon epub RtR","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}