{"title":"Meredith Wadman - The Vaccine Race 2017 RETAiL ePUB eBOOK-DiSTRi","magnet":"magnet:?xt=urn:btih:e1a1a4fc382ea2c072fd94447344ad5c1168d524&dn=Meredith+Wadman+-+The+Vaccine+Race+2017+RETAiL+ePUB+eBOOK-DiSTRi&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"22227868","seeders":"0","leechers":"0","description":"xx\r\n\r\nMeredith Wadman - The Vaccine Race 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe epic and controversial story of a major breakthrough in cell biology that led to the conquest of rubella and other devastating diseases.\r\n\r\nUntil the late 1960s, tens of thousands of American children suffered crippling birth defects if their mothers had been exposed to rubella, popularly known as German measles, while pregnant; there was no vaccine and little understanding of how the disease devastated fetuses. In June 1962, a young biologist in Philadelphia, using tissue extracted from an aborted fetus from Sweden, produced safe, clean cells that allowed the creation of vaccines against rubella and other common childhood diseases. Two years later, in the midst of a devastating German measles epidemic, his colleague developed the vaccine that would one day wipe out homegrown rubella. The rubella vaccine and others made with those fetal cells have protected more than 150 million people in the United States, the vast majority of them preschoolers. The new cells and the method of making them also led to vaccines that have protected billions of people around the world from polio, rabies, chicken pox, measles, hepatitis A, shingles and adenovirus.\r\n\r\nMeredith Wadman&apos;s masterful account recovers not only the science of this urgent race, but also the political roadblocks that nearly stopped the scientists. She describes the terrible dilemmas of pregnant women exposed to German measles and recounts testing on infants, prisoners, orphans, and the intellectually disabled, which was common in the era. These events take place at the dawn of the battle over using human fetal tissue in research, during the arrival of big commerce in campus labs, and as huge changes take place in the laws and practices governing who &quot;owns&quot; research cells and the profits made from biological inventions. It is also the story of yet one more unrecognized woman whose cells have been used to save countless lives.\r\n\r\nWith another frightening virus imperiling pregnant women on the rise today, no medical story could have more human drama, impact, or urgency today than The Vaccine Race.\r\n\r\nxx","last_updated":"2017-07-12T12:00:38.006Z","parsed":{"xt":"urn:btih:e1a1a4fc382ea2c072fd94447344ad5c1168d524","dn":"Meredith Wadman - The Vaccine Race 2017 RETAiL ePUB eBOOK-DiSTRi","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e1a1a4fc382ea2c072fd94447344ad5c1168d524","infoHashBuffer":{"type":"Buffer","data":[225,161,164,252,56,46,162,192,114,253,148,68,115,68,173,92,17,104,213,36]},"name":"Meredith Wadman - The Vaccine Race 2017 RETAiL ePUB eBOOK-DiSTRi","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}