{"title":"Cloudbase Prime RC1","magnet":"magnet:?xt=urn:btih:e223ab7b873cce794da021470bc8db0d4f88819f&dn=Cloudbase+Prime+RC1&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"177377605","seeders":"0","leechers":"0","description":"You are lost in the depths of a gas giant mining station where things have gone very, very wrong. Move terrain to clear paths, defeat enemies, and launch yourself skyward. Get ready to shoot a lot of robots and jump into the colorful clouds of Cloudbase Prime!The abandoned world in those clouds is full of weird and wonderful dangers. Discover friendly robots, discover murdery robots, grappling-hook onto enemy airships, fight giant bosses, and swim inside huge floating jellyfish.Find new weapons and powers for your robot suit as you explore. You don&apos;t need them to win, but they&apos;re definitely worth finding!Launch shockwaves through terrain that fling dozens of enemies into the air. Block homing missiles and cross gaps with hex tiles you&apos;ve created out of thin air. Destroy your enemies with a good old fashioned death beam. Your weapons and ammo can be customized at any point, after you&apos;ve found them! Charge shot + combust ammo? Homing shot + freeze ammo? Delicious!Here&apos;s the kind of stuff you&apos;ll do while playing Cloudbase Prime:JumpShootJump while shootingBlow up mech walkers leg by leg and then watch their stupid heads roll off a cliff and fall into the clouds belowRaise/lower terrain to open paths, launch enemies, launch yourself, or stop a homing missile from hitting you in the faceUpgrade your robot suit with new weapons, powers, and ammo to use in fast, bouncy combatSlow down time to select from your powers and weapons at a leisurely pace","last_updated":"2017-07-22T12:00:22.831Z","parsed":{"xt":"urn:btih:e223ab7b873cce794da021470bc8db0d4f88819f","dn":"Cloudbase Prime RC1","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e223ab7b873cce794da021470bc8db0d4f88819f","infoHashBuffer":{"type":"Buffer","data":[226,35,171,123,135,60,206,121,77,160,33,71,11,200,219,13,79,136,129,159]},"name":"Cloudbase Prime RC1","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}