{"title":"\nSJWs Always Lie by Vox Day MOBI","magnet":"magnet:?xt=urn:btih:e2657c1706b5a221d699bd61b394fb477bb19100&dn=SJWs+Always+Lie+by+Vox+Day+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2756172","seeders":"0","leechers":"0","description":"xx\r\n\r\nSJWs Always Lie by Vox Day MOBI\r\n\r\nSocial justice warriors have plagued mankind for more than 150 years, but only in the last 30 years has their ideology become dominant in the West. Having invaded one institution of the cultural high ground after another, from corporations and churches to video games and government, there is nowhere that remains entirely free of their intolerant thought and speech policing. Because the SJW agenda of diversity, tolerance, inclusiveness, and equality flies in the face of both science and observable reality, SJWs relentlessly work to prevent normal people from thinking or speaking in any manner that will violate their ever-mutating narrative. They police science, philosophy, technology, and even history in order to maintain the pretense that their agenda remains inevitable in a modern world that contradicts it on a daily basis. SJWs Always Lie is a useful guide to understanding, anticipating, and surviving SJW attacks from the perspective of a man who has not only survived, but thrived, after experiencing multiple attempts by Social Justice Warriors to disqualify, discredit, and dis-employ him in the same manner they have successfully attacked Nobel Laureates, technology CEOs, broadcasters, sports commentators, school principals, and policemen. It analyzes well-known SJW attacks as well as the two most successful examples of resistance to the SJW narrative, #GamerGate and Sad Puppies. Written by Vox Day, Supreme Dark Lord of the Evil Legion of Evil and three-time Hugo nominee who is described as the most hated man in science fiction by Black Gate and The Wall Street Journal, SJWs Always Lie is a powerful weapon in the cultural war against the thought police.\r\n\r\nxx","last_updated":"2017-10-09T12:00:50.789Z","parsed":{"xt":"urn:btih:e2657c1706b5a221d699bd61b394fb477bb19100","dn":"SJWs Always Lie by Vox Day MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e2657c1706b5a221d699bd61b394fb477bb19100","infoHashBuffer":{"type":"Buffer","data":[226,101,124,23,6,181,162,33,214,153,189,97,179,148,251,71,123,177,145,0]},"name":"SJWs Always Lie by Vox Day MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}