{"title":"Phasma (Star Wars)_ The Last Jedi by Delilah S. Dawson EPUB","magnet":"magnet:?xt=urn:btih:e2c1e28ef07f58cd573df9de02876649eecb9939&dn=Phasma+%28Star+Wars%29_+The+Last+Jedi+by+Delilah+S.+Dawson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6726481","seeders":"13","leechers":"3","description":"xx\r\n\r\nPhasma (Star Wars)_ The Last Jedi by Delilah S. Dawson EPUB\r\n\r\nDiscover Captain Phasma&apos;s mysterious history in this &quot;Journey to Star Wars: The Last Jedi&quot; novel.\r\n\r\nOne of the most cunning and merciless officers of the First Order, Captain Phasma commands the favor of her superiors, the respect of her peers, and the terror of her enemies. But for all her renown, Phasma remains as virtually unknown as the impassive expression on her gleaming chrome helmet. Now, an adversary is bent on unearthing her mysterious origins-and exposing a secret she guards as zealously and ruthlessly as she serves her masters.\r\n\r\nDeep inside the Battlecruiser Absolution, a captured Resistance spy endures brutal interrogation at the hands of a crimson-armored stormtrooper-Cardinal. But the information he desires has nothing to do with the Resistance or its covert operations against the First Order.\r\n\r\nWhat the mysterious stormtrooper wants is Phasma&apos;s past-and with it whatever long-buried scandal, treachery, or private demons he can wield against the hated rival who threatens his own power and privilege in the ranks of the First Order. His prisoner has what Cardinal so desperately seeks, but she won&apos;t surrender it easily. As she wages a painstaking war of wills with her captor, bargaining for her life in exchange for every precious revelation, the spellbinding chronicle of the inscrutable Phasma unfolds. But this knowledge may prove more than just dangerous once Cardinal possesses it-and once his adversary unleashes the full measure of her fury....\r\n\r\nxx","last_updated":"2017-11-08T12:17:35.751Z","parsed":{"xt":"urn:btih:e2c1e28ef07f58cd573df9de02876649eecb9939","dn":"Phasma (Star Wars)_ The Last Jedi by Delilah S. Dawson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e2c1e28ef07f58cd573df9de02876649eecb9939","infoHashBuffer":{"type":"Buffer","data":[226,193,226,142,240,127,88,205,87,61,249,222,2,135,102,73,238,203,153,57]},"name":"Phasma (Star Wars)_ The Last Jedi by Delilah S. Dawson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}