{"title":"Tom Wainwright - Narconomics How to Run a Drug Cartel 2016 Retai","magnet":"magnet:?xt=urn:btih:e396a50752529f2b2bbb95650f8731d897ed4a4c&dn=Tom+Wainwright+-+Narconomics+How+to+Run+a+Drug+Cartel+2016+Retai&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4281752","seeders":"0","leechers":"0","description":"Tom Wainwright - Narconomics How to Run a Drug Cartel 2016 Retail EPUB eBook-BitBook\r\n\r\nWhat drug lords learned from big business.\r\n\r\nHow does a budding cartel boss succeed (and survive) in the $300 billion illegal drug business? By learning from the best, of course. From creating brand value to fine-tuning customer service, the folks running cartels have been attentive students of the strategy and tactics used by corporations such as Walmart, McDonald&apos;s, and Coca-Cola.\r\n\r\nAnd what can government learn to combat this scourge? By analyzing the cartels as companies, law enforcers might better understand how they work - and stop throwing away $100 billion a year in a futile effort to win the &quot;war&quot; against this global, highly organized business.\r\n\r\nYour intrepid guide to the most exotic and brutal industry on earth is Tom Wainwright. Picking his way through Andean cocaine fields, Central American prisons, Colorado pot shops, and the online drug dens of the Dark Web, Wainwright provides a fresh, innovative look into the drug trade and its 250 million customers.\r\n\r\nThe cast of characters includes &quot;Bin Laden&quot;, the Bolivian coca guide; &quot;Old Lin&quot;, the Salvadoran gang leader; &quot;Starboy&quot;, the millionaire New Zealand pill maker; and a cozy Mexican grandmother who cooks blueberry pancakes while plotting murder. Along with presidents, cops, and teenage hit men, they explain such matters as the business purpose for head-to-toe tattoos, how gangs decide whether to compete or collude, and why cartels care a surprising amount about corporate social responsibility.\r\n\r\nMore than just an investigation of how drug cartels do business, Narconomics is also a blueprint for how to defeat them","last_updated":"2017-06-22T12:01:02.285Z","parsed":{"xt":"urn:btih:e396a50752529f2b2bbb95650f8731d897ed4a4c","dn":"Tom Wainwright - Narconomics How to Run a Drug Cartel 2016 Retai","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e396a50752529f2b2bbb95650f8731d897ed4a4c","infoHashBuffer":{"type":"Buffer","data":[227,150,165,7,82,82,159,43,43,187,149,101,15,135,49,216,151,237,74,76]},"name":"Tom Wainwright - Narconomics How to Run a Drug Cartel 2016 Retai","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}