{"title":"\nTotal Focus_ Make Better Decisions Under Pressure by John David ","magnet":"magnet:?xt=urn:btih:e3a7deffa9787334f1d32e2d4cda0d3896e43ce1&dn=Total+Focus_+Make+Better+Decisions+Under+Pressure+by+John+David+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3399122","seeders":"0","leechers":"0","description":"xx\r\n\r\nTotal Focus_ Make Better Decisions Under Pressure by John David Mann and Brandon Webb ePUB eBOOK-ZAK\r\n\r\nA former Navy SEAL sniper turned media CEO and New York Times best-selling author teaches business leaders how to make the best decisions under pressure.\r\n\r\nOver his four deployments as a Navy SEAL sniper, Brandon Webb learned all about performing while experiencing heart-pounding stress. After returning to civilian life, he started his first business venture - and failed miserably. He realized that his big mistake was neglecting to apply what he already knew about focus under pressure. By drawing on the lessons of his SEAL training and early business struggles, Webb went on to build a second business, a media network called Hurricane, which today has an audience of millions and a valuation over $100 million.\r\n\r\nNow Webb deconstructs the decision-making DNA of the most effective snipers and shows you how to develop the same mental acuity in civilian life. Drawing on stories from his own experiences and those of other Special Operations warriors and great entrepreneurs, like Solomon Choi of 16 Handles, Matt Meeker of BarkBox, and Betsy Morgan of The Huffington Post and TheBlaze, he teaches you how to have total situational awareness to stay out of danger and adapt to changing circumstances, to avoid the trap of overanalysis, and to understand that pain is temporary and learning is priceless.\r\n\r\nBy following in the path of a generation of legendary snipers, you&apos;ll find the clarity of mind you need to make key decisions and accomplish your mission, whatever it takes.\r\n\r\nxx","last_updated":"2017-10-02T12:06:52.522Z","parsed":{"xt":"urn:btih:e3a7deffa9787334f1d32e2d4cda0d3896e43ce1","dn":"Total Focus_ Make Better Decisions Under Pressure by John David ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e3a7deffa9787334f1d32e2d4cda0d3896e43ce1","infoHashBuffer":{"type":"Buffer","data":[227,167,222,255,169,120,115,52,241,211,46,45,76,218,13,56,150,228,60,225]},"name":"Total Focus_ Make Better Decisions Under Pressure by John David ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}