{"title":"\nHow to Murder Your Life by Cat Marnell EPUB","magnet":"magnet:?xt=urn:btih:e3d8461b6d761c10ed96d27ebf13083bac602d3c&dn=How+to+Murder+Your+Life+by+Cat+Marnell+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"598915","seeders":"0","leechers":"0","description":"xx\r\n\r\nHow to Murder Your Life by Cat Marnell EPUB\r\n\r\nFrom Cat Marnell, &quot;New York&apos;s enfant terrible&quot; (The Telegraph), a candid and darkly humorous memoir of prescription drug addiction and self-sabotage, set in the glamorous world of fashion magazines and downtown nightclubs.\r\n\r\nAt 26 Cat Marnell was an associate beauty editor at Lucky, one of the top fashion magazines in America - and that&apos;s all most people knew about her. But she hid a secret life. She was a prescription drug addict. She was also a &quot;doctor shopper&quot; who manipulated Upper East Side psychiatrists for pills, pills, and more pills; a lonely bulimic who spent hundreds of dollars a week on binge foods; a promiscuous party girl who danced barefoot on banquets; a weepy and hallucination-prone insomniac who would take anything - anything - to sleep.\r\n\r\nThis is a tale of self-loathing, self-sabotage, and, yes, self-tanner. It begins at a posh New England prep school - and with a prescription for attention deficit disorder medication Ritalin. It continues to New York, where we follow Marnell&apos;s amphetamine-fueled rise from intern to editor through the beauty departments of NYLON, Teen Vogue, Glamour, and Lucky. We see her fight between ambition and addiction and how, inevitably, her disease threatens everything she worked so hard to achieve.\r\n\r\nFrom the Conde Nast building (where she rides the elevator alongside Anna Wintour) to seedy nightclubs, from doctors&apos; offices and mental hospitals, Marnell shows - like no one else can - what it is like to live in the wild, chaotic, often sinister world of a young female addict who can&apos;t say no.\r\n\r\nCombining lightning-rod subject matter and bold literary aspirations, How to Murder Your Life is mesmerizing, revelatory, and necessary.\r\n\r\nxx","last_updated":"2017-10-09T12:00:58.437Z","parsed":{"xt":"urn:btih:e3d8461b6d761c10ed96d27ebf13083bac602d3c","dn":"How to Murder Your Life by Cat Marnell EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e3d8461b6d761c10ed96d27ebf13083bac602d3c","infoHashBuffer":{"type":"Buffer","data":[227,216,70,27,109,118,28,16,237,150,210,126,191,19,8,59,172,96,45,60]},"name":"How to Murder Your Life by Cat Marnell EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}