{"title":"HexCmp v2.34","magnet":"magnet:?xt=urn:btih:e42ef76f7573315bd8d95e9d5cb7e95fb01be29b&dn=HexCmp+v2.34&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"violet1143","categoryP":"applications","categoryS":"windows","size":"2673104","seeders":"1","leechers":"1","description":"HexCmp is a program, which combines together the features of a hex file comparison application and a convenient hex editor. The program will help you to compare files in binary format, at the same time serving as a hex editor that will edit and modify your files. Hex comparison is made on-the-fly, while scrolling down the files. Enhanced with features like color highlighting; synchronous scrolling; an Info panel, which shows the file information in different formats and more, this program will most definitely become an asset for both home users and companies.\r\n\r\nInstead of the full files comparison, upon loading you can compare just the current parts of the files, displayed on the screen, which saves you your working time. HexCmp supports files up to 4 GB. You can navigate among different blocks or files, choose the required parts of files to compare (just scroll down the file), set your own color scheme, use the Undo, Redo and Search functions. Besides the hex format, the program can also compare files in text format. String searching can be done in both formats as well. All commands are conveniently assigned to hotkeys. You can work with HexCmp, using your keyboard only.\r\n\r\n------------------------------\r\n\r\nCouldn&apos;t find this thing on the usual venues, so I decided to upload this myself. You can either install and crack the tool with the supplied patched exe, or just run the cracked exe itself with no apparent issues.\r\n\r\nAnd don&apos;t worry, it&apos;s safe. Been using this thing for years whenever I need to crack or fix things myself, so yeah","last_updated":"2017-08-07T12:01:50.363Z","parsed":{"xt":"urn:btih:e42ef76f7573315bd8d95e9d5cb7e95fb01be29b","dn":"HexCmp v2.34","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e42ef76f7573315bd8d95e9d5cb7e95fb01be29b","infoHashBuffer":{"type":"Buffer","data":[228,46,247,111,117,115,49,91,216,217,94,157,92,183,233,95,176,27,226,155]},"name":"HexCmp v2.34","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}