{"title":"\nConfessions of a Funeral Director_ How the Business of Death Sav","magnet":"magnet:?xt=urn:btih:e48020145c4903341d0c47e1407b44922b43653c&dn=Confessions+of+a+Funeral+Director_+How+the+Business+of+Death+Sav&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3063751","seeders":"25","leechers":"12","description":"xx\r\n\r\nConfessions of a Funeral Director_ How the Business of Death Saved My Life by Caleb Wilde ePUB eBOOK-ZAK\r\n\r\nA sixth-generation funeral director and writer of the popular &quot;must read&quot; (Time magazine) blog Confessions of a Funeral Director reflects on mortality and the powerful lessons death holds for every one of us in this compassionate and thoughtful spiritual memoir that combines the humor and insight of Smoke Gets in Your Eyes with the poignancy and brevity of When Breath Becomes Air.\r\n\r\nDeath. It happens to everyone, yet most of us don&apos;t want to talk about this final chapter of existence. Sixth-generation funeral director Caleb Wilde intimately understands this reticence and fear. The son of an undertaker, he hesitated to embrace the legacy of running his family&apos;s business. Yet he discovered that caring for the deceased and their loved ones profoundly changed his faith and his perspective on death - and life itself. &quot;Yes, death can be bad. Yes, death can be negative,&quot; he acknowledges, &quot;but it can also be beautiful. And that alternate narrative needs to be discussed&quot;.\r\n\r\nIn Confessions of a Funeral Director, he talks about his experiences and pushes back against the death-negative ethos of our culture, opening a thoughtful, poignant conversation to help us see the end of life in a positive and liberating way. In the wry, compassionate, and honest voice that has charmed his growing legions of blog readers, Wilde offers an intimate look inside his business, offering information on unspoken practices around death such as the embalming process, beautiful and memorable stories about families in the wake of death, and, most importantly, a fresh and wise perspective on how embracing death can allow us to embrace life.\r\n\r\nConfessions of a Funeral Director is the story of one man learning how death illuminates and deepens the meaning of existence - insights that can help us all pursue and cherish full, rich lives.\r\n\r\nxx","last_updated":"2017-09-26T12:06:52.771Z","parsed":{"xt":"urn:btih:e48020145c4903341d0c47e1407b44922b43653c","dn":"Confessions of a Funeral Director_ How the Business of Death Sav","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e48020145c4903341d0c47e1407b44922b43653c","infoHashBuffer":{"type":"Buffer","data":[228,128,32,20,92,73,3,52,29,12,71,225,64,123,68,146,43,67,101,60]},"name":"Confessions of a Funeral Director_ How the Business of Death Sav","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}