{"title":"\nWe Were the Lucky Ones by Georgia Hunter ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:e4a2ca41c0f6e8631fee168f8925127760df0dbd&dn=We+Were+the+Lucky+Ones+by+Georgia+Hunter+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3700451","seeders":"0","leechers":"0","description":"xx\r\n\r\nWe Were the Lucky Ones by Georgia Hunter ePUB eBOOK-ZAK\r\n\r\nAn extraordinary, propulsive novel based on the true story of a family of Polish Jews who are separated at the start of the Second World War, determined to survive - and to reunite.\r\n\r\nIt is the spring of 1939, and three generations of the Kurc family are doing their best to live normal lives, even as the shadow of war grows closer. The talk around the family Seder table is of new babies and budding romance, not of the increasing hardships threatening Jews in their hometown of Radom, Poland. But soon the horrors overtaking Europe will become inescapable, and the Kurcs will be flung to the far corners of the world, each desperately trying to navigate his or her own path to safety.\r\n\r\nAs one sibling is forced into exile, another attempts to flee the continent while others struggle to escape certain death, either by working grueling hours on empty stomachs in the factories of the ghetto or by hiding as gentiles in plain sight. Driven by an unwavering will to survive and by the fear that they may never see one another again, the Kurcs must rely on hope, ingenuity, and inner strength to persevere.\r\n\r\nA novel of breathtaking sweep and scope that spans five continents and six years and transports readers from the jazz clubs of Paris to Krakow&apos;s most brutal prison to the ports of Northern Africa and the farthest reaches of the Siberian gulag, We Were the Lucky Ones demonstrates how in the face of the 20th century&apos;s darkest moment, the human spirit could find a way to survive and even triumph.\r\n\r\nxx","last_updated":"2017-09-23T12:01:36.157Z","parsed":{"xt":"urn:btih:e4a2ca41c0f6e8631fee168f8925127760df0dbd","dn":"We Were the Lucky Ones by Georgia Hunter ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4a2ca41c0f6e8631fee168f8925127760df0dbd","infoHashBuffer":{"type":"Buffer","data":[228,162,202,65,192,246,232,99,31,238,22,143,137,37,18,119,96,223,13,189]},"name":"We Were the Lucky Ones by Georgia Hunter ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}