{"title":"\nThe Indigo Girl_ A Novel by Natasha Boyd ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:e4a485701111c9eddf8a8799e3db68200c3945c3&dn=The+Indigo+Girl_+A+Novel+by+Natasha+Boyd+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2967771","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Indigo Girl_ A Novel by Natasha Boyd ePUB eBOOK-ZAK\r\n\r\nThe year is 1739. Eliza Lucas is 16-years-old when her father leaves her in charge of their family&apos;s three plantations in rural South Carolina and then proceeds to bleed the estates dry in pursuit of his military ambitions. Tensions with the British and with the Spanish in Florida, just a short way down the coast, are rising, and slaves are becoming restless. Her mother wants nothing more than for their South Carolina endeavor to fail so they can go back to England. Soon, their family is in danger of losing everything.\r\n\r\nHearing how much the French pay for indigo dye, Eliza believes it&apos;s the key to their salvation. But everyone tells her it&apos;s impossible, and no one will share the secret to making it. Thwarted at nearly every turn, even by her own family, Eliza finds her only allies in an aging horticulturalist, an older gentleman lawyer, and a slave with whom she strikes a dangerous deal: teach her the intricate, thousand-year-old secret process of making indigo dye and, in return - against the laws of the day - she will teach the slaves to read.\r\n\r\nSo begins an incredible story of dangerous and hidden friendships, ambition, betrayal, and sacrifice.\r\n\r\nBased on historical documents and Eliza Lucas&apos; own letters, this is a historical fiction account of how young Eliza Lucas produced indigo dye, which became one of South Carolina&apos;s largest exports, an export that laid the foundation for the incredible wealth of the South. Although largely overlooked by historians, the accomplishments of Eliza Lucas influenced the course of US history. When she passed away in 1793, President George Washington, at his own request, served as a pallbearer at her funeral.\r\n\r\nThis book is set between the years 1739 and 1744, with romance, intrigue, forbidden friendships, and political and financial threats weaving together the story of a remarkable young woman whose actions were far ahead of their time.\r\n\r\nxx","last_updated":"2017-10-07T12:00:57.522Z","parsed":{"xt":"urn:btih:e4a485701111c9eddf8a8799e3db68200c3945c3","dn":"The Indigo Girl_ A Novel by Natasha Boyd ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4a485701111c9eddf8a8799e3db68200c3945c3","infoHashBuffer":{"type":"Buffer","data":[228,164,133,112,17,17,201,237,223,138,135,153,227,219,104,32,12,57,69,195]},"name":"The Indigo Girl_ A Novel by Natasha Boyd ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}