{"title":"PBS Nova Inifinite Secrets The Genius of Archimedes 2003 DVDRip ","magnet":"magnet:?xt=urn:btih:e4d864d448f8fc93b3fd84f58af413f1c2cbd5d1&dn=PBS+Nova+Inifinite+Secrets+The+Genius+of+Archimedes+2003+DVDRip+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"MVGroup","categoryP":"video","categoryS":"hd___movies","size":"3355379621","seeders":"55","leechers":"17","description":"Genius of Archimedes\r\n\r\n\r\n&quot;This is one of NOVA&apos;s shining episodes--one of the most exciting works the venerable series has produced in recent years.&quot; -- The Christian Science Monitor\r\nIn 1991, a small Medieval prayer book was sold at auction. Miraculously, some original writings of Archimedes, the brilliant Greek mathematician, were discovered hidden beneath the religious text. Through scholarly detective work with the help of modern technology, this book now reveals Archimedes&apos; stunningly original concepts, ideas, and theories--revelations that, if known sooner, might have reshaped our world. \r\nMany historic figures have been hailed as ahead of their time. Few--if any--are said to be centuries ahead of their time. The Einstein of his era, Archimedes had a sophisticated understanding of mathematics, and designed marvelous war machines for his native Syracuse to use against the invading Romans. Many of Archimedes&apos; works disappeared during the Middle Ages, but some survived to help inspire the scientific revolution in the sixteenth and seventeenth centuries. One document that seemed irretrievably lost was his final treatise The Method, which reputedly explained how he achieved his brilliant results--secrets he revealed nowhere else. Now, over 2200 years later, the discovery of The Method has experts and scientists dreaming of what might have been if Renaissance thinkers and other great minds had known of his ideas and been able to build on them. \r\nNOVA explores Archimedes&apos; rare writings, as well as the book&apos;s mysterious beginnings, tumultuous history and amazing discovery. As the ancient text comes back from the dead, it unlocks its revolutionary contents--the infinite secrets of one of history&apos;s greatest thinkers.\r\n\r\n\r\nTechnical Specs\r\n------------------------------\r\n\r\n\r\n * Video Codec: mkv\r\n * Video Bitrate: 7.5MB/s\r\n * Video Resolution: 720x480\r\n * Video Aspect Ratio: 4:3\r\n * Audio - English\r\n * Audio Codec: AC-3\r\n * Audio Bitrate: 384kb/s\r\n * RunTime : 56 min\r\n * Size: 3.12 GB\r\nReleaser jmr123","last_updated":"2017-11-05T12:12:22.277Z","parsed":{"xt":"urn:btih:e4d864d448f8fc93b3fd84f58af413f1c2cbd5d1","dn":"PBS Nova Inifinite Secrets The Genius of Archimedes 2003 DVDRip ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4d864d448f8fc93b3fd84f58af413f1c2cbd5d1","infoHashBuffer":{"type":"Buffer","data":[228,216,100,212,72,248,252,147,179,253,132,245,138,244,19,241,194,203,213,209]},"name":"PBS Nova Inifinite Secrets The Genius of Archimedes 2003 DVDRip ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}