{"title":"Scream by Tama Janowitz 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:e4f270fd5a2712b382800639cc3d01f0c985e927&dn=Scream+by+Tama+Janowitz+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4884360","seeders":"9","leechers":"8","description":"xx\r\n\r\nScream by Tama Janowitz 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIn this darkly funny, surprising memoir, the original &quot;Lit Girl&quot; and author of the era-defining Slaves of New York considers her life in and outside of New York City, from the heyday of the 1980s to her life today in a tiny upstate town that proves that fact is always stranger than fiction.\r\n\r\nWith the publication of her acclaimed short story collection Slaves of New York, Tama Janowitz was crowned the Lit Girl of New York. Celebrated in rarified literary and social circles, she was hailed, alongside Mark Lindquist, Bret Easton Ellis, and Jay McInerney, as one of the original &quot;Brat Pack&quot; writers - a wave of young minimalist authors whose wry, urbane sensibility captured the zeitgeist of the time, propelling them to the forefront of American culture.\r\n\r\nIn Scream, her first memoir, Janowitz recalls the quirky literary world of young downtown New York in the go-go 1980s and reflects on her life today far away from the city indelible to her work. As in Slaves of New York and A Certain Age, Janowitz turns a critical eye toward life, this time her own, recounting the vagaries of fame and fortune as a writer devoted to her art. Here, too, is Tama as daughter, wife, and mother, wrestling with aging, loss, and angst both adolescent (her daughter) and middle aged (her own) as she cares for a mother plagued by dementia, battles a brother who questions her choices, and endures the criticism of a surly teenager.\r\n\r\nFilled with a very real, very personal cast of characters, Scream is an intimate, scorching memoir rife with the humor, insight, and experience of a writer with a surgeon&apos;s eye for detail and a skill for cutting straight to the strangest parts of life.\r\n\r\nxx","last_updated":"2017-09-06T12:00:42.661Z","parsed":{"xt":"urn:btih:e4f270fd5a2712b382800639cc3d01f0c985e927","dn":"Scream by Tama Janowitz 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e4f270fd5a2712b382800639cc3d01f0c985e927","infoHashBuffer":{"type":"Buffer","data":[228,242,112,253,90,39,18,179,130,128,6,57,204,61,1,240,201,133,233,39]},"name":"Scream by Tama Janowitz 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}