{"title":"Rising Star: The Making of Barack Obama/David Garrow/2017/EPUB","magnet":"magnet:?xt=urn:btih:e501275fde16fa1430b3fca33db3160a6208c971&dn=Rising+Star%3A+The+Making+of+Barack+Obama%2FDavid+Garrow%2F2017%2FEPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"john1942","categoryP":"other","categoryS":"e_books","size":"2811797","seeders":"0","leechers":"0","description":"Rising Star: The Making of Barack Obama/David Garrow/2017/EPUB\r\n\r\nEnglish|Non-Fiction|ASIN: B01KFBO82E|1472pg|2.65MB\r\n\r\nRising Star: The Making of Barack Obama captivatingly describes Barack Obama&apos;s tumultuous upbringing as a young black man attending an almost-all-white, elite private school in Honolulu while being raised almost exclusively by his white grandparents. \r\nAfter recounting Obama&apos;s college years in California and New York, Garrow charts Obama&apos;s time as a Chicago community organizer, working in some of the city&apos;s roughest neighborhoods; his years at the top of his Harvard Law School class; and his return to Chicago, where Obama honed his skills as a hard-knuckled politician, first in the state legislature and then as a candidate for the United States Senate.\r\n\r\nDetailing a scintillating, behind-the-scenes account of Obama&apos;s 2004 speech, a moment that labeled him the Democratic Party&apos;s &quot;rising star,&quot; Garrow also chronicles Obama&apos;s four years in the Senate, weighing his stands on various issues against positions he had taken years earlier, and recounts his thrilling run for the White House in 2008.\r\n\r\nIn Rising Star, David J. Garrow has created a vivid portrait that reveals not only the people and forces that shaped the future president but also the ways in which he used those influences to serve his larger aspirations. \r\n\r\nThis is a gripping read about a young man born into uncommon family circumstances, whose faith in his own talents came face-to-face with fantastic ambitions and a desire to do good in the world. Most important, Rising Star is an extraordinary work of biography&#x2014;tremendous in its research and storytelling, and brilliant in its analysis of the all-too-human struggles of one of the most fascinating politicians of our time","last_updated":"2017-05-09T19:34:26.852Z","parsed":{"xt":"urn:btih:e501275fde16fa1430b3fca33db3160a6208c971","dn":"Rising Star: The Making of Barack Obama/David Garrow/2017/EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e501275fde16fa1430b3fca33db3160a6208c971","infoHashBuffer":{"type":"Buffer","data":[229,1,39,95,222,22,250,20,48,179,252,163,61,179,22,10,98,8,201,113]},"name":"Rising Star: The Making of Barack Obama/David Garrow/2017/EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}