{"title":"The Fold_ A Novel by Peter Clines ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:e541efc91482ace109dc394d0a3640e2d846aba9&dn=The+Fold_+A+Novel+by+Peter+Clines+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"2853446","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Fold_ A Novel by Peter Clines ePUB eBOOK-ZAK\r\n\r\nStep into the fold. It&apos;s perfectly safe.\r\n\r\nThe folks in Mike Erikson&apos;s small New England town would say he&apos;s just your average, everyday guy. And that&apos;s exactly how Mike likes it. Sure, the life he&apos;s chosen isn&apos;t much of a challenge to someone with his unique gifts, but he&apos;s content with his quiet and peaceful existence. That is until an old friend presents him with an irresistible mystery, one that Mike is uniquely qualified to solve.\r\n\r\nFar out in the California desert, a team of DARPA scientists has invented a device they affectionately call the Albuquerque Door. Using a cryptic computer equation and magnetic fields to &quot;fold&quot; dimensions, it shrinks distances so a traveler can travel hundreds of feet with a single step. The invention promises to make mankind&apos;s dreams of teleportation a reality. And, the scientists insist, traveling through the door is completely safe. Yet evidence is mounting that this miraculous machine isn&apos;t quite what it seems - and that its creators are harboring a dangerous secret.\r\n\r\nAs his investigations draw him deeper into the puzzle, Mike begins to fear there&apos;s only one answer that makes sense. And if he&apos;s right, it may be only a matter of time before the project destroys...everything. A cunningly inventive mystery featuring a hero worthy of Sherlock Holmes and a terrifying final twist you&apos;ll never see coming, The Fold is that rarest of things: a genuine pause-resister science-fiction thriller. \r\n\r\nxx","last_updated":"2017-08-09T12:00:25.466Z","parsed":{"xt":"urn:btih:e541efc91482ace109dc394d0a3640e2d846aba9","dn":"The Fold_ A Novel by Peter Clines ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e541efc91482ace109dc394d0a3640e2d846aba9","infoHashBuffer":{"type":"Buffer","data":[229,65,239,201,20,130,172,225,9,220,57,77,10,54,64,226,216,70,171,169]},"name":"The Fold_ A Novel by Peter Clines ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}