{"title":"Henry VIII's Last Love: The Life of Katherine Willoughby","magnet":"magnet:?xt=urn:btih:e5569cdde8f1ef1b01446ed5c869f8a2b889dce2&dn=Henry+VIII%27s+Last+Love%3A+The+Life+of+Katherine+Willoughby&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"anders","categoryS":"e_books","size":"10202835","seeders":"11","leechers":"3","description":"Henry VIII&apos;s Last Love: The Extraordinary Life of Katherine Willoughby, Lady-in-Waiting to the Tudors - David Baldwin [epub]\r\n\r\nIn 1533 Katherine Willoughby married Charles Brandon, Henry VIII&#x2019;s closest friend. She would go on to serve at the court of every Tudor monarch bar Henry VII and Mary Tudor. Duchess of Suffolk at the age of fourteen, she became a powerful woman ruling over her houses at Grimsthorpe and Tattershall in Lincolnshire and wielding subtle influence through her proximity to the king.\r\n\r\nShe grew to know Henry well and in 1538, only three months after Jane Seymour&#x2019;s death, it was reported that they had been &#x2018;masking and visiting&#x2019; together. In 1543 she became a lady-in-waiting to his sixth wife Catherine Parr. Henry had a reputation for tiring of his wives once the excitement of the pursuit was over, and in February 1546, only six months after Charles Brandon&#x2019;s death, it was rumoured that Henry intended to wed Katherine himself if he could end his present marriage. But Henry changed his mind at the last moment, and Katherine Willoughby never became his seventh queen.\r\n\r\nHers was a life of privilege mixed with tragedy and danger, losing both her sons to illness and being forced into exile in Poland beyond &apos;Bloody&apos; Mary&apos;s clutches. But Katherine kept her head on her shoulders when many of her contemporaries lost theirs for lesser reasons.\r\n\r\nDavid Baldwin is a medieval historian who has taught at the Universities of Leicester and Nottingham for many years. His historical research has focused on the great medieval families in the Midlands and he has contributed articles to historical journals and lectured regularly to societies and conferences in this field.\r\n\r\nHardcover: 272 pages\r\nPublisher: Amberley; 1st edition (May 19, 2015)","last_updated":"2017-08-30T12:01:21.961Z","parsed":{"xt":"urn:btih:e5569cdde8f1ef1b01446ed5c869f8a2b889dce2","dn":"Henry VIII's Last Love: The Life of Katherine Willoughby","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e5569cdde8f1ef1b01446ed5c869f8a2b889dce2","infoHashBuffer":{"type":"Buffer","data":[229,86,156,221,232,241,239,27,1,68,110,213,200,105,248,162,184,137,220,226]},"name":"Henry VIII's Last Love: The Life of Katherine Willoughby","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}