{"title":"[R.G. Mechanics] Need For Speed Payback [Deluxe Edition]","magnet":"magnet:?xt=urn:btih:e558b7ee9f27478cdf9b9f5e8668fb0845573e15&dn=%5BR.G.+Mechanics%5D+Need+For+Speed+Payback+%5BDeluxe+Edition%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"moonoon2","categoryP":"games","categoryS":"pc","size":"38791253508","seeders":"1","leechers":"0","description":"Dear users, this torrent is updated to version Patch 01\r\n\r\n\r\nNeed for Speed&#x2122;, one of the world&#x2019;s bestselling video game franchises returns with a vengeance in the new Need for Speed Payback.\r\n\r\nSet in the underworld of Fortune Valley, you and your crew were divided by betrayal and reunited by revenge to take down The House, a nefarious cartel that rules the city&#x2019;s casinos, criminals and cops. In this corrupt gambler&#x2019;s paradise, the stakes are high and The House always wins.\r\n\r\nCraft unique rides with deeper performance and visual customisation than ever before. Push them to the limit when you narrowly escape the heat in epic cop battles. From insane heist missions to devastating car battles to jaw-dropping set piece moments, Need for Speed Payback delivers an edge-of-your-seat, adrenaline-fueled action-driving fantasy.\r\n\r\nKey Features:\r\n\r\nScrap to stock to supercar. Your car is at the center of everything you do in Need for Speed Payback. Endlessly fine-tune your performance with each of the five distinct car classes (Race, Drift, Off-Road, Drag and Runner) to turn the tables on the competition in any race, mission or challenge.\r\n\r\nLive out an action-driving fantasy. Play as three distinct characters united by one common goal: revenge. Tyler, Mac and Jess team up to even the score against all odds, and enter the ultimate race to take down The House. Battle cops with ever-increasing intensity, race against rivals across the city and drive on and off-road through mountains, canyons and deserts.\r\n\r\nHigh stakes competition. Win big with all-new Risk vs Reward gameplay. Intense cop chases mean the stakes have never been higher. Challenge your friends or potential rivals via Autolog recommendations throughout the events or go head-to-head in classic online leaderboards","last_updated":"2017-12-20T12:02:07.919Z","parsed":{"xt":"urn:btih:e558b7ee9f27478cdf9b9f5e8668fb0845573e15","dn":"[R.G. Mechanics] Need For Speed Payback [Deluxe Edition]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e558b7ee9f27478cdf9b9f5e8668fb0845573e15","infoHashBuffer":{"type":"Buffer","data":[229,88,183,238,159,39,71,140,223,155,159,94,134,104,251,8,69,87,62,21]},"name":"[R.G. Mechanics] Need For Speed Payback [Deluxe Edition]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}