{"title":"Neither Snow nor Rain by Devin Leonard MOBI","magnet":"magnet:?xt=urn:btih:e58daa492ce541453b2b363ce6a0a9d073d27ed9&dn=Neither+Snow+nor+Rain+by+Devin+Leonard+MOBI&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"6687267","seeders":"26","leechers":"5","description":"xx\r\n\r\nNeither Snow nor Rain by Devin Leonard MOBI\r\n\r\nFew institutions are as loved, as loathed, and as historically important as the United States Postal Service, the subject of this landmark century-spanning social, political, and economic history.\r\n\r\nThe United States Postal Service is a wondrous American creation. Seven days a week, its army of 300,000 letter carriers delivers 513 million pieces of mail, 40 percent of the world&apos;s volume. It is far more efficient than any other mail service - more than twice as efficient as the Japanese and easily outpacing the Germans and British. And the USPS has a storied history.\r\n\r\nFounded by Benjamin Franklin, it was the information network that bound far-flung Americans together, fostered a common culture, and helped American business to prosper. A first class stamp remains one of the greatest bargains of all time, and yet the USPS is slowly vanishing. Critics say it is slow and archaic. Mail volume is down. The workforce is shrinking. Post offices are closing.\r\n\r\nIn Neither Snow nor Rain, journalist Devin Leonard tackles the fascinating, centuries-long history of the USPS, from the first letter carriers through Franklin&apos;s days, when postmasters worked out of their homes and post roads cut new paths through the wilderness. Under Andrew Jackson, the post office was molded into a vast patronage machine, and by the 1870s, over 70 percent of federal employees were postal workers. As the country boomed, USPS aggressively developed new technology, from mobile post offices on railroads and air mail service to mechanical sorting machines and optical character readers.\r\n\r\nNeither Snow nor Rain is a rich, multifaceted history full of remarkable characters, from the stamp-collecting FDR to the revolutionaries who challenged USPS&apos; monopoly on mail to the renegade union members who brought the system - and the country - to a halt in the 1970s. An exciting and engrossing read, Neither Snow nor Rain is the first major history of the USPS in over 50 years.\r\n\r\nxx","last_updated":"2017-12-26T12:06:05.151Z","parsed":{"xt":"urn:btih:e58daa492ce541453b2b363ce6a0a9d073d27ed9","dn":"Neither Snow nor Rain by Devin Leonard MOBI","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e58daa492ce541453b2b363ce6a0a9d073d27ed9","infoHashBuffer":{"type":"Buffer","data":[229,141,170,73,44,229,65,69,59,43,54,60,230,160,169,208,115,210,126,217]},"name":"Neither Snow nor Rain by Devin Leonard MOBI","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}