{"title":"Florentine Codex 1a","magnet":"magnet:?xt=urn:btih:e5fe2a68a139e7b2e216f513618b4f77e2d688aa&dn=Florentine+Codex+1a&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"jesus_malverde","categoryP":"other","categoryS":"e_books","size":"9309814843","seeders":"0","leechers":"18","description":"The Florentine Codex consists of twelve books that describe Aztec life before the Spanish conquest. Created under the supervision of Franciscan friar Bernadino de Sahagun in the mid- to late 1500s, these manuscripts were compiled from records of conversations and interviews with indigenous people in Tlatelolco, Texcoco, and Tenochtitlan. A Spanish-language version, known as the Historia General de las cosas de Nueva Espana (General History of the Things of New Spain) also exists.\r\nThe Florentine Codex was written primarily in Nahuatl by trilingual (Nahuatl, Spanish, and Latin) Aztec students of Sahagun. The Nahuatl text appears in the right column. Some sections were translated into Spanish, and these translations appear in the left column. Many sections were not translated, and others were only summarized in Spanish. Along with the texts, the Florentine Codex contains approximately 1,800 illustrations done by Aztec tlacuilos using European techniques.\r\nSahagun organized the codex similar to an encyclopedia. He divided the material into books based on subject matter, and each book includes a preface. Aztec history, major gods, calendar, social structure and stratification, and perceptions of the natural world are some of the subjects.\r\nImages in JPEG and TIFF","last_updated":"2017-11-04T12:08:54.032Z","parsed":{"xt":"urn:btih:e5fe2a68a139e7b2e216f513618b4f77e2d688aa","dn":"Florentine Codex 1a","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e5fe2a68a139e7b2e216f513618b4f77e2d688aa","infoHashBuffer":{"type":"Buffer","data":[229,254,42,104,161,57,231,178,226,22,245,19,97,139,79,119,226,214,136,170]},"name":"Florentine Codex 1a","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}