{"title":"Gather the Daughters ~ Jennie Melamed [Shades]epub","magnet":"magnet:?xt=urn:btih:e6efebea3c2b577ed30d31348c5c1265ea9df457&dn=Gather+the+Daughters+%7E+Jennie+Melamed+%5BShades%5Depub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ShadesTPB","categoryP":"other","categoryS":"e_books","size":"798212","seeders":"10","leechers":"1","description":"Gather the Daughters by Jennie Melamed\r\n\r\nISBN: 0316501409\r\nISBN13: 9780316501408\r\n\r\n\r\n\r\nNever Let Me Go meets The Giver in this haunting debut about a cult on an isolated island, where nothing is as it seems.\r\n\r\nYears ago, just before the country was incinerated to wasteland, ten men and their families colonized an island off the coast. They built a radical society of ancestor worship, controlled breeding, and the strict rationing of knowledge and history. Only the Wanderers--chosen male descendants of the original ten--are allowed to cross to the wastelands, where they scavenge for detritus among the still-smoldering fires.\r\n\r\nThe daughters of these men are wives-in-training. At the first sign of puberty, they face their Summer of Fruition, a ritualistic season that drags them from adolescence to matrimony. They have children, who have children, and when they are no longer useful, they take their final draught and die. But in the summer, the younger children reign supreme. With the adults indoors and the pubescent in Fruition, the children live wildly--they fight over food and shelter, free of their fathers&apos; hands and their mothers&apos; despair. And it is at the end of one summer that little Caitlin Jacob sees something so horrifying, so contradictory to the laws of the island, that she must share it with the others.\r\n\r\nBorn leader Janey Solomon steps up to seek the truth. At seventeen years old, Janey is so unwilling to become a woman, she is slowly starving herself to death. Trying urgently now to unravel the mysteries of the island and what lies beyond, before her own demise, she attempts to lead an uprising of the girls that may be their undoing.\r\n\r\nGather The Daughters is a smoldering debut; dark and energetic, compulsively readable, Melamed&apos;s novel announces her as an unforgettable new voice in fiction","last_updated":"2017-08-04T12:02:16.907Z","parsed":{"xt":"urn:btih:e6efebea3c2b577ed30d31348c5c1265ea9df457","dn":"Gather the Daughters ~ Jennie Melamed [Shades]epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e6efebea3c2b577ed30d31348c5c1265ea9df457","infoHashBuffer":{"type":"Buffer","data":[230,239,235,234,60,43,87,126,211,13,49,52,140,92,18,101,234,157,244,87]},"name":"Gather the Daughters ~ Jennie Melamed [Shades]epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}