{"title":"What She Ate - Laura Shapiro [Shades]epub","magnet":"magnet:?xt=urn:btih:e7545590e899cb959a4a7b69d341a8bc2cc1b381&dn=What+She+Ate+-+Laura+Shapiro+%5BShades%5Depub&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ShadesTPB","categoryP":"other","categoryS":"e_books","size":"7722212","seeders":"0","leechers":"0","description":"What She Ate: Six Remarkable Women and the Food That Tells Their Stories by Laura Shapiro\r\n\r\nISBN: 0525427643 \r\nISBN13: 9780525427643\r\n\r\n\r\n\r\nA beloved culinary historian&#x2019;s short takes on six famous women through the lens of food and cooking&#x2014;what they ate and how their attitudes toward food offer surprising new insights into their lives.\r\n\r\nEveryone eats, and food touches on every aspect of our lives&#x2014;social and cultural, personal and political. Yet most biographers pay little attention to people&#x2019;s attitudes toward food, as if the great and notable never bothered to think about what was on the plate in front of them. Once we ask how somebody relates to food, we find a whole world of different and provocative ways to understand her. Food stories can be as intimate and revealing as stories of love, work, or coming-of-age. Each of the six women in this entertaining group portrait was famous in her time, and most are still famous in ours; but until now, nobody has told their lives from the point of view of the kitchen and the table. \r\n\r\nIt&#x2019;s a lively and unpredictable array of women; what they have in common with one another (and us) is a powerful relationship with food. They include Dorothy Wordsworth, whose food story transforms our picture of the life she shared with her famous poet brother; Rosa Lewis, the Edwardian-era Cockney caterer who cooked her way up the social ladder; Eleanor Roosevelt, First Lady and rigorous protector of the worst cook in White House history; Eva Braun, Hitler&#x2019;s mistress, who challenges our warm associations of food, family, and table; Barbara Pym, whose witty books upend a host of stereotypes about postwar British cuisine; and Helen Gurley Brown, the editor of Cosmopolitan, whose commitment to &#x201C;having it all&#x201D; meant having almost nothing on the plate except a supersized portion of diet gelatin","last_updated":"2017-08-04T12:00:57.710Z","parsed":{"xt":"urn:btih:e7545590e899cb959a4a7b69d341a8bc2cc1b381","dn":"What She Ate - Laura Shapiro [Shades]epub","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e7545590e899cb959a4a7b69d341a8bc2cc1b381","infoHashBuffer":{"type":"Buffer","data":[231,84,85,144,232,153,203,149,154,74,123,105,211,65,168,188,44,193,179,129]},"name":"What She Ate - Laura Shapiro [Shades]epub","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}