{"title":"[Marc Dorcel] Luxure I Offer My Wife to Others (DvdRip / 2017)","magnet":"magnet:?xt=urn:btih:e792927a2cd293ed5840ff7d72d095221db7b314&dn=%5BMarc+Dorcel%5D+Luxure+I+Offer+My+Wife+to+Others+%28DvdRip+%2F+2017%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"XSpS","categoryP":"porn","categoryS":"movies","size":"948883844","seeders":"4","leechers":"36","description":"[Marc Dorcel] Luxure I Offer My Wife to Others (DvdRip / 2017)\r\n\r\nTo offer: to present as an act of worship or devotion.\r\nIf couples want to last, they have to preserve the love and passion they felt at the beginning. To do so, these young couples have decided that in order to take full advantage of their time together, they had to share their love with other parnters. Through sensual and perverse games, men share their wives with others. The latter didn&apos;t expect to enjoy it so much.\r\n\r\nOn all fours, entirely submitted to her husband&apos;s desires, Alexa is waiting, just dressed in stockings and high heels, for her husband&apos;s guest to come and take her. So excited to see his wife like this, Joel will join them to take full advantage of the situation.\r\n\r\nKristof and Mina love each other a lot but it doesn&apos;t prevent them from sharing their happiness with other men. Handcuffed, dressed in sexy see through lingerie and an anus jewel between her ass cheeks, Mina knows that Joel, their guest will turn her on like crazy before fucking her ass. After his departure, Mina will take care of her husband who had been a simple voyeur until then.\r\nAnthony is on a business trip. He is staying in his best friend&apos;s wealthy appartment. To entertain him, his host asked his wife to go and spend some time with him. After a hot strip-tease, Cl&#xE9;a will use all her assets to relax her guest.\r\n\r\nFor Dorian&apos;s birthday, Rico, his childhood friend, has a huge surprise. When entering the living room with a blindfold on his eyes, Dorian didn&apos;t expect to receive three half naked women as a present. Even Shona, Rico&apos;s wife accepted to be a part of it and turn the party into a real orgy.\r\nLucy is restless. Tonight, her husband&apos;s fantasy will come true. Rico has invited Ricky, an old friend, to share his wife. He will fuck the pretty blond in the ass while her husband watches and then comes to join them for a hardcore threesome.\r\n\r\nFeature Anal, DP\r\n\r\nScreens:\r\n <a href=\"\nhttp://sho-pic.com/image/qwhO\" rel=\"nofollow\" target=\"_NEW\">\nhttp://sho-pic.com/image/qwhO</a> <a href=\"\nhttp://sho-pic.com/image/qcl7\" rel=\"nofollow\" target=\"_NEW\">\nhttp://sho-pic.com/image/qcl7</a> <a href=\"\nhttp://sho-pic.com/image/q7EE\" rel=\"nofollow\" target=\"_NEW\">\nhttp://sho-pic.com/image/q7EE</a>","last_updated":"2017-09-17T12:07:30.504Z","parsed":{"xt":"urn:btih:e792927a2cd293ed5840ff7d72d095221db7b314","dn":"[Marc Dorcel] Luxure I Offer My Wife to Others (DvdRip / 2017)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e792927a2cd293ed5840ff7d72d095221db7b314","infoHashBuffer":{"type":"Buffer","data":[231,146,146,122,44,210,147,237,88,64,255,125,114,208,149,34,29,183,179,20]},"name":"[Marc Dorcel] Luxure I Offer My Wife to Others (DvdRip / 2017)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}