{"title":"The Cuban Affair by Nelson DeMille ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:e7b5925350c06b4b09373b9677b9ce688fc5544d&dn=The+Cuban+Affair+by+Nelson+DeMille+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5541247","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Cuban Affair by Nelson DeMille ePUB eBOOK-ZAK\r\n\r\nFrom the legendary number-one New York Times best-selling author of Plum Island and Night Fall, Nelson DeMille&apos;s blistering new novel features an exciting new character - US Army combat veteran Daniel &quot;Mac&quot; MacCormick, now a charter boat captain, who is about to set sail on his most dangerous cruise.\r\n\r\nDaniel Graham MacCormick - Mac for short - seems to have a pretty good life. At age 35 he&apos;s living in Key West, owner of a 42-foot charter fishing boat, The Maine. Mac served five years in the army as an infantry officer, with two tours in Afghanistan. He returned with the Silver Star, two Purple Hearts, scars that don&apos;t tan, and a boat with a big bank loan. Truth be told, Mac&apos;s finances are more than a little shaky.\r\n\r\nOne day Mac is sitting in the famous Green Parrot Bar in Key West, contemplating his life and waiting for Carlos, a hotshot Miami lawyer heavily involved with anti-Castro groups. Carlos wants to hire Mac and The Maine for a 10-day fishing tournament to Cuba at the standard rate, but Mac suspects there is more to this and turns it down. The price then goes up to $2 million, and Mac agrees to hear the deal and meet Carlos&apos;s clients - a beautiful Cuban American woman named Sara Ortega and a mysterious older Cuban exile, Eduardo Valazquez.\r\n\r\nWhat Mac learns is that there is 60 million American dollars hidden in Cuba by Sara&apos;s grandfather when he fled Castro&apos;s revolution. With the &quot;Cuban Thaw&quot; underway between Havana and Washington, Carlos, Eduardo, and Sara know it&apos;s only a matter of time before someone finds the stash - by accident or on purpose. And Mac knows if he accepts this job, he&apos;ll walk away rich...or not at all.\r\n\r\nBrilliantly written, with his signature humor, fascinating authenticity from his research trip to Cuba, and heart-pounding pace. Nelson DeMille is a true master of the genre.\r\n\r\nxx","last_updated":"2017-09-19T12:16:55.539Z","parsed":{"xt":"urn:btih:e7b5925350c06b4b09373b9677b9ce688fc5544d","dn":"The Cuban Affair by Nelson DeMille ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e7b5925350c06b4b09373b9677b9ce688fc5544d","infoHashBuffer":{"type":"Buffer","data":[231,181,146,83,80,192,107,75,9,55,59,150,119,185,206,104,143,197,84,77]},"name":"The Cuban Affair by Nelson DeMille ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}