{"title":"The Myth Seekers - The Legacy of Vulcan [ASG]","magnet":"magnet:?xt=urn:btih:e7bc4f71fae9ccb9f68637974376bdf279945f02&dn=The+Myth+Seekers+-+The+Legacy+of+Vulcan+%5BASG%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"gameowl","categoryP":"games","categoryS":"pc","size":"1359506114","seeders":"0","leechers":"2","description":"No Need For Patches Or Serials Just Run Installer And Enjoy The Game!\r\n\r\nAs the 1920&#x2019;s draws to a close, political tensions run high in Italy. When a member of the top-secret Myth Seekers agency goes missing, you&#x2019;re called in to discover the truth. Can you recover the Hammer of Vulcan before havoc is unleashed by the ancient gods? Explore picturesque locations across modern Italy and solve challenging puzzles as you clash with the deadly foe of the Myth Seekers!\r\n\r\nYou play as Amelia, a brilliant expert on Roman mythology and a new asset of the Myth Seekers agency. Your assignment is to continue the investigation of a fellow operative who recently vanished under mysterious circumstances. The first order of business is to locate the Vesuvian Codex and get in touch with an Italian agent named Lorenzo. Together you will need to track down the powerful artifact called Vulcan&#x2019;s Hammer. Time is of the essence as evil forces are also looking for the relic. During this stunning adventure you will travel across Italy, solving countless puzzles and looking for clues in hidden object scenes. Learn the truth behind the destruction of Pompeii and face off against the enemies of the Agency as you race to prevent another catastrophe!\r\n\r\nThe Game Features:\r\nMeet 16 legendary characters from the Roman pantheon!\r\nAccept the mission as a Myth Seekers agent!\r\nUse many divine artifacts created by Vulcan!\r\nSolve almost 40 HO scenes &amp; Minigames!\r\nFeel the Italian mood in 28 captivating locations!\r\n\r\nSystem Requirements:\r\nOS: Windows XP/Vista/Win7/Win8/Win10\r\nCPU: 2 GHz RAM: 1024 MB\r\nDirectX: 9.0\r\nHard Drive: 2 GB\r\n\r\nWork like you don&apos;t need money, love like you&apos;ve never been hurt, and dance like no one&apos;s watching\r\n- Unknown Author -\r\n\r\nAnd Seed like there is no bandwidth limit\r\n\r\nSupport Us Your &quot;Thank You&quot; means a lot\r\n\r\nThanks To VELOCITY And Let&apos;s never forget the work of Flight of the Conchords","last_updated":"2017-08-13T12:03:39.510Z","parsed":{"xt":"urn:btih:e7bc4f71fae9ccb9f68637974376bdf279945f02","dn":"The Myth Seekers - The Legacy of Vulcan [ASG]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e7bc4f71fae9ccb9f68637974376bdf279945f02","infoHashBuffer":{"type":"Buffer","data":[231,188,79,113,250,233,204,185,246,134,55,151,67,118,189,242,121,148,95,2]},"name":"The Myth Seekers - The Legacy of Vulcan [ASG]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}