{"title":"The Great Kanto Earthquake","magnet":"magnet:?xt=urn:btih:e7f9629766d318bb3e440c09c772a57bb9fa5ae1&dn=The+Great+Kanto+Earthquake&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"23609128","seeders":"51","leechers":"7","description":"The Great Kanto Earthquake and the Chimera of National Reconstruction in Japan - J. Charles Schencking [epub]\r\n\r\nIn September 1923, a magnitude 7.9 earthquake devastated eastern Japan, killing more than 120,000 people and leaving two million homeless. Using a rich array of source material, J. Charles Schencking tells for the first time the graphic tale of Tokyo&apos;s destruction and rebirth. In emotive prose, he documents how the citizens of Tokyo experienced this unprecedented calamity and explores the ways in which it rattled people&apos;s deep-seated anxieties about modernity. While explaining how and why the disaster compelled people to reflect on Japanese society, he also examines how reconstruction encouraged the capital&apos;s inhabitants to entertain new types of urbanism as they rebuilt their world.\r\n\r\nSome residents hoped that a grandiose metropolis, reflecting new values, would rise from the ashes of disaster-ravaged Tokyo. Many, however, desired a quick return of the city they once called home. Opportunistic elites advocated innovative state infrastructure to better manage the daily lives of Tokyo residents. Others focused on rejuvenating society&#x2015;morally, economically, and spiritually&#x2015;to combat the perceived degeneration of Japan.\r\n\r\nSchencking explores the inspiration behind these dreams and the extent to which they were realized. He investigates why Japanese citizens from all walks of life responded to overtures for renewal with varying degrees of acceptance, ambivalence, and resistance. His research not only sheds light on Japan&apos;s experience with and interpretation of the earthquake but challenges widespread assumptions that disasters unite stricken societies, creating a &quot;blank slate&quot; for radical transformation. National reconstruction in the wake of the Great Kanto Earthquake, Schencking demonstrates, proved to be illusive","last_updated":"2017-06-05T12:04:07.219Z","parsed":{"xt":"urn:btih:e7f9629766d318bb3e440c09c772a57bb9fa5ae1","dn":"The Great Kanto Earthquake","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e7f9629766d318bb3e440c09c772a57bb9fa5ae1","infoHashBuffer":{"type":"Buffer","data":[231,249,98,151,102,211,24,187,62,68,12,9,199,114,165,123,185,250,90,225]},"name":"The Great Kanto Earthquake","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}