{"title":"DiRT.4-RELOADED","magnet":"magnet:?xt=urn:btih:e80f239f88657ff046260705cfcc23d242eb2970&dn=DiRT.4-RELOADED&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"xfoleyx","categoryP":"games","categoryS":"pc","size":"33940234353","seeders":"2","leechers":"3","description":"DiRT 4 (c) Codemasters\r\n   \r\nRELEASE.DATE..... ;06/2017\r\nPROTECTION .......: Steam\r\nDISC(S)  .......... : 1\r\nGAME.TYPE ........: Racing, Simulation, Sports\r\n\r\n\r\n\r\nDiRT 4 will feature a game changing system called Your Stage; an innovative rally route creation tool that allows you to produce a near infinite number of unique stages at the touch of a button. You choose your location and set the route parameters, then Your Stage does the hard work to create a unique rally stage that you can race, share with your friends and then challenge them to beat your time. Your Stage allows experienced rally players to create longer, more technical routes, whilst newcomers can create simpler shorter routes as they hone their skills.\r\n\r\nGlobally renowned for delivering premium quality, authentic and fun racing games, Codemasters is once more bringing its talent and experience to the world of off-road driving. With DiRT 4, the team have sought to combine the levels of thrill and realism from last year&#x2019;s DiRT Rally with the fearless excitement, accessibility and adrenalin-fuelled contests previously seen in its critically acclaimed prequels DiRT 2 and DiRT 3.\r\n\r\nFeaturing classic rally racing that continues to build on the foundations set by the Colin McRae Rally games, the bruising contests from the official FIA World Rallycross Championship, the crazy battles of racing trucks and buggies, and the outrageous fun of open events in Joyride, players will face the challenges from as far apart as Australia, Spain and California in a truly global sport","last_updated":"2017-06-14T12:04:42.183Z","parsed":{"xt":"urn:btih:e80f239f88657ff046260705cfcc23d242eb2970","dn":"DiRT.4-RELOADED","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e80f239f88657ff046260705cfcc23d242eb2970","infoHashBuffer":{"type":"Buffer","data":[232,15,35,159,136,101,127,240,70,38,7,5,207,204,35,210,66,235,41,112]},"name":"DiRT.4-RELOADED","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}