{"title":"Writings on the Wall by Kareem Abdul Jabbar 2016 RETAiL ePUB eBO","magnet":"magnet:?xt=urn:btih:e8d768d5eaa898f21f4954f0f962f10e96f0aa75&dn=Writings+on+the+Wall+by+Kareem+Abdul+Jabbar+2016+RETAiL+ePUB+eBO&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3885104","seeders":"17","leechers":"12","description":"xx\r\n\r\nWritings on the Wall by Kareem Abdul Jabbar 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nBest-selling author, basketball legend, and cultural commentator Kareem Abdul-Jabbar explores the heart of issues that affect Americans today.\r\n\r\nSince retiring from professional basketball as the NBA&apos;s all-time leading scorer, six-time MVP and Hall of Fame inductee Kareem Abdul-Jabbar has become a lauded observer of culture and society, a New York Times best-selling author, and a regular contributor to The Washington Post, TIME magazine and TIME.com.\r\n\r\nHe now brings that keen insight to the fore in Writings on the Wall: Searching for a New Equality Beyond Black and White, his most incisive and important work of nonfiction in years. He uses his unique blend of erudition, street smarts, and authentic experience in essays on the country&apos;s seemingly irreconcilable partisan divide, both racial and political; parenthood; and his own experiences as an athlete, an African American, and a Muslim. The book is not just a collection of expositions; he also offers keen assessments of and solutions to problems such as racism in sports while speaking candidly about his experiences on the court and off.\r\n\r\nTimed for publication as the nation debates whom to send to the White House, the combination of plain talk on issues, life lessons, and personal stories places Writings on the Wall squarely in the middle of the conversation, as many of Abdul-Jabbar&apos;s topics are at the top of the national agenda. Whether it is sparring with Donald Trump, within the pages of TIME magazine, or full-length features in The New York Times Magazine, writers, critics, and readers have come to agree on what The Washington Post observed: Abdul-Jabbar &quot;has become a vital, dynamic and unorthodox cultural voice.&quot;\r\n\r\nxx","last_updated":"2017-09-19T12:42:31.792Z","parsed":{"xt":"urn:btih:e8d768d5eaa898f21f4954f0f962f10e96f0aa75","dn":"Writings on the Wall by Kareem Abdul Jabbar 2016 RETAiL ePUB eBO","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e8d768d5eaa898f21f4954f0f962f10e96f0aa75","infoHashBuffer":{"type":"Buffer","data":[232,215,104,213,234,168,152,242,31,73,84,240,249,98,241,14,150,240,170,117]},"name":"Writings on the Wall by Kareem Abdul Jabbar 2016 RETAiL ePUB eBO","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}