{"title":"Behind the Beautiful Forevers_ Life Death and Hope in a Mumbai U","magnet":"magnet:?xt=urn:btih:e91ed8b5c581fe21ce383ed1bb318cfaaff1959e&dn=Behind+the+Beautiful+Forevers_+Life+Death+and+Hope+in+a+Mumbai+U&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5087989","seeders":"0","leechers":"0","description":"xx\r\n\r\nBehind the Beautiful Forevers_ Life Death and Hope in a Mumbai Undercity by Katherine Boo 2012 Retail EPUB eBook-BitBook\r\n\r\nNational Book Award, Nonfiction, 2012\r\n\r\nFrom Pulitzer Prize-winner Katherine Boo, a landmark work of narrative nonfiction that tells the dramatic and sometimes heartbreaking story of families striving toward a better life in one of the 21st century&#x2019;s great, unequal cities.\r\n\r\nIn this brilliantly written, fast-paced book, based on three years of uncompromising reporting, a bewildering age of global change and inequality is made human.\r\n\r\nAnnawadi is a makeshift settlement in the shadow of luxury hotels near the Mumbai airport, and as India starts to prosper, Annawadians are electric with hope. Abdul, a reflective and enterprising Muslim teenager, sees &#x201C;a fortune beyond counting&#x201D; in the recyclable garbage that richer people throw away. Asha, a woman of formidable wit and deep scars from a childhood in rural poverty, has identified an alternate route to the middle class: political corruption. With a little luck, her sensitive, beautiful daughter&#x2014;Annawadi&#x2019;s &#x201C;most-everything girl&#x201D;&#x2014;will soon become its first female college graduate. And even the poorest Annawadians, like Kalu, a fifteen-year-old scrap-metal thief, believe themselves inching closer to the good lives and good times they call &#x201C;the full enjoy.&#x201D;\r\n\r\nBut then Abdul the garbage sorter is falsely accused in a shocking tragedy; terror and a global recession rock the city; and suppressed tensions over religion, caste, sex, power and economic envy turn brutal. As the tenderest individual hopes intersect with the greatest global truths, the true contours of a competitive age are revealed. And so, too, are the imaginations and courage of the people of Annawadi.\r\n\r\nWith intelligence, humor, and deep insight into what connects human beings to one another in an era of tumultuous change, Behind the Beautiful Forevers carries the reader headlong into one of the 21st century&#x2019;s hidden worlds, and into the lives of people impossible to forget.\r\n\r\nxx","last_updated":"2017-08-25T12:00:29.302Z","parsed":{"xt":"urn:btih:e91ed8b5c581fe21ce383ed1bb318cfaaff1959e","dn":"Behind the Beautiful Forevers_ Life Death and Hope in a Mumbai U","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e91ed8b5c581fe21ce383ed1bb318cfaaff1959e","infoHashBuffer":{"type":"Buffer","data":[233,30,216,181,197,129,254,33,206,56,62,209,187,49,140,250,175,241,149,158]},"name":"Behind the Beautiful Forevers_ Life Death and Hope in a Mumbai U","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}