{"title":"XYplorer v17.90.0400 Final + Keygen - [SH]","magnet":"magnet:?xt=urn:btih:e942ae8b56953dddeef76d47907606858ec0ce53&dn=XYplorer+v17.90.0400+Final+%2B+Keygen+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"4029592","seeders":"11","leechers":"4","description":"XYplorer is an Advanced File System Explorer targeting everybody who is looking for a real alternative to the Windows Explorer. It has the following features: Created Date, Last Accessed Date and Attributes are shown right in the file list. Extended file find supporting NT-only features, and including binary string search. Multiple location search (find files in all selected directories). Generates various sorts of file system reports (to clipboard, file, and printer &#x2013; we are talking about one-click directory print-outs here). Export extended file informations of whole directories (or even directory trees) to CSV-formatted files. [Column Width Auto-Adjustment.\r\n\r\nHighly customizable display formats for file size and date information. For each file and folder, the (real!) disk space used is immediately displayed. Remembers last folder location and sort order. Browser-like history functionality. Can define favorite folders. A large suite of useful commands added to the standard file context menu, including Copy To, Move To, Copy Filename with Path, Copy File Properties, Copy Large/Small Icon, Multi-file Rename. Icon-extraction, multi-file time-stamping and attribute-stamping. Instant display of complete file/version information for each selected file. Instant preview of image, audio, and video files (displaying detailed media information). Instant file content view for all files (ASCII and binary), including text extraction from binaries (BTW: the fastest on the market). Full support for drag&#x2019;n&#x2019;drop and wheel mouse. Made to handle heavy-duty jobs. Easy to install, and easy to remove. Installing and running the program does not change your system or registry. Easy to use, start working in no time (interface closely follows Explorer standards). Small, fast, and RAM-friendly","last_updated":"2017-06-01T12:12:59.012Z","parsed":{"xt":"urn:btih:e942ae8b56953dddeef76d47907606858ec0ce53","dn":"XYplorer v17.90.0400 Final   Keygen - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e942ae8b56953dddeef76d47907606858ec0ce53","infoHashBuffer":{"type":"Buffer","data":[233,66,174,139,86,149,61,221,238,247,109,71,144,118,6,133,142,192,206,83]},"name":"XYplorer v17.90.0400 Final   Keygen - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}