{"title":"Jonathan Allen - Shattered_ Inside Hillary Clinton's Doomed Camp","magnet":"magnet:?xt=urn:btih:e94c4bbf47b1c45ea908489ca35732f99ea025bf&dn=Jonathan+Allen+-+Shattered_+Inside+Hillary+Clinton%27s+Doomed+Camp&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"8541400","seeders":"0","leechers":"0","description":"xx\r\n\r\nJonathan Allen - Shattered_ Inside Hillary Clinton&apos;s Doomed Campaign 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nIt was never supposed to be this close. And of course she was supposed to win. How Hillary Clinton lost the 2016 election to Donald Trump is the tragic story of a sure thing gone off the rails. For every Comey revelation or hindsight acknowledgment about the electorate, no explanation of defeat can begin with anything other than the core problem of Hillary&apos;s campaign - the candidate herself.\r\n\r\nThrough deep access to insiders from the top to the bottom of the campaign, political writers Jonathan Allen and Amie Parnes have reconstructed the key decisions and unseized opportunities, the well-intentioned misfires and the hidden thorns that turned a winnable contest into a devastating loss. Drawing on the authors&apos; deep knowledge of Hillary from their previous book, the acclaimed biography HRC, Shattered will offer an object lesson in how Hillary herself made victory an uphill battle, how her difficulty articulating a vision irreparably hobbled her impact with voters, and how the campaign failed to internalize the lessons of populist fury from the hard-fought primary against Bernie Sanders.\r\n\r\nMoving blow by blow from the campaign&apos;s difficult birth through the bewildering terror of election night, Shattered tells an unforgettable story with urgent lessons both political and personal, filled with revelations that will change the way readers understand just what happened to America on November 8, 2016.\r\n\r\nxx","last_updated":"2017-08-09T12:00:59.320Z","parsed":{"xt":"urn:btih:e94c4bbf47b1c45ea908489ca35732f99ea025bf","dn":"Jonathan Allen - Shattered_ Inside Hillary Clinton's Doomed Camp","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"e94c4bbf47b1c45ea908489ca35732f99ea025bf","infoHashBuffer":{"type":"Buffer","data":[233,76,75,191,71,177,196,94,169,8,72,156,163,87,50,249,158,160,37,191]},"name":"Jonathan Allen - Shattered_ Inside Hillary Clinton's Doomed Camp","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}