{"title":"Act Like a Leader, Think Like a Leader by Herminia Ibarra AZW3","magnet":"magnet:?xt=urn:btih:eac2920b223b7dd7d6213938ec7eab07eb443d29&dn=Act+Like+a+Leader%2C+Think+Like+a+Leader+by+Herminia+Ibarra+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"620284","seeders":"0","leechers":"0","description":"xx\r\n\r\nAct Like a Leader, Think Like a Leader by Herminia Ibarra AZW3\r\n\r\nYou aspire to lead with greater impact. The problem is you&apos;re busy executing on today&apos;s demands. You know you have to carve out time from your day job to build your leadership skills, but it&apos;s easy to let immediate problems and old mind-sets get in the way.\r\n\r\nHerminia Ibarra - an expert on professional leadership and development and a renowned professor at INSEAD, a leading international business school - shows how managers and executives at all levels can step up to leadership by making small but crucial changes in their jobs, their networks, and themselves. In Act Like a Leader, Think Like a Leader, she offers advice to help you:\r\n\r\nRedefine your job in order to make more strategic contributions\r\n\r\nDiversify your network so that you connect to and learn from a bigger range of stakeholders\r\n\r\nBecome more playful with your self-concept, allowing your familiar - and possibly outdated - leadership style to evolve\r\n\r\nIbarra turns the usual &quot;think first and then act&quot; philosophy on its head by arguing that doing these three things will help you learn through action and will increase what she calls your outsight - the valuable external perspective you gain from direct experiences and experimentation. As opposed to insight, outsight will then help change the way you think as a leader: about what kind of work is important; how you should invest your time; why and which relationships matter in informing and supporting your leadership; and, ultimately, who you want to become.\r\n\r\nPacked with self-assessments and practical advice to help define your most pressing leadership challenges, this book will help you devise a plan of action to become a better leader and move your career to the next level. It&apos;s time to learn by doing.\r\n\r\nxx","last_updated":"2017-11-01T12:03:17.103Z","parsed":{"xt":"urn:btih:eac2920b223b7dd7d6213938ec7eab07eb443d29","dn":"Act Like a Leader, Think Like a Leader by Herminia Ibarra AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eac2920b223b7dd7d6213938ec7eab07eb443d29","infoHashBuffer":{"type":"Buffer","data":[234,194,146,11,34,59,125,215,214,33,57,56,236,126,171,7,235,68,61,41]},"name":"Act Like a Leader, Think Like a Leader by Herminia Ibarra AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}