{"title":"Jonah Lehrer - A Book About Love 2016 RETAiL ePUB eBOOK-DiSTRiBU","magnet":"magnet:?xt=urn:btih:eacf1239053f851cb73205fb95b9f7a6cffc49d8&dn=Jonah+Lehrer+-+A+Book+About+Love+2016+RETAiL+ePUB+eBOOK-DiSTRiBU&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3452641","seeders":"30","leechers":"4","description":"Jonah Lehrer - A Book About Love 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nScience writer Jonah Lehrer explores the mysterious subject of love.\r\n\r\nWeaving together scientific studies from clinical psychologists, longitudinal studies of health and happiness, historical accounts and literary depictions, child-rearing manuals, and the language of online dating sites, Jonah Lehrer&apos;s A Book About Love plumbs the most mysterious, most formative, most important impulse governing our lives.\r\n\r\nLove confuses and compels us - and it can destroy and define us. It has inspired our greatest poetry and defined our societies and our beliefs, and it governs our biology. From the way infants attach to their parents to the way we fall in love with other people to the way some find a love for God or their pets to the way we remember and mourn love after it ends, this book focuses on research that attempts, even in glancing ways, to deal with the long-term and the everyday. The most dangerous myth of love is that it&apos;s easy, that we fall into the feeling, and then the feeling takes care of itself. While we can easily measure the dopamine that causes the initial feelings of &quot;falling&quot; in love, the partnerships and devotions that last decades or longer remain a mystery.\r\n\r\nThis book is about that mystery. Love, Lehrer argues, is not built solely on overwhelming passion but, fascinatingly, on a set of skills to be cultivated over a lifetime","last_updated":"2017-05-27T09:02:54.258Z","parsed":{"xt":"urn:btih:eacf1239053f851cb73205fb95b9f7a6cffc49d8","dn":"Jonah Lehrer - A Book About Love 2016 RETAiL ePUB eBOOK-DiSTRiBU","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eacf1239053f851cb73205fb95b9f7a6cffc49d8","infoHashBuffer":{"type":"Buffer","data":[234,207,18,57,5,63,133,28,183,50,5,251,149,185,247,166,207,252,73,216]},"name":"Jonah Lehrer - A Book About Love 2016 RETAiL ePUB eBOOK-DiSTRiBU","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}