{"title":"Dien Bien Phu: The First Indochina War, 1946-1954","magnet":"magnet:?xt=urn:btih:eb035f78375ab8273c8666200a65bc79d231df93&dn=Dien+Bien+Phu%3A+The+First+Indochina+War%2C+1946-1954&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"33944534","seeders":"0","leechers":"0","description":"Dien Bien Phu: The First Indochina War, 1946-1954 - Anthony Tucker-Jones [epub]\r\n\r\nIt is 25 years since the end of the Cold War, now a generation old. It began over 75 years ago, in 1944&#x2014;long before the last shots of the Second World War had echoed across the wastelands of Eastern Europe&#x2014;with the brutal Greek Civil War. The battle lines are no longer drawn, but they linger on, unwittingly or not, in conflict zones such as Iraq, Somalia and Ukraine. In an era of mass-produced AK-47s and ICBMs, one such flashpoint was French Indochina &#x2026; \r\n\r\nAt the end of the Second World War France sought to reassert its military prestige, but instead suffered humiliating defeat at Dien Bien Phu in French colonial Indochina. The First Indochina war became a textbook example of how not to conduct counterinsurgency warfare against nationalist guerrillas. Anthony Tucker-Jones guides the reader through this decisive conflict with a concise text and contemporary photographs, providing critical insight into the conduct of the war by both sides and its wider ramifications.\r\n\r\nThe Viet Minh, after resisting the Japanese in Indochina, sought independence for Vietnam from France. The French, with limited military resources, moved swiftly to reassert control in 1945, sparking a decade-long conflict. French defense of Hanoi rested on holding the Red River Delta, making it a key battleground. When the Viet Minh invaded neighboring Laos the French deployed to fight a set-piece battle at Dien Bien Phu, in 1954, but instead were trapped. All relief attempts failed and French defenses were slowly overwhelmed. America considered coming to the garrison&#x2019;s rescue using nuclear weapons, but instead left it to its fate, which set the scene for the Algerian and the Vietnam conflicts.\r\n\r\nPaperback: 128 pages\r\nPublisher: Pen and Sword (October 17, 2017)","last_updated":"2017-12-30T12:00:41.207Z","parsed":{"xt":"urn:btih:eb035f78375ab8273c8666200a65bc79d231df93","dn":"Dien Bien Phu: The First Indochina War, 1946-1954","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb035f78375ab8273c8666200a65bc79d231df93","infoHashBuffer":{"type":"Buffer","data":[235,3,95,120,55,90,184,39,60,134,102,32,10,101,188,121,210,49,223,147]},"name":"Dien Bien Phu: The First Indochina War, 1946-1954","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}