{"title":"Len Kasten - Secret Journey to Planet Serpo, A True Story of Int","magnet":"magnet:?xt=urn:btih:eb1726a8ac8f77c6ef4e0fd5b4e7ec2594db5efc&dn=Len+Kasten+-+Secret+Journey+to+Planet+Serpo%2C+A+True+Story+of+Int&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"roflcopter2110","categoryP":"other","categoryS":"e_books","size":"4933708","seeders":"60","leechers":"5","description":" <a href=\"https://extraimage.net/images/2017/04/21/e8570708a6cc56b5a2ec0c04de99a684.png\" rel=\"nofollow\" target=\"_NEW\">https://extraimage.net/images/2017/04/21/e8570708a6cc56b5a2ec0c04de99a684.png</a>\r\n\r\nLen Kasten - Secret Journey to Planet Serpo, A True Story of Interplanetary Travel (2013) - epub [TKRG]\r\n <a href=\"\nhttps://extraimage.net/images/2017/06/11/2506e377beebf30998cbe5f4e1d87581.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://extraimage.net/images/2017/06/11/2506e377beebf30998cbe5f4e1d87581.jpg</a>\r\n\r\nGenre: Occult &amp; Paranormal, Supernatural, UFOs, Astronomy &amp; Space Science\r\nPublisher: Bear &amp; Company\r\nLanguage: English\r\nISBN-10: 1591431468\r\nISBN-13: 978-1591431466\r\nFormat: EPUB\r\n\r\nDocuments how 12 people, as part of a top-secret U.S. government program, traveled to the planet Serpo and lived there for 13 years \r\n\r\n&#x2022; Based on the debriefing of the Serpo team and the diary of the expedition&#x2019;s commander \r\n\r\n&#x2022; Explains how the aliens helped us reverse-engineer their antigravity spacecraft and develop technology to solve our planet-wide energy problems \r\n\r\n&#x2022; Reveals how our government has an ongoing relationship with the Serpo aliens \r\n\r\nOn July 16, 1965, a massive alien spacecraft from the Zeta Reticuli star system landed at the Nevada test site north of Las Vegas. Following a plan set in motion by President Kennedy in 1962, the alien visitors known as the Ebens welcomed 12 astronaut-trained military personnel aboard their craft for the 10-month journey to their home planet, Serpo, 39 light-years away. In November 2005, former and current members of the Defense Intelligence Agency--directed by Kennedy to organize the Serpo exchange program--came forward to reveal the operation, including details from the 3,000-page debriefing of the 7 members of the Serpo team who returned after 13 years on the planet. \r\n\r\nWorking with the DIA originators of the Serpo project and the diary kept by the expedition&#x2019;s commanding officer, Len Kasten chronicles the complete journey of these cosmic pioneers, including their remarkable stories of life on an alien planet, superluminal space travel, and advanced knowledge of alien technologies. He reveals how the Ebens presented the U.S. with &#x201C;The Yellow Book&#x201D;--a complete history of the universe recorded holographically, allowing the reader to view actual scenes from pre-history to the present. He explains how the Ebens helped us reverse-engineer their antigravity spacecraft and develop technology to solve our planet-wide energy problems--knowledge still classified. \r\n\r\nExposing the truth of human-alien interaction and interplanetary travel, Kasten reveals not only that the Ebens have returned to Earth eight times but also that our government continues to have an ongoing relationship with them--a relationship with the potential to advance the human race into the future","last_updated":"2017-06-11T12:05:26.029Z","parsed":{"xt":"urn:btih:eb1726a8ac8f77c6ef4e0fd5b4e7ec2594db5efc","dn":"Len Kasten - Secret Journey to Planet Serpo, A True Story of Int","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb1726a8ac8f77c6ef4e0fd5b4e7ec2594db5efc","infoHashBuffer":{"type":"Buffer","data":[235,23,38,168,172,143,119,198,239,78,15,213,180,231,236,37,148,219,94,252]},"name":"Len Kasten - Secret Journey to Planet Serpo, A True Story of Int","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}