{"title":"In Pursuit of Memory_ The Fight Against Alzheimer's EPUB","magnet":"magnet:?xt=urn:btih:eb6a44c3a52033847727c22e4aeba89f246eb1f9&dn=In+Pursuit+of+Memory_+The+Fight+Against+Alzheimer%27s+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3577945","seeders":"22","leechers":"11","description":"xx\r\n\r\nIn Pursuit of Memory_ The Fight Against Alzheimer&apos;s EPUB\r\n\r\nWhen Joseph Jebelli was 12, his beloved grandfather began to act very strangely. It started with inexplicable walks, and gradually his bright smiles were replaced by a fearful, withdrawn expression. Before long he didn&apos;t recognise his family anymore.\r\n\r\nDr Jebelli has dedicated his career to understanding Alzheimer&apos;s disease, which affects millions worldwide and 850,000 people in the UK alone. In this, his first book, Jebelli explores the past, present and future of Alzheimer&apos;s disease, starting from the very beginning - the first recorded case more than 100 years ago - right up to the cutting-edge research being done today. It is a story as good as any detective novel, taking us to 19th-century Germany and postwar England; to the jungles of Papua New Guinea and the technological proving grounds of Japan; to America, India, China, Iceland, Sweden, and Colombia; and to the cloud-capped spires of the most elite academic institutions. Its heroes are expert scientists from around the world - but also the incredibly brave patients and families who have changed the way scientists think about Alzheimer&apos;s, unveiling a pandemic that took us centuries to track down, and above all reminding everyone never to take memory - our most prized possession - for granted. Based upon years of meticulous research, In Pursuit of Memory is a compelling insider&apos;s account of this terrible disease and the scientists who are trying to find a cure against the clock.\r\n\r\nxx","last_updated":"2017-11-03T12:08:18.036Z","parsed":{"xt":"urn:btih:eb6a44c3a52033847727c22e4aeba89f246eb1f9","dn":"In Pursuit of Memory_ The Fight Against Alzheimer's EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb6a44c3a52033847727c22e4aeba89f246eb1f9","infoHashBuffer":{"type":"Buffer","data":[235,106,68,195,165,32,51,132,119,39,194,46,74,235,168,159,36,110,177,249]},"name":"In Pursuit of Memory_ The Fight Against Alzheimer's EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}