{"title":"Erotic Exchanges_ World of Elite Prostitution by N. Kushner EPUB","magnet":"magnet:?xt=urn:btih:eb8d109a7c750581d17c9868ecebd411cd984db4&dn=Erotic+Exchanges_+World+of+Elite+Prostitution+by+N.+Kushner+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"461941","seeders":"88","leechers":"12","description":"xx\r\n\r\nErotic Exchanges_ World of Elite Prostitution by N. Kushner EPUB\r\n\r\nIn Erotic Exchanges, Nina Kushner reveals the complex world of elite prostitution in 18th-century Paris by focusing on the professional mistresses who dominated it. In this demimonde, these dames entretenues exchanged sex, company, and sometimes even love for being &quot;kept&quot;. Most of these women entered the profession unwillingly, either because they were desperate and could find no other means of support or because they were sold by family members to brothels or to particular men. A small but significant percentage of kept women, however, came from a theater subculture that actively supported elite prostitution. Kushner shows that in its business conventions, its moral codes, and even its sexual practices, the demimonde was an integral part of contemporary Parisian culture.\r\n\r\nKushner&apos;s primary sources include thousands of folio pages of dossiers and other documents generated by the Paris police as they tracked the lives and careers of professional mistresses, reporting in meticulous, often lascivious, detail what these women and their clients did. Rather than reduce the history of sex work to the history of its regulation, Kushner interprets these materials in a way that unlocks these women&apos;s own experiences. Kushner analyzes prostitution as a form of work, examines the contracts that governed relationships among patrons, mistresses, and madams, and explores the roles played by money, gifts, and, on occasion, love in making and breaking the bonds between women and men. This vivid and engaging book explores elite prostitution not only as a form of labor and as a kind of business but also as a chapter in the history of emotions, marriage, and the family.\r\n\r\nxx","last_updated":"2018-01-02T12:07:06.605Z","parsed":{"xt":"urn:btih:eb8d109a7c750581d17c9868ecebd411cd984db4","dn":"Erotic Exchanges_ World of Elite Prostitution by N. Kushner EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eb8d109a7c750581d17c9868ecebd411cd984db4","infoHashBuffer":{"type":"Buffer","data":[235,141,16,154,124,117,5,129,209,124,152,104,236,235,212,17,205,152,77,180]},"name":"Erotic Exchanges_ World of Elite Prostitution by N. Kushner EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}