{"title":"Software Inc. Alpha 9.7.5","magnet":"magnet:?xt=urn:btih:ebab12eece169512f875778b7802e833d4443590&dn=Software+Inc.+Alpha+9.7.5&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"113892729","seeders":"6","leechers":"1","description":"Construct and design buildings for optimal working conditions. Hire people to design and release software, so you can defeat the simulated competition and take over their businesses. Manage and educate your employees to make sure they are skilled and satisfied with their job.CURRENT FEATURESBuild, furnish and maintain office buildings up to ten stories + basement, on an enormous land, using a free-form building system with easy copy-paste toolsHire employees to design, develop, support, research and market software in teamsBuild roads and parking to ease commuting for your employeesTend to your employees&apos; needs, demands, skills and specializations, while making sure each team has compatible personalitiesCustomize your own employee avatarCreate your own software products and franchisesCompete in a simulated and randomly populated market by selling your products, taking on contract work, creating patents, making deals or trading stocksHire staff to repair your furniture and computers, clean your office, make food for your employees or greet visitorsMod what kind of software you can develop, add your own furniture, upload your building blueprints or add support for your languageDelegate important tasks to your team leaders, such as managing development cycles and human resourcesSet up your own servers for products, source control and running your own online store","last_updated":"2017-05-27T09:05:56.728Z","parsed":{"xt":"urn:btih:ebab12eece169512f875778b7802e833d4443590","dn":"Software Inc. Alpha 9.7.5","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ebab12eece169512f875778b7802e833d4443590","infoHashBuffer":{"type":"Buffer","data":[235,171,18,238,206,22,149,18,248,117,119,139,120,2,232,51,212,68,53,144]},"name":"Software Inc. Alpha 9.7.5","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}