{"title":"The Frozen Hours_ A Novel of the Korean War by Jeff Shaara ePUB ","magnet":"magnet:?xt=urn:btih:ebecf3ddce88bc38939c286d4eda55342a7e9c0f&dn=The+Frozen+Hours_+A+Novel+of+the+Korean+War+by+Jeff+Shaara+ePUB+&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9628802","seeders":"51","leechers":"14","description":"xx\r\n\r\nThe Frozen Hours_ A Novel of the Korean War by Jeff Shaara ePUB eBOOK-ZAK\r\n\r\nThe master of military historical fiction turns his discerning eye to the Korean War in this riveting new novel, which tells the dramatic story of the Americans and the Chinese who squared off in one of the deadliest campaigns in the annals of combat: the Battle of Chosin Reservoir, also known as Frozen Chosin.\r\n\r\nJune 1950. The North Korean army invades South Korea, intent on uniting the country under Communist rule. In response, the United States mobilizes a force to defend the overmatched South Korean troops, and together they drive the North Koreans back to their border with China.\r\n\r\nBut several hundred thousand Chinese troops have entered Korea, laying massive traps for the Allies. In November 1950, the Chinese spring those traps. Allied forces, already battling stunningly cold weather, find themselves caught completely off guard as the Chinese advance around the Chosin Reservoir in North Korea. A force that once stood on the precipice of victory now finds itself on the brink of annihilation. Assured by General Douglas MacArthur that they would be home by Christmas, the soldiers and marines fight for their lives against the most brutal weather conditions imaginable - and an enemy that outnumbers them more than six to one.\r\n\r\nThe Frozen Hours tells the story of Frozen Chosin from multiple points of view: Oliver P. Smith, the commanding general of the American 1st Marine Division, who famously redefined defeat as &quot;advancing in a different direction&quot;; marine private Pete Riley, a World War II veteran who now faces the greatest fight of his life; and the Chinese commander Sung Shi-Lun, charged with destroying the Americans he has so completely surrounded, ever aware that above him, Chairman Mao Tse-Tung watches his every move.\r\n\r\nWritten with the propulsive force Shaara brings to all his novels of combat and courage, The Frozen Hours transports us to the critical moment in the history of America&apos;s &quot;Forgotten War&quot;, when the fate of the Korean peninsula lay in the hands of a brave band of brothers battling both the elements and a determined, implacable foe.\r\n\r\nxx","last_updated":"2017-09-02T12:05:41.626Z","parsed":{"xt":"urn:btih:ebecf3ddce88bc38939c286d4eda55342a7e9c0f","dn":"The Frozen Hours_ A Novel of the Korean War by Jeff Shaara ePUB ","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ebecf3ddce88bc38939c286d4eda55342a7e9c0f","infoHashBuffer":{"type":"Buffer","data":[235,236,243,221,206,136,188,56,147,156,40,109,78,218,85,52,42,126,156,15]},"name":"The Frozen Hours_ A Novel of the Korean War by Jeff Shaara ePUB ","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}