{"title":"Mega Maker v1.0.0","magnet":"magnet:?xt=urn:btih:ee47c6da2715438851def48c760f20ddf041d4c5&dn=Mega+Maker+v1.0.0&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"falcorr","categoryP":"games","categoryS":"pc","size":"10595981","seeders":"2","leechers":"3","description":" <a href=\"https://mega-maker.com\" rel=\"nofollow\" target=\"_NEW\">https://mega-maker.com</a>\r\n\r\n&quot;Mega Maker is a fan game where you can create and share your own Mega Man levels. You can make a traditional stage, a series of puzzle chambers or even an automatic level, anything goes! On top of that, you can play one of many levels uploaded by other users, allowing you to create and customize your very own Mega Man experience.\r\n\r\nThe game packs many features to help you achieve this. The stage builder allows you to select from 46 enemies, 29 level objects, 12 bosses, 24 special weapons, 40 backgrounds, 129 tilesets, 63 music tracks and more! On top of that, there&apos;s an interactive tutorial to help you get going, several quality-checked example levels, customization for your in-game profile, the ability to rate other people&apos;s levels, controller support and several other features to discover.\r\n\r\nThe game has been in development since September 2016, starting out as a one-person project but gradually becoming larger and larger. It is built using the Mega Engine, a Mega Man engine for Game Maker created by WreckingPrograms (the same guy that started Mega Maker). Even after the initial release, development on this game will not yet be finished. Aside from any bug patches, we plan to include more content down the road, like assets from Mega Man 7 onward as well as entirely new features. Stay tuned!\r\n\r\nIf you&apos;re interested in the project, please join the forums (https://mega-maker.com/forum/) or the official Discord serverWe&apos;d love to hear from you!&quot;\r\n\r\n&quot;Mega Man and all related content is (C)Capcom. Mega Maker and its development team are not affiliated with Capcom in any way.&quot;","last_updated":"2017-07-16T12:01:18.636Z","parsed":{"xt":"urn:btih:ee47c6da2715438851def48c760f20ddf041d4c5","dn":"Mega Maker v1.0.0","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ee47c6da2715438851def48c760f20ddf041d4c5","infoHashBuffer":{"type":"Buffer","data":[238,71,198,218,39,21,67,136,81,222,244,140,118,15,32,221,240,65,212,197]},"name":"Mega Maker v1.0.0","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}