{"title":"Oh Susannah-4 CDs (great acoustic based folky female vocals)","magnet":"magnet:?xt=urn:btih:eedbb28ae7f0ca57725181f898c0a431343704e5&dn=Oh+Susannah-4+CDs+%28great+acoustic+based+folky+female+vocals%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"rontoolsie","categoryP":"audio","categoryS":"flac","size":"1054179992","seeders":"50","leechers":"21","description":"Here are four albums (Jonestown, Oh Susannah, Sleepy Little Sailor, Soon the Birds), circa mid  1990s onwards, from Canadian singer/songwriter who goes by performing name of Oh Susanna. It is mainly acoustic based folky style music, with credits to some serious instruments (&apos;44 Martin, 53 Gibson J50, &apos;78 Gretch, &apos;64 Fender Precision bass, &apos;58 Les Paul Junior, &apos;63 Telecaster, Fender Rhodes, &apos;63 Hofner bass etc. \r\n\r\nNone of this would be important unless the recording and production justified the use of these exotica-and it most certainly does. Sleepy Little Sailor in particular is one of the best recorded albums of its genre I have ever heard, and although not an audio chestnut like Diana Krall etc, on the right system it can sound near perfect. \r\n\r\nBut the reason to give these albums a punt is not the sound...its the music! And the music is excellent \r\n\r\nIf you found Oh Susanna&apos;s previous album a bit of an acquired taste but like the voice and the quality of the sound, perhaps wished for something a little easier to get into, then this is for you. \r\nIt will grab you right from the opening song which is so delicious, you might have to play it a couple of times before you move on to the rest. The arrangement is so subtle and simple and quiet, but the effect is captivating. \r\nSuzie&apos;s voice can be soft and intimate - playful and arch, like on the first track, or upbeat and even pop-tinged, like on the second, but it is always right for the song. She sounds young, yet wise, sings about the sea, and strange relationships, knows how to put together the catchiest pop tune, then slows it down to pure folk. \r\nSound quality is excellent too and perfectly suits the spare arrangement and Suzie&apos;s electric guitar highlights. It&apos;s a very intimate, appealing sound. Suzie sounds like she&apos;s in your living room at times. \r\nHighly recommended. Four and a half stars really (Amazon review)","last_updated":"2017-06-03T12:04:14.002Z","parsed":{"xt":"urn:btih:eedbb28ae7f0ca57725181f898c0a431343704e5","dn":"Oh Susannah-4 CDs (great acoustic based folky female vocals)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"eedbb28ae7f0ca57725181f898c0a431343704e5","infoHashBuffer":{"type":"Buffer","data":[238,219,178,138,231,240,202,87,114,81,129,248,152,192,164,49,52,55,4,229]},"name":"Oh Susannah-4 CDs (great acoustic based folky female vocals)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}