{"title":"Tim Harford - Messy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:f0a18a9b4916f05b2b2876e1ceb053318a19a79d&dn=Tim+Harford+-+Messy+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"F3lch3r","categoryP":"other","categoryS":"e_books","size":"3372241","seeders":"33","leechers":"3","description":"Tim Harford - Messy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nFrom the award-winning columnist and author of the national best-seller The Undercover Economist comes a provocative big-idea book about the genuine benefits of being messy: at home, at work, in the classroom, and beyond.\r\n\r\nMessy: The Power of Disorder to Transform Our Lives celebrates the benefits that messiness has in our lives: why it&apos;s important, why we resist it, and why we should embrace it instead. Using research from neuroscience, psychology, and social science as well as captivating examples of real people doing extraordinary things, Tim Harford explains that the human qualities we value - creativity, responsiveness, resilience - are integral to the disorder, confusion, and disarray that produce them.\r\n\r\nFrom the music studio of Brian Eno to the Lincoln Memorial with Martin Luther King Jr., from the boardroom to the classroom, messiness lies at the core of how we innovate, how we achieve, how we reach each other - in short, how we succeed.\r\n\r\nIn Messy, you&apos;ll learn about the unexpected connections between creativity and mess; understand why unexpected changes of plans, unfamiliar people, and unforeseen events can help generate new ideas and opportunities as they make you anxious and angry; and come to appreciate that the human inclination for tidiness - in our personal and professional lives, online, even in children&apos;s play - can mask deep and debilitating fragility that keeps us from innovation.\r\n\r\nStimulating and listenable as it points exciting ways forward, Messy is an insightful exploration of the real advantages of mess in our lives","last_updated":"2017-05-23T19:06:00.761Z","parsed":{"xt":"urn:btih:f0a18a9b4916f05b2b2876e1ceb053318a19a79d","dn":"Tim Harford - Messy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f0a18a9b4916f05b2b2876e1ceb053318a19a79d","infoHashBuffer":{"type":"Buffer","data":[240,161,138,155,73,22,240,91,43,40,118,225,206,176,83,49,138,25,167,157]},"name":"Tim Harford - Messy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}