{"title":"Space Beast Terror Fright Update 36","magnet":"magnet:?xt=urn:btih:f0e2e401082af2f94533a61f35a55e845430e9aa&dn=Space+Beast+Terror+Fright+Update+36&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"232346193","seeders":"2","leechers":"1","description":"S.B.T.F. is a very hard arcade-style / rogue-like / perma-death first person shooter. You play as Marines who must brave dark, claustrophobic and terrifyingly intense Space Beast infested spacecraft in order to extract critical data and lucrative upgrades. Can you make it out alive?The game revolves around the concept of a procedurally generated maze-like spacecraft which is unique each time, within which the Marines must search out DataCores to be downloaded. The spacecraft are infested with Beasts that are extremely lethal, and the Marines must brave these dark and hostile environments in order to complete the objective of retrieving all critical data and ultimately setting the Reactor core to overload.Aside from either all purpose automatic Rifles or powerful Shotguns, the Marines initially only have a rudimentary Tracker device that detects nearby motion as well as the distance to the nearest DataCore. The DataCores can however contain lucrative Upgrades that will empower the Marines with better ammunition, a better motion tracker, and other useful functionality that will significantly increase the chances of survival.Key to managing the unknown spaces within each spacecraft is the intelligent use of Doors, sealing of sections behind the team in order to keep from being overwhelmed from several directions at once. Closing Doors controls the space, but they also make it harder","last_updated":"2017-07-22T12:00:39.470Z","parsed":{"xt":"urn:btih:f0e2e401082af2f94533a61f35a55e845430e9aa","dn":"Space Beast Terror Fright Update 36","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f0e2e401082af2f94533a61f35a55e845430e9aa","infoHashBuffer":{"type":"Buffer","data":[240,226,228,1,8,42,242,249,69,51,166,31,53,165,94,132,84,48,233,170]},"name":"Space Beast Terror Fright Update 36","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}