{"title":"Social Wealth_ How to Build Extraordinary Relationships By Trans","magnet":"magnet:?xt=urn:btih:f124123947ee14ddfa5159174dd575c0359ff2d1&dn=Social+Wealth_+How+to+Build+Extraordinary+Relationships+By+Trans&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3042178","seeders":"0","leechers":"0","description":"xx\r\n\r\nSocial Wealth_ How to Build Extraordinary Relationships By Transforming the Way We Live, Love, Lead and Network by Jason Treu ePUB eBOOK-ZAK\r\n\r\nHave you ever admired those successful, confident, motivated, and charismatic people who seem to have it all? They&apos;ve climbed the corporate ladder quickly or started a great business. Their love life is amazing and they have fantastic friends. They&apos;ve made all the right connections. They&apos;ve mastered networking and how to build relationships. They&apos;re very persuasive and created significant influence with people. And all of this has opened up limitless opportunities for them.\r\n\r\nWhat&apos;s their secret? What breakthroughs have they learned that you haven&apos;t?They have figured out the biggest predicator for success is&#x2026;. Social Wealth\r\n\r\nEverything we create in life is with or through other people. No one does it alone.\r\n\r\nWe value our experiences and relationships with other people above everything else. So settling for less than you deserve.\r\n\r\nYour legacy comes down to becoming rich in all your relationships. Relationships are our true &quot;wealth&quot; and currency in life.\r\n\r\nStuck in your career? Wishing you could find passionate love in your life? Want to be a top producer in your field? Having trouble building business relationships and networking? Want to improve your leadership, social, communication, and emotional skills? Desire to create more meaningful connections with people in your life? Do you want to have more influence and persuasion? Do you want to be more vulnerable, authentic, confident and courageous?\r\n\r\nIf you answered &quot;yes&quot; to any of the above questions...\r\n\r\nSocial Wealth will give you the blueprint and action steps you&apos;ve been looking for to achieve the success you desire and deserve.\r\n\r\nThe reality is no one is born with this information and skills. No one sits you down to explain how it works, and you certainly don&apos;t learn this in your education. These are learned skills and behaviors.\r\n\r\nxx","last_updated":"2017-09-20T12:01:22.507Z","parsed":{"xt":"urn:btih:f124123947ee14ddfa5159174dd575c0359ff2d1","dn":"Social Wealth_ How to Build Extraordinary Relationships By Trans","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f124123947ee14ddfa5159174dd575c0359ff2d1","infoHashBuffer":{"type":"Buffer","data":[241,36,18,57,71,238,20,221,250,81,89,23,77,213,117,192,53,159,242,209]},"name":"Social Wealth_ How to Build Extraordinary Relationships By Trans","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}