{"title":"The Age of Miracles by Karen Thompson Walker 2012 Retail EPUB eB","magnet":"magnet:?xt=urn:btih:f12a022d679625ec2800d14edfb9200ef4d9d5c6&dn=The+Age+of+Miracles+by+Karen+Thompson+Walker+2012+Retail+EPUB+eB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4581038","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Age of Miracles by Karen Thompson Walker 2012 Retail EPUB eBook-BitBook\r\n\r\nWith a voice as distinctive and original as that of The Lovely Bones, and for the fans of the speculative fiction of Margaret Atwood, Karen Thompson Walker&apos;s The Age of Miracles is a luminous, haunting, and unforgettable debut novel about coming of age set against the backdrop of an utterly altered world. &quot;It still amazes me how little we really knew... Maybe everything that happened to me and my family had nothing at all to do with the slowing. It&apos;s possible, I guess. But I doubt it. I doubt it very much.&quot;\r\n\r\nOn a seemingly ordinary Saturday in a California suburb, Julia and her family awake to discover, along with the rest of the world, that the rotation of the earth has suddenly begun to slow. The days and nights grow longer and longer, gravity is affected, the environment is thrown into disarray. Yet as she struggles to navigate an ever-shifting landscape, Julia is also coping with the normal disasters of everyday life - the fissures in her parents marriage, the loss of old friends, the hopeful anguish of first love, the bizarre behavior of her grandfather who, convinced of a government conspiracy, spends his days obsessively cataloging his possessions. As Julia adjusts to the new normal, the slowing inexorably continues.\r\n\r\nxx","last_updated":"2017-08-24T12:00:34.747Z","parsed":{"xt":"urn:btih:f12a022d679625ec2800d14edfb9200ef4d9d5c6","dn":"The Age of Miracles by Karen Thompson Walker 2012 Retail EPUB eB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f12a022d679625ec2800d14edfb9200ef4d9d5c6","infoHashBuffer":{"type":"Buffer","data":[241,42,2,45,103,150,37,236,40,0,209,78,223,185,32,14,244,217,213,198]},"name":"The Age of Miracles by Karen Thompson Walker 2012 Retail EPUB eB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}