{"title":"Murder In Tehran's Alleys 1933","magnet":"magnet:?xt=urn:btih:f14f725cef6396fb5611ad00e0275115406d8e43&dn=Murder+In+Tehran%27s+Alleys+1933&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"2056889488","seeders":"0","leechers":"0","description":"A series of bitter and horrifying murders has tainted the ambience of Tehran. The situation is extremely alarming and there is nothing the police or the city security guards can do! The press slams the government and sarcastically talks about the alleys of Tehran turning into scenes from Western movies. Each day a new murder is committed, a new family mourns for its loved ones and more people are gripped by fear; fear of being the next victim&#x2026; \r\nBut who are the victims of such heinous murders, anyways? The rich? The politicians? Or the upper class? &#x201C;None&#x201D;, is the answer. The victims are innocent children from southern neighborhoods; what wrong they have done to be drawn into this diabolical game is not known! There is no clue as to the murderer&#x2019;s whereabouts.\r\nThe high degree of violence in these murders is what attracts the attention. Most victims are tortured before death and are then brutally sliced into pieces! Such unbridled violence increases social tensions even more. While the general situation in Tehran becomes more and more chaotic as days go by, Colonel Nasiri, the chief of police, assigns the case to one of his elite officers, detective Afshar, in hope of saving the people and city of Tehran by virtue of the intellect of this compassionate and patriotic officer","last_updated":"2017-07-04T12:03:16.562Z","parsed":{"xt":"urn:btih:f14f725cef6396fb5611ad00e0275115406d8e43","dn":"Murder In Tehran's Alleys 1933","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f14f725cef6396fb5611ad00e0275115406d8e43","infoHashBuffer":{"type":"Buffer","data":[241,79,114,92,239,99,150,251,86,17,173,0,224,39,81,21,64,109,142,67]},"name":"Murder In Tehran's Alleys 1933","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}