{"title":"The XFiles Season 1","magnet":"magnet:?xt=urn:btih:f1da095b3e1a485955f7629f593dd5ac24533c28&dn=The+XFiles+Season+1&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Aussie87","categoryP":"video","categoryS":"tv_shows","size":"10998711098","seeders":"0","leechers":"4","description":"FBI Special Agent Dana Scully is assigned to work with Fox Mulder on a group of unexplained cases labeled as X-files. Mulder believes that the paranormal can explain most of the cases, whereas Scully is more interested in finding a scientific, logical explanation.\r\n\r\nHer first case with Mulder involved a series of unexplainable deaths of young people in a small Oregon town. Mulder fears that Scully may be a spy for the higher ups at the FBI but still boldly theorizes that it is the work of extraterrestrials. Discovering a non-Human corpse in the coffin of one of the victims they exhume doesn&apos;t dissuade Scully&apos;s skepticism but as the strange occurrences such as time loss, flashes of light, and strange implants in the corpse mount up even she is willing to believe Mulder&apos;s theory a bit. When she comes to Mulder fearing she has the same marks as the victims on her own back, he tells her they are merely mosquito bites. Seeing her vulnerable and embarrassed, he asks her to stay and they get to talking. He confides about the disappearance of his sister Samantha Mulder, his FBI career and study of the supernatural &amp; the X-Files, and of a conspiracy to suppress his work on the X-Files. Scully may not believe everything he is saying but a bond has formed between them","last_updated":"2017-07-16T12:00:50.114Z","parsed":{"xt":"urn:btih:f1da095b3e1a485955f7629f593dd5ac24533c28","dn":"The XFiles Season 1","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f1da095b3e1a485955f7629f593dd5ac24533c28","infoHashBuffer":{"type":"Buffer","data":[241,218,9,91,62,26,72,89,85,247,98,159,89,61,213,172,36,83,60,40]},"name":"The XFiles Season 1","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}