{"title":"CSR Racing 2 v1.11.3 MOD APK + DATA","magnet":"magnet:?xt=urn:btih:f233b5e48f1fd7d38a1047cd2876b2139ecf3a92&dn=CSR+Racing+2+v1.11.3+MOD+APK+%2B+DATA&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"itscharsi","categoryP":"applications","categoryS":"android","size":"1048105988","seeders":"0","leechers":"0","description":"Our Website: https://charsiapk.com\r\nPost Link: https://charsiapk.com/csr-racing-2-mod-apk/\r\n\r\n\r\nDescription:\r\n\r\nCSR 2 MOD APK. The next-gen sequel to the record-breaking CSR Racing has finally arrived and it will blow your mind.Setting a new standard in visuals, CSR 2 smashes the current console generation by delivering hyper-real drag racing to your iPhone and iPad. Beat live players across the world and build your dream garage of beautiful supercars, including LaFerrari, McLaren P1&#x2122;, Audi R8 V10 plus Coup&#xE9;, Koenigsegg One:1 and many more.Team up with friends to form a crew, tune your ride to maximise its potential and place bets to humiliate real-time opponents. CSR 2 is all-new &#x2013; get racing now.\r\n\r\nFeatures:\r\n\r\nNEXT-GEN GRAPHICS\r\nCSR 2 will redefine what you thought possible on mobile. Running at full 2K resolution and using bleeding-edge rendering techniques, CSR 2 features the most beautiful and authentic supercars to date. And now, you can get inside every car to reveal its meticulously detailed interior, incl. original manufacturers&#x2019; trim options. It does not get more real than this.\r\n\r\nREAL-TIME RACING\r\nCSR 2 lets you race against real players across the world, in real-time. Choose worthy opponents from the lobby or accept live challenges &#x2013; and raise the stakes by placing bets. Team up with friends to form a crew, and together fight for ranks in the leaderboard and super-exclusive vehicles.\r\n\r\nBUILD YOUR DREAM GARAGE\r\nCollect beautiful supercars and show them off in your huge warehouse garage &#x2013; CSR 2 features over 50 officially licensed vehicles from the world&#x2019;s most desirable car manufacturers including Ferrari, McLaren, Bugatti, Lamborghini, Pagani and Koenigsegg.\r\n\r\nPLAY WITH FRIENDS &#x2013; AND MAKE FRIENDS\r\nCSR 2 is built around a live online community of players, featuring synchronous multiplayer races, live chat, online multiplayer crews, fresh and exciting online events and competitive leaderboards. Team up with your friends, or meet new people around the world who share your passion for cars.\r\n\r\nUPGRADE, TUNE AND FUSE\r\nUpgrading your car is only the start. You can now get under the hood to tune gear ratios, tyre pressure, nitrous timings and much more. And when things get really competitive, make sure you strip surplus cars for parts, and fuse them into your prime vehicles.\r\n\r\nCONFIGURE AND CUSTOMIZE\r\nSelect your paint, rims, brake callipers and interior trims just as you would in the real world with the world&#x2019;s most advanced car configurator. Choose from paint wraps and custom license plates to personalize your ride. But remember: money can&#x2019;t buy taste!\r\n\r\nMOD Features:\r\n\r\nUnlimited Coins\r\nUnlimited Gold\r\nUnlimited Keys\r\nUnlimited Fuel\r\nAnti-ban (Untested)","last_updated":"2017-06-11T12:00:33.519Z","parsed":{"xt":"urn:btih:f233b5e48f1fd7d38a1047cd2876b2139ecf3a92","dn":"CSR Racing 2 v1.11.3 MOD APK   DATA","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f233b5e48f1fd7d38a1047cd2876b2139ecf3a92","infoHashBuffer":{"type":"Buffer","data":[242,51,181,228,143,31,215,211,138,16,71,205,40,118,178,19,158,207,58,146]},"name":"CSR Racing 2 v1.11.3 MOD APK   DATA","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}