{"title":"Tim Shipman - All Out War 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:f27f25b49061c64d60898e1154abf74c8f704281&dn=Tim+Shipman+-+All+Out+War+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10557569","seeders":"26","leechers":"7","description":"Tim Shipman - All Out War 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nPolitics was turned upside down during 2016. This book by Sunday Times political editor Tim Shipman is the first to tell the full story of how and why Britain voted to leave the European Union and how the vote shattered the political status quo.\r\n\r\nBased on unrivalled access to all the key politicians and their advisors - including Boris Johnson, Michael Gove, George Osborne, Nigel Farage and Dominic Cummings, the mastermind of Vote Leave - Shipman has written a political history that reads like a thriller and offers a gripping day-by-day account of what really happened behind the scenes in Downing Street, both Leave campaigns, the Labour Party, Ukip and Britain Stronger in Europe.\r\n\r\nShipman gives his listeners a ringside seat on how decisions were made, mistakes justified and betrayals perpetrated. Filled with stories, anecdotes and juicy leaks, the audiobook does not seek to address the rights and wrongs of Brexit but to explore how and why David Cameron chose to take the biggest political gamble of his life and explain why he lost.\r\n\r\nThis is a story of calculation, attempted coups, individuals torn between principles and loyalty. All the events are here - from David Cameron&apos;s pledge to hold a referendum through to the campaign itself, his resignation as prime minister, the betrayals and rivalries that occurred during the race to find his successor and the arrival of Theresa May in Downing Street as Britain&apos;s second female prime minister.\r\n\r\nAll Out War is an audiobook about leaders and their closest aides, the decisions they make and how and why they make them as well as how they feel when they turn out to be wrong. It is about men who make decisions that are intellectually consistent and - by their own measure - morally sound that are simultaneously disastrous for themselves and those closest to them. It is about how doing what you know has worked before doesn&apos;t always work again. Most of all it is about asking the question: how far are you prepared to go to win?","last_updated":"2017-05-27T09:03:46.182Z","parsed":{"xt":"urn:btih:f27f25b49061c64d60898e1154abf74c8f704281","dn":"Tim Shipman - All Out War 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f27f25b49061c64d60898e1154abf74c8f704281","infoHashBuffer":{"type":"Buffer","data":[242,127,37,180,144,97,198,77,96,137,142,17,84,171,247,76,143,112,66,129]},"name":"Tim Shipman - All Out War 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}