{"title":"To the Last Man_ A Novel of the First World War by Jeff Shaara e","magnet":"magnet:?xt=urn:btih:f281fb477d6188bf940ba15338ca16304b8a79d1&dn=To+the+Last+Man_+A+Novel+of+the+First+World+War+by+Jeff+Shaara+e&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5173757","seeders":"0","leechers":"0","description":"xx\r\n\r\nTo the Last Man_ A Novel of the First World War by Jeff Shaara ePUB MOBI eBOOK-ZAK\r\n\r\nJeff Shaara has enthralled readers with his New York Times best-selling novels set during the Civil War and the American Revolution. Here the acclaimed author turns to World War I, bringing to life the sweeping, emotional story of the war that devastated a generation and established America as a world power.\r\n\r\nSpring 1916: the horror of a stalemate on Europe&apos;s western front. France and Great Britain are on one side of the barbed wire, a fierce German army is on the other. Shaara opens the window onto the otherworldly tableau of trench warfare as seen through the eyes of a typical British soldier who experiences the bizarre and the horrible - a &quot;Tommy&quot; whose innocent youth is cast into the hell of a terrifying war.\r\n\r\nIn the skies, meanwhile, technology has provided a devastating new tool, the &quot;aeroplane&quot;, and with it a different kind of hero emerges: the flying ace. Soaring high above the chaos on the ground, these solitary knights duel in the splendor and terror of the skies, their courage and steel tested with every flight.\r\n\r\nAs the conflict stretches into its third year, a neutral America is goaded into war, its reluctant president, Woodrow Wilson, finally accepting the repeated challenges to his stance of nonalignment. Yet the Americans are woefully unprepared and ill equipped to enter a war that has become worldwide in scope. The responsibility is placed on the shoulders of General John &quot;Blackjack&quot; Pershing, and by mid-1917 the first wave of the American Expeditionary Force arrives in Europe. Encouraged by the bold spirit and strength of the untested Americans, the world waits to see if the tide of war can finally be turned.\r\n\r\nThe Great War: explore our wide-ranging list of titles about World War I.\r\n\r\nxx","last_updated":"2017-08-22T12:03:57.102Z","parsed":{"xt":"urn:btih:f281fb477d6188bf940ba15338ca16304b8a79d1","dn":"To the Last Man_ A Novel of the First World War by Jeff Shaara e","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f281fb477d6188bf940ba15338ca16304b8a79d1","infoHashBuffer":{"type":"Buffer","data":[242,129,251,71,125,97,136,191,148,11,161,83,56,202,22,48,75,138,121,209]},"name":"To the Last Man_ A Novel of the First World War by Jeff Shaara e","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}