{"title":"Unconditional Defeat: Japan, America and the End of World War II","magnet":"magnet:?xt=urn:btih:f312ef6e2cf6c01a675ef024d3e9cd708d1251af&dn=Unconditional+Defeat%3A+Japan%2C+America+and+the+End+of+World+War+II&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"8205541","seeders":"45","leechers":"7","description":"Unconditional Defeat: Japan, America and the End of World War II - Thomas W. Zeiler [epub]\r\n\r\nUnconditional Defeat-the second book in a Pacific War trilogy that is part of SR Books&apos; Total War series-examines the concluding stages of World War II in Asia and the Pacific, from November 1943 until September 1945. Thomas W. Zeiler argues that this &quot;war without mercy&quot; could only come to one conclusion: the complete, unconditional defeat of Japan by a mobilized, overwhelming, vengeful United States.\r\n\r\nZeiler describes these final 22 months of the Pacific War as a story of contrasts. While the U.S. launched a methodical, smothering attack with all the means at its disposal, Japan fought a fierce yet hopeless defense with diminishing supplies. By November 1943, Japan lacked the necessities not just for victory, as in the earlier phases of the war, but for adequate defense. The Japanese had no options. The strategic planning rested with the Americans.\r\n\r\nZeiler&apos;s gripping and thorough overview discusses other contrasts between the two foes. The Americans planned multiple advances in the Pacific Ocean and on the Asian mainland. They used a massive number of troops, devised and adopted new amphibious techniques, and deployed the new nuclear category of weapons. The Japanese stubbornly but desperately clung to their territory, often with the basest of defenses.\r\n\r\nBy August 1945, the United States&apos; forces at sea, on land, and in the air had brought Japan near complete defeat. In addition, the Japanese Empire was diplomatically isolated. Japanese politics was in turmoil, the government faced rebellion, and the Emperor stood on the brink of extinction. Wracked by the destruction of the homeland from the air and blockade by sea, Japanese society veered near chaos and the people peered into the abyss of an uncertain future. In the meantime, America&apos;s military had experienced such horrors at the hands of Japan that the U.S. made the difficult decision to unleash the atomic bomb.\r\n\r\nPaperback: 223 pages\r\nPublisher: Rowman &amp; Littlefield Publishers (October 1, 2003)","last_updated":"2017-12-09T12:08:56.225Z","parsed":{"xt":"urn:btih:f312ef6e2cf6c01a675ef024d3e9cd708d1251af","dn":"Unconditional Defeat: Japan, America and the End of World War II","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f312ef6e2cf6c01a675ef024d3e9cd708d1251af","infoHashBuffer":{"type":"Buffer","data":[243,18,239,110,44,246,192,26,103,94,240,36,211,233,205,112,141,18,81,175]},"name":"Unconditional Defeat: Japan, America and the End of World War II","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}