{"title":"Shep Gordon - They Call Me Supermensch 2016 RETAiL ePUB eBOOK-Di","magnet":"magnet:?xt=urn:btih:f3c226e934ea258198ddc8f310a388c18540dc5f&dn=Shep+Gordon+-+They+Call+Me+Supermensch+2016+RETAiL+ePUB+eBOOK-Di&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"11863551","seeders":"1","leechers":"0","description":"Shep Gordon - They Call Me Supermensch 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nAn eye-popping peek into the entertainment industry from the magnetic force who has worked with an impeccable roster of stars throughout his storied career.\r\n\r\nIn the course of his legendary career as a manager, an agent, and a producer, Shep Gordon has worked with and befriended some of the biggest names in the entertainment industry, from Alice Cooper to Bette Davis, Raquel Welch to Groucho Marx, Blondie to Jimi Hendrix, Sylvester Stallone to Salvador Dali, Luther Vandross to Teddy Pendergrass. He is also credited with inventing the &quot;celebrity chef&quot; and has worked with Nobu Matsuhisa, Emeril Lagasse, Wolfgang Puck, Roger Verg&#xE9;, and many others, including His Holiness the Dalai Lama.\r\n\r\nIn this wonderfully engaging memoir, the charismatic entertainment legend recalls his life, from his humble beginnings as a &quot;shy, no self-esteem Jewish nebbisher kid with no ambition&quot; in Oceanside, Long Island, to his unexpected rise as one of the most influential and respected personalities in show business, revered for his kindness, charisma - and fondness for a good time.\r\n\r\nGordon shares riotous anecdotes and outrageous accounts of his freewheeling, globe-trotting experiences with some of the biggest celebrities of the past five decades, including his first meeting with Janice Joplin in 1968, when the raspy singer punched him in the face.\r\n\r\nTold with incomparable humor and heart, They Call Me Supermensch is a sincere, hilarious behind-the-scenes look at the worlds of music and entertainment from the consummate Hollywood insider","last_updated":"2017-06-14T12:00:38.982Z","parsed":{"xt":"urn:btih:f3c226e934ea258198ddc8f310a388c18540dc5f","dn":"Shep Gordon - They Call Me Supermensch 2016 RETAiL ePUB eBOOK-Di","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f3c226e934ea258198ddc8f310a388c18540dc5f","infoHashBuffer":{"type":"Buffer","data":[243,194,38,233,52,234,37,129,152,221,200,243,16,163,136,193,133,64,220,95]},"name":"Shep Gordon - They Call Me Supermensch 2016 RETAiL ePUB eBOOK-Di","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}