{"title":"Subnautica v49544","magnet":"magnet:?xt=urn:btih:f4035aeffa67084bb35577477a6fe7735b10baa6&dn=Subnautica+v49544&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"dauphong","categoryP":"games","categoryS":"pc","size":"5762509837","seeders":"16","leechers":"27","description":"Subnautica is an open world, underwater exploration and adventure game currently under construction at Unknown Worlds. The game is in advanced stage of Early Access development, with substantial content available for play. Performance/frame-rates, stability, and polish are not yet up to the standards of a finished game.Dive Into a Vast Underwater WorldYou have crash-landed on alien ocean world, and the only way to go is down. Subnautica&apos;s oceans range from sun drenched shallow coral reefs to treacherous deep-sea trenches, lava fields, and bio-luminescent underwater rivers. Manage your oxygen supply as you explore kelp forests, plateaus, reefs, and winding cave systems. The water teems with life: Some of it helpful, much of it harmful.Scavenge, Craft, and SurviveAfter crash landing in your Life Pod, the clock is ticking to find water, food, and to develop the equipment you need to explore. Collect resources from the ocean around you. Craft knives, lights, diving gear, and personal water craft. Venture deeper and further form to find rarer resources, allowing you to craft more advanced items.Construct Underwater HabitatsBuild bases on the sea floor. Choose layouts and components, and manage hull-integrity as depth and pressure increase. Use your base to store","last_updated":"2017-06-18T12:06:12.759Z","parsed":{"xt":"urn:btih:f4035aeffa67084bb35577477a6fe7735b10baa6","dn":"Subnautica v49544","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4035aeffa67084bb35577477a6fe7735b10baa6","infoHashBuffer":{"type":"Buffer","data":[244,3,90,239,250,103,8,75,179,85,119,71,122,111,231,115,91,16,186,166]},"name":"Subnautica v49544","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}