{"title":"Autumn by Karl Ove Knausgaard ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:f416ab8329c8ba1866f853c5d0833786905c395a&dn=Autumn+by+Karl+Ove+Knausgaard+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"10446243","seeders":"0","leechers":"0","description":"xx\r\n\r\nAutumn by Karl Ove Knausgaard ePUB eBOOK-ZAK\r\n\r\nFrom the author of the monumental My Struggle series, Karl Ove Knausgaard, one of the masters of contemporary literature and a genius of observation and introspection, comes the first in a new autobiographical quartet based on the four seasons.\r\n\r\nAugust 28. Now, as I write this, you know nothing about anything, about what awaits you, the kind of world you will be born into. And I know nothing about you. I want to show you our world as it is now: the door, the floor, the water tap and the sink, the garden chair close to the wall beneath the kitchen window, the sun, the water, the trees. You will come to see it in your own way, you will experience things for yourself and live a life of your own, so of course it is primarily for my own sake that I am doing this: Showing you the world, little one, makes my life worth living.\r\n\r\nAutumn begins with a letter Karl Ove Knausgaard writes to his unborn daughter, showing her what to expect of the world. He writes one short piece per day, describing the material and natural world with the precision and mesmerizing intensity that have become his trademark. He describes with acute sensitivity daily life with his wife and children in rural Sweden, drawing upon memories of his own childhood to give an inimitably tender perspective on the precious and unique bond between parent and child. The sun, wasps, jellyfish, eyes, lice - the stuff of everyday life is the fodder for his art. Nothing is too small or too vast to escape his attention. This book is a personal encyclopedia on everything from chewing gum to the stars. Through close observation of the objects and phenomena around him, Knausgaard shows us how vast, unknowable, and wondrous the world is.\r\n\r\nxx","last_updated":"2017-08-22T12:00:30.476Z","parsed":{"xt":"urn:btih:f416ab8329c8ba1866f853c5d0833786905c395a","dn":"Autumn by Karl Ove Knausgaard ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f416ab8329c8ba1866f853c5d0833786905c395a","infoHashBuffer":{"type":"Buffer","data":[244,22,171,131,41,200,186,24,102,248,83,197,208,131,55,134,144,92,57,90]},"name":"Autumn by Karl Ove Knausgaard ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}