{"title":"\nThe Flight_ Charles Lindbergh's Daring and Immortal 1927 Transat","magnet":"magnet:?xt=urn:btih:f41dcf2059b3a7a5d4bed2aa4c29e80f980dae61&dn=The+Flight_+Charles+Lindbergh%27s+Daring+and+Immortal+1927+Transat&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7918266","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Flight_ Charles Lindbergh&apos;s Daring and Immortal 1927 Transatlantic Crossing by Dan Hampton 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA gripping and unique in-the-cockpit account of Charles Lindbergh&apos;s extraordinary first transatlantic flight from New York to Paris, by acclaimed aviation historian and former fighter pilot Dan Hampton - &quot;one of the most decorated pilots in Air Force history&quot; (New York Post).\r\n\r\nAmerica&apos;s finest aviation story in the hands of our finest aviation historian, The Flight is Dan Hampton&apos;s biggest, most dramatic book yet.\r\n\r\nOn the morning of May 20, 1927, a little-known pilot named Charles Lindbergh waited to take off from Roosevelt Field on Long Island. He was determined to claim the $25,000 Orteig Prize promised to the first pilot to fly nonstop from New York to Paris - a contest that had already claimed six men&apos;s lives. Just 25 years old, Lindbergh had never before flown over water. Yet 33 hours later, his single-engine monoplane, The Spirit of St. Louis, touched down in Paris. Overnight, Charles Lindbergh became the most famous aviator of all time.\r\n\r\nThe Flight is a long overdue flyer&apos;s-eye-view look at Lindbergh&apos;s legendary journey. Decorated fighter pilot and best-selling author Dan Hampton offers a unique appreciation for Lindbergh&apos;s accomplishment: Hampton has flown the exact same route many times, knowledge that informs and shapes The Flight. Relying upon a trove of primary sources, including Lindbergh&apos;s own personal diary and writings, Hampton crafts a dramatic narrative of a challenging, death-defying feat that many had believed was impossible.\r\n\r\nMoving hour by hour, Hampton recounts Lindbergh&apos;s uncertainty over his equipment and his courage as he traverses the vast darkness of the Atlantic with no radar. Moving between the sky and ground, Hampton intersperses the tale of the flight with Lindbergh&apos;s personal history as well as some of the stories of those waiting for him on the ground, praying he would make it safely across.\r\n\r\nxx","last_updated":"2017-09-24T12:01:00.183Z","parsed":{"xt":"urn:btih:f41dcf2059b3a7a5d4bed2aa4c29e80f980dae61","dn":"The Flight_ Charles Lindbergh's Daring and Immortal 1927 Transat","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f41dcf2059b3a7a5d4bed2aa4c29e80f980dae61","infoHashBuffer":{"type":"Buffer","data":[244,29,207,32,89,179,167,165,212,190,210,170,76,41,232,15,152,13,174,97]},"name":"The Flight_ Charles Lindbergh's Daring and Immortal 1927 Transat","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}