{"title":"Raspberry Pi 3 Projects for Java Programmers Author: John Sirach","magnet":"magnet:?xt=urn:btih:f4da22ef4c8efbe48d5cfc95736f77cb53c95dae&dn=Raspberry+Pi+3+Projects+for+Java+Programmers+Author%3A+John+Sirach&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zeke23","categoryP":"other","categoryS":"e_books","size":"17470884","seeders":"1","leechers":"0","description":"\nRaspberry Pi 3 Projects for Java Programmers Author: John Sirach, Pradeeka Seneviratne(2017) - True PDF - zeke23\r\nPublication Date: 2017-05-31 - ISBN-13: 9781786462121 -  286 pages - True PDF - English\r\nLearn the art of building enticing projects by unleashing the potential of Raspberry Pi 3 using Java\r\nAbout This Book\r\n\r\n    Explore the small yet powerful mini computer in order to run java applications\r\n    Leverage Java libraries to build exciting projects on home automation, IoT, and Robotics by leveraging Java libraries\r\n    Get acquainted with connecting electronic sensors to your Raspberry Pi 3 using Java APIs.\r\n\r\nWho This Book Is For\r\n\r\nThe book is aimed at Java programmers who are eager to get their hands-on Raspberry Pi and build interesting projects using java. They have a very basic knowledge of Raspberry Pi.\r\nWhat You Will Learn\r\n\r\n    Use presence detection using the integrated bluetooth chip\r\n    Automatic light switch using presence detection\r\n    Use a centralized IoT service to publish data using RPC\r\n    Control a robot by driving motors using PWM\r\n    Create a small web service capable of performing actions on the Raspberry Pi and supply readings\r\n    Image capture using Java together with the OpenCV framework\r\n\r\nIn Detail Raspberry Pi is a small, low cost and yet very powerful development platform. It is used to interact with attached electronics by the use of it&apos;s GPIO pins for multiple use cases, mainly Home Automation and Robotics. Our book is a project-based guide that will show you how to utilize the Raspberry Pi&apos;s GPIO with Java and how you can leverage this utilization with your knowledge of Java. You will start with installing and setting up the necessary hardware to create a seamless development platform. You will then straightaway start by building a project that will utilize light for presence detection. Next, you will program the application, capable of handling real time data using MQTT and utilize RPC to publish data to adafruit.io. Further, you will build a wireless robot on top of the zuma chassis with the Raspberry Pi as the main controller. Lastly, you will end the book with advanced projects that will help you to create a multi-purpose IoT controller along with building a security camera that will perform image capture and recognize faces with the help of notifications. By the end of the book, you will be able to build your own real world usable projects not limited to Home Automation, IoT and/or Robotics utilizing logic, user and web interfaces. Style and approach The book will contain projects that ensure a java programmer gets started with building interesting projects using the small yet powerful Raspberry Pi 3. We will start with brushing up your Raspberry Pi skills followed by building 5-6 projects\r\nTable of Contents\r\n\r\nChapter 1. Setting up Your Raspberry Pi\r\nChapter 2. Automatic Light Switch Using Presence Detection\r\nChapter 3. A Social and Personal Digital Photo Frame\r\nChapter 4. Integrating a Real-Time IoT Dashboard\r\nChapter 5. Wireless Controlled Robot\r\nChapter 6. Building a Multipurpose IoT Controller\r\nChapter 7. Security Camera with Face Recognition","last_updated":"2017-06-08T12:00:41.228Z","parsed":{"xt":"urn:btih:f4da22ef4c8efbe48d5cfc95736f77cb53c95dae","dn":"Raspberry Pi 3 Projects for Java Programmers Author: John Sirach","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f4da22ef4c8efbe48d5cfc95736f77cb53c95dae","infoHashBuffer":{"type":"Buffer","data":[244,218,34,239,76,142,251,228,141,92,252,149,115,111,119,203,83,201,93,174]},"name":"Raspberry Pi 3 Projects for Java Programmers Author: John Sirach","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}