{"title":"Strathclyde and the Anglo-Saxons in the Viking Age","magnet":"magnet:?xt=urn:btih:f509bd304fd380db3ee81f0ce8de7ff3a1853b82&dn=Strathclyde+and+the+Anglo-Saxons+in+the+Viking+Age&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"5465498","seeders":"0","leechers":"0","description":"Strathclyde and the Anglo-Saxons in the Viking Age - Tim Clarkson [epub]\r\n\r\nThis book traces the history of relations between the kingdom of Strathclyde and Anglo-Saxon England in the Viking period of the ninth to eleventh centuries AD. It puts the spotlight on the North Britons or &apos;Cumbrians&apos;, an ancient people whose kings ruled from a power-base at Govan on the outskirts of present-day Glasgow.\r\n\r\nIn the tenth century, these kings extended their rule southward from Clydesdale to the southern shore of the Solway Firth, bringing their language and culture to a region that had been in English hands for more than two hundred years. They played a key role in many of the great political events of the time, whether leading their armies in battle or forging treaties to preserve a fragile peace.\r\n\r\nTheir extensive realm, which was also known as &apos;Cumbria&apos;, was eventually conquered by the Scots, but is still remembered today in the name of an English county. How this county acquired the name of a long-vanished kingdom centred on the River Clyde is one of the topics covered in this book. It is part of a wider history that forms an important chapter in the story of how England and Scotland emerged from the early medieval period or &apos;Dark Ages&apos; as the countries we know today.\r\n\r\nTim Clarkson is an independent researcher and historian, who previously worked in academic librarianship. He gained an MPhil in Archaeology and a PhD in medieval history, both from the University of Manchester. He is a Fellow of the Society of Antiquaries of Scotland and a member of the editorial board of the Heroic Age online journal.\r\n\r\nPaperback: 224 pages\r\nPublisher: John Donald Short Run Press (October 20, 2014)","last_updated":"2017-12-30T12:00:23.718Z","parsed":{"xt":"urn:btih:f509bd304fd380db3ee81f0ce8de7ff3a1853b82","dn":"Strathclyde and the Anglo-Saxons in the Viking Age","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f509bd304fd380db3ee81f0ce8de7ff3a1853b82","infoHashBuffer":{"type":"Buffer","data":[245,9,189,48,79,211,128,219,62,232,31,12,232,222,127,243,161,133,59,130]},"name":"Strathclyde and the Anglo-Saxons in the Viking Age","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}