{"title":"\nThat Used to Be Us by Thomas L. Friedman EPUB","magnet":"magnet:?xt=urn:btih:f52e08708a67e7d4fb7c4f36fe5eda39fc91e4e3&dn=That+Used+to+Be+Us+by+Thomas+L.+Friedman+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"549208","seeders":"0","leechers":"0","description":"xx\r\n\r\nThat Used to Be Us by Thomas L. Friedman EPUB\r\n\r\nAmerica has a huge problem. It faces four major challenges, on which its future depends, and it is failing to meet them. In That Used to Be Us, Thomas L. Friedman, one of our most influential columnists, and Michael Mandelbaum, one of our leading foreign policy thinkers, analyze those challenges - globalization, the revolution in information technology, the nation&apos;s chronic deficits, and its pattern of energy consumption - and spell out what we need to do now to rediscover America and rise to this moment.\r\n\r\nThey explain how the end of the cold war blinded the nation to the need to address these issues. They show how our history, when properly understood, provides the key to addressing them, and explain how the paralysis of our political system and the erosion of key American values have made it impossible for us to carry out the policies the country needs. They offer a way out of the trap into which the country has fallen, which includes the rediscovery of some of our most valuable traditions and the creation of a new, third-party movement.\r\n\r\nThat Used to Be Us is both a searching exploration of the American condition today and a rousing manifesto for American renewal. &quot;As we were writing this book,&quot; Friedman and Mandelbaum explain, &quot;we found that when we shared the title with people, they would often nod ruefully and ask: &apos;But does it have a happy ending?&apos; Our answer is that we can write a happy ending, but it is up to the country - to all of us - to determine whether it is fiction or nonfiction. We need to study harder, save more, spend less, invest wisely, and get back to the formula that made us successful as a country in every previous historical turn. What we need is not novel or foreign, but values, priorities, and practices embedded in our history and culture, applied time and again to propel us forward as a country. That is all part of our past. That used to be us and can be again - if we will it.&quot;\r\n\r\nxx","last_updated":"2017-10-21T12:01:14.477Z","parsed":{"xt":"urn:btih:f52e08708a67e7d4fb7c4f36fe5eda39fc91e4e3","dn":"That Used to Be Us by Thomas L. Friedman EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f52e08708a67e7d4fb7c4f36fe5eda39fc91e4e3","infoHashBuffer":{"type":"Buffer","data":[245,46,8,112,138,103,231,212,251,124,79,54,254,94,218,57,252,145,228,227]},"name":"That Used to Be Us by Thomas L. Friedman EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}