{"title":"The Empire Must Die: Russia's Revolutionary Collapse, 1900-1917","magnet":"magnet:?xt=urn:btih:f54c3c7b43962819ed29f27c5b3391a0bed3fb26&dn=The+Empire+Must+Die%3A+Russia%27s+Revolutionary+Collapse%2C+1900-1917&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"7970792","seeders":"63","leechers":"5","description":"The Empire Must Die: Russia&apos;s Revolutionary Collapse, 1900-1917 - Mikhail Zygar [epub]\r\n\r\nFrom Tolstoy to Lenin, from Diaghilev to Stalin, The Empire Must Die is a tragedy of operatic proportions with a cast of characters that ranges from the exotic to utterly villainous, the glamorous to the depraved.\r\n\r\nIn 1912, Russia experienced a flowering of liberalism and tolerance that placed it at the forefront of the modern world: women were fighting for the right to vote in the elections for the newly empowered parliament, Russian art and culture was the envy of Europe and America, there was a vibrant free press and intellectual life. But a fatal flaw was left uncorrected: Russia&apos;s exuberant experimental moment took place atop a rotten foundation. The old imperial order, in place for three hundred years, still held the nation in thrall. Its princes, archdukes, and generals bled the country dry during the First World War and by 1917 the only consensus was that the Empire must die.\r\n\r\nMikhail Zygar&apos;s dazzling, in-the-moment retelling of the two decades that prefigured the death of the Tsar, his family, and the entire imperial edifice is a captivating drama of what might have been versus what was subsequently seen as inevitable. A monumental piece of political theater that only Russia was capable of enacting, the fall of the Russian Empire changed the course of the twentieth century and eerily anticipated the mood of the twenty-first.\r\n\r\nMikhail Zygar is the former editor in chief of the only independent TV station in Russia, TV Rain (Dozhd). Previously, he worked for Newsweek Russia and the business daily Kommersant. Zygar was awarded the 2014 International Press Freedom Award by the Committee to Protect Journalists.\r\n\r\nHardcover: 576 pages\r\nPublisher: PublicAffairs (November 7, 2017)","last_updated":"2017-12-09T12:09:18.913Z","parsed":{"xt":"urn:btih:f54c3c7b43962819ed29f27c5b3391a0bed3fb26","dn":"The Empire Must Die: Russia's Revolutionary Collapse, 1900-1917","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f54c3c7b43962819ed29f27c5b3391a0bed3fb26","infoHashBuffer":{"type":"Buffer","data":[245,76,60,123,67,150,40,25,237,41,242,124,91,51,145,160,190,211,251,38]},"name":"The Empire Must Die: Russia's Revolutionary Collapse, 1900-1917","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}