{"title":"WinUtilities Professional Edition v14.66 + Keygen - [SH]","magnet":"magnet:?xt=urn:btih:f5e50976b5c482773dc3f4fc7497a9737df3f8ac&dn=WinUtilities+Professional+Edition+v14.66+%2B+Keygen+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"7133969","seeders":"15","leechers":"2","description":"WinUtilities is an award winning collection of tools to optimize and speedup your system performance. This suite contains utilities to clean registry, temporary files on your disks, erase your application and internet browser history, cache and cookies. It also supports to defragment your disk drives and improve computer performance and stability. Built-in StartUp Cleaner allows you to control startup programs that load automatically with windows, find duplicate files, fix broken shortcuts and uninstall unneeded software. Other features include secure file deletion, recycle bin shredding, system maintenance tasks scheduling and undelete deleted files.\r\n\r\nKey Benefits:\r\n\r\n    Disk Defrag. Defragment your disks and improve computer performance and stability\r\n    File Undelete. Recovers deleted files on NTFS and FAT volumes.\r\n    Disk Cleaner. Cleans disks from information that clogs your system and reduces the performance of your computer.\r\n    Registry Cleaner. Scans the Windows registry and finds incorrect or obsolete information in the Windows Registry.\r\n    Startup Cleaner. Helps you to easily manage program execution at windows startup.\r\n    History Cleaner. Erases all traces of activity on your computer, save spaces and protect your privacy.\r\n    File Splitter. Splits any type of file into smaller pieces and rejoin them to the original file.\r\n    File Shredder. Erases files and make sure that no data thief can get his hands on your sensitive data.\r\n    File Lock and EXE Protector. Protects any Windows executable file with a secure password.\r\n    Many more&#x2026;","last_updated":"2017-06-06T12:02:57.535Z","parsed":{"xt":"urn:btih:f5e50976b5c482773dc3f4fc7497a9737df3f8ac","dn":"WinUtilities Professional Edition v14.66   Keygen - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f5e50976b5c482773dc3f4fc7497a9737df3f8ac","infoHashBuffer":{"type":"Buffer","data":[245,229,9,118,181,196,130,119,61,195,244,252,116,151,169,115,125,243,248,172]},"name":"WinUtilities Professional Edition v14.66   Keygen - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}