{"title":"The Longest Night by Andria Williams EPUB","magnet":"magnet:?xt=urn:btih:f62ceb6688947559a6fc02167652de72a3af32ca&dn=The+Longest+Night+by+Andria+Williams+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1325395","seeders":"26","leechers":"7","description":"xx\r\n\r\nThe Longest Night by Andria Williams EPUB\r\n\r\nIn this absorbing and suspenseful debut novel - reminiscent of Revolutionary Road and inspired by a little-known piece of history - a young couple must fight to save both their marriage and the town they live in.\r\n\r\nIn 1959, Nat Collier moves with her husband, Paul, and their two young daughters to Idaho Falls, a remote military town. An army specialist, Paul is stationed there to help oversee one of the country&apos;s first nuclear reactors - an assignment that seems full of opportunity.\r\n\r\nThen, on his rounds, Paul discovers that the reactor is compromised, placing his family and the entire community in danger. Worse, his superiors set out to cover up the problem rather than fix it. Paul can&apos;t bring himself to tell Nat the truth, but his lies only widen a growing gulf between them.\r\n\r\nLonely and restless, Nat is having trouble adjusting to their new life. She struggles to fit into her role as a housewife and longs for a real friend. When she meets a rancher, Esrom, she finds herself drawn to him, comforted by his kindness and company. But as rumors spread, the secrets between Nat and Paul build and threaten to reach a breaking point.\r\n\r\nBased on a true story of the only fatal nuclear accident to occur in America, The Longest Night is a deeply moving novel that explores the intricate makeup of a marriage, the shifting nature of trust, and the ways we try to protect the ones we love.\r\n\r\nxx","last_updated":"2018-01-02T12:07:06.935Z","parsed":{"xt":"urn:btih:f62ceb6688947559a6fc02167652de72a3af32ca","dn":"The Longest Night by Andria Williams EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f62ceb6688947559a6fc02167652de72a3af32ca","infoHashBuffer":{"type":"Buffer","data":[246,44,235,102,136,148,117,89,166,252,2,22,118,82,222,114,163,175,50,202]},"name":"The Longest Night by Andria Williams EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}