{"title":"\nConfronting Capitalism_ Real Solutions for a Troubled Economic S","magnet":"magnet:?xt=urn:btih:f65e15e54475bd2cb9c357f1cd130d70f6948946&dn=Confronting+Capitalism_+Real+Solutions+for+a+Troubled+Economic+S&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3614714","seeders":"21","leechers":"11","description":"xx\r\n\r\nConfronting Capitalism_ Real Solutions for a Troubled Economic System by Philip Kotler PDF eBOOK-ZAK\r\n\r\nWith the fall of the Berlin Wall, one economic model emerged triumphant. Capitalism - spanning a spectrum from laissez-faire to authoritarian - shapes the market economies of all the wealthiest and fastest-growing nations. The trouble is cracking its shiny veneer. In the US, economic growth is no longer matched by economic development. Wealth is concentrated in the hands of a few, natural resources are exploited for short-term profits, and good jobs are hard to find.\r\n\r\nWith a piercing clarity, Philip Kotler explains 14 major problems undermining capitalism, including: persistent poverty, job creation in the face of automation, high debt burdens, the disproportionate influence of the wealthy on public policy, steep environmental costs, boom-bust economic cycles, and more.\r\n\r\nAmid its dire assessment of what&apos;s ailing us, Confronting Capitalism delivers a heartening message: We can turn things around. Movements toward shared prosperity and a higher purpose are reinvigorating companies large and small while proposals abound on government policies that offer protections without stagnation. Kotler identifies the best ideas, linking private and public initiatives into a force for positive change. Combining economic history, expert insight, business lessons, and recent data, this landmark book elucidates today&apos;s critical dilemmas and suggests solutions for returning to a healthier, more sustainable path.\r\n\r\nxx","last_updated":"2017-10-07T12:05:51.421Z","parsed":{"xt":"urn:btih:f65e15e54475bd2cb9c357f1cd130d70f6948946","dn":"Confronting Capitalism_ Real Solutions for a Troubled Economic S","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f65e15e54475bd2cb9c357f1cd130d70f6948946","infoHashBuffer":{"type":"Buffer","data":[246,94,21,229,68,117,189,44,185,195,87,241,205,19,13,112,246,148,137,70]},"name":"Confronting Capitalism_ Real Solutions for a Troubled Economic S","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}