{"title":"Paul Bloom - Against Empathy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:f665bbe6b1b81806f618b37e46d9e20c87243271&dn=Paul+Bloom+-+Against+Empathy+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3025330","seeders":"38","leechers":"4","description":"Paul Bloom - Against Empathy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA controversial call to arms, Against Empathy argues that the natural impulse to share the feelings of others can lead to immoral choices in both public policy and in our intimate relationships with friends and family.\r\n\r\nMost people, including many policy makers, activists, scientists, and philosophers, have encouraged us to be more empathetic - to feel the pain and pleasure of others. Yale researcher and author Paul Bloom argues that this is a mistake. Far from leading us to improve the lives of others, empathy is a capricious and irrational emotion that appeals to our narrow prejudices. It muddles our judgment and often leads to cruelty. We are at our best when we are smart enough not to rely on it and draw upon a more distanced compassion.\r\n\r\nBased on groundbreaking scientific findings, Against Empathy makes the case that some of the worst decisions that individuals and nations make - who to give money to, when to go to war, how to respond to climate change, and who to put in prison - are too often motivated by honest yet misplaced emotions. With clear and witty prose, Bloom demonstrates how empathy distorts our judgment in every aspect of our lives, from philanthropy and charity to the justice system; from culture and education to foreign policy and war. Without empathy, Bloom insists, our decisions would be clearer, fairer, and ultimately more moral.\r\n\r\nBound to be controversial, Against Empathy shows us that when it comes to major policy decisions and the choices we make in our everyday lives, limiting our empathetic emotions is often the most compassionate choice we can make","last_updated":"2017-05-27T09:02:56.400Z","parsed":{"xt":"urn:btih:f665bbe6b1b81806f618b37e46d9e20c87243271","dn":"Paul Bloom - Against Empathy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f665bbe6b1b81806f618b37e46d9e20c87243271","infoHashBuffer":{"type":"Buffer","data":[246,101,187,230,177,184,24,6,246,24,179,126,70,217,226,12,135,36,50,113]},"name":"Paul Bloom - Against Empathy 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}