{"title":"Jonathan Kellerman The Murderers Daughter","magnet":"magnet:?xt=urn:btih:f706ac9fc44545c1209da125892973ed5ff7ed76&dn=Jonathan+Kellerman+The+Murderers+Daughter&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"metheguy","categoryP":"audio","categoryS":"audio_books","size":"206256467","seeders":"0","leechers":"0","description":"Book Description\r\n================\r\nFrom the number-one New York Times best-selling creator of the acclaimed Alex Delaware series comes a tour-de-force novel that introduces an unforgettable new heroine and illustrates perfectly why &apos;Jonathan Kellerman has justly earned his reputation as a master of the psychological thriller&apos; (People). Brilliant, beautiful, and stunningly effective, psychologist Dr. Grace Blades has a special gift for treating troubled souls and healing tormented psyches - perhaps because she bears her own invisible scars. Only five years old when she witnessed her parents die in a bloody murder-suicide, Grace took refuge in her towering intellect and found comfort in the loving couple who adopted her. But as an adult, Grace&apos;s accomplished professional life vies with a covert, high-risk dark side, played out harrowingly. And when Grace&apos;s two worlds shockingly converge, her past returns with a vengeance. The crisis begins when the busy therapist encounters a new patient whose own bleak past seems to eerily echo her own grim childhood. But there&apos;s a complication: She&apos;s met Andrew Toner before, under bizarre circumstances, and must refuse to treat him. Thinking that this is the last she&apos;ll hear of the young man, Grace is stunned to learn he was murdered soon after leaving her office, a vicious crime that leads a homicide investigation to her doorstep. Shaken by the killing and fearing exposure of her double life, Grace sets out to probe the crime herself. But when she stumbles on the dead man&apos;s true identity, a horrifying chapter from her childhood is violently reawakened, forcing her to confront a decades-old act of evil that cries out for retribution. Suddenly stalked by vicious predators, Grace must draw upon the fierce will to survive that has powered her entire life while facing down her darkest personal demons","last_updated":"2017-11-16T12:02:21.840Z","parsed":{"xt":"urn:btih:f706ac9fc44545c1209da125892973ed5ff7ed76","dn":"Jonathan Kellerman The Murderers Daughter","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f706ac9fc44545c1209da125892973ed5ff7ed76","infoHashBuffer":{"type":"Buffer","data":[247,6,172,159,196,69,69,193,32,157,161,37,137,41,115,237,95,247,237,118]},"name":"Jonathan Kellerman The Murderers Daughter","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}