{"title":"The Last Stand of pany_ A True Story of U.S. Marines in C","magnet":"magnet:?xt=urn:btih:f75dce701d6d06909029265bca909ee8db1a5dcc&dn=The+Last+Stand+of+pany_+A+True+Story+of+U.S.+Marines+in+C&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7804484","seeders":"30","leechers":"4","description":"xx\r\n\r\nThe Last Stand of Fox Company_ A True Story of U.S. Marines in Combat by Bob Drury and Thomas Clavin ePUB MOBI eBOOK-ZAK\r\n\r\nNovember 1950, the Korean Peninsula. After General MacArthur ignores Mao&apos;s warnings and pushes his UN forces deep into North Korea, his 10,000 First Division Marines find themselves surrounded and hopelessly outnumbered by 100,000 Chinese soldiers near the Chosin Reservoir. Their only chance for survival is to fight their way south through the Toktong Pass, a narrow gorge in the Nangnim Mountains. It will need to be held open at all costs. The mission is handed to Captain William Barber and the 246 Marines of Fox Company, a courageous but undermanned unit of the First Marines. Barber and his men are ordered to climb seven miles of frozen terrain to a rocky promontory overlooking the pass. The Marines have no way of knowing that the ground they occupy - it is soon dubbed &quot;Fox Hill&quot; - is surrounded by 10,000 Chinese soldiers.\r\n\r\nAs the sun sets on the hill, and the temperature plunges to 30 degrees below zero, Barber&apos;s men dig in for the night. At two in the morning they are awakened by the sound - bugles, whistles, cymbals, and drumbeats - of a massive assault by thousands of enemy infantry. The attack is just the first wave of four days and five nights of nearly continuous Chinese attempts to take Fox Hill, during which Barber&apos;s beleaguered company clings to the high ground and allows the First Marine Division to battle south. Amid the relentless violence, three-quarters of Fox Company&apos;s Marines are killed, wounded, or captured. Just when it looks like the outfit will be overrun, Lieutenant Colonel Raymond Davis, a fearless Marine officer who is fighting south from Chosin, volunteers to lead a force of 500 men on a daring mission that cuts a hole in the Chinese lines and relieves the men of Fox Company.\r\n\r\nThe Last Stand of Fox Company is a fast-paced and gripping account of heroism and self-sacrifice in the face of impossible odds. The authors have conducted dozens of firsthand interviews with the battle&apos;s survivors, and they narrate the story with the imm...\r\n\r\nxx","last_updated":"2017-08-30T12:09:31.072Z","parsed":{"xt":"urn:btih:f75dce701d6d06909029265bca909ee8db1a5dcc","dn":"The Last Stand of pany_ A True Story of U.S. Marines in C","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f75dce701d6d06909029265bca909ee8db1a5dcc","infoHashBuffer":{"type":"Buffer","data":[247,93,206,112,29,109,6,144,144,41,38,91,202,144,158,232,219,26,93,204]},"name":"The Last Stand of pany_ A True Story of U.S. Marines in C","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}