{"title":"What Happened by Hillary Rodham Clinton ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:f774c10476db6fb38906839554754d2d64b8ccdb&dn=What+Happened+by+Hillary+Rodham+Clinton+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4117116","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhat Happened by Hillary Rodham Clinton ePUB eBOOK-ZAK\r\n\r\n&quot;In the past, for reasons I try to explain, I&apos;ve often felt I had to be careful in public, like I was up on a wire without a net. Now I&apos;m letting my guard down.&quot; (Hillary Rodham Clinton, from the introduction of What Happened)\r\n\r\nFor the first time, Hillary Rodham Clinton reveals what she was thinking and feeling during one of the most controversial and unpredictable presidential elections in history. Now free from the constraints of running, Hillary takes you inside the intense personal experience of becoming the first woman nominated for president by a major party in an election marked by rage, sexism, exhilarating highs and infuriating lows, stranger-than-fiction twists, Russian interference, and an opponent who broke all the rules. This is her most personal memoir yet.\r\n\r\nIn this book she describes what it was like to run against Donald Trump, the mistakes she made, how she has coped with a shocking and devastating loss, and how she found the strength to pick herself back up afterward. With humor and candor, she tells readers what it took to get back on her feet - the rituals, relationships, and reading that got her through and what the experience has taught her about life. She speaks about the challenges of being a strong woman in the public eye, the criticism over her voice, age, and appearance, and the double standard confronting women in politics.\r\n\r\nShe lays out how the 2016 election was marked by an unprecedented assault on our democracy by a foreign adversary. By analyzing the evidence and connecting the dots, Hillary shows just how dangerous the forces are that shaped the outcome and why Americans need to understand them to protect our values and our democracy in the future.\r\n\r\nThe election of 2016 was unprecedented and historic. What Happened is the story of that campaign and its aftermath - both a deeply intimate account and a cautionary tale for the nation.\r\n\r\nxx","last_updated":"2017-09-13T12:00:27.074Z","parsed":{"xt":"urn:btih:f774c10476db6fb38906839554754d2d64b8ccdb","dn":"What Happened by Hillary Rodham Clinton ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f774c10476db6fb38906839554754d2d64b8ccdb","infoHashBuffer":{"type":"Buffer","data":[247,116,193,4,118,219,111,179,137,6,131,149,84,117,77,45,100,184,204,219]},"name":"What Happened by Hillary Rodham Clinton ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}