{"title":"Sally Mott Freeman - The Jersey Brothers 2017 RETAiL ePUB eBOOK-","magnet":"magnet:?xt=urn:btih:f7aeb4d83a0a28272de8ba9714c007846ae6dee1&dn=Sally+Mott+Freeman+-+The+Jersey+Brothers+2017+RETAiL+ePUB+eBOOK-&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"63815738","seeders":"0","leechers":"0","description":"xx\r\n\r\nSally Mott Freeman - The Jersey Brothers 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nThe extraordinary real-life adventure of three brothers at the center of the most dramatic turning points of World War II and their mad race to change history - and save one of their own.\r\n\r\nThey are three brothers, all navy men, who end up coincidentally and extraordinarily at the epicenter of three of the war&apos;s most crucial moments. Bill is picked by Roosevelt to run his first map room in Washington. Benny is the gunnery and antiaircraft officer on the USS Enterprise, one of the only carriers to escape Pearl Harbor and by the end of 1942 the last one left in the Pacific to defend against the Japanese. Barton, the youngest and least distinguished of the three, is shuffled off to the Navy Supply Corps because his mother wants him out of harm&apos;s way. But this protection plan backfires when Barton is sent to the Philippines and listed as missing in action after a Japanese attack. Now it is up to Bill and Benny to find and rescue him.\r\n\r\nBased on 10 years of research drawn from archives around the world, interviews with fellow shipmates and POWs, and primary sources including diaries, unpublished memoirs, and letters half forgotten in basements, The Jersey Brothers is a remarkable story of agony and triumph - from the home front to Roosevelt&apos;s White House and Pearl Harbor to Midway and Bataan. It is the story, written with intimate, novelistic detail, of an ordinary young man who shows extraordinary courage as the Japanese do everything short of killing him. And it is, above all, a story of brotherly love: of three men finding their loyalty to each other tested under the tortures of war - and knowing that their success or failure to save their youngest brother will shape their family forever.\r\n\r\nxx","last_updated":"2017-08-01T12:00:36.817Z","parsed":{"xt":"urn:btih:f7aeb4d83a0a28272de8ba9714c007846ae6dee1","dn":"Sally Mott Freeman - The Jersey Brothers 2017 RETAiL ePUB eBOOK-","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f7aeb4d83a0a28272de8ba9714c007846ae6dee1","infoHashBuffer":{"type":"Buffer","data":[247,174,180,216,58,10,40,39,45,232,186,151,20,192,7,132,106,230,222,225]},"name":"Sally Mott Freeman - The Jersey Brothers 2017 RETAiL ePUB eBOOK-","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}