{"title":"Textual v6.0.10 [Mac Os X]","magnet":"magnet:?xt=urn:btih:f8097bbe771370e71ea8a655fc05028c2ab6c5cf&dn=Textual+v6.0.10+%5BMac+Os+X%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Browse booka89","categoryP":"applications","categoryS":"mac","size":"8987675","seeders":"1","leechers":"1","description":"\r\nA lightweight and simple to use OS X IRC client that provides the tools needed to stay in touch with your friends using the internet\r\n\r\nMac users don&#x2019;t have lots of options when it comes to IRC  (short for Internet Relay Chat) clients because most of them look pretty bad on macOS and aren&#x2019;t as user-friendly as we would like from macOS apps.\r\n\r\nAs an alternative, you could try Textual, a modern looking IRC client, with a streamlined and clean OS X interface and tons of customization features.\r\n\r\nEverything you could ever want from an IRC client\r\n\r\nWith a perfect OS X integration, this IRC client comes with iCloud support for your connections and settings, as well as with support for Notification Center notifications, so you can rest assured that instant notifications will always be received each time you are being approached by other users.\r\n\r\nNot only this, but Textual also includes other, more advanced, features that you want in an IRC client, such as ZNC support, SSL with cert validation, username, command and channel auto-completion, inline media embedding, native keyboard shortcuts, SOCKS4, SOCKS5, and HTTP proxy support, as well as support for sending certificates for authentication, just to name a few.\r\n\r\nChoose from its built-in collection of themes or install add-ons to improve its functionality\r\n\r\nAlso worth mentioning is Textual&#x2019;s integration with the Address Book app, so that you can easily track when your friends are online, its support for add-ons that will extend its functionality, and its support for rule-based ignore matching, which makes it easy for you to block unwanted and annoying parties.\r\n\r\nAs far as customizability features go, you will also not be disappointed, as Textual comes with an attractive set of themes, suitable for both very lit and very dark environments, with text formatting options, and support for emoticons and emoji.\r\n\r\nPowerful and highly customizable IRC client for your Mac\r\n\r\nTo conclude, with its large collection of powerful features, perfect system integration, and beautiful native interface, Textual is a must-have IRC client designed for macOS users that like the concept behind the, once powerful, IRC","last_updated":"2017-04-18T10:38:04.720Z","parsed":{"xt":"urn:btih:f8097bbe771370e71ea8a655fc05028c2ab6c5cf","dn":"Textual v6.0.10 [Mac Os X]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8097bbe771370e71ea8a655fc05028c2ab6c5cf","infoHashBuffer":{"type":"Buffer","data":[248,9,123,190,119,19,112,231,30,168,166,85,252,5,2,140,42,182,197,207]},"name":"Textual v6.0.10 [Mac Os X]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}