{"title":"GlassWire Elite v1.2.102 Final + Crack - [SH]","magnet":"magnet:?xt=urn:btih:f83a50a4edc4a169cdf9025873ba188e874a1ebc&dn=GlassWire+Elite+v1.2.102+Final+%2B+Crack+-+%5BSH%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"ranger.03","categoryP":"applications","categoryS":"windows","size":"31335965","seeders":"13","leechers":"8","description":"Although you may not always be notified about it, processes and applications sometimes connect to the Internet to send or receive data. Because of this, your computer can get hijacked or infected by malware, especially if you are not aware of the vulnerability and you do not take any measures to protect the system against unauthorized access.GlassWire is a software utility that provides you with around-the-clock security when it comes to your Internet connection, by monitoring the incoming and outgoing network traffic. Hence, it is able to detect and display information about every service or process that is currently making use of your bandwidth, as well as the IP addresses of each third party connection.\r\n\r\nIn order to make the data easier to read, the utility display this information in graph form, which is updated every few seconds with your network&#x2019;s activity feed. In addition, the notification service also alerts you whenever a new connection is detected and you can view separate feeds for applications and regular Internet traffic.The firewall capabilities of the utility can be used to protect yourself from any unwanted connections, as well as block certain applications from being able to transfer data over the Internet. Thus, you are able to choose which programs are allowed to use the network and send or receive information, by simply clicking on them in the provided list","last_updated":"2017-06-04T12:02:06.164Z","parsed":{"xt":"urn:btih:f83a50a4edc4a169cdf9025873ba188e874a1ebc","dn":"GlassWire Elite v1.2.102 Final   Crack - [SH]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f83a50a4edc4a169cdf9025873ba188e874a1ebc","infoHashBuffer":{"type":"Buffer","data":[248,58,80,164,237,196,161,105,205,249,2,88,115,186,24,142,135,74,30,188]},"name":"GlassWire Elite v1.2.102 Final   Crack - [SH]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}