{"title":"Play Anything by Ian Bogost 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","magnet":"magnet:?xt=urn:btih:f84f399c7af1601b50d322d3416fe6625befcbd8&dn=Play+Anything+by+Ian+Bogost+2016+RETAiL+ePUB+eBOOK-DiSTRiBUTiON&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3276164","seeders":"0","leechers":"0","description":"xx\r\n\r\nPlay Anything by Ian Bogost 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nLife is boring: filled with meetings and traffic, errands and emails. Nothing we&apos;d ever call fun. But what if we&apos;ve gotten fun wrong? In Play Anything, visionary game designer and philosopher Ian Bogost shows how we can overcome our daily anxiety; transforming the boring, ordinary world around us into one of endless, playful possibilities. The key to this playful mindset lies in discovering the secret truth of fun and games.\r\n\r\nPlay Anything reveals that games appeal to us not because they are fun, but because they set limitations. Soccer wouldn&apos;t be soccer if it wasn&apos;t composed of two teams of 11 players using only their feet, heads, and torsos to get a ball into a goal; Tetris wouldn&apos;t be Tetris without falling pieces in characteristic shapes. Such rules seem needless, arbitrary, and difficult. Yet it is the limitations that make games enjoyable, just like it&apos;s the hard things in life that give it meaning.\r\n\r\nPlay is what happens when we accept these limitations, narrow our focus, and, \r\nconsequently, have fun. Which is also how to live a good life. Manipulating a soccer ball into a goal is no different than treating ordinary circumstances - like grocery shopping, lawn mowing, and making PowerPoints - as sources for meaning and joy. We can &quot;play anything&quot; by filling our days with attention and discipline, devotion and love for the world as it really is, beyond our desires and fears. Ranging from Internet culture to moral philosophy, ancient poetry to modern consumerism, Bogost shows us how today&apos;s chaotic world can only be tamed - and enjoyed - when we first impose boundaries on ourselves.\r\n\r\nxx","last_updated":"2017-08-19T12:00:31.157Z","parsed":{"xt":"urn:btih:f84f399c7af1601b50d322d3416fe6625befcbd8","dn":"Play Anything by Ian Bogost 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f84f399c7af1601b50d322d3416fe6625befcbd8","infoHashBuffer":{"type":"Buffer","data":[248,79,57,156,122,241,96,27,80,211,34,211,65,111,230,98,91,239,203,216]},"name":"Play Anything by Ian Bogost 2016 RETAiL ePUB eBOOK-DiSTRiBUTiON","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}