{"title":"\nSpies in the Family_ An American Spymaster, His Russian Crown Je","magnet":"magnet:?xt=urn:btih:f86fa045521f55af88696907750a644c4ff724e7&dn=Spies+in+the+Family_+An+American+Spymaster%2C+His+Russian+Crown+Je&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"7830216","seeders":"15","leechers":"13","description":"xx\r\n\r\nSpies in the Family_ An American Spymaster, His Russian Crown Jewel, and ... by Eva Dillon 2017 RETAiL ePUB eBOOK-DiSTRiBUTiON\r\n\r\nA riveting true-life thriller and revealing memoir from the daughter of an American intelligence officer - the astonishing true story of two spies and their families on opposite sides of the Cold War.\r\n\r\nIn the summer of 1975, 17-year-old Eva Dillon&apos;s family was living in New Delhi when her father was exposed as a CIA spy. Eva had long believed that her father was a US State Department employee. She had no idea that he was handling the CIA&apos;s highest ranking double agent - Dmitri Fedorovich Polyakov, a Soviet general whose code name was TOPHAT. Dillon&apos;s father and Polyakov had a close friendship that went back years, to their first meeting in Burma in the mid-1960s. At the height of the Cold War, the Russian offered the CIA an unfiltered view into the vault of Soviet intelligence. His collaboration helped ensure that tensions between the two nuclear superpowers did not escalate into a shooting war.\r\n\r\nSpanning 50 years and three continents, Spies in the Family is a deeply researched account of two families on opposite sides of the lethal espionage campaigns of the Cold War and two men whose devoted friendship lasted a lifetime, until the devastating final days of their lives. With impeccable insider access to both families as well as knowledgeable CIA and FBI officers, Dillon goes beyond the fog of secrecy to craft an unforgettable story of friendship and betrayal, double agents and clandestine lives, exposing the commonality between peoples of opposing political economic systems.\r\n\r\nBoth a gripping tale of spy craft and a moving personal story, Spies in the Family is an invaluable and heart-rending work.\r\n\r\nxx","last_updated":"2017-09-24T12:02:44.330Z","parsed":{"xt":"urn:btih:f86fa045521f55af88696907750a644c4ff724e7","dn":"Spies in the Family_ An American Spymaster, His Russian Crown Je","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f86fa045521f55af88696907750a644c4ff724e7","infoHashBuffer":{"type":"Buffer","data":[248,111,160,69,82,31,85,175,136,105,105,7,117,10,100,76,79,247,36,231]},"name":"Spies in the Family_ An American Spymaster, His Russian Crown Je","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}