{"title":"Benjamin Franklin_ An American Life by Walter Isaacson EPUB","magnet":"magnet:?xt=urn:btih:f8e80aaca0e62032e5e50c5ff6453c24ea2de3a1&dn=Benjamin+Franklin_+An+American+Life+by+Walter+Isaacson+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"661746","seeders":"0","leechers":"0","description":"xx\r\n\r\nBenjamin Franklin_ An American Life by Walter Isaacson EPUB\r\n\r\nBenjamin Franklin is the founding father who winks at us - an ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings.\r\n\r\nIn best-selling author Walter Isaacson&apos;s vivid and witty full-scale biography, we discover why Franklin turns to us from history&apos;s stage with eyes that twinkle from behind his new-fangled spectacles. In Benjamin Franklin, Isaacson shows how Franklin defines both his own time and ours.\r\n\r\nThe most interesting thing that Franklin invented, and continually reinvented, was himself. America&apos;s first great publicist, he was consciously trying to create a new American archetype. In the process, he carefully crafted his own persona, portrayed it in public, and polished it for posterity. His guiding principle was a &quot;dislike of everything that tended to debase the spirit of the common people&quot;. Few of his fellow founders felt this comfort with democracy so fully, and none so intuitively.\r\n\r\nIn this colorful and intimate narrative, Isaacson provides the full sweep of Franklin&apos;s amazing life, from his days as a runaway printer to his triumphs as a statesman, scientist, and Founding Father. He chronicles Franklin&apos;s tumultuous relationship with his illegitimate son and grandson, his practical marriage, and his flirtations with the ladies of Paris. He also shows how Franklin helped to create the American character and why he has a particular resonance in the 21st century.\r\n\r\nxx","last_updated":"2017-11-01T12:01:14.543Z","parsed":{"xt":"urn:btih:f8e80aaca0e62032e5e50c5ff6453c24ea2de3a1","dn":"Benjamin Franklin_ An American Life by Walter Isaacson EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f8e80aaca0e62032e5e50c5ff6453c24ea2de3a1","infoHashBuffer":{"type":"Buffer","data":[248,232,10,172,160,230,32,50,229,229,12,95,246,69,60,36,234,45,227,161]},"name":"Benjamin Franklin_ An American Life by Walter Isaacson EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}