{"title":"Can't Cope Won't Cope S01 complete","magnet":"magnet:?xt=urn:btih:f9b930f8b2f92f01e1800b115decdb59d2cbbbd1&dn=Can%27t+Cope+Won%27t+Cope+S01+complete&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"RoaElson","categoryP":"video","categoryS":"other","size":"2462431954","seeders":"0","leechers":"0","description":"Can&apos;t Cope Won&apos;t Cope S01 complete (720p HD, soft Eng subs)\r\n\r\nE01\r\nBest friends Aisling and Danielle are two young women from Cork working in Dublin and sharing a house. Aisling works as a fund manager and Danielle is studying graphic design.  \r\n\r\nBoth are party people, knocking back shots and enjoying the night life that Dublin offers them.  \r\n\r\nAfter a less than satisfactory work review, Aisling agrees to meet Danielle at their favourite night club, where Aisling meets Simon and goes home with him to his sister&apos;s house for a night of passion.\r\n\r\nE02\r\nWhen Aisling saves her boss from a disastrous quirk of fate, the office are given the afternoon off.  \r\n\r\nInviting Danielle to the drunken celebrations, things get out of hand when the two friends decide to visit a remote part of Dublin to watch some illicit activity.  \r\n\r\nThings get even more out of hand when Aisling decides to steal a car - in her drunken state she seems more concerned that her provisional licence has expired.\r\n\r\nE03\r\nAisling and Lorcan are warned to be on their best behaviour when entertaining an important client from America.  \r\n\r\nAisling is determined to comply until alcohol gets the better of her and she blurts out an unintentional insult to the client. Danielle meanwhile has been invited along to the evening function and makes matters worse by revealing details of a confidential account. Aisling goes home with Lorcan unaware of the damage she has caused and is in for a shock when she arrives at work the following morning.  \r\n\r\nDanielle makes a decision about the possible Canadian student exchange programme.\r\n\r\nE04\r\nAisling wakes and discovers that Danielle is not at home and is spending her weekend with Ferg.  \r\n\r\nOn finally returning her mother&apos;s calls, Aisling is persuaded to make the trip back to Mallow to visit the family and receive some important news.  \r\n\r\nHer younger brother and sister seem less than pleased to see her, but the news - when it is delivered - is shattering, leading Aisling to go on an unprecidented binge.\r\n\r\nE05\r\nHaving been arrested for being drunk and incapable, Aisling asks that the Garda calls Danielle to come and collect her.  Danielle has spent the night with Ferg and on getting the call, gets a taxi to the station.  \r\n\r\nAn unappreciative and still drunk Aisling calls in sick to work and expects Danielle to stay and comfort her, but Danielle is approaching her end of term exhibition and goes in to college.  \r\n\r\nFinally giving in to Aisling&apos;s pressure, the girls take an impulsive ride to the Wicklow Hills, an impulse which proves to be a turning point in their relationship.\r\n\r\nE06\r\nAisling and her co-workers think that someone has organised a &quot;stripper&quot; surprise when two uniformed Garda arrive at the offices of Sweeny, Grimes and Hunt -  but they require her attendance at the station to answer some questions regarding a document found in a stolen car.  \r\n\r\nAisling is determined to shield Danielle when questioned but has a rude awakening when she returns to the office.\r\n\r\n(with soft subtitles) \r\n\r\nFirst broadcast: May 2017\r\nDuration:  c.20 minutes per episode","last_updated":"2017-06-11T12:00:21.799Z","parsed":{"xt":"urn:btih:f9b930f8b2f92f01e1800b115decdb59d2cbbbd1","dn":"Can't Cope Won't Cope S01 complete","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f9b930f8b2f92f01e1800b115decdb59d2cbbbd1","infoHashBuffer":{"type":"Buffer","data":[249,185,48,248,178,249,47,1,225,128,11,17,93,236,219,89,210,203,187,209]},"name":"Can't Cope Won't Cope S01 complete","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}