{"title":"The Dead Hand_ The Untold Story of the Cold War Arms Race and It","magnet":"magnet:?xt=urn:btih:f9d1b69a079afa15fb9973b26a0a822790beb77e&dn=The+Dead+Hand_+The+Untold+Story+of+the+Cold+War+Arms+Race+and+It&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4051094","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Dead Hand_ The Untold Story of the Cold War Arms Race and Its Dangerous Legacy by David E Hoffman MOBI eBOOK-ZAK\r\n\r\nPulitzer Prize, General Nonfiction, 2010\r\n\r\nThis riveting narrative history of the end of the arms race sheds new light on the frightening last chapters of the Cold War and the legacy of the nuclear, chemical, and biological weapons that remain a threat today.\r\n\r\nDuring the Cold War, world superpowers amassed nuclear arsenals containing the explosive power of one million Hiroshimas. The Soviet Union secretly plotted to create the &quot;Dead Hand,&quot; a system designed to launch an automatic retaliatory nuclear strike on the United States, and developed a fearsome biological warfare machine. President Ronald Reagan, hoping to awe the Soviets into submission, pushed hard for the creation of space-based missile defenses.\r\n\r\nIn the first full account of how the arms race finally ended, The Dead Hand provides an unprecedented look at the inner motives and secret decisions of each side. Drawing on top-secret documents from deep inside the Kremlin, memoirs, and interviews in both Russia and the United States, David Hoffman introduces the scientists, soldiers, diplomats, and spies who saw the world sliding toward disaster and tells the gripping story of how Reagan, Gorbachev, and many others struggled to bring the madness to an end. When the Soviet Union dissolved, the danger continued, and the United States began a race against time to keep nuclear and biological weapons out of the hands of terrorists and and rogue states.\r\n\r\nxx","last_updated":"2017-08-14T12:00:33.312Z","parsed":{"xt":"urn:btih:f9d1b69a079afa15fb9973b26a0a822790beb77e","dn":"The Dead Hand_ The Untold Story of the Cold War Arms Race and It","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f9d1b69a079afa15fb9973b26a0a822790beb77e","infoHashBuffer":{"type":"Buffer","data":[249,209,182,154,7,154,250,21,251,153,115,178,106,10,130,39,144,190,183,126]},"name":"The Dead Hand_ The Untold Story of the Cold War Arms Race and It","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}