{"title":"The Award by Danielle Steel EPUB","magnet":"magnet:?xt=urn:btih:f9feb133c3b53f27c71e18e847f3651539b6e120&dn=The+Award+by+Danielle+Steel+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1133253","seeders":"9","leechers":"1","description":"xx\r\n\r\nThe Award by Danielle Steel EPUB\r\n\r\nCapturing historical events, terrifying moments of danger, tragedy, the price of war, and the invincible spirit of a woman of honor, The Award is a monumental tale from one of our most gifted storytellers - Danielle Steel&apos;s finest, most emotionally resonant novel yet.\r\n\r\nGa&#xEB;lle de Barbet is sixteen years old in 1940 when the German army occupies France and frightening changes begin. She is shocked and powerless when French gendarmes take away her closest friend, Rebekah Feldmann, and her family, and send them to a detention camp for deportation to an unknown, ominous fate.\r\n\r\nThe local German military commandant makes Ga&#xEB;lle&apos;s family estate outside Lyon into his headquarters. Her father and brother are killed by the Germans; her mother fades away into madness and ill health. Trusted friends and employees become traitors. And by accident, Ga&#xEB;lle begins a perilous journey with the French Resistance, hoping to save lives to make up for the beloved friend she could do nothing to help.\r\n\r\nTaking terrifying risks, Ga&#xEB;lle becomes a valuable member of the Resistance, fearlessly delivering Jewish children to safety underneath the eyes of the Gestapo and their French collaborators. Then she is suddenly approached by the German commandant with an astonishing and dangerous plan to save part of France&apos;s artistic heritage as the Germans withdraw. And once again, her life is on the line. Conducted in secret, flawlessly carried out, her missions for the Resistance change her life and mark her for years. She is falsely accused of collaboration at the end of the war, and flees Lyon in disgrace, orphaned and alone. She goes to Paris to put the war behind her and begin a new life, with the ghosts of the past always close at hand.\r\n\r\n..\r\n\r\nxx","last_updated":"2017-11-06T12:05:10.259Z","parsed":{"xt":"urn:btih:f9feb133c3b53f27c71e18e847f3651539b6e120","dn":"The Award by Danielle Steel EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"f9feb133c3b53f27c71e18e847f3651539b6e120","infoHashBuffer":{"type":"Buffer","data":[249,254,177,51,195,181,63,39,199,30,24,232,71,243,101,21,57,182,225,32]},"name":"The Award by Danielle Steel EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}