{"title":"Fiction Ruined My Family by Jeanne Darst EPUB","magnet":"magnet:?xt=urn:btih:fa1113cb81c22526a59bbb2aef861587666d84ba&dn=Fiction+Ruined+My+Family+by+Jeanne+Darst+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"249123","seeders":"13","leechers":"7","description":"xx\r\n\r\nFiction Ruined My Family by Jeanne Darst EPUB\r\n\r\nIntroducing a deeply funny, charismatic new voice: an entertaining memoir of a family haunted by its own myths and its obsessive idolization of the literary life.\r\n\r\nJeanne Darst was born the youngest of four daughters in an old, celebrated family long past its glory days. For the early part of her life, the family survived on the memory of past generations&apos; grandeur and the romantic belief that Darst&apos;s father would restore that greatness with his destined career as a novelist. Within a few years, however, it was abundantly clear to everyone but him that despite the many years enslaved to the writer&apos;s craft and lifestyle, he was never going to sell a book. By the time of Darst&apos;s adolescence, the family was broke, and her mother was consoling herself with nightly booze-fueled weepathons, while her father was still too possessed by the dream to get a job.\r\n\r\nLater, Darst realizes she has inherited both the gene for alcoholism and the gene for wanting to write, and she isn&apos;t sure which is more devastating. Does her need to write, to tell stories, mean that she&apos;s doomed to repeat the mistakes of her father, or can she find a way to move beyond her family&apos;s curse, and not have fiction ruin her life?\r\n\r\nNow sober and a productive writer, Darst looks back on all those years with warmth, affection, and a moving degree of understanding - as well as wicked, deadpan humor.\r\n\r\nxx","last_updated":"2017-10-31T12:04:52.799Z","parsed":{"xt":"urn:btih:fa1113cb81c22526a59bbb2aef861587666d84ba","dn":"Fiction Ruined My Family by Jeanne Darst EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fa1113cb81c22526a59bbb2aef861587666d84ba","infoHashBuffer":{"type":"Buffer","data":[250,17,19,203,129,194,37,38,165,155,187,42,239,134,21,135,102,109,132,186]},"name":"Fiction Ruined My Family by Jeanne Darst EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}