{"title":"Drunk Tank Pink_ And Other Unexpected Forces That Shape How We T","magnet":"magnet:?xt=urn:btih:faa4aa2de93dc9420a1c56af98ee6dbeb998d37d&dn=Drunk+Tank+Pink_+And+Other+Unexpected+Forces+That+Shape+How+We+T&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4790045","seeders":"0","leechers":"0","description":"xx\r\n\r\nDrunk Tank Pink_ And Other Unexpected Forces That Shape How We Think, Feel, and Behave by Adam Alter ePUB eBOOK-ZAK\r\n\r\nAn illuminating look at the way the thoughts we have and the decisions we make are influenced by forces that aren&apos;t always in our control.\r\n\r\nWhy are people named Kim, Kelly, and Ken more likely to donate to Hurricane Katrina victims than to Hurricane Rita victims? Are you really more likely to solve puzzles if you watch a light bulb illuminate? How did installing blue lights along a Japanese railway line halt rising crime and suicide rates? Can decorating your walls with the right artwork make you more honest? The human brain is fantastically complex, having engineered space travel and liberated nuclear energy, so it&apos;s no wonder that we resist the idea that we&apos;re deeply influenced by our surroundings. As profound as they are, these effects are almost impossible to detect both as they&apos;re occurring and in hindsight. Drunk Tank Pink is the first detailed exploration of how our environment shapes what we think, how we feel, and the ways we behave.\r\n\r\nThe world is populated with words and images that prompt unexpected, unconscious decisions. We are so deeply attracted to our own initials that we give more willingly to the victims of hurricanes that match our initials: Kims and Kens donate more generously to Hurricane Katrina victims, whereas Rons and Rachels give more openly to Hurricane Rita victims. Meanwhile, an illuminated light bulb inspires creative thinking because it symbolizes insight.\r\n\r\nSocial interactions have similar effects, as professional cyclists pedal faster when people are watching. Teachers who took tea from the break room at Newcastle University contributed 300 percent more to a cash box when a picture of two eyes hung on the wall. We&apos;re evolutionarily sensitive to human surveillance, so we behave more virtuously even if we&apos;re only watched by a photograph. The physical environment, from locations to colors, also guides our hand in unseen ways. Dimly lit interiors metaphorically imply no one&apos;s watching and encourage dishonesty and theft, while blue lights discourage violent activity because they&apos;re associated with the police. Olympic taekwondo and judo athletes are more likely to win when they wear red rather than blue, because red makes them behave aggressively and referees see them as more dominant. Drunk Tank Pink is full of revelatory facts, riveting anecdotes, and cutting-edge experiments that collectively explain how the most unexpected factors lead us to think, feel, and behave the way we do.\r\n\r\nxx","last_updated":"2017-07-20T12:00:51.384Z","parsed":{"xt":"urn:btih:faa4aa2de93dc9420a1c56af98ee6dbeb998d37d","dn":"Drunk Tank Pink_ And Other Unexpected Forces That Shape How We T","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"faa4aa2de93dc9420a1c56af98ee6dbeb998d37d","infoHashBuffer":{"type":"Buffer","data":[250,164,170,45,233,61,201,66,10,28,86,175,152,238,109,190,185,152,211,125]},"name":"Drunk Tank Pink_ And Other Unexpected Forces That Shape How We T","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}