{"title":"Academic Search Engines","magnet":"magnet:?xt=urn:btih:faf4e3b51de0c0625098ea73e1706ec29721e4b3&dn=Academic+Search+Engines&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"9051964","seeders":"23","leechers":"8","description":"Academic Search Engines: intends to run through the current panorama of the academic search engines through a quantitative approach that analyses the reliability and consistence of these services. The objective is to describe the main characteristics of these engines, to highlight their advantages and drawbacks, and to discuss the implications of these new products in the future of scientific communication and their impact on the research measurement and evaluation. In short, Academic Search Engines presents a summary view of the new challenges that the Web set to the scientific activity through the most novel and innovative searching services available on the Web.\r\n\r\nThis is the first approach to analyze search engines exclusively addressed to the research community in an integrative handbook. The novelty, expectation and usefulness of many of these services justify their analysis.\r\nThis book is not merely a description of the web functionalities of these services; it is a scientific review of the most outstanding characteristics of each platform, discussing their significance to the scholarly communication and research evaluation.\r\nThis book introduces an original methodology based on a quantitative analysis of the covered data through the extensive use of crawlers and harvesters which allow going in depth into how these engines are working. Beside of this, a detailed descriptive review of their functionalities and a critical discussion about their use for scientific community is displayed","last_updated":"2017-06-09T12:01:18.172Z","parsed":{"xt":"urn:btih:faf4e3b51de0c0625098ea73e1706ec29721e4b3","dn":"Academic Search Engines","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"faf4e3b51de0c0625098ea73e1706ec29721e4b3","infoHashBuffer":{"type":"Buffer","data":[250,244,227,181,29,224,192,98,80,152,234,115,225,112,110,194,151,33,228,179]},"name":"Academic Search Engines","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}