{"title":"Between the World and Me by Ta-Nehisi Coates 2015 Retail EPUB eB","magnet":"magnet:?xt=urn:btih:fb5a0aa56d4b062208afe679c1d00afd4510b8d4&dn=Between+the+World+and+Me+by+Ta-Nehisi+Coates+2015+Retail+EPUB+eB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"5560255","seeders":"0","leechers":"0","description":"xx\r\n\r\nBetween the World and Me by Ta-Nehisi Coates 2015 Retail EPUB eBook-BitBook\r\n\r\nHailed by Toni Morrison as &quot;required reading&quot;, a bold and personal literary exploration of America&apos;s racial history by &quot;the single best writer on the subject of race in the United States&quot; (The New York Observer).\r\n\r\n&quot;This is your country, this is your world, this is your body, and you must find some way to live within the all of it.&quot;\r\n\r\nIn a profound work that pivots from the biggest questions about American history and ideals to the most intimate concerns of a father for his son, Ta-Nehisi Coates offers a powerful new framework for understanding our nation&apos;s history and current crisis. Americans have built an empire on the idea of &quot;race&quot;, a falsehood that damages us all but falls most heavily on the bodies of black women and men - bodies exploited through slavery and segregation and, today, threatened, locked up, and murdered out of all proportion. What is it like to inhabit a black body and find a way to live within it? And how can we all honestly reckon with this fraught history and free ourselves from its burden?\r\n\r\nBetween the World and Me is Ta-Nehisi Coates&apos; attempt to answer these questions in a letter to his adolescent son. Coates shares with his son - and readers - the story of his awakening to the truth about his place in the world through a series of revelatory experiences, from Howard University to Civil War battlefields, from the South Side of Chicago to Paris, from his childhood home to the living rooms of mothers whose children&apos;s lives were taken as American plunder. Beautifully woven from personal narrative, reimagined history, and fresh, emotionally charged reportage, Between the World and Me clearly illuminates the past, bracingly confronts our present, and offers a transcendent vision for a way forward.\r\n\r\nxx","last_updated":"2017-08-25T12:00:29.178Z","parsed":{"xt":"urn:btih:fb5a0aa56d4b062208afe679c1d00afd4510b8d4","dn":"Between the World and Me by Ta-Nehisi Coates 2015 Retail EPUB eB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fb5a0aa56d4b062208afe679c1d00afd4510b8d4","infoHashBuffer":{"type":"Buffer","data":[251,90,10,165,109,75,6,34,8,175,230,121,193,208,10,253,69,16,184,212]},"name":"Between the World and Me by Ta-Nehisi Coates 2015 Retail EPUB eB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}