{"title":"SexAndSubmission-SaS-42200 AJ Applegate Lucas Frost Tommy Pistol","magnet":"magnet:?xt=urn:btih:fb77d861e050038c5dd95f55c2d13dc3fe93362f&dn=SexAndSubmission-SaS-42200+AJ+Applegate+Lucas+Frost+Tommy+Pistol&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"merzedes","categoryP":"porn","categoryS":"hd___movies","size":"2851736456","seeders":"4","leechers":"59","description":"Chance to Advance\r\n\r\nJun 23, 2017 - Lucas Frost  , AJ Applegate , Tommy Pistol \r\n\r\n\r\nHi and HD MP4.\r\n\r\n\r\nBlonde, blue eyed, big ass beauty AJ Applegate is the wife of an up and coming corporate VP Lucas Frost. He is about to be layed off but has the Chance to Advance to this prestigious position if he is willing the play the game. Frost&apos;s boss Tommy Pistol likes to fuck the wives of his employees and will hire the right man for the job depending on how far the wives will go. When Lucas goes home after the interview AJ welcomes him with a sweet smile and sexy blowjob. She pushes him down on the bed and rewards him for getting through a long day at work. AJ knows how to suck cock and she looks so pretty doing it. When Lucas tells AJ what its going to take to keep his job she is appalled but wants to support her man so she is willing to help. Bossman Tommy Pistol comes over for dinner and reminds them both that Lucas does not YET have the job. He asks AJ to show him her tits and after some awkward conversations a full on fuck fest ensues. Tommy wants to find out how submissive AJ is so he puts a red ball gag and leather leash on her to start. He puts her on all fours with that big curvy ass in the air while she sucks Lucas&apos;s cock. This kinky threesome has rope bondage, flogging, face fucking, pussy fucking, anal, ass to mouth, pussy to ass to mouth to ass to pussy and back again, this dinner party is going swimmingly! Later on the couch Tommy fucks AJ from below while Lucas fucks her ass from behind. Double penetration is AJ&apos;s favorite. Her hands are tied so she can&apos;t do anything except take it. They flip her over and do reverse cowgirl with Tommy&apos;s dick in her ass while Lucas fucks her pussy until she is loving it! Finally AJ gets off with the Hitachi while Tommy and Lucas shoot their loads all over her cum-drunk face. Watch AJ get totally fucked while she helps her man with the Chance to Advance. \r\n\r\nScreens <a href=\"\nhttps://www.kink.com/shoot/42200\" rel=\"nofollow\" target=\"_NEW\">\nhttps://www.kink.com/shoot/42200</a>\r\n <a href=\"\nhttps://s30.pixxxels.org/emsotpkrl/Sa_S_-_Jun_23_2017_-_AJ_Applegate_Lucas_Frost_a.jpg\" rel=\"nofollow\" target=\"_NEW\">\nhttps://s30.pixxxels.org/emsotpkrl/Sa_S_-_Jun_23_2017_-_AJ_Applegate_Lucas_Frost_a.jpg</a>\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n23 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n\r\n1337X FAQ: http://i.xomf.com/gdqkv.jpg\r\n\r\nThePirateBay FAQ: http://i.xomf.com/hgyrj.jpg\r\n\r\nCheers :-)","last_updated":"2017-06-24T12:01:12.260Z","parsed":{"xt":"urn:btih:fb77d861e050038c5dd95f55c2d13dc3fe93362f","dn":"SexAndSubmission-SaS-42200 AJ Applegate Lucas Frost Tommy Pistol","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fb77d861e050038c5dd95f55c2d13dc3fe93362f","infoHashBuffer":{"type":"Buffer","data":[251,119,216,97,224,80,3,140,93,217,95,85,194,209,61,195,254,147,54,47]},"name":"SexAndSubmission-SaS-42200 AJ Applegate Lucas Frost Tommy Pistol","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}