{"title":"Varicose Veins - Practical Guides in Interventional Radiology","magnet":"magnet:?xt=urn:btih:fb95b5ce35476eeffb4c007405f8637c3c61c217&dn=Varicose+Veins+-+Practical+Guides+in+Interventional+Radiology&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"clouderone","categoryP":"other","categoryS":"e_books","size":"31659262","seeders":"0","leechers":"0","description":"Chronic venous disease is a common condition, with a prevalence as high as 50% in industrialized countries worldwide. Of those, about 20-25% of women and 10-15% of men have visible varicose veins. Varicose vein treatment has become an increasingly multidisciplinary field, and one that has seen cutting-edge advances and significant growth.\r\n\r\nFelipe B. Collares, Salomao Faintuch, and a team of venous disease experts have compiled, Varicose Veins, a concise book that covers the full range of interventional procedures for venous insufficiency. Following introductory chapters on anatomy and pathophysiology, the authors guide readers through the clinical exam, imaging, compression therapy, and various minimally invasive techniques. Highly practical and an affordable alternative to larger published tomes.\r\n\r\nKey Highlights\r\n\r\nStep-by-step guide on core venous interventions - from compression therapy to sclerotherapy - ambulatory phlebectomy to endovascular ablation\r\nIllustrations delineate anatomy and specific treatment modalities\r\nClinical pearls on patient safety and preventing complications\r\nDiscussion of emerging endovascular approaches that do not require administration of tumescent anesthesia\r\nThis handy resource is a must-have for trainees and veteran physicians. The practical and focused layout provides a well-rounded reference for all specialists who perform varicose vein procedures - interventional radiologists, vascular surgeons, phlebologists, cardiologists, and dermatologists","last_updated":"2017-06-20T12:05:06.350Z","parsed":{"xt":"urn:btih:fb95b5ce35476eeffb4c007405f8637c3c61c217","dn":"Varicose Veins - Practical Guides in Interventional Radiology","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fb95b5ce35476eeffb4c007405f8637c3c61c217","infoHashBuffer":{"type":"Buffer","data":[251,149,181,206,53,71,110,239,251,76,0,116,5,248,99,124,60,97,194,23]},"name":"Varicose Veins - Practical Guides in Interventional Radiology","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}