{"title":"Kevin McCloud's Man Made Home & Supersized Salvage","magnet":"magnet:?xt=urn:btih:fc63cbaf3089ba34a76eb67b2cdf4e050bc702f2&dn=Kevin+McCloud%27s+Man+Made+Home+%26amp%3B+Supersized+Salvage&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Ravenwilde","categoryP":"video","categoryS":"tv_shows","size":"5997203614","seeders":"1","leechers":"16","description":"Kevin McCloud&apos;s Man Made Home\r\n\r\nKevin McCloud&apos;s Man Made Home is a British television series, broadcast on Channel 4. The series features Kevin McCloud&apos;s attempt at building a sustainable eco-friendly shed in the woods. In order to achieve this, he decided to use only the materials locally available in the woodland where the shed was to be built, or to employ only recycled materials.\r\n\r\nThe shed that was successfully produced during the first series, was transportable to avoid the need for planning permissions. Thus in the second series, McCloud decided to relocate the shed to Watchet, on the coast of Somerset where he expanded it, employing a nautical theme to match its location overlooking the sea.\r\n\r\nKevin&#x2019;s Supersized Salvage: Airbus A320 Kevin McCloud challenges three designers to turn one plane - an Airbus A320 - into hundreds of amazing new products in a giant upcycling experiment. Their task is to find a new use for every single piece of the plane, leaving only an empty hangar behind them. The office pods and desk lamps, rickshaws and rocking chairs, luggage, storage and even jewellery that they fashion from this fallen giant will prove - in a spectacular and sustainable way - that creativity is a genuine solution to Britain&apos;s waste crisis. It&apos;s not just the size of this challenge that makes it tough; to master it, the designers need endless ingenuity, patience and the entrepreneurial skills and sales patter to sell their sometimes outlandish creations. It&apos;s a transformation on an unprecedented scale and Kevin&apos;s largest recycling project to date. If they can pull it off they&apos;ll prove that the sky&apos;s not the limit","last_updated":"2017-08-02T12:05:25.744Z","parsed":{"xt":"urn:btih:fc63cbaf3089ba34a76eb67b2cdf4e050bc702f2","dn":"Kevin McCloud's Man Made Home &amp; Supersized Salvage","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fc63cbaf3089ba34a76eb67b2cdf4e050bc702f2","infoHashBuffer":{"type":"Buffer","data":[252,99,203,175,48,137,186,52,167,110,182,123,44,223,78,5,11,199,2,242]},"name":"Kevin McCloud's Man Made Home &amp; Supersized Salvage","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}