{"title":"Still the Best Hope by Dennis Prager AZW3","magnet":"magnet:?xt=urn:btih:fc77b4f146fcedbc0b7cc3fe72c6b9454803e5c6&dn=Still+the+Best+Hope+by+Dennis+Prager+AZW3&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"871804","seeders":"0","leechers":"0","description":"xx\r\n\r\nStill the Best Hope by Dennis Prager AZW3\r\n\r\nIn this visionary book, Dennis Prager, one of America&apos;s most original thinkers, contends that humanity confronts a monumental choice. The whole world must decide between American values and its two oppositional alternatives: Islamism and European-style democratic socialism.\r\n\r\nPrager - a bestselling author, columnist, and nationally syndicated radio talk show host who is read and heard by millions of people in America and abroad - makes the case for the American value system as the most viable program ever devised to produce a good society. Those values are explained here more clearly and persuasively than ever before.\r\n\r\nStill the Best Hope deals with three huge themes: The first is perhaps the most persuasive explanation for why Leftism has been and will always be a moral failure, despite its acknowledged appeal to many people of goodwill. The second explains why fundamentalist Islam, despite its historic and growing appeal, cannot make a good society. But Prager holds out hope for an open and tolerant Islam and explains why it will emerge from faithful American Muslims. The third is a singularly persuasive defense and explanation of what Prager calls the &quot;American Trinity&quot;: liberty, values rooted in the Creator, and the melting-pot ideal. These values are inscribed on every American coin as &quot;Liberty,&quot; &quot;In God We Trust,&quot; and &quot;E Pluribus Unum,&quot; and they are the reasons for America&apos;s greatness. Without them, America will cease to be an exceptional nation, and therefore cease to be America.\r\n\r\nPrager shows why these values can and must be adopted by every nation and culture in the world, why Americans must relearn and recommit to these values, and why America must vigorously export them. For if the world does not adopt American values, the result will be chaos and barbarism on an unprecedented scale.\r\n\r\nxx","last_updated":"2017-11-06T12:03:03.628Z","parsed":{"xt":"urn:btih:fc77b4f146fcedbc0b7cc3fe72c6b9454803e5c6","dn":"Still the Best Hope by Dennis Prager AZW3","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fc77b4f146fcedbc0b7cc3fe72c6b9454803e5c6","infoHashBuffer":{"type":"Buffer","data":[252,119,180,241,70,252,237,188,11,124,195,254,114,198,185,69,72,3,229,198]},"name":"Still the Best Hope by Dennis Prager AZW3","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}