{"title":"XYplorer 18.30.0000 + Keygen [CracksNow]","magnet":"magnet:?xt=urn:btih:fd2dd586295a192eaff5f6ffc43fbc834a1efca9&dn=XYplorer+18.30.0000+%2B+Keygen+%5BCracksNow%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"cracksnow","categoryP":"applications","categoryS":"windows","size":"3953245","seeders":"6","leechers":"1","description":"XYplorer is an Advanced File System Explorer targeting everybody who is looking for a real alternative to the Windows Explorer. It has the following features: Created Date, Last Accessed Date and Attributes are shown right in the file list. Extended file find supporting NT-only features, and including binary string search. Multiple location search (find files in all selected directories). Generates various sorts of file system reports (to clipboard, file, and printer - we are talking about one-click directory print-outs here). Export extended file informations of whole directories (or even directory trees) to CSV-formatted files. [Column Width Auto-Adjustment. \r\n\r\n\r\nFEATURES - \r\n&#x2022; Tabbed Browsing: have an unlimited number of tabs to make jumping around between folders a one-click affair. Rename the tabs, shift them around, hide them, drag-drop stuff onto the tab headers... the tabs remember their configuration individually and between sessions. You often search your system for files added in the last 24 hours? Let a &quot;finding tab&quot; do the job at a single click! \r\n&#x2022; High end find files engine with tremendous power and amazing speed. Find files fully supports Boolean logic (up to 256 nesting levels), advanced pattern matching, Regular Expressions, whole word and fuzzy matching, binary string search, multiple location search (find files in all selected directories) and much more... \r\n&#x2022; Instant preview of image (incl. PNG, JPEG, GIF, TIFF, ICO and many more), audio, and video files (displaying detailed media information). \r\n&#x2022; Thumbnails of image files shown right in the file list, introducing the unique &quot;Mouse Down Blow Up&quot; functionality. \r\n&#x2022; Instant preview of installed and uninstalled TrueType and Type-1 font files (displaying detailed font information). \r\n&#x2022; Instant preview of HTML, MHT, PHP files (including configurable server mappings) with printing option","last_updated":"2017-08-31T12:05:41.716Z","parsed":{"xt":"urn:btih:fd2dd586295a192eaff5f6ffc43fbc834a1efca9","dn":"XYplorer 18.30.0000   Keygen [CracksNow]","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fd2dd586295a192eaff5f6ffc43fbc834a1efca9","infoHashBuffer":{"type":"Buffer","data":[253,45,213,134,41,90,25,46,175,245,246,255,196,63,188,131,74,30,252,169]},"name":"XYplorer 18.30.0000   Keygen [CracksNow]","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}