{"title":"Sherlock Holmes and the Autumn of Terror","magnet":"magnet:?xt=urn:btih:fd55121025c3f37380773f6be0476b56fdd3312b&dn=Sherlock+Holmes+and+the+Autumn+of+Terror&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"marty14","categoryP":"other","categoryS":"e_books","size":"8723423","seeders":"61","leechers":"3","description":"Sherlock Holmes and the Autumn of Terror - Randy Williams [epub]\r\n\r\nEveryone knows the name of Sherlock Holmes -- the fictional detective created by Arthur Conan Doyle with his superhuman powers of observation and unbeatable methodology for solving crimes. But could his 1800&#x2019;s philosophy really work in the modern world to solve genuine crimes? \r\n\r\nThat&#x2019;s the very question that a real-life US-based private detective asked himself before embarking on the adventure of a lifetime by stepping into Holmes&#x2019; shoes and using his mindset to solve real crimes. So effective was this method that he decided to turn his attention to the greatest set of crimes known in history -- the brutal murders perpetrated by the criminal who came to be known as Jack the Ripper. \r\n\r\nThe author, along with a team of three of the world&#x2019;s top forensic scientists and criminologists have convincingly solved the infamous Jack the Ripper murders of 1888 London &#x2013; arguably the world&#x2019;s most talked-about unsolved murder mystery. But their true-life resolution of the case is presented here in the form of a Sherlock Holmes novel, painstakingly penned faithfully in the style of Sir Arthur Conan Doyle.\r\n\r\nIn it, the author &#x2013; who actually used Holmes&#x2019; methods to uncover the killers&#x2019; identity &#x2013; explains exactly how the crimes were committed and by whom, all in the form of a fast-paced thriller featuring the world&#x2019;s most beloved detective along with Dr. Watson, from whose point-of-view most of the tale is told. Once the reader has finally been clued in on the final solution, the murders are then revisited from the killers&#x2019; perspective","last_updated":"2017-06-05T12:04:07.138Z","parsed":{"xt":"urn:btih:fd55121025c3f37380773f6be0476b56fdd3312b","dn":"Sherlock Holmes and the Autumn of Terror","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fd55121025c3f37380773f6be0476b56fdd3312b","infoHashBuffer":{"type":"Buffer","data":[253,85,18,16,37,195,243,115,128,119,63,107,224,71,107,86,253,211,49,43]},"name":"Sherlock Holmes and the Autumn of Terror","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}