{"title":"Shock and Awe by Simon Reynolds EPUB","magnet":"magnet:?xt=urn:btih:febbb82e62765bd683515149a86a06d03d0c61e6&dn=Shock+and+Awe+by+Simon+Reynolds+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4440608","seeders":"0","leechers":"0","description":"xx\r\n\r\nShock and Awe by Simon Reynolds EPUB\r\n\r\nFrom the acclaimed author of Rip It Up and Start Again and Retromania - &quot;the foremost popular music critic of this era&quot; (Times Literary Supplement) - comes the definitive cultural history of glam and glitter rock, celebrating its outlandish fashion and outrageous stars, including David Bowie and Alice Cooper, and tracking its vibrant legacy in contemporary pop.\r\n\r\nSpearheaded by David Bowie, Alice Cooper, T. Rex, and Roxy Music, glam rock reveled in artifice and spectacle. Reacting against the hairy, denim-clad rock bands of the late &apos;60s, glam was the first true teenage rampage of the new decade. In Shock and Awe, Simon Reynolds takes you on a wild cultural tour through the early &apos;70s, a period packed with glitzy costumes and alien makeup, thrilling music, and larger-than-life personas.\r\n\r\nShock and Awe offers a fresh, in-depth look at the glam and glitter phenomenon, placing it in the wider &apos;70s context of social upheaval and political disillusion. It explores how artists like Lou Reed, New York Dolls, and Queen broke with the hippie generation, celebrating illusion and artifice over truth and authenticity. Probing the genre&apos;s major themes - stardom, androgyny, image, decadence, fandom, apocalypse - Reynolds tracks glam&apos;s legacy as it unfolded in subsequent decades, from &apos;80s art-pop icons like Kate Bush through to 21st-century idols of outrage such as Lady Gaga. Shock and Awe shows how the original glam artists&apos; obsessions with fame, extreme fashion, and theatrical excess continue to reverberate through contemporary pop culture.\r\n\r\nxx","last_updated":"2017-10-27T12:06:40.531Z","parsed":{"xt":"urn:btih:febbb82e62765bd683515149a86a06d03d0c61e6","dn":"Shock and Awe by Simon Reynolds EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"febbb82e62765bd683515149a86a06d03d0c61e6","infoHashBuffer":{"type":"Buffer","data":[254,187,184,46,98,118,91,214,131,81,81,73,168,106,6,208,61,12,97,230]},"name":"Shock and Awe by Simon Reynolds EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}