{"title":"Modern Lovers by Emma Straub EPUB","magnet":"magnet:?xt=urn:btih:fedbecf760e168e64802680c50a6123c1711788d&dn=Modern+Lovers+by+Emma+Straub+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"587876","seeders":"37","leechers":"8","description":"xx\r\n\r\nModern Lovers by Emma Straub EPUB\r\n\r\nFrom the New York Times best-selling author of The Vacationers, a smart, highly entertaining novel about a tight-knit group of friends from college - their own kids now going to college - and what it means to finally grow up well after adulthood has set in.\r\n\r\nFriends and former college bandmates Elizabeth, Andrew, and Zoe have watched one another marry, buy real estate, and start businesses and families, all while trying to hold on to the identities of their youth. But nothing ages them like having to suddenly pass the torch (of sexuality, independence, and the ineffable alchemy of cool) to their own offspring.\r\n\r\nBack in the band&apos;s heyday, Elizabeth put on a snarl over her Midwestern smile, Andrew let his unwashed hair grow past his chin, and Zoe was the lesbian all the straight women wanted to sleep with. Now nearing 50, they all live within shouting distance in the same neighborhood deep in gentrified Brooklyn, and the trappings of the adult world seem to have arrived with ease. But the summer that their children reach maturity (and start sleeping together), the fabric of the adult lives suddenly begins to unravel, and the secrets and revelations that are finally let loose - about themselves and about the famous fourth band member who soared and fell without them - can never be reclaimed.\r\n\r\nStraub packs wisdom, insight, and humor together in a satisfying book about neighbors and nosiness, ambition and pleasure, the excitement of youth, the shock of middle age, and the fact that our passions - be they food or friendship or music - never go away; they just evolve and grow along with us.\r\n\r\nxx","last_updated":"2018-01-02T12:07:03.453Z","parsed":{"xt":"urn:btih:fedbecf760e168e64802680c50a6123c1711788d","dn":"Modern Lovers by Emma Straub EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fedbecf760e168e64802680c50a6123c1711788d","infoHashBuffer":{"type":"Buffer","data":[254,219,236,247,96,225,104,230,72,2,104,12,80,166,18,60,23,17,120,141]},"name":"Modern Lovers by Emma Straub EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}