{"title":"Call.of.Duty.Black.Ops.III-RELOADED","magnet":"magnet:?xt=urn:btih:fef60b075035111da032f1655b35113f57b4afbe&dn=Call.of.Duty.Black.Ops.III-RELOADED&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"batac223","categoryP":"games","categoryS":"pc","size":"344504052","seeders":"1","leechers":"0","description":"\r\n\r\n\r\nnERv\r\n\r\nCall of Duty Black Ops III (c) Activision\r\n\r\n11/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\r\n\r\nTreyarch, developer of the two most-played games in Call of Duty history,\r\nreturns with Call of Duty: Black Ops III. For the first time with\r\nthree-years of development, the revered, award-winning studio has created\r\nits first title for next-gen hardware in the critically acclaimed Black Ops\r\nseries. Welcome to Call of Duty: Black Ops 3, a dark, twisted future where\r\na new breed of Black Ops soldier emerges and the lines are blurred between\r\nour own humanity and the technology we created to stay ahead, in a world\r\nwhere cutting-edge military robotics define warfare.\r\n\r\nCall of Duty: Black Ops 3 combines three unique game modes: Campaign,\r\nMultiplayer and Zombies, providing fans with the deepest and most ambitious\r\nCall of Duty ever. The Campaign has been designed as a co-op game that can\r\nbe played with up to 4 players online or as a solo cinematic thrill-ride\r\nMultiplayer will be the franchise&apos;s deepest, most rewarding and most\r\nengaging to date, with new ways to rank up, customize, and gear up for\r\nbattle. And Zombies delivers an all-new mind-blowing experience with its\r\nown dedicated narrative. Call of Duty: Black Ops 3 can be played entirely\r\nonline, and for the first time each of the offerings has its own unique\r\nplayer XP and progression systems. The title ushers in an unprecedented\r\nlevel of innovation, including jaw-dropping environments, never before\r\nexperienced weaponry and abilities, and the introduction of a new, improved\r\nfluid movement system. All of this is brought to life by advanced\r\ntechnology custom crafted for this title, including new AI and animation\r\nsystems, and graphics that redefine the standards Call of Duty fans have\r\ncome to expect from the critically-acclaimed series, with cutting edge","last_updated":"2017-08-17T12:04:47.991Z","parsed":{"xt":"urn:btih:fef60b075035111da032f1655b35113f57b4afbe","dn":"Call.of.Duty.Black.Ops.III-RELOADED","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"fef60b075035111da032f1655b35113f57b4afbe","infoHashBuffer":{"type":"Buffer","data":[254,246,11,7,80,53,17,29,160,50,241,101,91,53,17,63,87,180,175,190]},"name":"Call.of.Duty.Black.Ops.III-RELOADED","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}