{"title":"Planet Coaster (Latest With Cedar Point DLC) (Steampunks)","magnet":"magnet:?xt=urn:btih:ff1b4b6481ad66f062a17c7a2e4f8b2097ab8405&dn=Planet+Coaster+%28Latest+With+Cedar+Point+DLC%29+%28Steampunks%29&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"Sarah116","categoryP":"games","categoryS":"pc","size":"18075","seeders":"5","leechers":"3","description":"PLEASE READ. Guys, if you haven&apos;t noticed, uploaders been having issues uploading files to the TPB. We are able to upload smaller files but big files are a no go.In order to bypass this issue, I had to make a work around. So, just download this torrent, to get to the actual torrent that has the game. Sorry, you guys to have to do this but it just a minor inconvenience.\r\n&#x25CF;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25CF;\r\n\r\nHey, here the latest version of Planet Coaster as of September 5th,2017. This includes all the previous DLC as well. Hope you enjoy and please help seed\r\n\r\n\r\n&#x25CF;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25CF;\r\n\r\nINSTALLATION: \r\n1.Unpack, burn or mount iso \r\n2.Install the game \r\nYou will have the option to copy the crack files automatically \r\n3.Start the game from the desktop shortcut we created or \r\nyou can manually start from the game executable \r\n4.That&apos;s it, Enjoy the Game \r\n\r\n\r\n&#x25CF;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25AC;&#x25CF;\r\n\r\nPlanet Coaster brings fresh thrills, fireworks and new customization options for every player in the FREE Summer Update. Fireworks are an explosive new way to customize parks, design epic firework displays with the new Display Sequencer, trigger them alongside other park events, and even choreograph them to custom music! Not only that, new to Planet Coaster: new rides, new coasters, video and image billboards, new scenario&#x2019;s, ride sequencer, painted wooden supports and new scenery pieces! \r\n\r\nPlanet Coaster&#xAE; - the future of coaster park simulation games has arrived! Surprise, delight and thrill incredible crowds as you build your coaster park empire - let your imagination run wild, and share your success with the world.\r\n\r\n\r\nPiece-by-Piece Construction: Planet Coaster makes a designer out of everyone. Lay paths, build scenery, customize rides and make everything in your park unique with piece-by-piece construction and over a thousand unique building components. \r\n\r\nLandscape Sculpting: Play with nature and reshape the land beneath your feet. Sculpt the landscape to raise mountains, form lakes, dig caverns and even build islands in the sky, then weave coasters through your park above ground and below.\r\n\r\nTotal Authenticity: Recreate your favorite rides or leave the real world at the door. However you love to play, the most realistic rides and most realistic reactions from your guests make Planet Coaster the most authentic simulation ever.\r\n\r\nSimulation Evolved: The deepest park simulation in gaming history rewards your skills and makes management fun. Control every aspect of your guests&#x2019; experience and watch as Planet Coaster&#x2019;s world reacts to your choices in an instant.\r\n\r\nA Living World: Every park guest is an expressive individual who thinks, feels and explores your park with their own interests and desires. Together Planet Coaster&#x2019;s guests will tell you at a glance just how well your park is run.\r\n\r\nPark Management: You&#x2019;re the boss with accessible controls that make management fun. Test your skills in a campaign of creative scenarios, or just build for fun and tweak your parks to surprise, delight and thrill your guests","last_updated":"2017-09-06T12:04:01.590Z","parsed":{"xt":"urn:btih:ff1b4b6481ad66f062a17c7a2e4f8b2097ab8405","dn":"Planet Coaster (Latest With Cedar Point DLC) (Steampunks)","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ff1b4b6481ad66f062a17c7a2e4f8b2097ab8405","infoHashBuffer":{"type":"Buffer","data":[255,27,75,100,129,173,102,240,98,161,124,122,46,79,139,32,151,171,132,5]},"name":"Planet Coaster (Latest With Cedar Point DLC) (Steampunks)","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}