{"title":"Consuming the Word_ The New Testament and The Eucharist in the E","magnet":"magnet:?xt=urn:btih:ff3d0d00fd118330d82e8a07fd0cf2e82eb6bd9e&dn=Consuming+the+Word_+The+New+Testament+and+The+Eucharist+in+the+E&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"3647422","seeders":"0","leechers":"0","description":"xx\r\n\r\nConsuming the Word_ The New Testament and The Eucharist in the Early Church by Scott Hahn ePUB MOBI eBOOK-ZAK\r\n\r\nFrom the bestselling author of The Lamb&apos;s Supper and Signs of Life comes an illuminating work that unlocks the many mysteries of the Catholic sacrament of the Eucharist.\r\n\r\nLong before the New Testament was a document, it was a sacrament. Jesus called the Eucharist by the name Christians subsequently gave to the latter books of the Holy Bible. It was the &quot;New Covenant,&quot; the &quot;New Testament,&quot; in his blood. Christians later extended the phrase to cover the books produced by the apostles and their companions; but they did so because these were the books that could be read at Mass.\r\n\r\nThis simple and demonstrable historical fact has enormous implications for the way we read the Bible. In Consuming the Word: The New Testament and the Eucharist in the Early Church, Dr. Scott Hahn undertakes an examination of some of Christianity&apos;s most basic terms to discover what they meant to the sacred authors, the apostolic preachers, and their first hearers. Moreover, at a time when the Church is embarking on a New Evangelization he draws lessons for Christians today to help solidify their understanding of the why it is Catholics do what Catholics do.\r\n\r\nAnyone acquainted with the rich body of writing that flows so inspiringly from the hand and heart of Dr. Hahn knows that he brings profound personal insight to his demonstrated theological expertise,&#x201D; writes Cardinal Donald Wuerl in the foreword to the book.  Consuming the Word continues in that illustrious tradition. It brings us a powerful and welcome guide as we take our place in the great and challenging work in sharing the Good News.\r\n\r\nxx","last_updated":"2017-08-29T12:04:37.094Z","parsed":{"xt":"urn:btih:ff3d0d00fd118330d82e8a07fd0cf2e82eb6bd9e","dn":"Consuming the Word_ The New Testament and The Eucharist in the E","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ff3d0d00fd118330d82e8a07fd0cf2e82eb6bd9e","infoHashBuffer":{"type":"Buffer","data":[255,61,13,0,253,17,131,48,216,46,138,7,253,12,242,232,46,182,189,158]},"name":"Consuming the Word_ The New Testament and The Eucharist in the E","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}