{"title":"Why Soccer Matters by Pele and Brian Winter ePUB eBOOK-ZAK","magnet":"magnet:?xt=urn:btih:ff5f46b97a3f11d59c8eff7011dfb25580659513&dn=Why+Soccer+Matters+by+Pele+and+Brian+Winter+ePUB+eBOOK-ZAK&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"13705158","seeders":"0","leechers":"0","description":"xx\r\n\r\nWhy Soccer Matters by Pele and Brian Winter ePUB eBOOK-ZAK\r\n\r\nSoccer. Football. The beautiful game. The world&#x2019;s most popular sport goes by many names, but for decades, fans have agreed on one thing: the greatest player of all time was Pel&#xE9;. Now the legendary star, ambassador, and humanitarian shares a global vision for what soccer can accomplish. Now he shares his story, his experience, and his insights on the game for the very first time. Before Messi, before Ronaldo, before Beckham, there was Edson Arantes do Nascimento - known simply as Pel&#xE9;. A national treasure, he created pure magic with his accomplishments on the field: an unprecedented three World Cup championships and the all-time scoring record, with 1,283 goals in his twenty year career.\r\n\r\nNow, with the World Cup returning after more than sixty years to Brazil - the country often credited with perfecting the sport - soccer has a unique opportunity to encourage change on a global level. And as the tournament&#x2019;s official ambassador, Pel&#xE9; is ready to be the face of progress.\r\n\r\nFor the first time ever Pel&#xE9; explores the recent history of the game and provides new insights into soccer&#x2019;s role connecting and galvanizing players around the world. He has traveled the world as the global ambassador for soccer and in support of charitable organizations such as Unicef, promoting the positive influences soccer can have to transform young men and women, struggling communities, even entire nations. In groundbreaking detail and with unparalleled openness, he shares his most inspiring experiences, heartwarming stories and hard-won wisdom, and he puts the game in perspective.\r\n\r\nThis is Pel&#xE9;&#x2019;s legacy, his way of passing on everything he&#x2019;s learned and inspiring a new generation. In Why Soccer Matters, Pel&#xE9; details his ambitious goals for the future of the sport and, by extension, the world.\r\n\r\nxx","last_updated":"2017-08-12T12:00:35.923Z","parsed":{"xt":"urn:btih:ff5f46b97a3f11d59c8eff7011dfb25580659513","dn":"Why Soccer Matters by Pele and Brian Winter ePUB eBOOK-ZAK","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"ff5f46b97a3f11d59c8eff7011dfb25580659513","infoHashBuffer":{"type":"Buffer","data":[255,95,70,185,122,63,17,213,156,142,255,112,17,223,178,85,128,101,149,19]},"name":"Why Soccer Matters by Pele and Brian Winter ePUB eBOOK-ZAK","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}